{"body": "first, all lights out and candles everywhere.  \r\nentranceway...3 or 4.  \r\ndining room...only two long tapers on a small, intimate table for two, set for royalty.  \r\nbathroom...only 1, but one that burns fairly bright, but not distracting.  \r\nbedroom...however many different types you can find. oil candles are nice, if she has a favorite candle scent make sure it's near enough she can smsell it.\r\n\r\nbe waiting at the door, dressed to the nines, take any packages and her purse from her, lead her to the bathroom and slowly undress her and then assist her into the already drawn bath (rose petals on the water is a nice touch). check on her frequently, offer her a drink of choice, bathe her with a soft, natural sponge...s l o w l y wash her hair.\r\n\r\ndry her off and slip her into a nice, warmed bathrobe (remember, you're fully clothed), and take her to the dining room and seat her. excuse yourself to the kitchen and return with a tray full of peanutbutter and jelly sandwiches.\r\n\r\ntell her desert is to be served in the bedroom.\r\n\r\nget her comfy in bed (with robe still on) and serve her some strawberries and whipped cream. feed her a few and then do a striptease for her, i recommend [Joe Cocker - You Can Leave Your Hat On](http://www.youtube.com/watch?v=jVnli5SCJEs ), played softly (if you can find an instrumental, all the beter).\r\n\r\nclimb on the bed, slowly remove her robe...and let nature take its course.", "gilded": 0, "created_utc": "1249253135", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "It's a constitution which the Israelis don't have. \n\nCan you say 'T a l m u d'?  Sure you can.", "gilded": 0, "created_utc": "1249263923", "subreddit": "worldnews", "score": -7, "controversiality": 0}
{"body": "E NASPA SITEU ASTA ASTA ASTA ASTA AST AST AST AS AS AS A A A A A", "gilded": 0, "created_utc": "1249288096", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "What sort of limerick is that? Is there a special name for it? I like it. I've only ever heard the  A A B B A rhyming scheme before.", "gilded": 0, "created_utc": "1249306580", "subreddit": "worldnews", "score": 2, "controversiality": 0}
{"body": "The Yankees Suck! THA A A A A A A A A A A  A A A A A A A A  A A A YANKEES SUCK", "gilded": 0, "created_utc": "1249342658", "subreddit": "sports", "score": -3, "controversiality": 0}
{"body": "SOOO surprised that nobody has mentioned this song yet.\n\n\"A few times I've been around that track\nSo it's not just gonna happen like that\n'Cause I ain't no Hollaback Girl\nI ain't no Hollaback Girl\n\nOoh, this my shit, this my shit\nOoh, this my shit, this my shit\nOoh, this my shit, this my shit\nOoh, this my shit, this my shit\n\nLet me hear you say, this shit is bananas\nB A N A N A S\nThis shit is bananas\nB A N A N A S\nAgain, the shit is bananas\nB A N A N A S\nThis shit is bananas\nB A N A N A S\"\n\nOne of the most annoying and overplayed songs I've ever heard.", "gilded": 0, "created_utc": "1249406528", "subreddit": "AskReddit", "score": 10, "controversiality": 0}
{"body": "KEEP ON ROCKIN' ... H I G H E R !!!!!!", "gilded": 0, "created_utc": "1249425293", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "I have been from the bottom of the barrel to the top of the heap.  I've had my GPA go from 0.4 to a 4.0, but it took time.\n\nI started as a smart slacker in high school and an F F F F D first semester, to now being in a good graduate program in the top half of my class - besting many people who graduated with near 4.0s in undergrad.\n\nMy advice comes from the experience of doing poorly and rehabilitating myself.\n\nMy bottom started when I 1) roomed with slackers, 2) joined a fraternity, 3) became addicted to CS (counter-strike), and 4) didn't go to classes that often.  My problems ranged the gamut of social to anti-social.\n\nThe problems were obvious, but as with most things, the solutions were too.  The real question was how to implement the solutions when 1-4 were SO EASY to do.\n\n********\n\nSo here it goes:\n1) Find *your* work sanctuary.  Some people can work at home and some people absolutely can't.  I study best at a library because my home is my laziness kingdom.  Others can't stand a library.  The key is to never mix the purpose of these two areas.\n\n2) Social outings, under-age drinking and promiscuity are rampant.  However, you can't let them become the reason you are at school.  I say now, \"The only thing I didn't do when I went to college was go to school.\"  What they don't tell you is that once you graduate, your early twenties are good for social outings, above-age drinking and promiscuity.  However, you won't learn the stuff you \"do\" out in the real world and the businesses hiring these days without some sort of \"professional\" type skill (whether it is accounting, chemistry, business management, marketing, journalism) are fewer and fewer.\n\n3) Develop extra-curricular activities that require leadership and planning/organization - preferably those that need to contact people outside the organization.  I have a friend who got a perfect SAT score, was proficient musician, and was involved in theatre - not to mention the salutatorian.  He got waitlisted to almost every ivy league.  Had to settle for a legacy at MIT (father and older brother).  All because he wasn't a well rounded person.  \n\n4) DEVELOP A MENTOR - work at it - HARD.  Try over and over again.  Go to office hours.  Have the same professor for more than one semester. DEVELOP THAT RELATIONSHIP.  There are so many reasons to do this that it is impossible to explain it adequately.  Suffice it to say that knowing people is more important than knowing \"stuff.\"  A letter of recommendation from close faculty is worth its weight in tritium (as of 2003 it was approximately $30,000 *per gram* Canadian).\n\n5) Realize that many businesses today treat a 4-year degree as nothing special.  A 4-year degree by itself means very little these days.  I know Harvard grads in some of the tougher concentrations that couldn't get interviews at basic consulting firms and needed multiple interviews to land entry-level positions (or worse).  A tough program isnt' enough: you need to hit a concrete area with a college degree.\n\n6) Money is where its always been: the people who pay for the expectation of future performance.  The largest law firms in New York pay lock-step rates of $160,000 to first year associates and it is universally acknowledged that their advice isn't worth half that.  But, it is an investment in the 10-30% of them that become really fantastic at what they do.\n\n7)  There are finders, minders, and grinders.  Finders are paid the best, minders in the middle and grinders the worst.  Grinders can do the work - you can always find someone to \"do the work.\"  Minders are people who can do the work but can also sometimes go out and talk to clients.  They'll make a little more because they have that part-time value to the organization.  Finders go out and discover new business, keep old clients happy or develop new ideas or ways of thinking.  They're the inventors, the rainmakers, the revolutionaries and they get paid for it.  You won't know which one you are, but the only way to fast track yourself for it is to know from the beginning where you as a social person will fit in.\n\n8) In college it is easy to get a 4.0 - by taking the easiest classes possible.  If you want to go into a grad program unrelated to an undergrad field (aka law, MBA, etc.) DO IT.  Design your undergrad to know its merely a hop-step into a specialized program.  I guarantee you: no one cares about your undergrad GPA or school when you get into grad school.  So why get the 4.0?  Because you have to get your foot in the door.\n\n9)  As others have said: read and prepare before class.\n\n10) Sleep is the most valuable commodity in college: your body is a sleep bank and any time you withdraw some time and take it away from sleeping, your body will ask you to repay it with interest.", "gilded": 0, "created_utc": "1249528275", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "N E S T L E S, nestles makes the very best. sorrrrrrryyyyyy.", "gilded": 0, "created_utc": "1249548591", "subreddit": "reddit.com", "score": -3, "controversiality": 0}
{"body": "Wow! Cool I guess.\n\nUP RIGHT UP UP UP LEFT UP UP LEFT DOWN DOWN UP RIGHT...\n\nWow!\n\nNice little headup map, god those AI's are stupid.\n\nWhere's my fucking gun?\n\nCTRL SPACE ENT \n\nGun?\n\nCR Q W E R T A S D F Z X C I O P J K L SPACE SPACE CMD ALT TAB SPACE\n\nGu-uuun?\n\nDEL?\n\nFucking gun?\n\nF1?\n\nF1F2F3F4...\n\nSPACE\n\nFuck!\n\nHey this isn't a Wolfenstein map.\n\n[View Source]\n\n[Search for gun stuff]\n\n\n\"Hmm, cool I guess!\"", "gilded": 0, "created_utc": "1249598266", "subreddit": "technology", "score": 2, "controversiality": 0}
{"body": "I get flashbacks of past, um, encounters, and will blush - even though it has been  y e a r s  since it happened.", "gilded": 0, "created_utc": "1249674330", "subreddit": "AskReddit", "score": 16, "controversiality": 0}
{"body": "Add in the nationalized derivatives residue and United States is trillions in the hole. The prime culprits? American/Israeli dual citizens.\n\nMonetization will lead to hyperinflation. Who is spurring the monetization?  American/Israelis.\n\nWhat do they call you when you finally realize that you're being screwed by Israelis? **A N T I S E M I T E ! !**", "gilded": 0, "created_utc": "1249735790", "subreddit": "worldnews", "score": 7, "controversiality": 0}
{"body": "T H A T   \nD E P E N D S \n  O N  \n W H E T H E R   O R   N O T  \n Y O U   L I K E   S H O V I N G    T H I N G S   U P  Y O U R  A S S \n\n:D :D :D", "gilded": 0, "created_utc": "1249822066", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "[It'd be nice to view the list of worlds](http://www.yourworldoftext.com/cartographers)\n\nOr I can just list what I've found\n\nasdf reddit redditsucks redditrocks pi forexample doctorwho poem proggit digg twitter facebook myspace stumbleupon haskell lisp python ruby scheme xkcd spam sucks elsewhere nowhere somewhere 64digits world anothercastle anothercatle bill bacon narwhal narwhale robots text baconfort terrypratchett killbill poetry marijuana you me canada america yourworldoftext troll banana apple french english england orange red pink white black meme 4chan chan _ nigger a b c d e f g h i l no yes n o p q r s t v w x y z about first gizmo hell heaven nobody joe bob martin phillip 0 1 2 3 4 5 6 7 8 cartographers mario france spain burrito quetzalcoatl aoeu there\n\nAnd of course there's boobs dick dicks cock cocks fuck penis vagina cunt tits nsfw sex shit poo poop porn\n\nAlso, [Google](http://www.google.ca/search?q=site%3Awww.yourworldoftext.com)", "gilded": 0, "created_utc": "1249827832", "subreddit": "programming", "score": 6, "controversiality": 0}
{"body": "It's harder to say without knowing which specific chords are giving you trouble. I know Latin music especially can have some funky -7 or -9 chords. Chords that aren't in root position require a little more thought too. Start with this basic exercise:\n\nIn any key, play I - IV*6-4* - I - V*6-5* - I with the following fingerings, (for example, in the key of C) you would play:  \n\nC E G {5 3 1} (I = C)  \nC F A {5 3 1} (IV6-4 = F/C)  \nC E G {5 3 1} (I)  \nB F G {5 **2** 1} (V6-5 = G7/B)  \nC E G {5 3 1} (I)  \n\nGenerally, as far as strange chords go, you want to use 5-3-1 fingering if none of the notes are a second apart--thus the use of 5-2-1 in the G7 chord. Playing root-position 7th chords I find it easier to use a 5-3-2-1 fingering with my thumb on the 7th: try G B D F as 5-3-2-1 to see what I mean.\n\nAs far as scale-type patterns go, if you're ascending you can bring your thumb under your other fingers and put it down to shift to a new position. For example, try a C major scale with your right hand:\n\nC D E F G A B C  \n1 2 3 1 2 3 4 1\n\nYour thumb should come under your middle finger to hit F and under your ring finger to hit the high C; we use the thumb for high C instead of the pinky because then you can reiterate this pattern infinitely if necessary. (Moving-sidewalk-keyboard?) The same applies when coming back down the scale: bring your ring finger over your thumb to play B and your middle finger over your thumb to play E and you will land with your thumb back on C exactly as you started. For a complete list of all the scale patterns theglassishalf commented below with an excellent site that has a listing of all the patterns for all the scale groupings--you can play C, G, D, A, and E major all with the same fingering pattern!\n\nSource: I am an aspiring music education major and I had to take beginner piano last year, so I got lucky and had a technique book and professor from whom to learn.", "gilded": 0, "created_utc": "1249879532", "subreddit": "WeAreTheMusicMakers", "score": 5, "controversiality": 0}
{"body": "I'm seeing F A G Y then a bunny.\n\nSo... a gay bunny?", "gilded": 0, "created_utc": "1250119411", "subreddit": "pics", "score": 7, "controversiality": 0}
{"body": "I found it well worth starting before my class. You'll find the first few lessons nice and easy, and more importantly you'll have built up some calluses on your left hand (I don't know if anyone mentioned this, but it hurts when you start playing!).\n\nAs mentioned above, chordbook is a great resource. [Three Chord Guitar](http://threechordguitar.com/vids.htm) has some nice lessons for beginners, including videos showing you how to play some basic chords (I wouldn't worry about B7 quite yet, but A C D E and G are all fair game, I'd think). Some other decent sites in general are [Guitar Noise](http://www.guitarnoise.com/), [Chordie](http://chordie.com/) and just searching youtube for video lessons.\n\n\nEDIT: [Justin Sandercoe](http://www.justinguitar.com/en/TB-000-TheBasics.php) also has some great lessons, including lots of beginner material.", "gilded": 0, "created_utc": "1250125362", "subreddit": "Guitar", "score": 4, "controversiality": 0}
{"body": "E X A C T L Y !", "gilded": 0, "created_utc": "1250190759", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "The sad thing is that they have a chant where they spell out E A G L E S.", "gilded": 0, "created_utc": "1250203112", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "That shit was bananas, B A N A N A S.", "gilded": 0, "created_utc": "1250220900", "subreddit": "gaming", "score": -3, "controversiality": 0}
{"body": "C H E V R E cheese", "gilded": 0, "created_utc": "1250254331", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "P P P P P PHOTOSHOP!", "gilded": 0, "created_utc": "1250255697", "subreddit": "pics", "score": -3, "controversiality": 0}
{"body": "It was actually today; AIM convo went something like this:\n\nMe: \"Hey you, what are you getting into today sweetie?\"\n\nMy girl: \"Well, I'm suposta head to work @ 4, but I really don't want to go... :(\"\n\nMe: \"Suposta...?\"\n\nMy girl: \"What?\"\n\nMe: \"What does suposta mean?  I don't think that's a word.\"\n\nHer: \"Suposta isn't a word?!?!  Seriously?\"\n\nMe: \"... WOW.\"\n\n*F A C E P A L M *", "gilded": 0, "created_utc": "1250277189", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "Even though this was more than two weeks ago, I thought I would chime in a bit.\n\nIf you know the notes of the strings, you can discern the notes of the fret board quite easily.\n\nPattern is Whole, Whole, Half, Whole, Whole, Whole, Half\n\nE A D G B E are the open strings.  12th Fret barred is the octave.\n\nYou're probably well on your way to figuring it out by now, but just in case.\n\nGood Luck!", "gilded": 0, "created_utc": "1250280796", "subreddit": "Guitar", "score": 1, "controversiality": 0}
{"body": "It would look very similar to the drake equation.\n\nMaybe:\n\n    P(g) = B x U x S x -A\n    B := (Believers / Non Believers) // Not sure how it can effect the existence of god, only \"its\" possibility of reveling its self.  Therefore allowing a proof of \"god\".\n    U := (Unexplainable Events) // Events that we cannot explain scientifically and are commonly believed to be of a higher power.\n    S := Amount of **Scientific** studies that point to the existence of a higher power.\n    -A := Amount of **Scientific** studies that point to no higher power. // Negative to hurt overall score.\n    \n    ", "gilded": 0, "created_utc": "1250286253", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "And you still cant get insurance if you have a preexisting condition and the insurance company can still deny you life saving procedure to protect the bottom line. That is why what he offers as an alternative is G A R B A G E", "gilded": 0, "created_utc": "1250357921", "subreddit": "politics", "score": 11, "controversiality": 0}
{"body": "low to high Bb F C G B D(or E). i've been playing guitar for 10 years, but i still don't really know all that much beyond various theory books and many hours spent trying to freak myself out. i discovered pretty quickly that if you just invert the fingerings of most chords they still work, same with scales. at least on the low four strings. i play a lot of really gross sounding chords, augmented/diminished fifths, minor ninths, that kind of thing. wider intervals doesn't necessarily make it easier to do that, it just opens up different ways that i'm not entirely used to yet, and that's the joy of playing guitar for me.", "gilded": 0, "created_utc": "1250369673", "subreddit": "Guitar", "score": 1, "controversiality": 0}
{"body": "True old school Libertarians were against the Iraq war, and pretty much agree with lefty Liberals on a lot of issues, hence the name L I B E R T A R I A N.\n", "gilded": 0, "created_utc": "1250547696", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "Get the Wembley '86 CD  or DVD, cancel everything you have to do for 3 hours, and listen to it twice through. \n\n  G O O S E B U M P S ", "gilded": 0, "created_utc": "1250554274", "subreddit": "Music", "score": 2, "controversiality": 0}
{"body": "How about, instead of saying \"w w w\", we start saying \"u u u u u u\", then?", "gilded": 0, "created_utc": "1250591863", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "Darla and buckwheat are in a spelling bee.\nteacher. \"Darla, spell stupid and use it in a sentence. \nDarla \"S T U P I D, buckwheat sure is stupid\"\nteacher \"Very good. now do dumb.\"\nDarla \"D U M B. Buckwheat sure is dumb.\"\nteacher \"Very good, now Buckwheat. spell dictate and use it in a sentence.\nBuckwheat thinks for a moment, pissed that he getting harder words.\nBuckwheat. \"D I C T A T E. I may be dumb, and I may be stupid, but Darla says my dictate good.\"", "gilded": 0, "created_utc": "1250627877", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "My maths are bad, totally. So does the phrase hinge on rightness and wrongness and what they mean? I suppose to see it this way; imagine that choosing a religion is a purely random exercise, like picking a card. You have four religion cards W X Y Z with one that has a red back which you cannot see. If you choose X, you are statistically bias by a certain percent to have the red card. Can the same principle not be used in religion?  ", "gilded": 0, "created_utc": "1250715692", "subreddit": "religion", "score": 1, "controversiality": 0}
{"body": "b a s t a r d . ppppppppppppppppppppppppppppppppppppppppppppppp", "gilded": 0, "created_utc": "1250725058", "subreddit": "itookapicture", "score": 1, "controversiality": 0}
{"body": "Hey! I had the same problem asking for a pop when I was in Michigan when I was 12 or so. I had no idea what this asshole's problem was.\n\nMe: I'll have pop. (it was a place with a do it yourself fountain pop)\n\nThem: *blank stare*\n\nMe: Uh.. pop... soda... R o o t B e e r\n\nIt was so awkward :(\n", "gilded": 0, "created_utc": "1250728376", "subreddit": "todayilearned", "score": 7, "controversiality": 0}
{"body": "the most insane kinetic schizophrenic 50 min anime you'll ever see:\nD E A D L E A V E S\nproduction IG, directed by Hiroyuki Imaishi \nIt's a short movie/film that precedes his most known work \"Tengen Toppa Gurren Lagann\". One of my favorite animes of all time.", "gilded": 0, "created_utc": "1250784404", "subreddit": "anime", "score": 2, "controversiality": 0}
{"body": "**B U L L S H I T**  \n\nIf what you say is true then why all the senseless War? all the senseless policy? \n\ndownvoted", "gilded": 0, "created_utc": "1250792100", "subreddit": "IAmA", "score": -7, "controversiality": 0}
{"body": "Right... I assumed it was for the person who posted the reddit. Whomever you were commenting to, you could've done in the spirit of actually engaging in a conversation, rather than just ranting \"B U L L S H I T\".", "gilded": 0, "created_utc": "1250805877", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "G I G G I T Y", "gilded": 0, "created_utc": "1250858721", "subreddit": "movies", "score": 2, "controversiality": 0}
{"body": "Here's some capital letters for you:\n\nT J S I C L T T H J S T J I W S I B B J A I J D D T I J I I", "gilded": 0, "created_utc": "1250875121", "subreddit": "politics", "score": 14, "controversiality": 0}
{"body": "Big topic, short on time right now. If you learn which notes make up the chords based on the 1st, 4th and 5th degree of the scale, you can harmonise a great deal of music without needing much more. \n\nSo, say the song is in C major. The tonic (1st) degree chord would be C, E and G. The chord of the 4th would be F A and C, while the 5th degree chord would be G, B and D.  When you've got that sorted, adding a dominant 7th to the 5 chord adds colour - can explain that later if you want. \n\n So, when choosing how to use those chords, experiment with plonking a chord down when you have a note in the melody that contains one of those notes. So, take *twinkle twinkle little star* for example.  The tune starts on C, so play a C chord. Keep that one down till you get to \"little\", where the tune hits an A. That note belongs in the 4th chord, so play a F A C in the bass. After \"little\", the word \"star\" falls back on a G, so play another C chord (you can try a G chord, but will hear that it doesn't fit as well). \"how I\" falls on an F, so play the 4th chord again, \"wonder\" is on E, so play the C chord, \"what you\" is on D, so play your G chord, and \"are\" is back on the tonic, C, so play that chord again. \n\nThere is a lot you can do to make that better, but that might be a very basic way to get the hang of it.\n\nHope that helps...now I'm off to band...", "gilded": 0, "created_utc": "1250931332", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "So lets take the key of C since its a good example.. the notes of C are C D E F G A B and you could number them 1-7.. 1 is major 2 and 3 are minor 4 and 5 are major, 6 is minor, and 7 is diminished which basically means a minor chord with a flat 5th. So in Cmajor you get the chords Cmaj dmin emin FMaj GMaj amin bdim and those rules hold true to any starting point like D major the key which is D E F# G A B C# you get Dmaj emin f#min GMaj AMaj bmin c#dim. So theres a good starting point for figuring out what chords work well together use that circle of 5ths you mentioned to get the chords of whatever key you want. Most guitar stuff is in the rangle of FMaj to Emaj on the circle. This isnt something to be adhered to 100% but a framework to work with\n\n", "gilded": 0, "created_utc": "1250934544", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "yeah sorry phrygian, thanks.... technically all modes are scales and all scales are modes... now that im more awake, lets make an example out of it...\n\nC D E F G A B C = 1 2 3 4 5 6 7 8 \n\nIONIAN\n\n1 2 3 4 5 6 7 8 = C D E F G A B C\n\nDORIAN\n\n1 2 3b 4 5 6 7b 8 = C Db E F G A Bb C\n\nPHRYGIAN\n\n1 2b 3b 4 5 6b 7b 8 = C Db Eb F G Ab Bb C\n\nLIDIAN\n\n1 2 3 4# 5 6 7 8 = C D E F# G A B C\n\nMIXOLIDIAN\n\n1 2 3 4 5 6 7b 8 = C D E F G A B C\n\nEAOLIC\n\n1 2 3b 4 5 6b 7b 8 = C D Eb F G Ab Bb C\n\nLOCRIAN\n\n1 2b 3b 4 5b 6b 7b 8 = C Db Eb F Gb Ab Bb C\n\nHARMONIC\n\n1 2b 3 4 5 6b 7 8 = C Db E F G Ab B C\n\nMELODIC\n\n1 2 3b 4 5 6 7 8 = C D Eb F G A B C\n\nNow, with this in mind you gotta remember, in a major mode, such as ionian lidian and mixolidian the chords would go as follows... (upper case for major chords, lower chase for minor chords)\n\nI ii iii IV V vi viid (d = diminished....)\n\nnow for the minor chords such as dorian, phrygian, eaolic and locrian the chords would be\n\ni iid III iv v VI VII\n\nthe harmonic and melodic modes would use different chords progressions.\n\nNow, knowing if a chord is flat is where the circle of fifths comes in handy:\n\nstarting with C, going up by fifths, each time adding a sharp, like this...\n\nC D E F G A B C\n\nG A B C D E F# G\n\nD E F# G A B C# D \n\nA B D C# E F# G# A \n\nE F# Gb A B C# D# E \n\nB C# D# E F# G# A# B \n\nF G A Bb C D E F \n\nas you can see, in the mode, F ionian, the B is flat, here's where the circle of fourths start, every fourth adding a flat:\n\nIn the circle of 5ths, we added a sharp every 5th degree, so the order would be \n\nFCGDAEB\n\nin the circle of fourths how ever, every four notes we would add a flat and the order would be the other way around\n\nBEADGCF\n\nThat would give us all twelve keys....\n\nOk now that you've got all that memorized, it's time to talk about chord progressions....\n\nfirst cadences... you know what cadences are right? it's a way to end a chords progression such as V - I or V - IV - I or IV - I are the most common, you can come up with others such as VI - II or IV - V - I .... play around with the cadence first and then go backwards... usually playing in fourths is a nice way to play... for example C - F - Bb.... well all of these are major progressions, choose a mode you like and then depending on the mode, the chords you will use will vary...\n\nRead some theory on 12 - bar blues or standard blues tunes, read some on blues turn arounds, that will give you a basic knowledge on chord progression...\n\na standard major blues will sound something like (using every chord as a major 7th chord)\n\nI - I - I - I\nIV -IV - I - I\nV - IV - I - V\n\nThats a standard 12 bar blues, as you can see, there's a very nice turn around on the last 4 bars, thats the cadance.... \n\nnow a minor blues would be more more interesting, such as\n\ni - i - i - i\niv - iv - i - i\nVImaj7 - v - i - i\n\njust playing around with the chords is the idea, there's no one way to do it, just stay in the mode and you'll be fine, you can go to another key if you want, using transitions such as the 5th of 5th i.e\n\nthe 5th of C is G and the 5th of G is D... and if the cadence resolves on the other key well now you're in the key of G.. but al thats a little more coplex.....\n\nany more questions???\n\n\n\n\n\n\n\n", "gilded": 0, "created_utc": "1250965415", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "that shit's bananas. B A N A N A S", "gilded": 0, "created_utc": "1250988111", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Sure, blame it on the a a a a a alcohol", "gilded": 0, "created_utc": "1251056229", "subreddit": "comics", "score": 1, "controversiality": 0}
{"body": "I thought about what you wrote and it didn't explain why writing appears left/right reverse.  Because you can't \"put yourself in the point of view of the virtual image\" of letters, the way you can try to think about the person in the mirror's left and right hand.  Then I realized that the answer was that the letters are facing the mirror, and we reversed them by rotating the page around a vertical axis (spin left/right) instead of flipping it end over end on a horizontal axis.  Or, in the case of letters on our t-shirt, we always rotate on a vertical axis (spin around to face the mirror) to face the mirror.  What if we were to hang upside down to look in the mirror. Well, that would make no difference because our eyes would be upside down too.  If you were holding up a transparent sheet with words written, holding it in front of you, you'd see the same left/right reverse image because that's the direction you rotated it.\n\nSo I wrote some letters on a piece of paper and tried flipping it different directions in the mirror.  I had a piece of paper and had written the word MINE on it.  Flipped up/down it looked like \"WINE\" but with the N looking wrong.  Flipped left/right it looked like ENIM with the E and N looking wrong.\n\nThat gave me an idea.\n\nThe letters H I O and X look the same either way.  A M T U V W Y look the same reversed left/right, and B C D E K look the same flipped up/down.  Z S R Q P N F G J L never look right in the mirror.\n\nOnly W and M turn into another letter when flipped.\n\nIf you write CHICK BED OX on a piece of paper and turn it to the mirror by flipping it vertically it says the same thing in the mirror. If you flip it the other way you get lots of wrong looking letters in the reverse order.\n", "gilded": 0, "created_utc": "1251069050", "subreddit": "science", "score": 17, "controversiality": 0}
{"body": "a b c d e f g h i j k l m n o p q r s t u v w x y z\n\n*repeat*", "gilded": 0, "created_utc": "1251114465", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "&gt;Again, not at all. Reason allows us to alter our own instincts and desires, by choosing our experiences.\n\nYou cannot wish away your most fundamental instincts. Biology doesn't work that way. Besides, what would you be altering your instinct towards? What would be guiding you? \n\n&gt;At birth, we have not yet acquired any information and are thus at the mercy of our instinct. It is the nature of our particular species to transition out of this period of dependence and ultimately to rely on Rationality alone.\n\nEye-wincingly trite nonsense. Rationally justify for me why you choose to live and your most basic goals and objectives in life. \n\n&gt;To live or not to live. If you choose life, your rational goals will always be in line with your natural reward system. If not, it doesn't matter anyway.\n\nGreat, why should one live? Please provide a rational reason not dependent on instinct or desire. If you cannot you entire morality is built on whim i.e. it isn't really a morality at all. Please read that article I linked to from mises.org. It explains this exact problem in much greater detail. In fact I'll quote the relevant part:\n\n&gt;    This ability of man to choose his own destruction is of some importance, and\nRand mentions it more than once. She uses this negative choice-potential to differ-\nentiate the human from the lower vegetative life-forms: \"there is no alternative\nin a plant's function: it acts automatically to further its life, it cannot act for its \nown d e s t ~ c t i o n . \" ~The negative volitional option is utilized to separate human from animal as well. 28 Freely chosen evil is recognized as essential for this dif-f e r e n t i a t i ~ n and indeed, it is seen as that which constitutes the uniqueness of man: \"Man is the only living species that has the power to act as his own destroyer-and that is the way he has acted through most of his history.\"'O Galt\nis summoned to cap it off: \"the alternative his nature offers him is: rational being or suicidal animal.\"\n\n&gt;These reiterations seemingly contradict another basic thesis of Randian ethics,\nhowever, for she has insisted: \"Ethics is an objective, metaphysical necessity of\nman's survival. \" 32 Now, this standard-the rational criterion required for man to\nsurvive qua man3)-is perfectly objective, and unalterable by human whim: \"No\nchoice is open to an organism in this issue: that which is required for its survival\nis determined by its nature, by the kind of entity it is.\" '4 Since Rand has admitted\n(often) that the entity can choose deathover life, however, it is at this critical junc-\nture that the subjectivity enters and dominates Rand's entire ethical edifice. The\nwhole Randian moral system rests upon the most basic moral command that one\nought to do that which preserves one's life (qua man). It makes no difference,\nthen, that the standard is not variable in response to the individual, subjective will,\nfor the commitment to the command (\"one ought to behave so as to survive qua\nman\") demands a more basic deontological moral imperative-setting up the pro-\nspect of an infinite regression of moral commands-for a rational creature has the\noption to choose nonsurvival as well as survival: \"Metaphysically, the choice 'to\nbe conscious or not' is the choice of life or death.\" 35\n &gt;Apparently, there is no reason not to select death over life. The fact that activity\ny is required for my continued existence does not make a deontological \"ought\" derivable from that fact. If, on the other hand, \"one ought to do y in order to survive\" can be translated into \"if one wishes to survive, one ought to do y,\" then the entire structure of Objectivist ethics becomes subjective, for the condi-\ntional \"if one wishes to survive\" colors all that depends upon it.\n", "gilded": 0, "created_utc": "1251152561", "subreddit": "Libertarian", "score": 2, "controversiality": 0}
{"body": "Initially it did.  Time went by v e r y v e r y s l o w l y for about the first month.  Every minute was spent wondering if I should call the dealer and get a bag.  ..and I did a few times.\n\nMy whole brain was in slow motion and I couldn't answer questions and I felt like an idiot.  I just had to work through it because although I couldn't see it, I *knew* there was a light at the end of the tunnel. ", "gilded": 0, "created_utc": "1251201354", "subreddit": "IAmA", "score": 7, "controversiality": 0}
{"body": "TEACHER:   Donald, what is the chemical formula for water? \nDONALD:     H I J K L M N O. \nTEACHER:   What are you talking about? \nDONALD:    Yesterday you said it's H to O.   \n", "gilded": 0, "created_utc": "1251227704", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Breaking Bad is one of my favorite shows on TV.  It focuses on the manufacturing end which is something I don't know too much about.\n\nWhen they make a batch and hold up one of their giant crystals I drool because it looks so good.  I've never seen crystals that big or clear before.\n\nOne thing that always strikes me as inaccurate is when Jessie is smoking his pipe.  The smoke looks real, but he never takes a big hit.  It's like he puffs it.  To smoke crystal you need to draw in air s l o w l y once it begins to melt.  You can't just hold up a lighter, wait a second and give it a tiny puff.\n\nAlso, his pipe is dirty as hell.  If he's smoking something that pure it should be pretty clean.\n\nI had one friend die, but he wasn't high on meth at the time.  He fell down some steep stairs as he was leaving a bar and cracked his skull open.  Miss that guy.  :(", "gilded": 0, "created_utc": "1251247504", "subreddit": "IAmA", "score": 5, "controversiality": 0}
{"body": "--------------------------------------------------------------------.\n\n| .--                    FEDERAL RESERVE NOTE                    .-- |\n\n| |_       ......    THE UNTIED STATES OF AMERICA                |_  |\n\n| __)    ``````````             ______            B93810455B     __) |\n\n|      2        ___            /      \\                     2        |\n\n|              /|~\\\\          /  _-\\\\  \\           __ _ _ _  __      |\n\n|             | |-&lt; |        |  //   \\  |         |_  | | | |_       |\n\n|              \\|_//         | |-  o o| |         |   | `.' |__      |\n\n|               ~~~          | |\\   b.' |                            |\n|       B83910455B           |  \\ '~~|  |                            |\n| .--  2                      \\_/ ```__/    ....            2    .-- |\n| |_        ///// ///// ////   \\__\\'`\\/      ``  //// / ////     |_  |\n| __)                   F I V E  D O L L A R S                   __) |\n`--------------------------------------------------------------------'\n", "gilded": 0, "created_utc": "1251247589", "subreddit": "test", "score": 1, "controversiality": 0}
{"body": "[What does M O O N spell?](http://www.youtube.com/watch?v=hulF_g5_4uY)", "gilded": 0, "created_utc": "1251253720", "subreddit": "IAmA", "score": 5, "controversiality": 0}
{"body": "Bb F C G B E", "gilded": 0, "created_utc": "1251256161", "subreddit": "Guitar", "score": 1, "controversiality": 0}
{"body": "L E E   J A E D O N G ! ! !", "gilded": 0, "created_utc": "1251267758", "subreddit": "starcraft", "score": 1, "controversiality": 0}
{"body": "I honestly read that as the Tortoise album from TMNT. I had that album back in the day from Pizza Hut.\n\nT U R T L E POWER T U R T L E POWER\nYo, there's Donatello,\nEven for a turtle, he's mellow!\n\nHere is a video for the tour with the songs, also sponsored by Pizza Hut.\nhttp://www.youtube.com/watch?v=cGDeLkTlo_Q", "gilded": 0, "created_utc": "1251306990", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "And my bologna has a first name, it's O S C A R. ", "gilded": 0, "created_utc": "1251389085", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "And my bologna has a second name it's M A Y E R. ", "gilded": 0, "created_utc": "1251389141", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "\"up up down down left right left right B A B A start.\" Works on most microwaves.", "gilded": 0, "created_utc": "1251441938", "subreddit": "pics", "score": 8, "controversiality": 0}
{"body": "L I B E L . . .", "gilded": 0, "created_utc": "1251492476", "subreddit": "AskReddit", "score": 17, "controversiality": 0}
{"body": "Email \r\n\r\nh e a d l i n e c o p y @ g m a i l . c o m\r\n\r\nHere to help. ", "gilded": 0, "created_utc": "1251520626", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "I used [Google Translate](http://translate.google.com) from English to Japanese to spell out \"r e d d i t\"\n", "gilded": 0, "created_utc": "1251612160", "subreddit": "geek", "score": 3, "controversiality": 0}
{"body": "I are so smart S M R T smart...", "gilded": 0, "created_utc": "1251668584", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "So lets take the key of C since its a good example.. the notes of C are C D E F G A B and you could number them 1-7 (C is 1, D is 2 ect) so a 1 5 m6 4 in C would go C Major, G Major, a minor, and F Major", "gilded": 0, "created_utc": "1251693838", "subreddit": "WTF", "score": 1, "controversiality": 0}
