{"body": "Yeah, I think I read that in the industry dietary journal called \"DUH\"\n\nHFCS is P O I S O N, makes all food it's in taste like CORN and is the #1 cause of OBESITY IN THIS COUNTRY.\n\nWhy is all American food saturated with the stuff?  So we can sell our sugar to OTHER COUNTRIES who aren't stupid enough to put that crap HFCS in THEIR food.\n\nBoobus Americanus=the most gullible shoppers on earth", "gilded": 0, "created_utc": "1207246375", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "And here's the rub :-)\n\nThe types of the arguments can be different - or rather, in the Perl version, they're all scalars, which can contain anything. `argmunge [2,1]` is `flip`, and `argmunge [3,4,3]` is `\\f a b c d -&gt; f c d c`. So `argmunge xs` has an H-M type for each integer array `xs`, but `argmunge` itself doesn't.\n\nIn Perl/Lisp/whatever, you don't care about inspecting the types of the arguments: any type inspection necessary should be done by the victim function, and in general you have no way of knowing what its precise requirements are - certainly not at compile-time. You trust your users to be grown-ups and write adequate tests :-)", "gilded": 0, "created_utc": "1207261204", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "Can you spell F A L S E  F L A G", "gilded": 0, "created_utc": "1207371998", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Ah.\n\nCause...it's...F I C T I O N.\n\nYou want a different ending, write one yourself.", "gilded": 0, "created_utc": "1207429767", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "They are getting brave now - only the one call from them so far today and this time he said he was a manager!! Fun!!  \r\n\r\n\r\nMe: Hello \r\n\r\nDebitas: May I speak to Mr X? \r\n\r\nMe: Who's calling? \r\n\r\nDebitas: It's Debitas Legal Services \r\n\r\nMe: You're speaking to Mr X \r\n\r\nDebitas: I need to confirm your date of birth \r\n\r\nMe: Hang on - can I take your name first \r\n\r\nDebitas: It's Mr Mahmood \r\n\r\nMe: Can you spell it for me \r\n\r\nDebitas: It's Mr, them M A H M O O D \r\n\r\nMe: Ok, and what is your job title? \r\n\r\nDebitas: I'm a manager here \r\n\r\nMe: Is manager your job title? \r\n\r\nDebitas: Yes - now can I confirm your date of birth? \r\n\r\nMe: Well, I've been through this with loads \r\nof you guys now, the simple answer is no \r\n\r\nDebitas: (obviously annoyed) Listen Mr X, we have notes on our screen that tell me about all your calls... \r\n\r\nMe: (interrupting) oh good - you can see it amounts to harassment then? \r\n\r\nDebitas: We know your not Caesar or Jesus, we know this is Mr X \r\n\r\nMe: Oh dear - you caught me!! \r\n\r\nDebitas: (annoyed) now give me your date of birth \r\n\r\nMe: Actually Mr Mahmood - there's something you should know \r\n\r\nDebitas: What? \r\n\r\nMe: Are you sitting down? \r\n\r\nDebitas: (sigh) what? \r\n\r\nMe: This is very important... \r\n\r\nDebitas: What is it? \r\n\r\nMe: Mr Mahmood.... (silence for about a minute) \r\n\r\nMe: Mr Mahmood - (loud voice) I am your father! \r\n\r\nDebitas: (sigh) Mr X? \r\n\r\nMe: Yes - (choked up) son!! \r\n\r\nDebitas: Mr X, you are not helping yourself \r\n\r\nMe: I.... \r\n\r\nDebitas: (hangs up) ", "gilded": 0, "created_utc": "1207506480", "subreddit": "reddit.com", "score": 37, "controversiality": 0}
{"body": "Speccy was better because you'd type J symbolshift+P symbolshift+P, and 64 would be L O A D \" r e d d i t \" \n\nAlso, 401 would appear at the end of the loading, while speccy would detect them as the broken links the moment they appeared.\n\n64 was white, and speccy was black although there was that rainbow which was gay.", "gilded": 0, "created_utc": "1207570337", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "I am on an email list from one of my old right wing boss. Here is an email I got from him yesterday. Should go to show where the other %11 are coming from.\n\n======B E G I N  E M A I L =========\n\nHow Stupid Are WE?                                                      \n\n  I have been hammered with the propaganda that it is the Iraq war and the \n  war on terror that is bankrupting us. I now find that to be RIDICULOUS.  \n  Now, I hope the following 14 reasons are forwarded over and over again   \n  until they are read so many times that the reader gets sick of reading   \n  them. I have included the URL's for verification of all the following    \n  facts.                                                                   \n\n\n\n  1. $11 Billion to $22 billion is spent on welfare to illegal aliens each \n  year. http:&lt;http://tinyurl.com/zob77%20&gt;                                 \n\n\n  2. $2.2 Billion dollars a year is spent on food assistance programs such \n  as food stamps, WIC, and free school lunches for illegal aliens.         \n  http://www.cis.org/articles/2004/fiscalexec.html                         \n\n\n  3. $2.5 Billion dollars a year is spent on Medicaid for illegal aliens.  \n  http://www.cis.org/articles/2004/fiscalexec.html                         \n\n\n  4. $12 Billion dollars a year is spent on primary and secondary school   \n  education for children here illegally and they cannot speak a word of    \n  English! http://transcripts.cnn.com/TRANSCRIPTS/0604/01/ldt.0.html       \n\n\n  5. $17 Billion dollars a year is spent for education for the             \n  American-born children of illegal aliens, known as anchor babies.        \n  http://transcripts.cnn.com/TRANSCRIPTS/0604/01/ldt.01html                \n\n\n  6. $3 Million Dollars a DAY is spent to incarcerate illegal aliens       \n  http://transcripts.cnn.com/TRANSCRIPTS/0604/01/ldt.01.html               \n\n\n  7. 30% percent of all Federal Prison inmates are illegal aliens.         \n  http://transcripts.cnn.com/TRANSCRIPTS/0604/01/ldt.01.html               \n\n\n\n  8. $90 Billion Dollars a year is spent on illegal aliens for Welfare &amp;   \n  social services by the American taxpayers.                               \n  http://premium.cnn.com/TRANSCIPTS/0610/29/ldt.01.html                    \n\n\n  9. $200 Billion Dollars a year in suppressed American wages are caused   \n  by the illegal aliens.                                                   \n  http://transcripts.cnn.com/TRANSCRIPTS/0604/01/ldt.01.html               \n\n\n  10 The illegal aliens in the United States have a crime rate that's two  \n  and a half times that of white non-illegal aliens. In particular, their  \n  children are going to make a huge additional crime problem in the US     \n  http://transcripts.cnn.com/TRANSCRIPTS/0606/12/ldt.01.html               \n\n\n  11 During the year of 2005 there were 4 to 10 MILLION illegal aliens     \n  that crossed our Southern Border also, as many as 19,500 illegal aliens  \n  from Terrorist Countries. Millions of pounds of drugs, cocaine, meth,    \n  heroine and marijuana, crossed into the U. S from the Southern border.   \n  Homeland Security Report: http://tinyurl.com/t9sht &lt;                     \n  http://tinyurl.com/t9sht&gt;                                                \n\n\n  12 The National Policy Institute 'estimated that the total cost of mass  \n  deportation would be between $206 and $230 billion or an average cost of \n  between $41 and $46 billion annually over a five year period.'           \n  http://www.nationalpolicyinstitute.org/pdf/deportation.pdf               \n\n\n  13 In 2006 illegal aliens sent home $45 BILLION in remittances back to   \n  their countries of origin. http://www.rense.com/general75/niht.htm       \n\n\n  14 'The Dark Side of Illegal Immigration: Nearly One Million Sex Crimes  \n  Committed by Illegal Immigrants In The United States '.                  \n  http://www.drdsk.com/articleshtml                                        \n\n\n\n  The total cost is a whopping $ 338.3 BILLION DOLLARS A YEAR.            \n\n==============E N D ==================\n\nSome of the stuff I get from these people is ridiculous. I got the one about Obama being a Muslin and another painting Bush to be some kind of saint for all the killing he's done in Iraq. It's scary. The guy who sent this to me lives about 100 miles from Bush's ranch in Texas.\n", "gilded": 0, "created_utc": "1207677110", "subreddit": "politics", "score": 7, "controversiality": 0}
{"body": "Let me spell this out.\n\nFor most of the human race who utters the term \"Turing complete\", the referent is a language.\n\nL A N G U A G E\n\nnot a machine\n\nM A C H I N E\n\nEven people with basic literacy skills can distinguish these two things.", "gilded": 0, "created_utc": "1207755494", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "It's M I N N E S O T A.  Dick.", "gilded": 0, "created_utc": "1207762413", "subreddit": "business", "score": 18, "controversiality": 0}
{"body": "Fox and their so-called \"news\" support the right-wing, neocon, RepubliGOON party and their man John \"I call my wife a trollop and a cunt\" McNasty...\n\nThey are the **RepubliGOONS!**\n\nAnd please remember: the power-grabbing Hillary-bot must be stopped!\n\n**Let's each send another $20 or so to Obama on April 20th and spread this message!\n\"T W E N T Y - O N - T W E N T Y ! ! !\"**\n\nMcCain is angry, confused and unstable!", "gilded": 0, "created_utc": "1207764693", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "An ex-wrestler on the Dumb &amp; Dumber show on the Fox (so-called) \"news\" network.  Just because Ventura speaks in plain English doesn't mean he isn't a total douche bag!\n\nIf you feel strongly about changing this country, fight to get Obama elected and forget right-leaning ex-wrestlers.\n\nLet's each send another $20 or so to Obama on April 20th and post messages asking others to do it too.\n\n**\"T W E N T Y - O N - T W E N T Y ! ! !\"**", "gilded": 0, "created_utc": "1207765314", "subreddit": "politics", "score": -4, "controversiality": 0}
{"body": "The **RepubliGOONS!** and their man John McNasty must be stopped and so does the power-grabbing Hillary-bot!\n\nLet's each send another $20 or so to Obama on **April 20th** and post messages asking others to do it too.  You know the RepubliGOONS are using the web to raise money.  We need to continue to do it faster!\n\n**\"T W E N T Y - O N - T W E N T Y ! ! !\"**", "gilded": 0, "created_utc": "1207766188", "subreddit": "politics", "score": -5, "controversiality": 0}
{"body": "To take our country back from huge \ncorporations and the **RepubliGOONS,**\nwe must stop their man John McNasty.\n\nBut we first need to stop the power-grabbing Hillary-bot!\n\nLet's each send another $20 or so to Obama on April 20th and post messages asking others to do it too.  You know the RepubliGOONS are using the web to raise money.  We need to continue to do it faster!\n\n**\"T W E N T Y - O N - T W E N T Y ! ! !\"**", "gilded": 0, "created_utc": "1207766807", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "The **RepubliGOONS** have made it so that America is now known around the world as the country of murder, rape and torture.  And they want to continue this work by having us elect John McNasty!\n\nLet's each send another $20 or so to Obama on April 20th and post messages asking others to do it too.  You know the RepubliGOONS are using the web to raise money.  We need to continue to do it faster!\n\n**\"T W E N T Y - O N - T W E N T Y ! ! !\"**", "gilded": 0, "created_utc": "1207767410", "subreddit": "politics", "score": -6, "controversiality": 0}
{"body": "**RepubliGOONS.  The Party of Rape and Torture.**  I hope that helps.\n...\n\nThe RepubliGOONS have made it so that **America is now known around the world as the country of murder, rape and torture.** And they want to continue this work by having us elect John McNasty!\n...\n\nLet's each send another $20 or so to Obama on April 20th and post messages asking others to do it too. You know the RepubliGOONS are using the web to raise money. We need to continue to do it faster!\n\n\"T W E N T Y - O N - T W E N T Y ! ! !\"", "gilded": 0, "created_utc": "1207770901", "subreddit": "politics", "score": -4, "controversiality": 0}
{"body": "**RepubliGOONS.  The Party of Rape, Lies,\nWar , Torture and Airport Bathroom Sex.** \n\nUsing Blackwater and \"Black Sites,\" the RepubliGOONS have made it so that **America is now known around the world as the country of murder, rape and torture.** And they want to continue this work by having us elect John McNasty???\n...\n\nWe had better act fast if we still want a country.\n...\n\n\nLet's each send another $20 or so to Obama on April 20th and post messages asking others to do it too. You know the RepubliGOONS are using the web to raise money. We need to continue to do it faster!\n\n\"T W E N T Y - O N - T W E N T Y ! ! !\"", "gilded": 0, "created_utc": "1207771502", "subreddit": "politics", "score": -4, "controversiality": 0}
{"body": "Pop Quiz, hotshot!\r\n\r\nWhich one of these sentences does not implode:\r\n\r\n- 1) Staying silent is better _then_ embarrassing yourself by saying something stupid.\r\n- 2) People who fail at forming sentences in _there_ native language should stay silent.\r\n- 3) American_s_ generally get only 2 weeks vacation, if _they're_ lucky.\r\n\r\nIt doesn't matter that many of those big, difficult words (I've highlighted a few so you'll know them) sound alike, because they have *Different Meanings*.\r\n\r\nAllow me to demonstrate the severity of this issue using an example in my own native language, Finnish:\r\n\r\n- \"Suklaa on parempaa _kuin_ seksi.\"\r\n\r\nWhich is a translation of: \r\n\r\n- \"Chocolate is better _than_ sex.\"\r\n\r\nNow behold what happens when you make an oh-so-eye-hemorrhagingly-typical mistake:\r\n\r\n- \"Chocolate is better **then** sex.\" &lt;-- *WRONG*\r\n\r\nAnd the mistake translated to Finnish:\r\n\r\n- \"Suklaa on parempaa **sitten** seksi.\"\r\n\r\nYou see what happens when you use words with **DIFFERENT GODDAMN MEANINGS** ?\r\n\r\nDifferent words have different meanings! Even though some words in your language sound the same, they are still different words - and yes, you guessed it - have different meanings!\r\n\r\nTo make the equivalent mistake in Finnish, you would have to be _t o t a l l y . f u c k i n g . r e t a r d e d_, because generally when you speak, you know which words you are using.\r\n\r\nUnderstand?\r\n\r\nMaybe you're thinking I'm overreacting, and that especially in The Country Of Freedom, America, all people are Free to fail at forming sentences in _their_ (omg!) native language, but you haven't experienced seeing these mistakes making your brain hurt and your eyes bleed.\r\n\r\nYour message just happened to be yet another \"last straw\". \r\n\r\nEvery time I see a \"then\" where there should be a \"than\", it hurts, and every time I feel like raving about it. \r\n\r\nBut if I did that, I'd have no time for anything else besides gently correcting people's mistakes.\r\n\r\n\r\n\r\n", "gilded": 0, "created_utc": "1207949698", "subreddit": "programming", "score": 76, "controversiality": 0}
{"body": "I thought this story was kinda pointless, given that Japan isn't actually doing anything, explicitly or implicitly, other than giving the age-old finger to China...so here are the lyrics to **Eric the half a bee**\n\nHalf a bee, philosophically,\nMust, ipso facto, half not be.\nBut half the bee has got to be\nVis a vis, its entity. D'you see?\n\nBut can a bee be said to be\nOr not to be an entire bee\nWhen half the bee is not a bee\nDue to some ancient injury?\n\nSinging...\n\nLa dee dee, one two three,\nEric the half a bee.\nA B C D E F G,\nEric the half a bee.\n\nIs this wretched demi-bee,\nHalf-asleep upon my knee,\nSome freak from a menagerie?\nNo! It's Eric the half a bee!\n\nFiddle de dum, Fiddle de dee,\nEric the half a bee.\nHo ho ho, tee hee hee,\nEric the half a bee.\n\nI love this hive, employee-ee,\nBisected accidentally,\nOne summer afternoon by me,\nI love him carnally.\n\nHe loves him carnally,\nSemi-carnally.\nThe end.\n\nCyril Connelly?\nNo; semi-carnally!\nOh.\n\nCyril Connelly.", "gilded": 0, "created_utc": "1207996931", "subreddit": "worldnews", "score": 0, "controversiality": 0}
{"body": "He doesn't have the job requirements of a communications/journalism degree. Can't have those college drop-outs getting all uppity now can we?\r\n\r\n*Apparently I forgot to add that this is s a r c a s m \\ˈsär-ˌka-zəm\\", "gilded": 0, "created_utc": "1208025722", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "@ jordancaleb: I wouldn't go so far as to say total flash-mob style, that might give some fuel to the \"cult\" fire. I'm picturing like a group of guys at a baseball game with O B A M A  0 8 spelled on their chests or something like that. Nothing out of the ordinary for the scenery, except for the message.", "gilded": 0, "created_utc": "1208136413", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "It's true, these epic first person shooters are **B O R I N G**.\r\n\r\nIt's all about MAME. *Real* video games.", "gilded": 0, "created_utc": "1208149083", "subreddit": "gaming", "score": 6, "controversiality": 0}
{"body": "For the last time.  The perfect language would be perfect!  Every time you imagine anything that seems imperfect you are not imagining the perfect language.  The perfect language of God would suit the purpose of communicating the message perfectly.  Ambiguity when you are \"dictating\" your definitive word surely is not P E R F E C T.\n\nWhere does God say he wants you to interpret whatever you like out of the text?  The only argument for this (as made elsewhere) is that by the very nature of Gods language it is implied that he wants you to interpret it in your own way, which I guess would make the language perfect for the task.  However, that argument relies on a leap of faith to agree that the text is indeed authored by God as we have zero evidence of this.\n\nSo we are really talking about faith all the time here which has no basis in objective discourse so we may as well stop here.  It was fun while it lasted.", "gilded": 0, "created_utc": "1208220204", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "Dammit! He shoulda used the T A Z E R !", "gilded": 0, "created_utc": "1208639620", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Uh. You're saying Obama got a victory in PA?\nR i g h t .......", "gilded": 0, "created_utc": "1209017284", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "&gt;There would have to be some kind of pattern in the way they place the hats\n\nNo, suppose we've got 7 dwarves as follows:\n\n  W B B W W W B\n\nDwarf 1 sees an odd number (3) of black hats in front of him.  He says \"Black\" (he would have said white if he saw an even number).  He has a 50% chance of survival.  In this case, he dies.\n\nDwarf 2 sees an even number (2) of black hats.  Since he knows Dwarf 1 saw an odd number, *his* must be the extra black\nhat.  He knows his is black, so says so.\n\nIf he had seen an odd number of black hats, he would have said \"white\", as the only way Dwarf 1 could have seen an odd number\ntoo is if he has a white hat.\n\nDwarf 3 knows that Dwarf 2 saw an even number of black hats, because dwarf 1 saw an odd number, and one of those is\naccounted for by dwarf 2 (ie. Odd number -1 = Even number).  He proceeds with the same reasoning as Dwarf 2.  Since he sees an odd number, he says \"Black\"\n\nThis carrys on though the dwarves.  The arrangement of hats doesn't matter, as all dwarves can see the hats in front of them, and know whether the dwarf behind saw an even or odd number of black hats.  This is always enough to determine their own hat colour.\n", "gilded": 0, "created_utc": "1209043776", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "Yeah, jorpic's code is nice and listy:\n\n    import Data.List\n\n    levenshtein sa sb = last $ foldl (transform sa) [0..length sa] sb\n       where transform str xs@(x:ys) c = res\n                where res = x+1 : zipWith4 k str xs ys res\n                      k d x y z = minimum [y+1, z+1, x + fromEnum (d /= c)]\n\nRunning that:\n\n    *Main&gt; levenshtein  \"haskell\" \"pascal\"\n    4\n    *Main&gt; levenshtein  \"haskell\" \"raskell\"\n    1\n", "gilded": 0, "created_utc": "1209067496", "subreddit": "programming", "score": 3, "controversiality": 0}
{"body": "i n f l a t i o n", "gilded": 0, "created_utc": "1209089839", "subreddit": "business", "score": 1, "controversiality": 0}
{"body": "D aeolian: D E F G A Bb C\nD dorian: D E F G A B C", "gilded": 0, "created_utc": "1209141985", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "F R A M E R A T E", "gilded": 0, "created_utc": "1209227655", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "ROFLMAO!!\n\nWhat a noob.\n\nP A Y    A T T E N T I O N, McQuirk.\n\nI don't know how increased dangerous weather and flooding, millions of displaced people, etc, isn't a \"significant threat\".\n", "gilded": 0, "created_utc": "1209350983", "subreddit": "reddit.com", "score": -3, "controversiality": 0}
{"body": "Apparently this one just canceled all the accounts of the reddit users who took them up on their offer of a free lifetime account. \n\n\nSo much for early adopters driving a new tech/site. \n\nEdit: Now they just have an SQL error, how p r o f e s s i o n a l.", "gilded": 0, "created_utc": "1209448261", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Perhaps a surprising way to draw the Sierpinski gasket is to play the chaos game:\n\n1. Start at one of the corners.\n2. Move halfway to a random corner.\n3. Mark the new location.\n4. Go to step 2.\n\nImplementation below:\n\n    module Main where\n\n    -- derived from gtk2hs/demo/fastdraw\n\n    import Control.Monad\n    import Data.Array.MArray\n    import Data.Array.Base (unsafeWrite)\n    import Data.IORef\n    import Data.Word\n    import Graphics.UI.Gtk\n    import Random\n\n    width = 400\n    height = 400\n\n    main = do\n      initGUI\n      dia &lt;- dialogNew\n      contain &lt;- dialogGetUpper dia\n      canvas &lt;- drawingAreaNew\n      canvas `onSizeRequest` return (Requisition width height)\n\n      pb &lt;- pixbufNew ColorspaceRgb False 8 width height\n      pbData &lt;- (pixbufGetPixels pb :: IO (PixbufData Int Word8))\n      row &lt;- pixbufGetRowstride pb\n      chan &lt;- pixbufGetNChannels pb\n\n      let set (r,g,b) (x,y) = do\n            unsafeWrite pbData (x*chan+y*row) (fromIntegral r)\n            unsafeWrite pbData (1+x*chan+y*row) (fromIntegral g)\n            unsafeWrite pbData (2+x*chan+y*row) (fromIntegral b)\n            return ()\n          black = set (0,0,0)\n          white = set (255,255,255)\n          a = (200, 27)\n          b = (0, 373)\n          c = (width - 1, 373)\n          corners = [a, b, c]\n\n      doFromTo 0 (height - 1) $ \\y -&gt;\n        doFromTo 0 (width - 1) $ \\x -&gt; do\n          white (x,y)\n\n      forM_ corners black\n\n      posRef &lt;- newIORef a\n      let move = do\n            pos &lt;- readIORef posRef\n            pt &lt;- randomPoint\n            let m = midpoint pos pt\n            black m\n            writeIORef posRef m\n            widgetQueueDraw canvas\n            return True\n\n          randomPoint = do\n            idx &lt;- getStdRandom $ randomR (0, 2)\n            return $ corners !! idx\n\n      idleAdd move priorityLow\n      canvas `onExpose` updateCanvas canvas pb\n      boxPackStartDefaults contain canvas\n      widgetShow canvas\n      dialogRun dia\n      return ()\n\n    midpoint (a,b) (x,y) = (avg a x, avg b y)\n      -- round does banker's rounding\n      where avg s t = round $ (fromIntegral $ s + t) / 2.0 + 0.1\n\n    updateCanvas :: DrawingArea -&gt; Pixbuf -&gt; Event -&gt; IO Bool\n    updateCanvas canvas pb Expose { eventRegion = region } = do\n      win &lt;- widgetGetDrawWindow canvas\n      gc &lt;- gcNew win\n      width  &lt;- pixbufGetWidth pb\n      height &lt;- pixbufGetHeight pb\n      pbregion &lt;- regionRectangle (Rectangle 0 0 width height)\n      regionIntersect region pbregion\n      rects &lt;- regionGetRectangles region\n      (flip mapM_) rects $ \\(Rectangle x y w h) -&gt; do\n        drawPixbuf win gc pb x y x y w h RgbDitherNone 0 0\n      return True\n\n    {-# INLINE doFromTo #-}\n    -- do the action for [from..to], ie it's inclusive.\n    doFromTo :: Int -&gt; Int -&gt; (Int -&gt; IO ()) -&gt; IO ()\n    doFromTo from to action =\n      let loop n | n &gt; to   = return ()\n                 | otherwise = do action n\n                                  loop (n+1)\n        in loop from", "gilded": 0, "created_utc": "1209590150", "subreddit": "programming", "score": 6, "controversiality": 0}
