{"body": "This. Sometimes for some silly reason it can be labelled w x l x h. If it's about a product well I'm sure the dude can work out that the longer side of the toolbox is the length.", "gilded": 0, "created_utc": "1235867251", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Speaking of which, I just remembered a story! Back in middle school, there was this dude that picked on me. Not very often, but every chance he could get when even *some* attention was given to me by the teachers. \n\nAnyways, so one day we're sitting in zero-period - and him and I get into this verbal altercation. He jumps up, flips a desk around, and sits right in front of me saying \"WHAT THE FUCK IS YOUR PROBLEM?!\" all while his face being about an inch or so away from my face.\n\nWithout blinking, I grab my pen and start writing 'F U C K Y O ' on his cheek while laughing my ass off. He just sat there while I did it. I never did get a chance to finish the word 'YOU'.\n\nHe jumps up, and the teacher was like \"Is there a problem?\" and he was like \"dude just fucking drew on my face...\" and she's like \"... and you didn't have the brain to move your face away from his pen?\" \n\nThat's when the class burst out in laughter, and he went back to his seat scrubbing his face.\n\nAhh, good times.\n\nEdit: I got suspended for a few days for that stunt.", "gilded": 0, "created_utc": "1235900941", "subreddit": "reddit.com", "score": 14, "controversiality": 0}
{"body": "There is some basic universal science to it, and a lot of cultural and stylistic influence. Most of the rules in music are for the benefit of harmony, and many musical cultures don't have a strong concept of harmony. There are certain prescribed rules for melody, such as avoiding large leaps, but these are mostly a matter of taste and the underlying \"science\" is much less clear.\n\nConsonant chords, like C major, sound stable and restful because the frequencies of the notes are in low whole number ratios to each other, and the human ear perceives simpler ratios to be more consonant. For example, the most consonant interval is the octave, two notes separated by a frequency ratio of 2/1; a perfect fifth, the next most consonant, is at a ratio of 3/2; a fourth, 4/3, and so on.\n\nVibrating bodies (usually) produce harmonics above the so-called fundamental frequency, that occur at 2x, 3x, 4x, 5x that frequency and so on. The intervals used in Western music (and some other cultures) are based partly on ratios that occur naturally in the harmonic series. For example, if the harmonics are represented as\n\n1 2 3 4 5 6 7 8 9 ...\n\nthe ratios between successive harmonics are 2/1 (octave), 3/2 (P fifth), 4/3 (P fourth), 5/4 (Major third), 6/5 (Minor third). These are called \"pure\" intervals, low whole-number ratios that sound pleasing to the ear. (You may note that since the harmonic series represented this way is just the series of natural numbers, you could say that intervals in music are based on it, or you could say that they're just based on the mathematics of small whole-number ratios. It's really equivalent; what really matters is that our ear/brain can detect frequency differences with high accuracy, and that small whole-number ratios sound better.) And our fifth, fourth, major and minor third are close to and based on these ratios. But they're not exactly the same, and the other notes of the scale are even further from pure.\n\nThe reason for this may be difficult for some to grasp. If you take some note and add to it the interval of a perfect fifth, you multiply the frequency by 3/2. If you then add a perfect fourth, you multiply by 4/3. 1 * 3/2 * 4/3 = 12/6 = 2/1, which is an octave. Makes sense; anyone with basic music education knows that a perfect fifth plus a perfect fourth equals an octave. Note that to add two intervals together you multiply (not add!) their frequency ratios, due to the logarithmic way sound is perceived, and it is convenient to treat the \"root\" note as having a frequency of 1. (Really, 1 times some multiplier x which is that frequency.)\n\nSimilarly, if you take some note and add to it a major third, you take the frequency and multiply by 5/4. If you then add a minor third, you multiply again, by 6/5. 1 * 5/4 * 6/5 = 30/20 = 3/2, a perfect fifth. Again, this makes sense; musicians know that a minor third plus a major third equals a perfect fifth.\n\nSo far, so good. The trouble comes when you try to pick pure ratios for the other notes of the scale. If we say our root note is C, then the notes we've derived so far are C E F G C. To get D, A, and B, and all the chromatic notes, you have to do a little fudging. The next ratio to derive from the harmonic series, 7/6, sounds like a more contracted version of our earlier minor third (6/5) and not like a new note of the scale. Speaking logarithmically, all the notes of the scale should SOUND like they occur at regular intervals; that is, the scale should sound smooth. 8/7 sounds like a major second to a musician, but so does 9/8, and it is the latter that more closely approximates what we use today.\n\nPure ratios that are close to one another and thus, to Western ears, sound more like different versions of the same note than like different notes, are not the only issue; in Arabian, Indian, and other musical cultures all these different ratios may be represented and there may be up to 60 distinct notes in an octave. The key consideration for Western music is harmony. If you want to go up in a scale by a perfect fourth, then a minor third, you'd get 4/3 * 6/5 = 24/15 = 8/5, and a musician might say that this is a minor sixth: C to F, then F to Ab (A-flat). But you could also go up two major thirds, 5/4 * 5/4 = 25/16. A musician would call this G-sharp: C to E, E to G#.\n\nBut wait a minute! On a keyboard G# and Ab are the same note (they are called enharmonic), yet we've derived different ratios for them. No problem, they both sound good and are compositionally useful, so why not include them both on some fancy keyboard? In fact many early-Baroque-era keyboards did exactly that, with 16 or more notes per octave. But there an infinite number of ways to move around in a scale, to transpose up or down intervals, and depending on what you define as a third or a second or whatever you get wildly different ratios after multiplying everything out. After even a few simple transformations the ratios start getting really big and don't sound nearly as good anymore. Furthermore, as soon as you move to another key, even a closely related one, the relationships change and the pitches don't overlap.\n\nOne solution to all this mess is to compromise, to settle on a ratio that isn't perfectly pure, but simple enough that it still sounds consonant, and complex enough that it can be reached in different ways [of transposing to it], in different keys. This has some basic in mathematics, and a lot of it is stylistic considerations; early keyboard instruments were tuned to more pure intervals because vocals were considered (for religious reasons) more important, purity was valued more than utility, harmony was much less complex and modulation much less common.\n\nAs music developed into the Baroque age, tuning of keyboard instruments, or temperament, became more of an issue and the compromises more complex. More intervals that sounded good in more keys were needed. This led to the development of a wide array of tempering systems that emphasized different modalities of music, different keys and so on. There is a lot of evidence that Bach's famous \"well-tempered clavier\" was meant, not to show off the system of equal temperament (it didn't exist in practice) but rather to highlight the different cadences and harmonies that sounded best in each key under a particular temperament.\n\nWhich brings us to equal temperament, a relatively new invention that places each note of the 12-tone scale at exactly the correct spot, logarithmically speaking, so that they are all equally spaced. This has the benefit of making all modulations in all keys sound the same, and the drawback that certain intervals (especially the major third) suffer in purity.\n\nA lot of the cadences (resolutions of one chord into another) common in various periods of music are based on the transpositions effected in the tuning system of the time, i.e. what sounded good. And cadences sound good when the intervals expand or contract similarly, and resolve into a stable chord.\n\nThis is getting way too long, but for more information look into just intonation, temperament and tuning theory, and cadential forms.", "gilded": 0, "created_utc": "1235954024", "subreddit": "science", "score": 15, "controversiality": 0}
{"body": "I also think it's sad that people get their kicks this way on an ongoing basis. However, I think that everybody should indulge their curiousity once or twice. And you shouldn't punish people's natural human curiousity.\r\n\r\nNow, you must understand that laws only are viable when they are part of a social process which comes into play. Laws are the people's tool which they use to keep peace in their own communities. Governments can write all the laws they want to, but if the people disagree - or if when the \"crime\" happens, no one who sees or experiences the event feels that he has been wronged, then the law simply won't be used. It's impractical to the point of absurdity to make a law criminalizing drugs or criminalizing certain acts of consensual touch between two people. What your neighbors do in their living room is none of your business. Moralists have always sought to extrapolate - during prohibition in the usa, for example, they threw up their hands and said to themselves \"if we allow alcohol, we'll have social malady a b c d and e... in our society - and our whole society will suffer because of it.\"\r\n\r\nSocieties which heap more and more grievous punishments on things like this, will never ever succeed in stamping out what they see as being the problem. Instead, they make criminals out of ordinary citizens. And the social stigma ends up creating an atmosphere of trepidation in a neighborhood where people start mistrusting their neighbors. People involved in these kinds of activities get furtive, antisocial, tense... and it's not pretty for a community. If you care about the action not being done... if you are saddened by the course people's lives take who get really into recreational drugs... then you should act to help those people - you should not point your finger at them and call them \"bad people who need to be tossed into the penitentiary.\" The latter reaction simply does not make sense.\r\n\r\nLaw is not a magic tool you can pull out of your toolbox which works in every circumstance. If you don't want people to drug themselves up, you have to work to change the social consensus about drugs. For example, alcohol only maintains its role in society because it is part of a social ritual at the pub. If that social ritual were to go out of vogue or be replaced, then alcohol would cease being drunk. \r\n\r\nFurthermore, it's just a fascinating double standard that rich people can get pharmaceuticals to play with, and poor people are not allowed to use natural herbs to do the same thing. Such policies really show more about what the rich think of the poor than they do anything else. It's kind of like the scale of fines which are meted out for crimes; they are designed explicitly to be a burden to the poor, and to not be a problem at all for the rich. Indeed, I was assaulted one day on a construction site by a gentleman who was working there under the influence of a prescribed antidepressant. You cannot say that one kind of drug is evil and the other is good, simply because of social mores and customs. You have to think about these things logically.\r\n", "gilded": 0, "created_utc": "1236009952", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I can never hear aspergers without thinking of \n\nLetter A S P E R G E R S:\nwonder whether she’s so confident with alphabets\nthat she’d do it backwards skipping alternate letters.\nIf you offer demonstration, would she consider that clever?\nThis bitter endeavor: trying to predict a reaction.\nYou know you’re supposed to try to give the notion traction\nbut it don’t do nothing ‘cept make the clock tick.\nIt don’t even do that. Yo, you got Asperger’s, kid.", "gilded": 0, "created_utc": "1236048868", "subreddit": "pics", "score": -3, "controversiality": 0}
{"body": "What about:\n\na b b a a b b a\n\nfor Aladdin on the Sega? I just realized that it spells out ABBA ABBA which is kind of lulzy.", "gilded": 0, "created_utc": "1236065290", "subreddit": "reddit.com", "score": -8, "controversiality": 0}
{"body": "a b a c a b b \"Get over here!\"", "gilded": 0, "created_utc": "1236066184", "subreddit": "reddit.com", "score": 10, "controversiality": 0}
{"body": "A B A C A B B", "gilded": 0, "created_utc": "1236090102", "subreddit": "reddit.com", "score": 5, "controversiality": 0}
{"body": "D U L L A R D was the other one :)", "gilded": 0, "created_utc": "1236091459", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I thought the blood code was A B B A C A B - I remembered it as Abba-Cab.", "gilded": 0, "created_utc": "1236098110", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "he is **I N N O C E N T.**", "gilded": 0, "created_utc": "1236119797", "subreddit": "books", "score": -3, "controversiality": 0}
{"body": "B e r k e l e y.", "gilded": 0, "created_utc": "1236155166", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "S I C K E N I N G", "gilded": 0, "created_utc": "1236226735", "subreddit": "canada", "score": 1, "controversiality": 0}
{"body": "I don't care if Vince Li was found not criminally responsible because he has 'mental issues!'  He should be sent to prison for the rest of his life!  Yes, what he did is unimaginable...thus the reason he should be sitting in prison for the rest of his life!  Um, what don't people understand about that?  Hello, he cut off the head of a young man, ate part of him and put parts of the victim in his pocket...PRISON.  P R I S O N for the rest of his natural or unnatural life!  I don't see how people think it's 'OK' to send him to a mental hospital and if he 'gets better' let him out...that just amazes me...or better yet, scares the heck out of me.  Rest in peace Mr. McLean; I'm apologize there was no justice for you.  Sad, sad, sad...", "gilded": 0, "created_utc": "1236295542", "subreddit": "canada", "score": -3, "controversiality": 0}
{"body": "No, the idea is that when you're dealing with complex and life changing scientific issues you don't want to trust non peer reviewed anybodies from the internet.\nEverything about this article screams \"DO NOT TRUST\", like the fact that the only reference from the article is written by a woman with no background in science, (she was a former corrections officer and her only higher education is an ONLINE Bachelor degree in Business...) who uses emotive and ridiculous terms like 'frankenfood'. Anyone who uses this idiot of a woman as a source is obviously not acting under the rigorous standard required for scientific research.\n\nHere's a little nugget from Mrs. Frankenfood's website \n\"So, we have a huge global seed bank that contains seeds that the average Joe hasn’t a snowball’s chance in hell of gaining access to, and no privately-owned personal seed banks. And just who do you think will have access to the only remaining supply of unaltered seeds after this planned-for and orchestrated catastrophe? Your guess is as good as mine, but I’ll place my bet on the ruling elite after they exterminate 80% of the little people like you and me through a combination of complete control over food and water, as well as endless war.\n\nThe solution? If we allow this takeover to happen, and it is happening right before our eyes, then we need to be prepared to maintain a grassroots underground network of private food suppliers or succumb to whatever the ruling elite have planned for us. And just what is that plan? Let me spell it out: G E N O C I D E.\"\n", "gilded": 0, "created_utc": "1236519943", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "A A A A T T T A C K!!! Damn Huns.", "gilded": 0, "created_utc": "1236524092", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "testinG G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G\n\n G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G G", "gilded": 0, "created_utc": "1236571284", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "testing enter at end of line and\ntwice at end of paragraph G G G \nG G G G G G G G G G G G G G G G \nG G G G G G G G G G G G G G G G \nG G G G G G G G G G G G G G G G \nG G G G G G G G G G G G G G G G \nG G G G G G G G G G G G G G G G \nG G G G G G G G G G G G G G G G \nG G G G G G G G G G G G G G G G \nG G G G G G G G G G G G G G G G \nG G G G G G G G G G G G G G G G \n\nG G G G G G G G G G G G G G G G \nG G G G G G G G G G G G G G G G \nG G G G G G G G G G G G G G G G \nG G G GG G G G G G G G G G G G G\n G G G G G G G G G G G G G G G G\n G G G G G G G G G GG G G G G G", "gilded": 0, "created_utc": "1236571542", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "isn't it B A B A start?", "gilded": 0, "created_utc": "1236789769", "subreddit": "WTF", "score": 0, "controversiality": 0}
{"body": "R E A D A B O O-KAAYYY ", "gilded": 0, "created_utc": "1236804861", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "    C H A N G E -- W E   C A N  B E L E I V E   I N\n\nIraq: ALL TROOPS OUT (except 50,000)\n\nWar: RESTORE AMERICA'S IMAGE (let's invade afghanistan)\n\nWiretapping: END ILLEGAL SPYING (ahh...scratch that, lets keep it up)\n\nGaza: BE EVEN HANDED WITH THE PALS (continue to sell Israel weapons)\n\nGuantanamo: LET'S CLOSE IT (let's study if for a year first, oh our report says it exceeds all Geneva requirements)", "gilded": 0, "created_utc": "1236814916", "subreddit": "politics", "score": 9, "controversiality": 0}
{"body": " o o o o o [no x's just o's]...", "gilded": 0, "created_utc": "1236921959", "subreddit": "entertainment", "score": 2, "controversiality": 0}
{"body": "What is this 'we' shit.  I cringed every time someone upvoted an Obama article for the past year.\n\nThe guy is a P U P P E T.", "gilded": 0, "created_utc": "1236955721", "subreddit": "technology", "score": 2, "controversiality": 0}
{"body": "I've been listening to pi in A harmonic minor (A B C D E F G# A B C) for about 15 mins now... it's strangely addicting. I only wish that the flash didn't lag and cause random pauses.", "gilded": 0, "created_utc": "1236967751", "subreddit": "math", "score": 1, "controversiality": 0}
{"body": "Here is the behind the scenes transcript as it really happen:\n\nProsecutor: So Madoff, where's the money?\n\nMadoff: Most of it was returned to different investors....the old ones paid off the new ones...some went to various *expenses*\n\nProsecutor: I see. So you admit to running a ponzi scheme?\n\nMadoff: Of course, why do think I was bribing the SEC officials for so long....some of the money went there also by the way...haha\n\nProsecutor: Uhh...one second\n\n(Prosecutor and SEC officials confer)\n\nProsecutor: Would you be prepared to plead guilty?\n\nMadoff: Depends...can my wife keep some of the money?\n\n(Prosecutor and SEC officials confer)\n\nProsecutor: That would probably be acceptable. But you would also need to sign a confidentiality doc that you would never expose how many SEC officials you have bribed.\n\nMadoff: Done, lets do it.\n\n-----------------------------\n\n       H E A D L I N E\n           C N N \n\n    MADOFF PLEADS GUILTY!", "gilded": 0, "created_utc": "1237112892", "subreddit": "Economics", "score": 3, "controversiality": 0}
{"body": "Wussies.  It goes A B C D E F ALL GLORY TO THE COOKIE MONSTER", "gilded": 0, "created_utc": "1237279127", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "A B C D E F  ...\n\nC-C-C-C-COOKIE MONSTER!!!", "gilded": 0, "created_utc": "1237301630", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Yeah, what, like a guy in a a a a $5000 suit sh-sh-should have to s-s-s-signal his high status? COME ON", "gilded": 0, "created_utc": "1237333398", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "simply,  P E R F E C T ! There's a good point in all the greed of these motherfuckers, now Obama administration know how do deal with their lack of ethics and greed. In the future they will never release another stuff without closing all the doors.", "gilded": 0, "created_utc": "1237358745", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Okay, imagine a system involving N endpoints, where each endpoint initiates, let's say (on average) M messages per day.\n\nIn a push implementation, each endpoint basically creates M transactions (one for each message) per day.  So you get N x M transactions per day, where M is a constant.  So, O(N) transactions per day (linear).\n\nIn a pull implementation, each endpoint must poll *EVERY* other endpoint, some number of times per day, F.  So you end up intiating N x N x F transactions per day, where F is a constant.  So O(N^2) transactions per day (geometric).\n\nAlso, for what it's worth, polling frequency for most systems is generally much higher than the average message throughput, so it's not just a higher order of volume, but a higher constant factor, too!\n\n\nTo be more concrete: let's say, that you receive 100 emails per day, from about 300 different addresses (some addresses only send to you once a month, others a dozen times a day, etc).  In a push system, you get 100 data transactions per day (one per sent/received email).  In a pull system, you'd be checking for new mail, every, what: 30 minutes lets say?  And you'd have to check each of those potential 300 senders.  So you'd be doing 1500 transactions per day.\n\nOf course, you are not alone.  Everyone is doing these transactions.  So of your 300 friends, we'd have 300 people times 100 messages == 30,000 transactions in a push system, and 300 times 1500 == 450,000 transactions in a pull system.  \n\nNow let's say we doubled this system, so you could receive email from 600 different people, but still about the same volume of messages (most of those additional 300 people send you pretty infrequent messages, after all, your close friends and ssociates were in the first 300).  In a push system, you doubled the transactions to 60,000 per day (because you doubled the number of participants, after all, even though those 300 people send to you pretty infrequently, they still receive 100 messages per day from their closer friends).  In a pull system, though, you quadrupled the number of transactions to 1.8 million per day.  This is because you doubled the number of participants *and* you doubled the number of places that each participant has to poll for new messages.\n", "gilded": 0, "created_utc": "1237390036", "subreddit": "programming", "score": 2, "controversiality": 0}
{"body": "[I've added some more info over in the subreddit](http://www.reddit.com/r/whatsinthebox/comments/85mqt/whats_this_all_about_see_comments/c08ba0p)\n\nEdit: the subreddit got banned. My findings mirrored here for posterity.\n\n[Here is a version of the graphic with the levels tweaked.](http://imgur.com/SVIS.png)\n\nAs you can see it has the text A T T A I N A B L E N E S S hidden in the lower part of the graphic. Also the EXIF claims the graphic was made at 2007/03/12 15:19:54 using Photoshop CS for Windows. The RDF data Photoshop has hidden in it confirms that date too. Sounds pretty old but the domain was registered on 2006/07/13 so I guess it's not really.\nThe prose in the background of the image seems to be taken from a variety of different scientific texts. Probably just there to distract you. Although the parts in red (71-73% and 87%) might be clues. Variables for the equations perhaps? *Update: This line of text seems to be taken from [this paper](http://adsabs.harvard.edu/abs/1991Natur.353..737O) but with modified values.\n\nI think the 4 cube graphics within the main cube are representations of a hypercube rotating in 3-space?\nSeems like there might be an actual ARG going on here. I think we have markup to thank for all this nonsense :P\n\nI've watched the video a couple of times but other than the phone number 59462 (is this a sensible Dutch phone number?) and references to Higgs, Brout and Englert I've not been able to spot any other clues to move this puzzle on.\n\nI'm not sure the math goes anywhere yet, but I haven't been able to make use of ATTAINABLENESS or it's synonyms :(", "gilded": 0, "created_utc": "1237398760", "subreddit": "gaming", "score": 4, "controversiality": 0}
{"body": "Let me spell it out for you: \n\n**E T H N I C    -  C L E A N S I N G**  ", "gilded": 0, "created_utc": "1237509995", "subreddit": "worldnews", "score": 16, "controversiality": 0}
{"body": "**B E C A U S E  - T H E Y - C O S T - L E S S**", "gilded": 0, "created_utc": "1237538654", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "There will be blood!\r\n\r\nA B A C A B B", "gilded": 0, "created_utc": "1237572261", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "**H E L I C O P T E R - F A I L**", "gilded": 0, "created_utc": "1237598951", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "**l i n k b a i t**", "gilded": 0, "created_utc": "1237692234", "subreddit": "technology", "score": 16, "controversiality": 0}
{"body": "Q Q Q S S S... yatta, yatta. I remember this catchy tune from an old Flash animation.", "gilded": 0, "created_utc": "1237738711", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "successfully complete a group project for my communication works course.  5 member team an only two contributers.  it was a B I T C H, but we got it in under the deadline and, in my opinion, submitted the most thorough work.  that was about it for me.  who is attending the Life &amp; Times on the 28th?  Vavra &amp; I will be there with bells on!!!!!!!!!!!!!!!!  FUCK YES!  GOOD FIND DUDE!", "gilded": 0, "created_utc": "1237750456", "subreddit": "MapleLinks", "score": 2, "controversiality": 0}
{"body": "Well, RTSs, especially StarCraft, are basically 70% speed\\* so those kids who do nothing else with their lives have a huge advantage. They throw out their 1a 2a 3a 4a 5c c c c c c c1t2t3t5i (insert left click in place of each space) in five seconds (30 actions/5 seconds = 6 actions/sec = 360apm = professional). I can see how that, on top of all the rudeness can make it difficult to enjoy, but Wesnoth is all easy and relaxing in comparison.", "gilded": 0, "created_utc": "1237793736", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Just in case the link stops working:\n\n\n\niuguyg 2 points 53 minutes ago* [-]\n\nIf you really want to go back to pre-FDA days, you should read The Jungle to get a better idea of what unregulated companies were putting into the food supply. (Or just take a glance at China's milk problems)\n\n[T]he meat would be shoveled into carts, and the man who did the shoveling would not trouble to lift out a rat even when he saw one—there were things that went into the sausage in comparison with which a poisoned rat was a tidbit. There was no place for the men to wash their hands before they ate their dinner, and so they made a practice of washing them in the water that was to be ladled into the sausage. There were the butt-ends of smoked meat, and the scraps of corned beef, and all the odds and ends of the waste of the plants, that would be dumped into old barrels in the cellar and left there. Under the system of rigid economy which the packers enforced, there were some jobs that it only paid to do once in a long time, and among these was the cleaning out of the waste barrels. Every spring they did it; and in the barrels would be dirt and rust and old nails and stale water—and cartload after cartload of it would be taken up and dumped into the hoppers with fresh meat, and sent out to the public's breakfast.\n\nh t t p : / / y o u t u b e d d l . c o m ", "gilded": 0, "created_utc": "1237809724", "subreddit": "self", "score": 0, "controversiality": 0}
{"body": "S S S S S S S S S S S S. ", "gilded": 0, "created_utc": "1237844498", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "I'm a musician, and when teaching guitar to beginners who could never remember the names of the strings it is:\n\n\n*Every bad girl does absolutely everything*\n\nE B G D A E\n\nFeel free to use it, I made it up.", "gilded": 0, "created_utc": "1237901080", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "beating is w r o n g\n\nyet so American, nah ok keep the violence cycle.", "gilded": 0, "created_utc": "1237902697", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I liked the [H λ S K E L L one](http://haskell.org/logos/logos/HaskelmK.png), it looked more modern and professional.", "gilded": 0, "created_utc": "1237911389", "subreddit": "programming", "score": 14, "controversiality": 0}
{"body": "I don't find the lambda in the H λ S K E L L logo that obvious either, and I doubt it would have any meaning to somebody unfamiliar with language other than \"that's a weird looking A there\"", "gilded": 0, "created_utc": "1237987199", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "*F to the R to the E to the E to the C to the R to the E D I T Report to the Com. Come on everybody and sing along!*", "gilded": 0, "created_utc": "1238041672", "subreddit": "AskReddit", "score": 28, "controversiality": 0}
{"body": "Thats easy in this case, this was his daughter. d a u g h t e r. I hope I dont have a daughter, because if something like this happened to her trust me it would make international news. They would talk about it for 2..3 hundred years what I did.", "gilded": 0, "created_utc": "1238128196", "subreddit": "worldnews", "score": 0, "controversiality": 0}
{"body": "O C T O B E R   2 2 N D,   2 0 0 8.", "gilded": 0, "created_utc": "1238143443", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "d u m b a s s", "gilded": 0, "created_utc": "1238289935", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Kevin Warwick's main skill is that of being an excellent self-publicist, which he achieves by carrying out newsworthy experiments that get him writen about in magazines like W I R E D.\n\nHis lab is a fun place for geeks, full of Star Wars kit wired up with impressive LED eyes and voice synthesisers and shut like that. There's a big playpen full of stupid robotic turtles that exhibit comic emergent intelligence by running around chasing and running away from each other.\n\nWhen funding looks like getting tight Warwick will have a SCSI port surgically inserted into his neck and send off press releases about it.\n\nSmearing bit's of rats brains on circuit boards is a good one.\n\nThe world is more of a fun place for it!", "gilded": 0, "created_utc": "1238327150", "subreddit": "technology", "score": 25, "controversiality": 0}
{"body": "**P U P P E T S**", "gilded": 0, "created_utc": "1238418221", "subreddit": "funny", "score": -4, "controversiality": 0}
{"body": "If that is the case /r/jailbait is F U C K fucked", "gilded": 0, "created_utc": "1238509344", "subreddit": "worldnews", "score": 3, "controversiality": 0}
