{"body": "No, he's wrong on this. At least, I just checked the source code for the NT4 version (his is targetting XP's winmine, but they work the same), and the only bomb movement is done right at the start, if there happens to be a bomb where you click, it moves it to the first available space:\n\n    /****** S T E P  S Q U A R E ******/\n    \n    /* Step on a single square */\n    \n    VOID StepSquare(INT x, INT y)\n    {\n      if (fISBOMB(x,y))\n        {\n        if (cBoxVisit == 0)\n          {\n          INT xT, yT;\n          for (yT = 1; yT &lt; yBoxMac; yT++)\n            for (xT = 1; xT &lt; xBoxMac; xT++)\n              if (!fISBOMB(xT,yT))\n                {\n                IBLK(x,y) = (CHAR) iBlkBlankUp; /* Move bomb out of way */\n                SetBomb(xT, yT);\n                StepBox(x,y);\n                return;\n                }\n          }\n        else\n          {\n          ChangeBlk(x, y, MaskVisit | iBlkExplode);\n          GameOver(fLose);\n          }\n        }\n      else\n        {\n        StepBox(x,y);\n    \n        if (fCheckWin())\n          GameOver(fWin);\n        }\n    }\n\nThe only other occurrence of the SetBomb macro is at the start of the game, during initial random bomb placement:\n\n    cBombStart = Preferences.Mines;\n    \n    do\n      {\n      do\n        {\n        x = Rnd(xBoxMac) + 1;\n        y = Rnd(yBoxMac) + 1;\n        }\n      while ( fISBOMB(x,y) );\n    \n      SetBomb(x,y);\n      }\n    while(--cBombStart);\n\n", "gilded": 0, "created_utc": "1214909545", "subreddit": "programming", "score": 25, "controversiality": 0}
{"body": "F C H R I S T U I A C N B A K Y L E A ! E H\n\nHunt the visions with the closest weapon", "gilded": 0, "created_utc": "1214984492", "subreddit": "entertainment", "score": 1, "controversiality": 0}
{"body": "D E R A I L M E N T\nby snail is extreme", "gilded": 0, "created_utc": "1215097915", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "It's spelled c a n d e l a b r a.", "gilded": 0, "created_utc": "1215313957", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "I heard \"Surely you are joking ..\" last month in audio, from a library, and l o v e d it.  For *greatest*, for me it's [The Pleasure of Finding Things out](http://www.amazon.com/Pleasure-Finding-Things-Out-Richard/dp/0738203491), which incorporates the cited lecture as Chapter 6.  What a great lecture: \".. the imagination of nature is far, far greater than the imagination of man ..  matter with curiosity .. it is possible to live and not to know .. If we want to solve a problem we have never solved before, we must leave the door to the unknown ajar .. to teach how doubt is not to be feared but welcomed and discussed ...\"   This is as good as it gets.", "gilded": 0, "created_utc": "1215452497", "subreddit": "science", "score": 4, "controversiality": 0}
{"body": "Well, there's always Reddit.  And artichokes aplenty for E V E R Y O N E.", "gilded": 0, "created_utc": "1215481615", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "And before that it was spelled N E T S C A P E, but pronounced \"mozilla\".", "gilded": 0, "created_utc": "1215568628", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "That so-called \"quicksort\" is unusable because it **always requires O(n^2) space and time**. Here's [a usable quicksort in Haskell](http://augustss.blogspot.com/2007/08/quicksort-in-haskell-quicksort-is.html), due to Lennart Augustsson:\n\n    qsortM :: forall i a m r arr .\n             (MonadRef m r, Num i, Ix i, MArray arr a m, Ord a Bool) =&gt;\n             arr i a -&gt; m (arr i a)\n    qsortM ma = runE $ do\n        (lb, ub) &lt;- embed $ getBounds ma\n        let mlb = pure0 lb\n            mub = pure0 ub\n        a &lt;- liftArray ma\n     \n        let qsort' l r =\n                if1 (r &gt; l) $ do\n                    i &lt;- auto l\n                    j &lt;- auto (r+1)\n                    let v = a[l] :: E m a\n                        iLTj = i &lt; (j :: E m i)\n                    while iLTj $ do\n                        while ((i += 1) &lt; mub &amp;&amp; a[i] &lt; v)\n                            skip\n                        while (a[j -= 1] &gt; v)\n                            skip\n                        if1 iLTj $ do\n                            a[i] =:= a[j]\n                    a[l] =:= a[j]\n                    qsort' l (j-1)\n                    qsort' i r\n     \n        qsort' mlb mub\n        return ma\n\n", "gilded": 0, "created_utc": "1215782424", "subreddit": "programming", "score": 7, "controversiality": 0}
{"body": "R S T L N E", "gilded": 0, "created_utc": "1215810050", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Beautiful car nonetheless.  I actually saw one parked on the street here in San Francisco (Russian Hill) last night walking home.  I thought it was a Lotus Elise at first, but the badge in the front looked odd, and when I walked past I looked at the back and saw T E S L A across it.  Very nice looking car.  Obviously not for the masses, but a step in the right direction and a beautiful piece of machinery.", "gilded": 0, "created_utc": "1215974400", "subreddit": "technology", "score": 8, "controversiality": 0}
{"body": "W H O   C A R E S  ? ? ?", "gilded": 0, "created_utc": "1216136413", "subreddit": "reddit.com", "score": -5, "controversiality": 0}
{"body": "We have N E V E R had free markets. We have A L W A Y S had markets regulated in such a manner to give free REIGN to the existing players and to LOCK OUT new competitors. That is NOT a free market, that is a government supported oligopoly. Learn what a free market is before you say they have failed. ", "gilded": 0, "created_utc": "1216141679", "subreddit": "economy", "score": 2, "controversiality": 0}
{"body": "W H O R E S", "gilded": 0, "created_utc": "1216144349", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "&lt;h1&gt;E N H A N C E&lt;/h1&gt;", "gilded": 0, "created_utc": "1216344455", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Yawn yawn yawn. You can neglect the F A C T S all you like, but at the end of the day, all you're doing is speaking shit.  The USSR was not Socialist. It claimed to be Socialist, but it was anything but Socialist. The USSR, did it come out by the working class? No. Did it remove the capitalist state and strip power from the Bourgeois? No. All Stalinist Russia did, was remove all power from everyone, and hand it to its state. Then, with the \"progressive\"/petty bourgeois on its side, it force the people back into subservience as many were peasants that could be forced to work. I honestly can't be bothered going into the vast details of how and why Stalinist Russia came about for you, it really would not be worth it.\n\nThe Communist Manifesto gives a very specific method to Socialism. Criteria that must be met in order to create socialism, such as the emancipation of the working class, by the working class, and then having the working class run society themselves, forming a temporary worker's state to fend of capitalist states and so forth. It was always about the proletariat taking power back from their oppressors. It was never about dictatorship, or oppression, or allowing the exploitation of the masses. The birth of international socialism came from Lenin, as he wrote about the failure of the Russian Worker's Revolution (which occured prior to Stalin's rise to power). It was realized quickly, that revolution could not succeed in one place. It had to spread, as the interests of the capitalist regime sought to destroy their competitors, and also because resources in one place could not maintain themselves for too long, if cut off from the rest of the world. The russian revolution failed because the industry and resources were not built up enough for it to sustain its people. It became necessary for Socialism to spread, and at the time, it rested on Germany's shoulders. With the failure of the German Revolution, there was little hope for Socialism to spread beyond Russia at the time. Thus, in the shambles created by the lack of industry, Stalin rose to power, with Capitalists backing him for fear of being squashed by other capitalists.\n\nThere is no socialism to stalinist russia. There was power in the hands of a State-Capitalist State (called so because the state did not serve the capitalist, rather the state served itself), with a single dictator, dictating who would do what and on what terms, violently oppressing and forcing workers back into the grip of capitalism, with a new name.\n\nHonestly. You keep arguing stupid points like \"Your Utopian bla bla with no problems not valid\" bullshit, because you must be trying to get me to try and counter my own argument by making it exist under Capitalism, just for your personal benefit or something. But that isn't going to happen. The realities as you know them, capitalist realities, are barely reality in themselves as they are built of false-economy, reliant on hype and speculation, and serve the interests of an elite minority. These bogus realities your so fond of, are irrelevant. When workers unite, and workers revolt, and make no mistake it is not a question of \"if\" but \"when,\" and if they unify successfully, spread and take their power back by force, all of those petty, ignorant, segregated, contradictory realities will disappear.\n\nNow finally, I'm going to throw this last thing at you, so that I can end this with a mild anti-climax.\n\nYou are not someone I need to convince of these politics. You, by default, as a capitalist supporter, do not have invested interests in human need, or the masses of the world. Your interests are selfish, and are reliant on the exploitation and oppression of others to gain capital, and status. Your interests require competitive market, otherwise you become obsolete. You are a capitalist, who exists in the working class, and has been so brutally raped by the Capitalist hierarchy that you are reverent of it. You are a minority, a minority which will be defeated in the end. We have the numbers, we have the incentive, and we are by and large, good people. Convincing the few minor people, with no concept of socialism, or a reluctance to listen to what socialism actually is, is not on our agenda. You, Mr Libertarian, are irrelevant.\n\nAlright, that's enough. I wont be replying again.", "gilded": 0, "created_utc": "1216872330", "subreddit": "socialism", "score": 6, "controversiality": 0}
{"body": "When I clicked on \"subscribe\" my desktop turn to bright light and flashing letters composed the word S A L V A T I O N ", "gilded": 0, "created_utc": "1217094301", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "http://elsiehabicht.livejournal.com    P E A K I N G        T u r n  O n    T i m e  Don't Resist The Peak Some people can't understand why you would want to back off from something that's feeling good. We've answered that question extensively, haven't \n", "gilded": 0, "created_utc": "1217248022", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "D A I Y E day.", "gilded": 0, "created_utc": "1217297402", "subreddit": "funny", "score": 11, "controversiality": 0}
{"body": "Frankly that has always been a dumb canard. There is no way you having or not having a gun would make a viable difference to 'tyranny'.\n\nWhen they come for you in the night, all a gun does is ensure you are a corpse, rather than in a camp.\n\nTyranny is averted by having an alert, intelligent, engaged electorate - will to stand up and say no. As it is what you have is a disinterested electorate that stands up and says \"hell yea! U S A U S A\" before grunting like a monkey and switching channels.", "gilded": 0, "created_utc": "1217321665", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Most of my favorites have already been mentioned, but here they are in no particular order:\r\n\r\n* All Mario Bros\r\n* Battletoads\r\n* Duck Hunt (The light gun was just too much fun)\r\n* Metroid\r\n* Zelda II The adventure of Link\r\n* Contra ( U U D D L R L R B A SEL START)\r\n* Tecmo Super Bowl\r\n* Bill and Ted's excellent adventure (Strange but fun)\r\n\r\nEdit: I almost forgot a few more rather obscure ones!\r\n* Tiny Toon Adventures: Cartoon Workshop. You could make your own cartoon complete with cartoon destruction! It was crazy fun. \r\n* Arch Rivals: Basket Brawl. I loved just running around punching the other players. ", "gilded": 0, "created_utc": "1217344099", "subreddit": "gaming", "score": 2, "controversiality": 0}
