{"body": "You asked for it...\n\nThe Master Cleanse, also known as the Lemon Cleanse and the Maple Syrup Diet, was created by Stanley Burroughs in 1941 and later popularized by Peter Glickman in his book Lose Weight, Have More Energy and Be Happier in 10 Days. 2005. .[1] Burroughs states that it is a detoxification program that aids in the removal of harmful toxins from within the body, as well as a reducing diet for loss of weight,[2] and a cure for ulcers[2] and \"every kind of disease,\"[2] resulting in \"the correction of all disorders.\"[2]\n\nThe Master Cleanse claims to be a way to cleanse the body of toxins and remove the cravings associated with drugs, alcohol, tobacco, and eating junk food. \"Coffee, tea, and various cola drinks, as habit-forming beverages, also lose their appeal through the marvels of the lemonade diet.\"[2] The cleanse involves drinking only lemonade made from fresh lemon or lime juice, Grade B maple syrup, water and Cayenne pepper. No solid food is eaten for the entire cleanse. The master cleanse is technically not a \"fast\" and proponents say it is more gentle on the body because it does contain some essential vitamins and minerals. According to proponents it is recommended to be on the cleanse for a minimum of ten days, but some people stay on the cleanse for longer periods of time, even as long as 45 days.[3]\n\nSince there is no intake of solid food, special precautions are taken to avoid constipation. Senna tea is taken every night, and in the morning warm saline is required. This passes through the digestive system extremely quickly, usually causing defecation in 30-60 minutes. It is essential to go off of the cleanse slowly. The lack of solid foods for such long periods, requires careful breaking, as gut flora need to re-develop and mucus linings re-build. This usually involves drinking \"full strength\" juices for a day or two, while slowly adding in soups, then fruit, vegetables and nuts before resuming a regular diet.[2][3] Some individuals have returned to their healthy diet the following day after stopping the program without any problems, but this is rare and not recommended, especially for first timers.[citation needed]\n\n[edit] Health claims\n\nStanley Burroughs and other authors say that The Master Cleanse will eliminate toxins (pesticides, hormones, prescription drugs, chemical fertilizers, heavy metals) and congestion that have built up in the body.[2] For people in perfect health, the body is designed to eliminate normal everyday toxins from itself through the lungs, kidneys, liver, and other eliminator organs.[4] Supporters of the Master Cleanse have credited it with helping them lose weight, increase energy, and even alleviate some chronic diseases and increase sexual stamina[3] but there is no empirical peer-reviewed evidence that it achieves anything other than weight loss. Some people who sell the products for the diet are also doctors, and say that they've seen positive health effects such as the disappearance of acne, clearer vision, increased energy, the disappearance of dark circles around eyes.\n\nNutritionist Jane Clark points to a lack of essential nutrients in this program, citing a deficiency of protein, vitamins, and minerals in the regimen[5] although dietary deficiencies in protein may not lead to the individual showing signs of protein deficiency if it is followed only for a short time. As a result of these deficiencies, including far fewer calories than the recommended amount for health and optimum functioning, individuals on the diet may experience headaches and a variety of other symptoms in the short term.[5] Dr. Joel Fuhrman relates these effects to detoxification, which he says passes after the toxins are eliminated.[6] Many authors assert the benefits of fasting are related to its lack of nutrients, particularly macronutrients.[6][7][8][9] It could be dangerous if followed in the long term.[5]\n\nClark also believes that the saltwater \"flush\" may remove both harmful and beneficial bacteria from the body[5]. A no-food diet may cause the gut to stop passing food, resulting in constipation, or may make the consumption of food immediately after the cleanse painful. People with intestinal conditions such as irritable bowel syndrome may experience discomfort while on the cleanse. Some people who have followed the cleanse feel that a 14-day regimen of the program will eliminate that condition altogether; however, this may be a manifestation of the placebo effect, as there is no peer reviewed scientific evidence of this possible outcome.\n\n[edit] Used for weight loss\n\nMany proponents of the cleanse do not recommend it solely for weight loss, instead mentioning its detoxifying properties; although, as with detox diets, there is no peer-reviewed scientific evidence of any positive effect from detox.[3] Dr. Sunil Patel of Halifax's QEII Health Sciences Centre has suggested that the cleanse operates as a placebo and has no other health benefits.[10] When following the Master Cleanse, people will certainly lose weight.[11] Some people in the entertainment industry have used this fast for rapid weight loss, leading members of the public to follow their example and use what has been described as an extreme fad diet[12] as a crash diet. In 2006, the cleanse received media attention as a result of being embraced by some celebrities. The singer/actress Beyoncé did it for 14 days and lost 22 lb (9 kg) for her role in the 2006 movie Dreamgirls.[10] Other celebrities include rapper Trina who did this liquid diet for 13 days and Howard Stern's cohost Robin Quivers claims to have lost 73 lb using the Master Cleanse. Similarly, Jared Leto says he lost the weight he gained to play 'Mark David Chapman' (he gained 62 lb) all from the master cleanse.[13] Medical authorities say that those who try the Master Cleanse to lose weight will gain it back in time.[12] Beyoncé denounced using the cleanse as a weight-loss program, stating, \"I wouldn't recommend it if someone wasn't doing a movie ... there are other ways to lose weight.\"[10] The Master Cleanse is not recommended by most mainstream doctors,[14] who don't recommend detox diets, considering them unnecessary and potentially dangerous.[4]\n\nReferences\n\n   1. ^ \"The Lemonade Diet\". Retrieved on 27 May 2008. \n   2. ^ a b c d e f g Burroughs, Stanley (1976). The Master Cleanser. Burroughs Books. pp. 16–22,25. ISBN 0963926209. \n   3. ^ a b c d Glickman, Peter (2005). Lose Weight, Have More Energy &amp; Be Happier in 10 Days. Peter Glickman, Inc.. ISBN 0975572229. \n   4. ^ a b MacGregor, Hilary. \"Detoxing: In pursuit of a body that’s pure\". projo.com. The Providence Journal Co. Retrieved on 2008-04-27.\n   5. ^ a b c d Clarke, Jane (2006-01-24). \"The nutritionist's view:Lemon aid\", The Times (London UK), pp. 4. Retrieved on 30 January 2008. \n   6. ^ a b Fuhrman, Joel (1998). Fasting &amp; Eating for Health: A Medical Doctor's Program for Conquering Disease. St. Martin's Griffin. p. 221. ISBN 0-312-18719-X. \n   7. ^ Cousens, Gabriel (2005). Conscious Eating. North Atlantic Books. ISBN 1556432852. \n   8. ^ Anderson, Richard (1998). Cleanse and Purify Thyself, Book 1.5. Triumph Business. ISBN 1880170035. \n   9. ^ Bragg, Paul (2004). The Miracle of Fasting. Health Science. ISBN 0877900396. \n  10. ^ a b c Patriquin, Martin (2006-08-11). \"Star loses 22 lb. on maple syrup diet!\", Maclean's, Rogers Publishing Limited. Retrieved on 27 April 2008. \n  11. ^ \"Modified Detox Diets Can Help With Weight Loss\", cbs4.com, CBS Broadcasting Inc (2008-04-23). Retrieved on 27 April 2008. \n  12. ^ a b Associated Press (2007-05-02). \"Celebrities boost lemon detox fad, but it may not be good for your health\", The International Herald Tribune. Retrieved on 27 April 2008. \n  13. ^ \"Jared Leto\". imdb.com. Retrieved on 2008-04-27.\n  14. ^ Allday, Erin (2006-09-13). \"Extreme Dieting\", San Francisco Chronicle, Hearst Communications Inc. Retrieved on 27 April 2008. \n\nRetrieved from \"http://en.wikipedia.org/wiki/Master_Cleanse\"", "gilded": 0, "created_utc": "1229602084", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Hats don't turn people into douchebags.\n\nDeacon:  Are you wearing a smug look too?  If not, you should be.  The power of your intellect is s T u N n I n G!", "gilded": 0, "created_utc": "1229630814", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "f a n t a s t i c  idea.", "gilded": 0, "created_utc": "1229668782", "subreddit": "programming", "score": 4, "controversiality": 0}
{"body": "first time he is doingn the right thing, except im sure somewhere deep in there someone still gets away with millions. A bailout for the big 3 is rediculous. They have had bailouts in the past that went by different names. NOW they want another one when the economy is in the shits. NO! they do not deserve it and the people that work for them are over paid. Doesnt matter what the industry and what the product, except in this case it isnt a GOOD product and it isnt an industry that will halt america in its progress. IT WILL let others take the big3 place, it was inevitable with the way the BIG 3 were doing business, American cars should have always been $10,000 - $20,000 thousand dollars LESS than any import car. BUT THE BIG 3 WANTED THE KIND OF REVENUE THAT WOULD AFFORD THEM LUXURY YACHTS AND PRIVATE PLANES. ALL LIES AND DECIETS COME BACK IN THE END, WHAT GOES AROUND COMES AROUND, AND ITS TIME THAT THE BIG 3 GOT WHAT THEY HAVE BEEN DISHING OUT. \n\nN O T H I N G", "gilded": 0, "created_utc": "1229706552", "subreddit": "business", "score": -1, "controversiality": 0}
{"body": "a gift certificate to American Apparrel. everybody loves hoodies, you will be the C O O L E S T aunt/uncle/grampa/friend whatever. ", "gilded": 0, "created_utc": "1229722755", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "R e v o l t i n g.\r\n\r\nI don't want my computers to be made from your old socks", "gilded": 0, "created_utc": "1229791438", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "* g o a t s e x * g o a t s e x * g o a t s e x *\ng                                               g\no /     \\             \\            /    \\       o\na|       |             \\          |      |      a\nt|       `.             |         |       :     t\ns`        |             |        \\|       |     s\ne \\       | /       /  \\\\\\   --__ \\\\       :    e\nx  \\      \\/   _--~~          ~--__| \\     |    x\n*   \\      \\_-~                    ~-_\\    |    *\ng    \\_     \\        _.--------.______\\|   |    g\no      \\     \\______// _ ___ _ (_(__&gt; \\   |     o\na       \\   .  C ___)  _______ (_(____&gt; |  /    a\nt       /\\ |   C ____)/       \\ (_____&gt; |_/     t\ns      / /\\|   C_____)|HELP ME|  (___&gt; /  \\     s\ne     |   (   _C_____)\\_______/  // _/ /     \\  e\nx     |    \\  |__   \\\\_________// (__/       |  x\n*    | \\    \\____)   `----   --'             |  *\ng    |  \\_          ___\\       /_          _/ | g\no   |              /    |     |  \\            | o\na   |             |    /       \\  \\           | a\nt   |          / /    |         |  \\           |t\ns   |         / /      \\__/\\___/    |          |s\ne  |         / /        |    |       |         |e\nx  |          |         |    |       |         |x\n* g o a t s e x * g o a t s e x * g o a t e x *  \n", "gilded": 0, "created_utc": "1229795350", "subreddit": "lol", "score": 1, "controversiality": 0}
{"body": "&gt; * g o a t s e x * g o a t s e x * g o a t s e x *\n&gt; g                                               g\no /     \\             \\            /    \\       o\na|       |             \\          |      |      a\nt|       `.             |         |       :     t\ns`        |             |        \\|       |     s\ne \\       | /       /  \\\\\\   --__ \\\\       :    e\nx  \\      \\/   _--~~          ~--__| \\     |    x\n*   \\      \\_-~                    ~-_\\    |    *\ng    \\_     \\        _.--------.______\\|   |    g\no      \\     \\______// _ ___ _ (_(__&gt; \\   |     o\na       \\   .  C ___)  _______ (_(____&gt; |  /    a\nt       /\\ |   C ____)/       \\ (_____&gt; |_/     t\ns      / /\\|   C_____)|HELP ME|  (___&gt; /  \\     s\ne     |   (   _C_____)\\_______/  // _/ /     \\  e\nx     |    \\  |__   \\\\_________// (__/       |  x\n*    | \\    \\____)   `----   --'             |  *\ng    |  \\_          ___\\       /_          _/ | g\no   |              /    |     |  \\            | o\na   |             |    /       \\  \\           | a\nt   |          / /    |         |  \\           |t\ns   |         / /      \\__/\\___/    |          |s\ne  |         / /        |    |       |         |e\nx  |          |         |    |       |         |x\n* g o a t s e x * g o a t s e x * g o a t e x *  \n", "gilded": 0, "created_utc": "1229795366", "subreddit": "lol", "score": 1, "controversiality": 0}
{"body": "@ g o a t s e x @ g o a t s e x @ g o a t s e x @\n\ng                                               g\no /     \\             \\            /    \\       o\na|       |             \\          |      |      a\nt|       `.             |         |       :     t\ns`        |             |        \\|       |     s\ne \\       | /       /  \\\\\\   --__ \\\\       :    e\nx  \\      \\/   _--~~          ~--__| \\     |    x\n@   \\      \\_-~                    ~-_\\    |    @\ng    \\_     \\        _.--------.______\\|   |    g\no      \\     \\______// _ ___ _ (_(__&gt; \\   |     o\na       \\   .  C ___)  _______ (_(____&gt; |  /    a\nt       /\\ |   C ____)/       \\ (_____&gt; |_/     t\ns      / /\\|   C_____)|HELP ME|  (___&gt; /  \\     s\ne     |   (   _C_____)\\_______/  // _/ /     \\  e\nx     |    \\  |__   \\\\_________// (__/       |  x\n*    | \\    \\____)   `----   --'             |  *\ng    |  \\_          ___\\       /_          _/ | g\no   |              /    |     |  \\            | o\na   |             |    /       \\  \\           | a\nt   |          / /    |         |  \\           |t\ns   |         / /      \\__/\\___/    |          |s\ne  |         / /        |    |       |         |e\nx  |          |         |    |       |         |x\n@ g o a t s e x @ g o a t s e x @ g o a t e x @  \n", "gilded": 0, "created_utc": "1229795454", "subreddit": "lol", "score": 1, "controversiality": 0}
{"body": "@ g o a t s e x @ g o a t s e x @ g o a t s e x @\n\ng                                               g\n\no /     \\             \\            /    \\       o\n\na|       |             \\          |      |      a\n\nt|       `.             |         |       :     t\n\ns`        |             |        \\|       |     s\n\ne \\       | /       /  \\\\\\   --__ \\\\       :    e\n\nx  \\      \\/   _--~~          ~--__| \\     |    x\n\n@   \\      \\_-~                    ~-_\\    |    @\n\ng    \\_     \\        _.--------.______\\|   |    g\n\no      \\     \\______// _ ___ _ (_(__&gt; \\   |     o\n\na       \\   .  C ___)  _______ (_(____&gt; |  /    a\n\nt       /\\ |   C ____)/       \\ (_____&gt; |_/     t\n\ns      / /\\|   C_____)|HELP ME|  (___&gt; /  \\     s\n\ne     |   (   _C_____)\\_______/  // _/ /     \\  e\n\nx     |    \\  |__   \\\\_________// (__/       |  x\n\n@    | \\    \\____)   `----   --'             |  @\n\ng    |  \\_          ___\\       /_          _/ | g\n\no   |              /    |     |  \\            | o\n\na   |             |    /       \\  \\           | a\n\nt   |          / /    |         |  \\           |t\n\ns   |         / /      \\__/\\___/    |          |s\n\ne  |         / /        |    |       |         |e\n\nx  |          |         |    |       |         |x\n\n@ g o a t s e x @ g o a t s e x @ g o a t e x @  \n", "gilded": 0, "created_utc": "1229795499", "subreddit": "lol", "score": 1, "controversiality": 0}
{"body": "Fuck, you are stupid.  So -- everyone is wrong but you and some extreme evangelical vein of your homophobic and hateful group?  One is truly stupid when they can be shown a million times and still dig in their heels for no good reasons.\n\nIt must feel good to think you are  one of the only ones right, even when you demonstrate how wrong your logic and reason are.\n\nD E L U S I O N", "gilded": 0, "created_utc": "1229797227", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Thank you... I'm pretty passionate about this kind of music. This was a live recording, at a penthouse lounge, so I had to go back and figure out what i was playing... Here is the tracklist. I suggest you look into all the artists listed, they have lots more excellent tracks. -Enjoy! \n\n1. Just An Engine -ULA  ..Citadel Records  http://www.robotula.com/\n\n2. No More Anymore -Matthew Adams  ...Toes in the sand    http://www.toesinthesandrecordings.com/\n\n3. Fast Freeze -MyMy  ..Cocoon Recordings   http://www.myspace.com/justmymy\n\n4. Pluce  -Sean Palm  ...Railyard recordings http://www.railyardrecordings.com/SeanPalm.html\n\n5. Secret Liquid  -Château Flight    ...Versatile   http://www.versatilerecords.com/vr/menu.htm \n\n6. Lost  -Mlle Caro &amp; Frank Garcia       ..B u Z z I n ' f L y R e c O r D s     http://buzzinfly.com\n\n\n7. Remind Me -Royksopp  ...Wall of Sound  http://www.wallofsound.net/\n\n8. Rituel  -Château Flight    -Versatile   http://www.versatilerecords.com/vr/menu.htm\n\n9. Get Raw  -Dirt Crew     Dirt Crew         http://www.dirtcrew.net\n\n10.Lament for a dead computer  Furry Phreaks ( Charles Webster )           -Miso Records   http://www.misorecords.com/\n\n\n11. Geche -Moonface   -platipus   http://www.platipus.com/\n\n\n12. Miss You- TRENTEMØLLER     poker flat recordings   http://www.pokerflat-recordings.com\n\n", "gilded": 0, "created_utc": "1229825037", "subreddit": "WeAreTheMusicMakers", "score": 1, "controversiality": 0}
{"body": "My password is O I C U 8 1 2.....but don't tell any bad people, ok?", "gilded": 0, "created_utc": "1229838772", "subreddit": "self", "score": 9, "controversiality": 0}
{"body": "**E X A C T L Y**", "gilded": 0, "created_utc": "1229839465", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "G G G G G G G Ganja breaker!", "gilded": 0, "created_utc": "1229858596", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "o i c w y d t", "gilded": 0, "created_utc": "1229928437", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "You realize, of course, that most people are completely rational, except for the irrational data they use as a starting point?\n\nedit:\n\nsince there are some down mods, lets try to illustrate this idea, which is not particularly intuitive.\n\nIf you believe something is a threat to life and limb, it is rational to attack it, even if the object of fear is irrational, like a marshmellow (ghost busters reference noted)\n\nGiven Data X, you calculate Y.\n\nIf Data X is wrong, then calculating Y produces a incorrect result.\n\nIn Atheist circles, examples of a wrong Data X include belief in the big Sky Daddy, The Bible, etc.\n\nIf you accept these as the founding data of your logic you can then arrive at results that are utterly irrational if you do not have these as foundational data.\n\nNow, you can abstract this to data in general, and note the logic based whatever the foundational data happen to be.\n\nIn this context, most people are completely rational, except for the irrational data they use as a starting point.\n\nEven the wildly crazy often have very elaborate chains of logic of which you only see a part.\n\nin a logic chain going from A to Z, you might only see \n\nd k m q r x\n\nwhich are part of the A to Z sequence, and are not very rational in the context seeing that data alone.", "gilded": 0, "created_utc": "1229982773", "subreddit": "atheism", "score": -8, "controversiality": 0}
{"body": "She's un-be-f u c k i n g-lievable", "gilded": 0, "created_utc": "1230082126", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "ENGLISH? NO CHECK!\n\nS T U P I D !", "gilded": 0, "created_utc": "1230096075", "subreddit": "entertainment", "score": -8, "controversiality": 0}
{"body": "C D B  D B S A B Z B. ", "gilded": 0, "created_utc": "1230123771", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "But will I be able to scramble its database by whacking it a few too many times (like the one I used to have)?:\n\nSnS: Now spell: \"Erkngwhkfzgnkil\".\n\nMe:[A] [P] [P] [L] [E] [Enter]\n\nSnS: Incorrect. Please try again.\n\nMe:[M] [O] [N] [K] [E] [Y] [Enter]\n\nSnS: Incorrect. Please try again.\n\nMe:[S] [T] [U] [P] [I] [D] [Enter]\n\nSnS: Incorrect. The correct spelling of \"Erkngwhkfzgnkil\" is: S A U C E R.", "gilded": 0, "created_utc": "1230126218", "subreddit": "technology", "score": 12, "controversiality": 0}
{"body": "I think that's the joke the author is after.\n\n    INT TRENDY CAFE\n\n    PERSON 1: Hey, PERSON 2, I just found the best backup app ever! It's called GAEBAR!\n    PERSON 2: You *backup* by going to a gay bar?\n    PERSON 1: No, it's called G A E B A R. \n    PERSON 2: It's okay to come out. I've always known.\n    PERSON 1: ...", "gilded": 0, "created_utc": "1230198077", "subreddit": "Python", "score": 5, "controversiality": 0}
{"body": "It's spelled S N I P I N G\nnot S N I P P I N G.\n\nYou go sniping in CS:S. You go snipping if you're a mutilating jew.", "gilded": 0, "created_utc": "1230237108", "subreddit": "gaming", "score": -7, "controversiality": 0}
{"body": "T H A N K Y O U.\n\nAlthough I have to add for the HK side, dim-sum, Japanese goods, middle-class shopping districts, and Disneyland.\n\nBut to be a No.1 city, there has to be so much more.\n\nBroadway, Time Square, Central Park, the wealth of the world, stock markets, etc.\n\nNew York is still way and above beyond Hong Kong, even though I love HK very much.", "gilded": 0, "created_utc": "1230258422", "subreddit": "technology", "score": 3, "controversiality": 0}
{"body": "**E M P I R E**", "gilded": 0, "created_utc": "1230315909", "subreddit": "worldpolitics", "score": 1, "controversiality": 0}
{"body": "Comments\n529\nPending Comments\n672\n\nCheck out some of the comments on this story presented by Huffpo\n\n\"\nW H Y\n\nP O S T\n\nI N F L A M I T O R Y\n\nA R T I C L E S\n\nI F Y O U A R E G O I N G T O\n\nC E N S O R\n\nA L L T H E C O M M E N T S\n\nH E H...\n\"\nMy censored reply comment\n\n\"This comment is pending approval and won't be displayed until it is approved.\n\nThere's Glenn Greenwald on Salon http://www.salon.com/opinion/greenwald\nhttp://democracynow.org is really good\nhttp://therealnews.com is great and they have a channel on Youtube.\n\nThese other sites don't filter the news as much as Huffpo does.\n\"\n\n\n\n", "gilded": 0, "created_utc": "1230400044", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "It's a slang word I think...\n\nIf you are talking (writing) to another smoker, spell it any of these ways, they will get it. To a non smoker spell it P O L L E N if you want them to understand what you're talking about.  \n\nPo-9 thought my friends keef was a bottle of dope.... dumb fuckers.", "gilded": 0, "created_utc": "1230404231", "subreddit": "Marijuana", "score": 1, "controversiality": 0}
{"body": "I'm sure this question has been asked here before, but I couldn't find it.\n\nI am a mediocre guitar player. I started to learn a little from a friend back in 2000, when I was 19. The main things he showed me was chords like E A D G C and F, nothing fancy. He ended up passing away, and I always wanted to learn more, in like a memory to him.\n\nI started going to a guitar instructor in 2001, only had about 5 lessons with him, and got in trouble doing something unrelated, and had to move away for awhile. \n\nI still had a guitar, and would practice a little on my own, and probably teaching myself bad habits with the guitar, like the wrong finger placement and what not... but I was able to actually make a rhythm for a few songs I've wrote... But I always felt like I should be doing better.\n\nThis year I started going to another guitar instructor, who had me learning from books titled Mel Bay's modern guitar method. I was only able to afford a few lessons before my money started to get low. I still have two of the lessons books, and can play them decently, but it still feels like I could do more.\n\nI've read from here, and a few places about finding guitar lessons free online, from like Youtube and what not... But a lot of them I've seen were more for one particular song.. and I would like to actually make my own... and it not be a 'fake' barre chorded rhythm.\n\nSo my question to you is, should I just find a way to be able to pay a guitar instructor, or should I just try to learn to play certain songs, online?  ", "gilded": 0, "created_utc": "1230422379", "subreddit": "Guitar", "score": 3, "controversiality": 0}
{"body": "really? it's really grating and platforming is just wondering if it'll be A A B A or A A A :/ combat is frustrating for the fingers.", "gilded": 0, "created_utc": "1230424608", "subreddit": "gaming", "score": 0, "controversiality": 0}
{"body": "That robot was riding s o  s l o w l y it was painful to watch.  I was actually feeling like I was riding up a steep hill and the pain that comes with it - mostly in the thigh muscles.  Really really uncomfortable.", "gilded": 0, "created_utc": "1230536491", "subreddit": "technology", "score": 5, "controversiality": 0}
{"body": "Situation: You're in a park and witness a biker that accidentally runs into a couple of walkers, injuring both and badly injuring himself after being thrown off his bike. You panic, grab your phone, and before dialing, you notice a guy wearing a black shirt with yellow, printed letters \"P O L I C E\". You run for help to the would-be police officer instead of calling the police.\n\nCrucial time is wasted because of the t-shirt wearer's decision to be funny and ironic.", "gilded": 0, "created_utc": "1230698360", "subreddit": "WTF", "score": -9, "controversiality": 0}
{"body": "At a Tool show, and BOY was it affected.  I got B A K E D.", "gilded": 0, "created_utc": "1230750743", "subreddit": "Marijuana", "score": 1, "controversiality": 0}
{"body": "&gt; Please try again.  \r\n  \r\nO-K A Y !\r\n\r\nI  WORK  IN  A LONG  TERM  CARE  FACILITY.\r\n\r\n...TATTS  DO  NOT  AGE  WELL.  \r\n(A N Y W H E R E  ON  THE  BODY).\r\n\r\n&gt; ...until you're too old to care.  \r\n  \r\nthis says sumthin' now, dunn'it?", "gilded": 0, "created_utc": "1228238145", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "\"Hi, my name is twistedcain. Wanna see something [M A S S I V E](http://www.reddit.com/r/pics/comments/7gwbw/m_a_s_s_i_v_e/)?\"", "gilded": 0, "created_utc": "1228248968", "subreddit": "self", "score": 12, "controversiality": 0}
{"body": "NO MATCH FOR A FUCKING NARWHAL! MORE LIKE P U S S Y", "gilded": 0, "created_utc": "1228263602", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "btw - wtf, yes he is, b w d t h t d w i?", "gilded": 0, "created_utc": "1228291954", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "* A d v e r t i s e m e n t\n* Psycho rant continued below", "gilded": 0, "created_utc": "1228417812", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "If all three went out of business, wouldn't that open up the marketplace to new, innovative start-up companies to build great new hybrids, etc?\n\nAnd please don't say they would need capital.  The taxpayers just sent a few\n \nT R I L L I O N   D O L L A R S to wall street to get the credit markets \"unfrozen\".  If taxpayers give out any money, it should be to taxpayers ourselves so that WE CAN DECIDE which companies to invest in.\n\nI think that basically the \"Big Three\" are currently committing treason by trying to raid the U.S. Treasury.  Wall Street already got away with it (for now at least)... let's not let these con jobs go on any longer.\n\nCall your house reps and senators.  Demand that if any more cash, loans, etc. are given out, that they go directly to the people.  \n\n**You might want to mention the possibilities of not only getting voted out but being tried for treason if they do otherwise.**", "gilded": 0, "created_utc": "1228437895", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "Not sure about the alphabet along the wall, but yes, some of those birch barks have no content other than the equivalent of A B C D E F...", "gilded": 0, "created_utc": "1228685175", "subreddit": "science", "score": 3, "controversiality": 0}
{"body": "I tried it the day after it was released here in the USA at my local Verizon place. \n\nWhat a clusterfuck. It REALLY is as bad as they say. Actually, I found it WORSE most reviews I've read. I think David Pogue's review was spot on. After I tried both of the Storms on display (figuring that the first one MUST be broken), I spoke to the store manager. I asked \"is this thing as horrible as it seems?\", to which she replied (in a hushed whisper) \"ya, it's awful. we just got them in yesterday and they are all like that. I don't know what's wrong with them. Yeah, it is really slow to do anything, and the user interface is really bad. Most of the experienced PDA/smartphone folks who come in to try it walk out shaking their heads.\"\n\nIt is S L O O O O O O O O W to do anything. It feels like a Windows machine that has work-hardened after 3 years of spyware installs. Screen orientation switching is unfathomably slow. The keyboard is barely usable, and the entire user interface is so non-intuitive it boggles the mind how this thing EVER got past any semblance of a QA and SW testing team. My guess is that either the entire development team was stoned, or management was so lead-footed that they went into collective denial of the painfully obvious fact that the product is a hopeless piece of shit.\n\nI was ready to throw away my dying Treo 650 for the Storm. However, I ended up just switching to a \"new\" (to me) Treo 700p that a friend gave me after he bought an iPhone. Sadly, AT&amp;T sucks around these parts so I couldn't go all iPhone. If AT&amp;T didn't suck so bad I would switch in a femtosecond. \n\nSo, as for the Storm. Fuggedaboutit. It is a hopeless mess running on a lame-ass processor with a train-wreck of a user interface.\n\nBuy an iPhone or stick with what you have. ", "gilded": 0, "created_utc": "1228707521", "subreddit": "gadgets", "score": 8, "controversiality": 0}
{"body": "I have a little problem with this one. I mean, scientists have been working on these filters for years. And now what these guys have gotten down to are nanoparticle materials. Well, there's a problem here -- these materials, if breathed in, CAN CAUSE  C A N C E R.\n ", "gilded": 0, "created_utc": "1228794496", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "T H I S L O O K S P R E T T Y C O O L !", "gilded": 0, "created_utc": "1228796378", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Your Favourite Text Editor\n\nE D C D E E E", "gilded": 0, "created_utc": "1228798116", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Up Down Up Down A B A B Start.", "gilded": 0, "created_utc": "1228840652", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "c c c C C C C Comb- Same here. A good message is worth repeating at times. Not everyone sees it the first time. I imagine the person complaining didn't either.", "gilded": 0, "created_utc": "1228864157", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "The autocompletion features this guy is going on about don't really seem that amazing:\n\n&gt;I've amazed my co-worker Thomas, a vi user, with the emacs command dabbrev-expand, normally bound to M-/. For example typing p r o g M-/ in this file expands prog out to programmers. However because this expansion is just textual, it often takes a few presses of the M-/ before I get the word I want. For example, when looking for a method, a module name will expand out, or a word from comments.\n\nSo I have to type \"prog\", alternating between letters and spaces (so \"p r o g\") followed by hitting \"M-/\" multiple times, depending on how many occurences of words like \"program\" or \"progenitor\" appear in even the comments of my source file, just so it'll autocomplete the word \"programmers\"?\n\nWhy not just type \"programmers\"?\n\nAnd modifying code on the fly in a running program would not work for Python without a lot of language changes. For example, a Python function's default arguments are only evaluated once. If you could change a function's default arguments in a running program, a lot of people would be left wondering why their function is still using the old default arguments.", "gilded": 0, "created_utc": "1228932831", "subreddit": "programming", "score": -5, "controversiality": 0}
{"body": "No shit.  We're not talking about Adblock, however.  We're talking about the way that FireFox can't detect and fix the broken certificate problem.  Here, let me spell it for you &gt;&gt;  c e r t i f i c a t e .", "gilded": 0, "created_utc": "1229009043", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "That dildo machine can also S T R E T C H so it's quite dangerous...or pleasurable, depending on your tastes.", "gilded": 0, "created_utc": "1229033680", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "T H O U G H T   C R I M E.", "gilded": 0, "created_utc": "1229038352", "subreddit": "science", "score": 21, "controversiality": 0}
{"body": "R E T A R D E D  C O N S P I R A C Y  T H E O R I S T  W H O  T Y P E S  I N  C A P S  A N D  L E A V E S  S P A C E S  F O R  E M P H A S I S", "gilded": 0, "created_utc": "1229041185", "subreddit": "science", "score": 27, "controversiality": 0}
{"body": "W H E R E ?", "gilded": 0, "created_utc": "1229043419", "subreddit": "science", "score": 26, "controversiality": 0}
{"body": "T H E R E O N T H E S T A I R ! W H E R E O N T H E S T A I R ! R I G H T T H E R E ! A L I T T L E M O U S E W I T H C L O G S O N W E L L I D E C L A R E ! G O I N G C L I P - C L I P P E T Y - C L O P O N T H E S T A I R .", "gilded": 0, "created_utc": "1229044261", "subreddit": "science", "score": 34, "controversiality": 0}
{"body": "Y E S T E R D A Y U P O N T H E S T A I R I M E T A M A N W H O W A S N T T H E R E  H E W A S N T T H E R E A G A I N T O D A Y O H H O W I W I S H H E D G O A W A Y  ", "gilded": 0, "created_utc": "1229049104", "subreddit": "science", "score": 13, "controversiality": 0}
{"body": "W E P A S S E D U P O N T H E S T A I R, W E S P O K E O F W A S A N D W H E N.", "gilded": 0, "created_utc": "1229050484", "subreddit": "science", "score": 6, "controversiality": 0}
{"body": "I W H I S T L E D F O R A C A B A N D W H E N I T C A M E N E A R T H E L I S E N C E P L A T E S A I D F R E S H A N D I T H A D D I C E I N T H E M I R R O R.", "gilded": 0, "created_utc": "1229054393", "subreddit": "science", "score": 18, "controversiality": 0}
{"body": "Y O U M I S S P E L L E D \" R E T A R D E D \" T O U G H G U Y", "gilded": 0, "created_utc": "1229055887", "subreddit": "science", "score": 9, "controversiality": 0}
{"body": "W H A T C A M E F I R S T T H E M U S I C O R T H E M I S E R Y ? D I D I L I S T E N T O P O P M U S I C B E C A U S E I W A S M I S E R A B L E ?  O R W A S I M I S E R A B L E B E C A U S E I L I S T E N E D T O P O P M U S I C ?", "gilded": 0, "created_utc": "1229059138", "subreddit": "science", "score": 3, "controversiality": 0}
{"body": "L A D I E S A N D G E N T L E M A N W E H A V E A W I N R A R B U T C A N W E C O N T I N U E R E G A R D L E S S A S I N E E D T O L I S T E N T O T H A T S O N G I N T H E W A R M S P I R I T E D F O R M O F T H E C O M B O\n\nA L T H O U G H I W A S N T T H E R E H E S A I D I W A S H I S F R I E N D ", "gilded": 0, "created_utc": "1229066032", "subreddit": "science", "score": 3, "controversiality": 0}
{"body": "D O N T S T A R T T H A T S H I T A G A I N", "gilded": 0, "created_utc": "1229066135", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "While I agree that this tea pouring feat is in fact B A D A S S, I think it pales in comparison to his earlier feat.  That is, the fact that he not only escaped from a Nazi prison camp, but stole one of their fighter planes (the very same model which was used to shoot him down) and flew it to safety.  I think that is the very definition of the term B A D A S S.", "gilded": 0, "created_utc": "1229134670", "subreddit": "WTF", "score": 10, "controversiality": 0}
{"body": "Price?  Ever heard of t o r r e n t s?", "gilded": 0, "created_utc": "1229229540", "subreddit": "WeAreTheMusicMakers", "score": 1, "controversiality": 0}
{"body": "L O U I S I A N A", "gilded": 0, "created_utc": "1229414967", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "this: http://www.bedelias.edu.uy/ the page for university registrations in my country, the frames are the lesser of its problems... it asks you for your id/password EVERY FUCKING TIME you enter one of its pages, and not once per session: E V E R Y - F U C K I N G - P A G E that is restricted asks you for the id/pass! \"stateless protocol\" huh? and there's more! the enter key DO NOT WORKS! not for changing the fields not even for submitting the damn form :@!!!\n\noh and it also says \"Site optimized for 800x600, arial font, 24 bits.\" xDD", "gilded": 0, "created_utc": "1229465467", "subreddit": "usability", "score": 1, "controversiality": 0}
{"body": "Not one r a t i o n a l reason.  Your dismissal that the board approves it so it is deserved is circular at best, and if you want to call a clear-eyed view of the lack of value American companies typically receive for their exorbitantly priced CEOs \"philosohical,\" fine, but I think you need to read better philosophy.\n\nBoards are made up of other CEOs, so it isn't surprising that they approve compensation like this - they're just waiting for their turn in line.\n\nMeanwhile, they preside over a real stagnation in many of the industries they work in, using the same tricks as their other CEO buddies looking for similar results (economies of scale, buying competitors, fire sale asset purchases, spin offs, consolidations, blah blah blah), and in very public fashion, have been known to fail miserably.  What they spend an inordinate amount of time on during board meetings is talking about - you guessed it - their own compensation.\n\nI think you should research some of the things said during the Enron collapse by those folks before you say with certainty that no guns are held to anyone's head, too.\n\nThe innovators don't pay themselves this well up front.  They invest in the idea, and the people who help them execute it.  They spend their meetings looking for talent, and moving the ball down the field, not grabbing as much of the field as they can before their own practices destroy it.\n\nBut you go ahead and worship your market forces and your CEOs.", "gilded": 0, "created_utc": "1229497521", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "\"L R L R B A B A START\" also works\n", "gilded": 0, "created_utc": "1229538686", "subreddit": "funny", "score": 9, "controversiality": 0}
