{"body": "He should've pressed DOWN + A A A A A A A A A A A then release", "gilded": 0, "created_utc": "1238553804", "subreddit": "happy", "score": 8, "controversiality": 0}
{"body": "Please please please please make it g o a w a y", "gilded": 0, "created_utc": "1238576038", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "A P R I L  F O O L :-)", "gilded": 0, "created_utc": "1238580233", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "\"Hi guys, today we're gonna play some guitar that sounds like Chewbacca. What I have here is a 1997 standard Stratocaster, ruby red. It's got six strings, tuned E A D G B E. Star Wars was a movie from the '70s directed by George Lucas, who also did...\"", "gilded": 0, "created_utc": "1238635792", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Up Up Down Down A B B A Select Start...\n\nThe only one you need.", "gilded": 0, "created_utc": "1238690472", "subreddit": "AskReddit", "score": 27, "controversiality": 0}
{"body": "I can't stand his movies.  Sorry.  I had to say it.  It's a shame I can't make that statement in s l o w    m o t i o n   i n   a  v e r y   l o w     t o n e     o f    v o i c e  . . .", "gilded": 0, "created_utc": "1238691211", "subreddit": "entertainment", "score": 1, "controversiality": 0}
{"body": "Let me spell it out for you: I was being \r\n\r\ns a r c a s t i c", "gilded": 0, "created_utc": "1238703404", "subreddit": "worldnews", "score": -1, "controversiality": 0}
{"body": "B U L L S H I T", "gilded": 0, "created_utc": "1238794864", "subreddit": "politics", "score": -4, "controversiality": 0}
{"body": "Me too. Many years ago I was walking in the park with my family and my sister and I just decided to figure out the alphabet backwards. Haven't forgotten it since then. Anyways.\n\nThe rhythm I use is: z y x, w, v u t s r and q. p o n, m l k, j i h g f, e d c b a. You use something similar?", "gilded": 0, "created_utc": "1238803184", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "Yeah F U C K That.\n\nEdit: boy that was hard to get around.", "gilded": 0, "created_utc": "1238834413", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "YES Move Forward N O W - Renewable Energy is N E X T - Solar Power - Renewables is the NEXT big thing, the money will be there !", "gilded": 0, "created_utc": "1238854578", "subreddit": "business", "score": -1, "controversiality": 0}
{"body": "I'll talk slower then  t o  w h i c h  m y t h...", "gilded": 0, "created_utc": "1238916313", "subreddit": "atheism", "score": 40, "controversiality": 0}
{"body": "W h a a a a a a t\n\nt h e e e e e e e\n\nf u u u u u u c k\n\n...is wrong with his voice.", "gilded": 0, "created_utc": "1238952494", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Can you say : o v e r e x t e n d e d ?", "gilded": 0, "created_utc": "1239028926", "subreddit": "business", "score": 1, "controversiality": 0}
{"body": "Erotic Haircuts are my Bussniess! Your Pleasure! - w4m - 38 (Vanc/Port)\n\nDate: 2009-04-06, 11:46AM PDT\n\n\nIm your EROTIC hairdresser and believe me you wont be getting this kind of service at your local barber! Ive got the experience youll want to leave in style and relaxed for the day! \r\n\r\n\r\n\r\nIm 39, 55, 130lbs, a great pair of DDs and smokin brown eyes! \r\n\r\n\r\n\r\nCome for a haircut and leave with a smile on your face and me on your mind! \r\n\r\n\r\nMy rates are affordable, so whats stopping you! I'm waiting so drop me a line now! \r\n\r\nA n n i e     3*6*0*7*7*3*0*0*5*7\r\n\r\n\r\n\r\nNO EMAILS, TEXTS OR BLOCKED NUMBERS (I will NOT respond)\r\n\n\n\n\n Location: Vanc/Port\nit's NOT ok to contact this poster with services or other commercial interests\n\n\t\t\nhttp://images.craigslist.org/3k53mf3l5ZZZZZZZZZ946f2189f5457cc1e9b.jpg", "gilded": 0, "created_utc": "1239046076", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Gaming equipment can make a difference.\n\nBuy a name brand, non-gamer keyboard and you will only be able to hit 3 keys at a time before it locks out any more input. Gamer keyboards won't do that.\n\nHowever, cheapo generic keyboards won't do that either. For years I used a $10 General Electric keyboard I found at best buy because it let me hit 6 keys before locking out input. It was good enough for me to play in CAL-i and CPL qualifiers for CS. Last time it broke they didn't have it anymore so I got a Razer keyboard that was on clearance and I can hit as many keys as I want on it without locking out input. Although the most I ever hit at one time is 5 keys.\n\nThe macro keys are nice. I would never have been able to compete in WoW Arenas without them. They are right next to ctrl/shift/caps/tab/tilde so they are easy to hit, I just bound them to mirror keys like P L M N K then I had an additional 15 keybindings that were available because I could bind macro1-5, shift + macro 1-5, ctrl + macro 1-5.\n\nSo in that respect, the macro keys become incredibly useful. I never actually used the macro capabilities in them, just used them as extra keys.\n\nMouse matters as well. However, not in the way most people who buy gaming gear think. The most important thing is comfort. I used the Microsoft Intellimouse Optical for years. Now that it is impossible to find (and it has a tendency to break frequently). I have been on a quest to find a mouse that I can use, but they are all incredibly uncomfortable, especially the gamer mice. I think I finally found a mouse that I can use without it making my hand cramp. So now I am using a logitech G9, that I was lucky enough to find on sale for half the price it costs to buy it on the internet today.", "gilded": 0, "created_utc": "1239046890", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "a l g o r i t h m", "gilded": 0, "created_utc": "1239139253", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Coal is D O N E - its nasty and dirty - PERIOD !\nThe Oil Drum my arse ) ", "gilded": 0, "created_utc": "1239154271", "subreddit": "energy", "score": 1, "controversiality": 0}
{"body": "At which point during this exchange will you realize that what you're writing is not clever and you're a bit of an idiot? Do I have to spell that out to you  **s l o w l y**?", "gilded": 0, "created_utc": "1239307437", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "&gt;Who said I was trying to be clever, \n\nOh you were trying - and failing.\n\n&gt;I was just making a point.\n\nWhat is your point? That Europe isn't closer than the United States to Nicaragua. Is that your contribution? A geography lesson? Thanks.\n\nThis person is being denied asylum in the US - why wouldn't she apply for asylum to Canada or Europe? \n\nThere you go.. I just spelled out **my** point (which has so far eluded you) **v e r y - s l o w l y**. Did something click, or are you still having comprehension issues?\n", "gilded": 0, "created_utc": "1239310749", "subreddit": "politics", "score": -3, "controversiality": 0}
{"body": "F U C K I N G    B R I L L I A N T\n\nmost evar", "gilded": 0, "created_utc": "1239325663", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "A E I O U Girl FTW!", "gilded": 0, "created_utc": "1239376141", "subreddit": "funny", "score": -1, "controversiality": 0}
{"body": "A R O U A d a f   l a d f j   a s d l f . d . f a . d 2 3 2 3 &lt; a j", "gilded": 0, "created_utc": "1239475883", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Look, I will say it one last time and say it r e a l s l o w. The comic is poking fun at those idiotic Rapturees who place no value on this life and pee themselves with anticipation over being air-vacced up by Jesus. These cretins see this world as nothing more than a place to wipe their feet before they step into Jebus's parlor.\n\nFrankly, I wish that Rapture would happen because we would all be better off without these dangerous idiots who gave us 8 years of Bush &amp; Cheney.\n\n", "gilded": 0, "created_utc": "1239502462", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "*Facts be damned.... THIS.... IS.... R E D D I T !!!!*\n\n(kicks OP in the chest, knocking him into a bottomless pit full of conspiracy posts)", "gilded": 0, "created_utc": "1239639281", "subreddit": "politics", "score": 19, "controversiality": 0}
{"body": "Mmmmmmmmmm.....s h a v e d   k o a l a........", "gilded": 0, "created_utc": "1239643989", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "--- t v r a g e . u s ----", "gilded": 0, "created_utc": "1239658306", "subreddit": "scifi", "score": 2, "controversiality": 0}
{"body": "Hmm, I get a different set of working letters than you.\n\nABCD FGH JKLMN P S V X Z", "gilded": 0, "created_utc": "1239675279", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "These are my Shift+Shift characters\nABDFGHJKLNSTY\nC E I M O P Q R U V W X Z\ndon't work now!!", "gilded": 0, "created_utc": "1239718648", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "omg.. those graphics... are...\r\nA M A Z I N G ! ", "gilded": 0, "created_utc": "1239731316", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Sheesh, I'm in a public library and there are these two somewhat retarded dudes at a nearby computer, setting up an account with some service. The one guy, the 'expert' is s l o w l y reading e v e r y   question to the other guy, and when there's a drop down list (\"clue to remember your password\") the expert is slowly reading EVERY option, and they've been on that ONE question for the last 10 minutes. \r\n\r\nNow, it's \"there was some trouble creating your account... \". For the 6th or 7th time. Reading it One. Word. At. A. Time. \r\n\r\nThe guys aren't exactly loud, but it's not like you can concentrate on anything else, so I'm just trying to go with the flow. These guys have already used up an hour with their stupid antics, and they're NOT going to finish.  \r\n\r\nThank you for your attention. ", "gilded": 0, "created_utc": "1239821297", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "B B B B B B But they are a different culture.  We have to respect that.", "gilded": 0, "created_utc": "1239879219", "subreddit": "worldnews", "score": 2, "controversiality": 0}
{"body": "Example good, Concept bad...\n\nA = number of cars on road\n\nB = probability of a pothole causing an accident\n\nC = Cost of out of court settlement\n\nD = number of potholes on road\n\nX = (A x B x C )^D", "gilded": 0, "created_utc": "1239896680", "subreddit": "Economics", "score": 1, "controversiality": 0}
{"body": "You don't get it. It's the cutest Cookie Monster/little girl clip ever. Thank you joe_adk &amp; no_dawg. A B C D E F Cookie Monster!\n\nI'd provide a link, but I live in China. Youtube is still banned. Cute Cookie Monster videos are a threat to communism I guess.", "gilded": 0, "created_utc": "1239899334", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "L A W S U I T.", "gilded": 0, "created_utc": "1239917838", "subreddit": "offbeat", "score": 5, "controversiality": 0}
{"body": "L A W S U I T.", "gilded": 0, "created_utc": "1239923802", "subreddit": "Libertarian", "score": 1, "controversiality": 0}
{"body": "**OBOOMBA NOSEBONE IS A TRAITOR!  HES NOT EVEN ELEGIBLE TO BE PRESIDENT OF THIS GREAT COUNTRY BECAUSE HES TOO SCARED TO RELEASE HIS KENYAN BIRTH CIRTIFICATE.  HES TRICKED HALF OF AMERICA INTO THINKING HES THEIR LEADER, AND HAS NOW DENOUNCED CHRIST AND SAID AMERICA ISNT CHRISTIAN.  HOW DARE HE RELEASE TOP SECRET DOCUMENTS FROM AN ACTUAL LEGIT AMERICAN PRESIDENT?  HE HAS NO RIGHT TO DO THIS, AND IS BREAKING THE LAW!  HE MIGHT AS WELL BURN THE CONSTITUTION AND DECLARE HIMSELF KING LIKE THEY DO IN HIS KENYAN HOMELAND.  WHAT A DISCRASE TO AMERICA.  WHO WILL LIBERATE US?  WHO WILL LIBERATE AMERICA?  I CAN ONLY THINK OF ONE PERSON WHO CAN SAVE US, AND THAT PERSON WAS JUST DENOUNCED BY THE BOY KING ANTICHRIST.  SOCIALISM AND FACISM HAS TRULY COME TO THIS ONCE GREAT LAND, AND WE ARE SLOWLY BECOMING AS BAD AS GERMANY WHEN THEY ALSO HAD A CHARISMATIC BUT EVIL LEADER.  ALL WE CAN DO NOW IS PRAY, AND STOCKPILE GOODS AND PROTECTION WHILE WE STILL CAN.  ALL OF YOU WILL NEED TO HAVE THE MEENS TO PROTECT YOUR FAMILIES IN THE VERY NEER FUTURE, BECAUSE THINGS ARE ABOUT TO GO TO HELL IN A HANDBASKET.  BE WARNED.  AT LEAST A FEW REAL AMERICANS STOOD UP TO THIS MENACE ON TEABAG DAY, BUT THATS NOT ENOUGH.  WE NEED TO U N I T E !**", "gilded": 0, "created_utc": "1239927547", "subreddit": "politics", "score": -55, "controversiality": 0}
{"body": "The caps make me mad, but the rationale behind it infuriates me.  Shifting the cost to those who consume more?  B U L L S H I T\n\nIt didn't look to me like there were any deals going on with TW's proposed tiered structure.  The prices were equivalent to what people are paying now for unmetered access.\n\nBut what else do you expect from the former AOL Time Warner.  You know there are some old middle managers from AOL that have risen to the top of TW who are just aching to return to the glory days of 600 hours free CDs.", "gilded": 0, "created_utc": "1239929940", "subreddit": "business", "score": 5, "controversiality": 0}
{"body": "OBOOMBA NOSEBONE IS A TRAITOR! HES NOT EVEN ELEGIBLE TO BE PRESIDENT OF THIS GREAT COUNTRY BECAUSE HES TOO SCARED TO RELEASE HIS KENYAN BIRTH CIRTIFICATE. HES TRICKED HALF OF AMERICA INTO THINKING HES THEIR LEADER, AND HAS NOW DENOUNCED CHRIST AND SAID AMERICA ISNT CHRISTIAN. HOW DARE HE RELEASE TOP SECRET DOCUMENTS FROM AN ACTUAL LEGIT AMERICAN PRESIDENT? HE HAS NO RIGHT TO DO THIS, AND IS BREAKING THE LAW! HE MIGHT AS WELL BURN THE CONSTITUTION AND DECLARE HIMSELF KING LIKE THEY DO IN HIS KENYAN HOMELAND. WHAT A DISCRASE TO AMERICA. WHO WILL LIBERATE US? WHO WILL LIBERATE AMERICA? I CAN ONLY THINK OF ONE PERSON WHO CAN SAVE US, AND THAT PERSON WAS JUST DENOUNCED BY THE BOY KING ANTICHRIST. SOCIALISM AND FACISM HAS TRULY COME TO THIS ONCE GREAT LAND, AND WE ARE SLOWLY BECOMING AS BAD AS GERMANY WHEN THEY ALSO HAD A CHARISMATIC BUT EVIL LEADER. ALL WE CAN DO NOW IS PRAY, AND STOCKPILE GOODS AND PROTECTION WHILE WE STILL CAN. ALL OF YOU WILL NEED TO HAVE THE MEENS TO PROTECT YOUR FAMILIES IN THE VERY NEER FUTURE, BECAUSE THINGS ARE ABOUT TO GO TO HELL IN A HANDBASKET. BE WARNED. AT LEAST A FEW REAL AMERICANS STOOD UP TO THIS MENACE ON TEABAG DAY, BUT THATS NOT ENOUGH. WE NEED TO U N I T E !", "gilded": 0, "created_utc": "1239933962", "subreddit": "politics", "score": -12, "controversiality": 0}
{"body": "\"Shifting the cost to those who consume more? B U L L S H I T\"\n\nUmm how is it bullshit to charge more for consuming more?\nThe real fail of TW was the prices they were putting on it. 1GB of bandwidth cost them less than a penny. If they had made the charges 10 cents per GB no one would have thought much about it.", "gilded": 0, "created_utc": "1239936753", "subreddit": "business", "score": 1, "controversiality": 0}
{"body": "Decoded:\n\nD R I N K  O V A L T I N E", "gilded": 0, "created_utc": "1239995026", "subreddit": "cogsci", "score": 6, "controversiality": 0}
{"body": "F A N T A S T I C !", "gilded": 0, "created_utc": "1240016437", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "\n\n\n                          _    _  __  _  _ _____  ___ ___\n                          | /\\ | |__| |\\ |   |   |___ |  \\\n                          |/  \\| |  | | \\|   |   |___ |__/\n    \n             F O R   C R I M E S   A G A I N S T   T H E   E M P I R E\n    \n     ________________________  _________________________  _______________________\n    |        .......       LS||      .x%%%%%%x.         ||  ,.------;:~~:-.      |\n    |      ::::::;;::.       ||     ,%%%%%%%%%%%        || /:.\\`;;|||;:/;;:\\     |\n    |    .::;::::;::::.      ||    ,%%%'  )'  \\%        ||:')\\`:\\||::/.-_':/)    |\n    |   .::::::::::::::      ||   ,%x%) __   _ Y        ||`:`\\\\\\ ;'||'.''/,.:\\   |\n    |   ::`_```_```;:::.     ||   :%%% ~=-. &lt;=~|        ||==`;.:`|;::/'/./';;=   |\n    |   ::=-) :=-`  ::::     ||   :%%::. .:,\\  |        ||:-/-%%% | |%%%;;_- _:  |\n    | `::|  / :     `:::     ||   `;%:`\\. `-' .'        ||=// %wm)..(mw%`_ :`:\\  |\n    |   '|  `~'     ;:::     ||    ``x`. -===-;         ||;;--', /88\\ -,- :-~~|  |\n    |    :-:==-.   / :'      ||     / `:`.__.;          ||-;~~::'`~^~:`::`/`-=:) |\n    |    `. _    .'.d8:      ||  .d8b.  :: ..`.         ||(;':)%%%' `%%%.`:``:)\\ |\n    | _.  |88bood88888._     || d88888b.  '  /8         ||(\\ %%%/dV##Vb`%%%%:`-. |\n    |~  `-+8888888888P  `-. _||d888888888b. ( 8b       /|| |);/( ;~~~~ :)\\`;;.``\\|\n    |-'     ~~^^^^~~  `./8 ~ ||~   ~`888888b  `8b     /:|| //\\'/,/|;;|:(: |.|\\;|\\|\n    |8b /  /  |   \\  \\  `8   ||  ' ' `888888   `8. _ /:/||/) |(/ | / \\|\\\\`( )- ` |\n    |P        `          8   ||'      )88888b   8b |):X ||;):):)/.):|/) (`:`\\\\`-`|\n    |                    8b  ||   ~ - |888888   `8b/:/:\\||;%/ //;/(\\`.':| ::`\\\\;`|\n    |                    `8  ||       |888888    88\\/~~;||;/~( \\|./;)|.|):;\\. \\\\-|\n    |                     8b ||       (888888b   88|  / ||/',:\\//) ||`.|| (:\\)):%|\n    |         .           `8 ||\\       \\888888   8-:   /||,|/;/(%;.||| (|(\\:- ; :|\n    |________/_\\___________8_||_\\_______\\88888_.'___\\__/||_%__%:__;_:`_;_:_.\\%_`_|\n    \n    L u k e  S k y w a l k e r      H a n   S o l o          C h e w b a c c a\n    \n    Self-Proclaimed Jedi Knight     Smuggler, Pirate         Smuggler, Pirate\n         500,000 credits            200,000 credits          100,000 credits\n    \n", "gilded": 0, "created_utc": "1240031490", "subreddit": "geek", "score": 46, "controversiality": 0}
{"body": "W A T E R ....\n\nThe whole world is facing a shortage of clean water and in western lifestyles water is a huge key to our comfort level. How long until advertising and cleverly placed \"non-endorsements\" convince us that water usage is bad?\n\n[Check out my blog on the changes we can expect in the future related to water usage.](http://vicinsea.blogspot.com/2009/04/water-water-everywhere.html)", "gilded": 0, "created_utc": "1240078645", "subreddit": "Frugal", "score": -4, "controversiality": 0}
{"body": "Update:: I t s  s l o w w w w w  w  w  w  w   w   w   w   w", "gilded": 0, "created_utc": "1240098282", "subreddit": "4chan", "score": 6, "controversiality": 0}
{"body": "&gt; they finally released the originals untouched on DVD\n\nI was not aware of this *shaking*  I N E E D !", "gilded": 0, "created_utc": "1240161634", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "D I S G U S T I N G", "gilded": 0, "created_utc": "1240185171", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "\tseg000:0100 ; Segment type: Pure code\n\tseg000:0100 seg000          segment byte public 'CODE' use16\n\tseg000:0100                 assume cs:seg000\n\tseg000:0100                 org 100h\n\tseg000:0100                 assume es:nothing, ss:nothing, ds:seg000, fs:nothing, gs:nothing\n\tseg000:0100\n\tseg000:0100 ; ¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦ S U B R O U T I N E ¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦¦\n\tseg000:0100\n\tseg000:0100\n\tseg000:0100                 public start\n\tseg000:0100 start           proc near\n\tseg000:0100                 dec     ax\n\tseg000:0101                 out     61h, al         ; PC/XT PPI port B bits:\n\tseg000:0101                                         ; 0: Tmr 2 gate ---\u0010 OR 03H=spkr ON\n\tseg000:0101                                         ; 1: Tmr 2 data -+  AND 0fcH=spkr OFF\n\tseg000:0101                                         ; 3: 1=read high switches\n\tseg000:0101                                         ; 4: 0=enable RAM parity checking\n\tseg000:0101                                         ; 5: 0=enable I/O channel check\n\tseg000:0101                                         ; 6: 0=hold keyboard clock low\n\tseg000:0101                                         ; 7: 0=enable kbrd\n\tseg000:0103\n\tseg000:0103 loc_103:                                ; CODE XREF: start+D\u0019j\n\tseg000:0103                 mov     si, 13Fh\n\tseg000:0106\n\tseg000:0106 loc_106:                                ; CODE XREF: start+3B\u0019j\n\tseg000:0106                 xor     bx, bx\n\tseg000:0108                 mov     bl, [si]\n\tseg000:010A                 cmp     bl, 0FFh\n\tseg000:010D                 jz      short loc_103\n\tseg000:010F                 add     bx, 0D0h\n\tseg000:0113                 mov     al, 0B6h\n\tseg000:0115                 out     43h, al         ; Timer 8253-5 (AT: 8254.2).\n\tseg000:0117                 xor     dx, dx\n\tseg000:0119                 mov     eax, 1234DDh\n\tseg000:011F                 div     ebx\n\tseg000:0122                 out     42h, al         ; Timer 8253-5 (AT: 8254.2).\n\tseg000:0124                 mov     al, ah\n\tseg000:0126                 out     42h, al         ; Timer 8253-5 (AT: 8254.2).\n\tseg000:0128                 inc     si\n\tseg000:0129                 mov     cl, [si]\n\tseg000:012B                 inc     si\n\tseg000:012C                 mov     dx, 3BAh\n\tseg000:012F\n\tseg000:012F loc_12F:                                ; CODE XREF: start+32\u0019j\n\tseg000:012F                                         ; start+3D\u0019j\n\tseg000:012F                 in      al, dx          ; Video status bits:\n\tseg000:012F                                         ; 0: retrace.  1=display is in vert or horiz retrace.\n\tseg000:012F                                         ; 1: 1=light pen is triggered; 0=armed\n\tseg000:012F                                         ; 2: 1=light pen switch is open; 0=closed\n\tseg000:012F                                         ; 3: 1=vertical sync pulse is occurring.\n\tseg000:0130                 test    al, 8\n\tseg000:0132                 jz      short loc_12F\n\tseg000:0134\n\tseg000:0134 loc_134:                                ; CODE XREF: start+37\u0019j\n\tseg000:0134                 in      al, dx          ; Video status bits:\n\tseg000:0134                                         ; 0: retrace.  1=display is in vert or horiz retrace.\n\tseg000:0134                                         ; 1: 1=light pen is triggered; 0=armed\n\tseg000:0134                                         ; 2: 1=light pen switch is open; 0=closed\n\tseg000:0134                                         ; 3: 1=vertical sync pulse is occurring.\n\tseg000:0135                 test    al, 8\n\tseg000:0137                 jnz     short loc_134\n\tseg000:0139                 dec     cl\n\tseg000:013B                 jz      short loc_106\n\tseg000:013D                 jmp     short loc_12F\n\tseg000:013D start           endp\n\tseg000:013D\n\tseg000:013D ; ---------------------------------------------------------------------------\n\tseg000:013F                 db    0\n\tseg000:0140                 db  0Ch\n\tseg000:0141                 db  19h\n\tseg000:0142                 db  0Ch\n\tseg000:0143                 db  45h ; E\n\tseg000:0144                 db  0Ch\n\tseg000:0145                 db  19h\n\tseg000:0146                 db  0Ch\n\tseg000:0147                 db  8Dh ; ì\n\tseg000:0148                 db  24h ; $\n\tseg000:0149                 db  8Dh ; ì\n\tseg000:014A                 db  24h ; $\n\tseg000:014B                 db  67h ; g\n\tseg000:014C                 db  48h ; H\n\tseg000:014D                 db    0\n\tseg000:014E                 db  0Ch\n\tseg000:014F                 db  19h\n\tseg000:0150                 db  0Ch\n\tseg000:0151                 db  45h ; E\n\tseg000:0152                 db  0Ch\n\tseg000:0153                 db  19h\n\tseg000:0154                 db  0Ch\n\tseg000:0155                 db  67h ; g\n\tseg000:0156                 db  24h ; $\n\tseg000:0157                 db  67h ; g\n\tseg000:0158                 db  24h ; $\n\tseg000:0159                 db  45h ; E\n\tseg000:015A                 db  24h ; $\n\tseg000:015B                 db  36h ; 6\n\tseg000:015C                 db  0Ch\n\tseg000:015D                 db  19h\n\tseg000:015E                 db  18h\n\tseg000:015F                 db    0\n\tseg000:0160                 db  0Ch\n\tseg000:0161                 db  19h\n\tseg000:0162                 db  0Ch\n\tseg000:0163                 db  45h ; E\n\tseg000:0164                 db  0Ch\n\tseg000:0165                 db  19h\n\tseg000:0166                 db  0Ch\n\tseg000:0167                 db  45h ; E\n\tseg000:0168                 db  30h ; 0\n\tseg000:0169                 db  67h ; g\n\tseg000:016A                 db  18h\n\tseg000:016B                 db  36h ; 6\n\tseg000:016C                 db  24h ; $\n\tseg000:016D                 db  19h\n\tseg000:016E                 db  0Ch\n\tseg000:016F                 db    0\n\tseg000:0170                 db  30h ; 0\n\tseg000:0171                 db    0\n\tseg000:0172                 db  18h\n\tseg000:0173                 db  67h ; g\n\tseg000:0174                 db  18h\n\tseg000:0175                 db  45h ; E\n\tseg000:0176                 db  18h\n\tseg000:0177                 db  45h ; E\n\tseg000:0178                 db  34h ; 4\n\tseg000:0179                 db    0\n\tseg000:017A                 db  0Ch\n\tseg000:017B                 db  19h\n\tseg000:017C                 db  0Ch\n\tseg000:017D                 db  45h ; E\n\tseg000:017E                 db  0Ch\n\tseg000:017F                 db  19h\n\tseg000:0180                 db  0Ch\n\tseg000:0181                 db  8Dh ; ì\n\tseg000:0182                 db  30h ; 0\n\tseg000:0183                 db  8Dh ; ì\n\tseg000:0184                 db  18h\n\tseg000:0185                 db  67h ; g\n\tseg000:0186                 db  48h ; H\n\tseg000:0187                 db    0\n\tseg000:0188                 db  0Ch\n\tseg000:0189                 db  19h\n\tseg000:018A                 db  0Ch\n\tseg000:018B                 db  45h ; E\n\tseg000:018C                 db  0Ch\n\tseg000:018D                 db  19h\n\tseg000:018E                 db  0Ch\n\tseg000:018F                 db 0CFh ; -\n\tseg000:0190                 db  30h ; 0\n\tseg000:0191                 db  45h ; E\n\tseg000:0192                 db  18h\n\tseg000:0193                 db  45h ; E\n\tseg000:0194                 db  24h ; $\n\tseg000:0195                 db  36h ; 6\n\tseg000:0196                 db  0Ch\n\tseg000:0197                 db  19h\n\tseg000:0198                 db  18h\n\tseg000:0199                 db    0\n\tseg000:019A                 db  0Ch\n\tseg000:019B                 db  19h\n\tseg000:019C                 db  0Ch\n\tseg000:019D                 db  45h ; E\n\tseg000:019E                 db  0Ch\n\tseg000:019F                 db  19h\n\tseg000:01A0                 db  0Ch\n\tseg000:01A1                 db  45h ; E\n\tseg000:01A2                 db  30h ; 0\n\tseg000:01A3                 db  67h ; g\n\tseg000:01A4                 db  18h\n\tseg000:01A5                 db  36h ; 6\n\tseg000:01A6                 db  24h ; $\n\tseg000:01A7                 db  19h\n\tseg000:01A8                 db  0Ch\n\tseg000:01A9                 db    0\n\tseg000:01AA                 db  30h ; 0\n\tseg000:01AB                 db    0\n\tseg000:01AC                 db  18h\n\tseg000:01AD                 db  67h ; g\n\tseg000:01AE                 db  30h ; 0\n\tseg000:01AF                 db  45h ; E\n\tseg000:01B0                 db  6Bh ; k\n\tseg000:01B1                 db 0FFh\n\tseg000:01B1 seg000          ends\n\tseg000:01B1\n\tseg000:01B1\n\tseg000:01B1                 end start\n", "gilded": 0, "created_utc": "1240274705", "subreddit": "programming", "score": 7, "controversiality": 0}
{"body": "Asshole, this dude's wife is D Y I N G.  Your Internet tough guy approach is just plain BORING.  \n\nHave a heart.", "gilded": 0, "created_utc": "1240317959", "subreddit": "reddit.com", "score": 16, "controversiality": 0}
{"body": "My belief is bordering on OCD: If I cross my toes on one foot I have to then cross them twice on the other foot and once again on the original foot in order to even it out. Sometimes this goes on for a long time.\n\n\nMost simple example:\n\nR L L R\n\nLonger example:\n\nR L L R L L R R R R L L R L L R\n", "gilded": 0, "created_utc": "1240337088", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "L A W S U I T.", "gilded": 0, "created_utc": "1240377741", "subreddit": "Liberty", "score": 2, "controversiality": 0}
{"body": "Did you actually say it slowly? Because I read it at normal speed. Here, let me type this slowly. \r\n\r\nO B A M A   IS CONTINUING YOUR UNJUST WAR. ", "gilded": 0, "created_utc": "1240472032", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "V I D E O !!", "gilded": 0, "created_utc": "1240476356", "subreddit": "pics", "score": -1, "controversiality": 0}
{"body": "why not theres the room upstairs empty and Millys bed in the back room\nhe could do his writing and studies at the table in there for all the\nscribbling he does at it and if he wants to read in bed in the morning\nlike me as hes making the breakfast for I he can make it for 2 Im sure\nIm not going to take in lodgers off the street for him if he takes\na gesabo of a house like this Id love to have a long talk with an\nintelligent welleducated person Id have to get a nice pair of red\nslippers like those Turks with the fez used to sell or yellow and a\nnice semitransparent morning gown that I badly want or a peachblossom\ndressing jacket like the one long ago in Walpoles only 8/6 or 18/6 Ill\njust give him one more chance Ill get up early in the morning Im sick of\nCohens old bed in any case I might go over to the markets to see all\nthe vegetables and cabbages and tomatoes and carrots and all kinds of\nsplendid fruits all coming in lovely and fresh who knows whod be the 1st\nman Id meet theyre out looking for it in the morning Mamy Dillon used\nto say they are and the night too that was her massgoing Id love a\nbig juicy pear now to melt in your mouth like when I used to be in the\nlonging way then Ill throw him up his eggs and tea in the moustachecup\nshe gave him to make his mouth bigger I suppose hed like my nice cream\ntoo I know what Ill do Ill go about rather gay not too much singing a\nbit now and then mi fa pieta Masetto then Ill start dressing myself to\ngo out presto non son piu forte Ill put on my best shift and drawers let\nhim have a good eyeful out of that to make his micky stand for him Ill\nlet him know if thats what he wanted that his wife is I s l o fucked yes\nand damn well fucked too up to my neck nearly not by him 5 or 6 times\nhandrunning theres the mark of his spunk on the clean sheet I wouldnt\nbother to even iron it out that ought to satisfy him if you dont believe\nme feel my belly unless I made him stand there and put him into me Ive a\nmind to tell him every scrap and make him do it out in front of me serve\nhim right its all his own fault if I am an adulteress as the thing in\nthe gallery said O much about it if thats all the harm ever we did in\nthis vale of tears God knows its not much doesnt everybody only they\nhide it I suppose thats what a woman is supposed to be there for or\nHe wouldnt have made us the way He did so attractive to men then if he\nwants to kiss my bottom Ill drag open my drawers and bulge it right out\nin his face as large as life he can stick his tongue 7 miles up my hole\nas hes there my brown part then Ill tell him I want LI or perhaps 30/-\nIll tell him I want to buy underclothes then if he gives me that well he\nwont be too bad I dont want to soak it all out of him like other women\ndo I could often have written out a fine cheque for myself and write his\nname on it for a couple of pounds a few times he forgot to lock it up\nbesides he wont spend it Ill let him do it off on me behind provided he\ndoesnt smear all my good drawers O I suppose that cant be helped Ill do\nthe indifferent l or 2 questions Ill know by the answers when hes like\nthat he cant keep a thing back I know every turn in him Ill tighten my\nbottom well and let out a few smutty words smellrump or lick my shit or\nthe first mad thing comes into my head then Ill suggest about yes O wait\nnow sonny my turn is coming Ill be quite gay and friendly over it O\nbut I was forgetting this bloody pest of a thing pfooh you wouldnt know\nwhich to laugh or cry were such a mixture of plum and apple no Ill have\nto wear the old things so much the better itll be more pointed hell\nnever know whether he did it or not there thats good enough for you\nany old thing at all then Ill wipe him off me just like a business his\nomission then Ill go out Ill have him eying up at the ceiling where is\nshe gone now make him want me thats the only way a quarter after what an\nunearthly hour I suppose theyre just getting up in China now combing out\ntheir pigtails for the day well soon have the nuns ringing the angelus\ntheyve nobody coming in to spoil their sleep except an odd priest or two\nfor his night office or the alarmclock next door at cockshout clattering\nthe brains out of itself let me see if I can doze off 1 2 3 4 5 what\nkind of flowers are those they invented like the stars the wallpaper\nin Lombard street was much nicer the apron he gave me was like that\nsomething only I only wore it twice better lower this lamp and try again\nso as I can get up early Ill go to Lambes there beside Findlaters and\nget them to send us some flowers to put about the place in case he\nbrings him home tomorrow today I mean no no Fridays an unlucky day first\nI want to do the place up someway the dust grows in it I think while Im\nasleep then we can have music and cigarettes I can accompany him first I\nmust clean the keys of the piano with milk whatll I wear shall I wear\na white rose or those fairy cakes in Liptons I love the smell of a rich\nbig shop at 7 1/2d a lb or the other ones with the cherries in them\nand the pinky sugar I Id a couple of lbs of those a nice plant for the\nmiddle of the table Id get that cheaper in wait wheres this I saw them\nnot long ago I love flowers Id love to have the whole place swimming in\nroses God of heaven theres nothing like nature the wild mountains then\nthe sea and the waves rushing then the beautiful country with the fields\nof oats and wheat and all kinds of things and all the fine cattle going\nabout that would do your heart good to see rivers and lakes and flowers\nall sorts of shapes and smells and colours springing up even out of the\nditches primroses and violets nature it is as for them saying theres no\nGod I wouldnt give a snap of my two fingers for all their learning why\ndont they go and create something I often asked him atheists or whatever\nthey call themselves go and wash the cobbles off themselves first then\nthey go howling for the priest and they dying and why why because theyre\nafraid of hell on account of their bad conscience ah yes I know them\nwell who was the first person in the universe before there was anybody\nthat made it all who ah that they dont know neither do I so there you\nare they might as well try to stop the sun from rising tomorrow the sun\nshines for you he said the day we were lying among the rhododendrons on\nHowth head in the grey tweed suit and his straw hat the day I got him to\npropose to me yes first I gave him the bit of seedcake out of my mouth\nand it was leapyear like now yes 16 years ago my God after that long\nkiss I near lost my breath yes he said I was a flower of the mountain\nyes so we are flowers all a womans body yes that was one true thing he\nsaid in his life and the sun shines for you today yes that was why I\nliked him because I saw he understood or felt what a woman is and I knew\nI could always get round him and I gave him all the pleasure I could\nleading him on till he asked me to say yes and I wouldnt answer first\nonly looked out over the sea and the sky I was thinking of so many\nthings he didnt know of Mulvey and Mr Stanhope and Hester and father and\nold captain Groves and the sailors playing all birds fly and I say stoop\nand washing up dishes they called it on the pier and the sentry in front\nof the governors house with the thing round his white helmet poor devil\nhalf roasted and the Spanish girls laughing in their shawls and their\ntall combs and the auctions in the morning the Greeks and the jews and\nthe Arabs and the devil knows who else from all the ends of Europe and\nDuke street and the fowl market all clucking outside Larby Sharons\nand the poor donkeys slipping half asleep and the vague fellows in the\ncloaks asleep in the shade on the steps and the big wheels of the carts\nof the bulls and the old castle thousands of years old yes and those\nhandsome Moors all in white and turbans like kings asking you to sit\ndown in their little bit of a shop and Ronda with the old windows of the\nposadas 2 glancing eyes a lattice hid for her lover to kiss the iron\nand the wineshops half open at night and the castanets and the night we\nmissed the boat at Algeciras the watchman going about serene with his\nlamp and O that awful deepdown torrent O and the sea the sea crimson\nsometimes like fire and the glorious sunsets and the figtrees in the\nAlameda gardens yes and all the queer little streets and the pink\nand blue and yellow houses and the rosegardens and the jessamine and\ngeraniums and cactuses and Gibraltar as a girl where I was a Flower\nof the mountain yes when I put the rose in my hair like the Andalusian\ngirls used or shall I wear a red yes and how he kissed me under the\nMoorish wall and I thought well as well him as another and then I asked\nhim with my eyes to ask again yes and then he asked me would I yes to\nsay yes my mountain flower and first I put my arms around him yes and\ndrew him down to me so he could feel my breasts all perfume yes and his\nheart was going like mad and yes I said yes I will Yes.\n\nTrieste-Zurich-Paris 1914-1921\n", "gilded": 0, "created_utc": "1240478262", "subreddit": "science", "score": -8, "controversiality": 0}
{"body": "     |  o  \n     | \\|/  \n     |  |  \n     | / \\\n\n    M O H A M _ E D\n", "gilded": 0, "created_utc": "1240516956", "subreddit": "science", "score": 6, "controversiality": 0}
{"body": "      /¯¯\n     |  o  \n     | \\|/  \n     |  |  \n     | / \\\n\n    M O H A M _ E D\n\n    Used: B\n\nEDIT: I guess no one wants to be the one to have hanged Mohammed, eh?", "gilded": 0, "created_utc": "1240518852", "subreddit": "science", "score": 5, "controversiality": 0}
{"body": "When I clicked the titles of the newspaper Articles, they faded and left letters up.\n\nS O E X D P E", "gilded": 0, "created_utc": "1240560770", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "This is why the old media is F U C K E D people.\nThe whole thing is going to crash under the weight of its own stupidity. Luckily the new media is here to step in and fill the gap. For a start we have Dan Carlin's [\"Hardcore history\"](http://www.dancarlin.com/disp.php/hh) podcast, [\"The skeptic's guide to the universe\"](http://www.theskepticsguide.org/) and other wonderful amateur productions. Please support good podcasts with your money or else we'll be left with no alternative to the moronic bullshit that traditional media inflicts on us.", "gilded": 0, "created_utc": "1240585714", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "Ha! Many years ago I broke a long spell of unemployment by forming a company. Got the software to market, was ultimately a failure BUT it did mean I could just w a l k  into a new job. Score!", "gilded": 0, "created_utc": "1240607390", "subreddit": "programming", "score": 4, "controversiality": 0}
{"body": "Same difference.  \n\nWait, no, we shout.  L O U D L Y.  ", "gilded": 0, "created_utc": "1240611914", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "First text I ever got from my mom was:\n\n&gt;H E Y C A L L M E\n\nI still can't manage to work out why she put spaces after every character...", "gilded": 0, "created_utc": "1240621563", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "N O B O D Y should be taxed. Not even churches.", "gilded": 0, "created_utc": "1240669065", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "Neo Tokyo is about to E X P L O D E!\r\n\r\nI remember having to go the the sketchy video shop that would sell 15 and 18 rated films to kids. Good times.", "gilded": 0, "created_utc": "1240669311", "subreddit": "anime", "score": 1, "controversiality": 0}
{"body": "V E R Y  S L O W L Y. In all seriousness, play up their values. \n\nIf they are Christian, remind them that Christ wouldn't torture people. Remind them we should help the poor. Remind them Jesus wanted us to accept everyone no matter what their sins. Remind them not to judge others as it is not their job. \n\nIf they are patriotic, remind them that the US always takes the higher ground. Remind them to respect our institutions even if they disagree. Remind them that the majority of Americans have decided this is what is good, and if they don't like it, they are being \"un-American\". ", "gilded": 0, "created_utc": "1240710564", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "Yup. I do rekon the **L I B E R A L S** missed their chance! ", "gilded": 0, "created_utc": "1240775381", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "a b c d e f g h i j k ellamennopee", "gilded": 0, "created_utc": "1240819075", "subreddit": "pics", "score": 55, "controversiality": 0}
{"body": "L A W S U I T.", "gilded": 0, "created_utc": "1240821305", "subreddit": "Bad_Cop_No_Donut", "score": 2, "controversiality": 0}
{"body": "a b c d e f g, h i j k man i gotta pee", "gilded": 0, "created_utc": "1240830467", "subreddit": "pics", "score": -4, "controversiality": 0}
{"body": "...and why are gas pumps all different? Is there r e a l l y a market for those? God doesn't give a flying fuck about our survival, which is evident with all the ways to die on earth, our in-ability to pump gas out of one kind of pump.", "gilded": 0, "created_utc": "1240957080", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Just to add on what Tsien's saying, because he's right, in a minor key you'll frequently see the seventh scale degree raised in the V and vii chords.  It's called the harmonic minor scale.  For example, in the key of A minor:\n\nA B C D E F G# A instead of A B C D E F G A\n\nBut the G# will only be used in the E chord (E G# B) making it major rather than minor, and the G# chord (G# B D) making it diminished rather than major.  This helps establish the tonal center around A rather than C, which would be felt more strongly since it is the relative major of A minor.", "gilded": 0, "created_utc": "1240980433", "subreddit": "Guitar", "score": 3, "controversiality": 0}
{"body": "Just throwing ideas around for the day(s) by converting characters to numbers. Using different bases could throw up other dates:\n\nR E D D I T = 18  5  4  4  9  20\n\n= 18/5 , 4/4 , 9/20\n\n18th May (Euro format)\n4th April (International format)\n20th September (US format)\n\nEDIT: But as someone else has said, the odds of seeing someone else are pretty low, which would probably make it better to be either:\n\n- The same day each month or\n- The same day each week or\n- Any day", "gilded": 0, "created_utc": "1241123012", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
