{"body": "Wow, someone on this page who actually gets it.\r\n\r\nR E S P E C T", "gilded": 0, "created_utc": "1209659381", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "David Blaine is a P U S S Y", "gilded": 0, "created_utc": "1209667474", "subreddit": "reddit.com", "score": 4, "controversiality": 0}
{"body": "relax john....the people you NEED to fear are in charge of the US.\n\nThey won't rest now until the country and its soverignty, and economy are R U I N E D.\n\nThen, the BANKS can come in with their \"Your world is a Plantation\" plan, finish divvying up the world into four trade centers (Ours will be the American Union), replace our useless dollar with an equally useless fiat currency, the Amero.\n\nFactories and manufacturing will return to the US, but in sweatshop form, as labor unions and working wages will become a thing of the past.  You will work for your daily RFID credit (see below) so that you can eat.\n\nYou will probably live in labor camps or employer sponsored housing.  The only aspect of \"ownership\" that will remain of the soon to be former American society, will be that YOU and your children are owned, just as slaves and indentured servants were.\n\nPeople in this country will slide into bold faced serfdom, from their current position as sharecroppers.\n\nThen, they will start retrofitting people with RFID chips.  You will not be permitted to buy, sell, or exist unless your chip is in good standing.\n\nThey will keep you in line by threatening to turn off your chip.\n\nThink it can't happen here?  Look at the back of your dollar bill...Novus Ordos Seculorum...\n\nNew World Order.\n\nwww.zeigeist.com\n", "gilded": 0, "created_utc": "1209830560", "subreddit": "worldnews", "score": 3, "controversiality": 0}
{"body": "Actually it would help me to use something like l1 m1 r1 m2 r2 m3 r3 instead of a x b y c z d. But perhaps that's just me.", "gilded": 0, "created_utc": "1210060889", "subreddit": "programming", "score": 8, "controversiality": 0}
{"body": "There's an OCaml tutorial that uses implements red-black trees as an example and uses `a b c d w x y z`. WTF?", "gilded": 0, "created_utc": "1210075218", "subreddit": "programming", "score": 0, "controversiality": 0}
{"body": "It _has_ to be a b c d x y z or something like that, precisely because eg. \"c\" is bound to different things in different lines :\n(Ocaml, revised syntax)\n\n| T B (T R (T R a x b) y c) z d\n\n| T B (T R a x (T R b y c)) z d\n\n| T B a x (T R (T R b y c) z d)\n\n| T B a x (T R b y (T R c z d))\n\n  -&gt; T R (T B a x b) y (T B c z d)\n\n\nIf you don't follow the \"axbyczd\" order, you get lost. You could name them differently, but it is important to :\n- have positional meaning only (\"left left child\" is impossible because different things are bound to the same name in different patterns)\n\n- differentiate values (x, y, z) and trees (a, b, c, d) easily\n\n- be easy to remember and to \"sing\" (yes, sing : there is some music here, that you totally kill with a \"middle2\")\n\nBtw, if you live conciseness, OCaml let you have a shorter version :\n\n| T B (T R (T R a x b) y c | T R a x (T R b y c)) z d\n\n| T B a x (T R (T R b y c) z d | T R b y (T R c z d))\n\n  -&gt; T R (T B a x b) y (T B c z d)\n\nThe problem is that it kills the linearity of \"axbyczd\" a bit, but that's a nice factorization imho (and if you want space, you can still indent that differently).", "gilded": 0, "created_utc": "1210095739", "subreddit": "programming", "score": 5, "controversiality": 0}
{"body": "&gt;It has to be a b c d x y z or something like that, precisely because eg. \"c\" is bound to different things in different lines : (Ocaml, revised syntax)\n\nIt *has* to be cryptic single letter variable names?", "gilded": 0, "created_utc": "1210109395", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "As I said: Clockworks. *C l o c k w o r k s*\n\nAs if the bad emotion was enough to prevent them from any rational inquiry. Seething with rage while at the same time they are unable to see the truth that is before them. It's like watching some really predictable animals really. Had they even a hint of spine they'd recognize the situation and admit that it's one of the most embarrassing scams in history. Cutting a piece off your dicks... I mean really! What a load of crap! Just how people are falling for it... morons.", "gilded": 0, "created_utc": "1210171589", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "It will remain illegal everywhere until big pharma's stranglehold on remedies and drugs is B R O K E N.\n\nThey can't patent it, they can't own it.  That's wy it's illegal", "gilded": 0, "created_utc": "1210171812", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "if congress doesn't have the balls to kill this thing once and for all, perhaps phone customers should C A N C E L their service and let these assholes know we mean business.\n\nStay off the 4th fucking amendment.", "gilded": 0, "created_utc": "1210293418", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "up up down down left right left right b a b a select", "gilded": 0, "created_utc": "1210382377", "subreddit": "technology", "score": 0, "controversiality": 0}
{"body": "He'll have a lot of opposition from pharmacuetical companies that have mounted a concerted and so far, successful effort to keep marajuana criminalized.\n\nWhy?\n\nBecause they can't patent it;  they know it is an effective treatment for some conditions (i.e., glaucoma) and an effective pain reliever for countless others.  The clinical uses of marijuana are widely known but have been suppressed by BIG PHARMA.\n\nIt's not a \"phobia\" this \"country\" has... it's flat out, bare faced G R E E D on the part of multinational pharma corps who would rather sell you their poisonous, overpriced crap than see you get a little cheap pain relief.\n\nMake no mistake, that's the lobby behind keeping grass illegal,", "gilded": 0, "created_utc": "1210603782", "subreddit": "politics", "score": 23, "controversiality": 0}
{"body": "I'm so commited to the movement they tell me the letters on the W H I T E P O R keys have worn off!", "gilded": 0, "created_utc": "1210863737", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "L I B E R T Y", "gilded": 0, "created_utc": "1210885492", "subreddit": "reddit.com", "score": 8, "controversiality": 0}
{"body": "IT DRIVES ME NUUUUUUUTS!!!\n\nWE'LL DO IT LIVE, FUCK IT! DO IT LIVE! \n\nFUCKING G O O O O O L L L L F F F F ", "gilded": 0, "created_utc": "1210913057", "subreddit": "self", "score": 1, "controversiality": 0}
{"body": "z y x w v u t s r q p o n m l k j i h g f e d c b a\n\nI've been pulled over a few times.....", "gilded": 0, "created_utc": "1210989651", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "the Bush family are nazis, made their fortune trading with nazis, supported, encouraged, legitimized, energized and facilitated the Nazis.\n\nnow little bushie is running the nazi playbook all over again this time in the USA\n\nCry me a fucking river White House.  You're lucky our congress is full of sellouts and whores or you would all be in P R I S O N", "gilded": 0, "created_utc": "1211297838", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "A B A C A B B ", "gilded": 0, "created_utc": "1211321301", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "remember, the F I R S T thing Karl Rove did after 9/11 was to meet with movie and T.V. producers.\n\n\\http://news.bbc.co.uk/2/hi/entertainment/1651173.stm\n\nWhat else can you expect in a country where a television comic book hero forms the basis for the military training manual????", "gilded": 0, "created_utc": "1211464873", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "O R I S I N A L \nhttp://www.ferryhalim.com/orisinal/", "gilded": 0, "created_utc": "1211727424", "subreddit": "entertainment", "score": 1, "controversiality": 0}
{"body": "the link to  O R I S I N A L \nhttp://www.ferryhalim.com/orisinal/", "gilded": 0, "created_utc": "1211727440", "subreddit": "entertainment", "score": 2, "controversiality": 0}
{"body": "This archive was generated by hypermail 2.1.6 : Thu Jan 01 2004 -\r\n17:33:55 EST\r\n\r\nCAC Commercial Workshop\r\nFrom: J.Paul Robinson (j...@flowcyt.cyto.purdue.edu)\r\nDate: Wed Jul 29 1998 - 22:09:42 EST\r\n\r\nNext message: Newsom, Brian S.: \"RE: Murine erythrocytes\"\r\nPrevious message: Artur Summerfield: \"Re: Annexin V\"\r\nMessages sorted by: [ date ] [ thread ] [ subject ] [ author ]\r\n[ attachment ]\r\n\r\n--------------------------------------------------------------------------------\r\n\r\nI have been requested to post this notice about a workshop coming up\r\nat\r\nCAC. Here it is.\r\nPaul\r\n\r\n- Hide quoted text -\r\n- Show quoted text -\r\n&gt; * * * * * * * * * * * * * * * * * * * * * * * * * * * *\r\n&gt; A N N O U N C E M E N T\r\n&gt; * * * * * * * * * * * * * * * * * * * * * * * * * * * *\r\n&gt; Scientific Tutorial\r\n&gt; at the\r\n&gt; 13th Annual Meeting\r\n&gt; Clinical Applications of Cytometry\r\n&gt; The Hematopathological Model to Hematopoietic Malignancies:\r\n&gt; Applications of Novel Technologies\r\n&gt; Dr. Jean Lopategui, Medical Director and\r\n&gt; Horacio Vall, Flow Cytometry Supervisor\r\n&gt; IMPATH Laboratories, Los Angeles CA\r\n&gt; Wednesday, August 19, 1998\r\n&gt; 3:45-5:45pm\r\n&gt; Charleston Place\r\n&gt; Charleston, South Carolina\r\n&gt; Sponsored by Coulter Corporation\r\n\r\n----------------------------------------------------------------------------\r\n----\r\nThis message was posted on the Purdue Cytometry Discussion Group by\r\n\r\n--------------------------------------------------------------------------------\r\n\r\nNext message: Newsom, Brian S.: \"RE: Murine erythrocytes\"\r\nPrevious message: Artur Summerfield: \"Re: Annexin V\"\r\nMessages sorted by: [ date ] [ thread ] [ subject ] [ author ]\r\n[ attachment ]\r\n", "gilded": 0, "created_utc": "1211821395", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Very c l e a n. Me likey", "gilded": 0, "created_utc": "1211851558", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "I'm shocked!! All this time I thought Bush was doing a heck of a job protecting the country from evil... \n\nWhat will become of us?\n\n/sarcasm\n\nI really hope this goes somewhere... I hope these bastards all end up in jail F O R E V E R.. While we are at it, throw in the war profiteers, the wall street crooks, the oil crooks, the lobbyists, the MEDIA for sedating us with bullshit all this time.. I am sure there are many more but we can start with the Bush Administration.. \n\nMy conspiracy side tells me, what if this is part of the plan.. We shall see how this plays out.", "gilded": 0, "created_utc": "1211942995", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "I got to G O O D B Y E R E \n\nand thought holy wow! GOODBYE REDDIT? That's amazing.", "gilded": 0, "created_utc": "1212008267", "subreddit": "reddit.com", "score": 6, "controversiality": 0}
{"body": "There is. Choose model 2 (second from left) and then press X A B B Y Y R1 X X Z UP DOWN UP UP... she should then jump, don't get it wrong though or it says \"finish him\" ...", "gilded": 0, "created_utc": "1212012400", "subreddit": "reddit.com", "score": 39, "controversiality": 0}
{"body": "P h i l o s o m a t i k a | 100% Psychedelic Trance.\n Turn on, Tune in and Start Coding.\n\nhttp://www.shoutcast.com/sbin/shoutcast-playlist.pls?rn=1712&amp;file=filename.pls", "gilded": 0, "created_utc": "1212132363", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "yes, I have too much time on my hands, yes I have an agenda. \n\nI m n u r mind illuminating u r thoughts\n\nlolbrainz\n", "gilded": 0, "created_utc": "1212183235", "subreddit": "programming", "score": -2, "controversiality": 0}
{"body": "bush/cheney involvement:\n\nbush:\nhttp://www.youtube.com/watch?v=SN3JU3i7Sk0\n\ncheney: \nhttp://www.youtube.com/watch?v=bDfdOwt2v3Y\n\npeople piloted the planes, still alive:\nhttp://news.bbc.co.uk/1/hi/world/middle_east/1559151.stm\n\nosama bin laden did not admit to it:\n\"I have already said that I am not involved in the 11 September attacks in the United States.\"\nhttp://www.public-action.com/911/oblintrv.html\n\nThe FBI claims there is no hard evidence linking him to the attacks and does not have him on their wanted list for the 9/11 attacks.  I guess the FBI are conspiracy nut cases and fringe, loose-canon lunatics too.\n\nThe 1993 attacks were by Kuwaitis...\n\nYour Efff Aye See Teee (F A C T) (http://en.wikipedia.org/wiki/Fact)  based comments appreciated ... hopefully C I T E D (http://en.wikipedia.org/wiki/Citation)\n\nAnyway, moving on:\nlife expectancy:\nThat's just infant mortality and natal care taking a toll.  Now that that is figured out, life expectancy is poised to go down.  Furthermore, if you remove infant mortality from the fray, it has been going down for a while.  You can look at the bright side of things ... but then, in the end, it's nice to stop lying to yourself.\n\nEnergy:\nMcCain is a big supporter of nuclear energy and MARKET based control of VOLUNTARY reduction with incentives and tax breaks.  AKA, he doesn't want it to be controlled by the government.  He is a big fan of the soft hand of the government giving big payouts to people that are sensible, as opposed to a hard hand environmental policy.\n\nEither soft or hard will happen ... he is strongly pushing for soft so that hard will not.  He is the exact opposite of what you say.  You just spin it more then a washing machine.\n\nBut it's been well known for a while that reality is has a strongly leftist bias which is why the US's hatred of the \"liberal\" media has resulted in it being the \"most entertained and least informed\" (kennedy) people ever and is one of the primary sources for the rise of the internet and sites like the one you are on now, along with the downfall of the US empire.", "gilded": 0, "created_utc": "1212222819", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "N U M B N U T", "gilded": 0, "created_utc": "1212246987", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "A vector (implemented as an array), usually, is fixed size, while a list is much more flexible.\n\nAlso, access time differences.\n\nI don't know how Rlisp handles it, but with lists, I can have a list as, say:\n\n    (setf total '(a b c d e f))\nthen I do\n\n    (setf tail (cdr total))\nand when I change tail, total changes also.", "gilded": 0, "created_utc": "1212260214", "subreddit": "programming", "score": 1, "controversiality": 0}
