{"body": "First time they knocked it over - noooo\n\nSecond time - n o o o o o o o o o o o o o o o o o", "gilded": 0, "created_utc": "1230825039", "subreddit": "science", "score": 52, "controversiality": 0}
{"body": "Long answer is s o m e b o d y   l i e d   t o   y o u . ", "gilded": 0, "created_utc": "1230837867", "subreddit": "science", "score": 10, "controversiality": 0}
{"body": "**P R O F I T**", "gilded": 0, "created_utc": "1230888671", "subreddit": "Marijuana", "score": 1, "controversiality": 0}
{"body": "Perhaps now we are even, as that makes little sense to me.\n\n&lt;tl;dwdetwarib&gt;\n\nTo long ; did'nt read .... d e t w a r i b ? \n\n\"do energetic thinking witches always reason in babble?\" \n\nPossibly", "gilded": 0, "created_utc": "1231051797", "subreddit": "Freethought", "score": 1, "controversiality": 0}
{"body": "M O N O P O L Y. Adam Smith said a monopoly will charge the highest possible price and deliver the least possible value.\nhttp://www.adamsmith.org/smith/quotes.htm#jump8", "gilded": 0, "created_utc": "1231103160", "subreddit": "technology", "score": -1, "controversiality": 0}
{"body": "You have to buy food because white man decided that everything can and should be privately owned FOR PROFIT instead of communally developed for the common good and the general welfare.\n\nThe American constitution and Declaration of Independence give great lip service to these noble concepts, but the truth is that private property ownership based societies do not actually practice what they preach.  When it comes to taking care of each other, countries like the USA fail miserably.\n\nFor instance, the USA is the only industrialized nation on EARTH where you can be divested of everything you have worked for all your life, including a home and the means by which to continue EXISTING merely because you became ill.  At least other industrialized societies provide basic health care for their citizens.  Given the horrid misuses of tax dollars, you would think SOME of it could be used to provide for the people ON WHOSE BACKS THESE TAXES ARE EXACTED.\n\nIn fact, throughout most of human history, societies were not based on capitalistic private ownership models.  Take a world history and anthropological course of study to learn more about this.\n\nOur consumerist, profit drive society fails because it excludes people from the ability to pursue and maintain life liberty and happiness.\n\nAs we will all find out during this coming year, anyone whose bank account doesn't end in \"illion\" is in for a very rude awakening.  \n\nMoreover, your post suggests that you feel personally attacked, at least to the point where you felt compelled to share information about your charitable donations.  However, that is quite beside the point, so I won't digress to take up the point.\n\nThe fact is, that until and unless human society recognizes that we are each our own and each other's responsibility, understanding as simple a concept as that human beings must have certain needs met in order merely to survive will never translate into any widespread policies that actually make a difference.  That is because if you truly believe that it's OK to deprive someone of food because they don't own enough property to \"deserve\" it (i.e., can't buy it) then all the charitable organizations in the world formulated to \"assist the poor\" are for naught because they are based on the concept that they are doing something charitable, instead of responding to a basic human R I G H T.  Humanity needs a complete change of attitude.  That will require relearning how to live and share our limited world with our fellow humans.\n\nIt is possible that the coming economic collapse will finally kill the middle class.  When that happens and there no longer is any distinction between the poor and the former middle class, then, you will start to see great numbers of people learn to share and do not only for themselves, but for each other, for there will be no survival without it.\n\nThat in turn will prompt a widespread recognition that food, shelter, water, health care, are human rights.  If these are not, then there simply aren't any such things.\n\nBTW TBMonkey seems an apt handle for you.  Quite.", "gilded": 0, "created_utc": "1231136043", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "They're after his E S S E N C E!\n\nHe's lost purity of Essence!", "gilded": 0, "created_utc": "1231191457", "subreddit": "technology", "score": 5, "controversiality": 0}
{"body": "actually two. U n i c o r n\n\ncorn using the obvious\n\ncor(first n)", "gilded": 0, "created_utc": "1231215448", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I was thinking C U N T but that is just me.  I don't think about cock all that much.", "gilded": 0, "created_utc": "1231277198", "subreddit": "sports", "score": 8, "controversiality": 0}
{"body": "Fuck Obama...\n\nI voted for him on a false sense of hope and 'change'...now a token comment after hundreds of civilians are dead;  Wondering how much blood he will have to give at the alter of AIPAC...  \n\nF U C K H I M", "gilded": 0, "created_utc": "1231290567", "subreddit": "politics", "score": -7, "controversiality": 0}
{"body": "\t  m     h       d\n\t\n\tR E D D I T . C O M\n\t\n\te m o o d r   o w e\n\t\n\ta e w w e o   m n m\n\t\n\td s n n   l   m v e\n\t\n\t  . v v   l   e o .\n\t\n\t    o o   s   n t \n\t\n\t    t t   .   t e \n\t\n\t    e e       .\n\t\n\t    . .", "gilded": 0, "created_utc": "1231306190", "subreddit": "AskReddit", "score": 19, "controversiality": 0}
{"body": "But actually- it's his 1st time- so maybe he'd be better off putting [mandelay](http://www.amazon.com/Mandelay-Climax-Control-Gel-Oz/dp/B000MNQQJ4) in the condom.**\n\n**shellacct1- I'm totally kidding about the mandelay. Do not put mandelay in the condom.\n\nJust go S L O W and try to relax. Good luck, my dear, and congrats!! ;-)", "gilded": 0, "created_utc": "1231313223", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "\nfor c in r e d d i t; do echo -n $(look $c | head -$(( $(date '+%N') % $(look $c | wc -l))) | tail -1) \" \"; done\n\n\nFIRST Result!\n\nrascal  editorial  decision's  dictatorship's  interrogatives  terrorist's  \n", "gilded": 0, "created_utc": "1231370363", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "slotar and digg, sitting in a tree, f u c k i n g.", "gilded": 0, "created_utc": "1231378205", "subreddit": "gaming", "score": 13, "controversiality": 0}
{"body": "I love it. Substantial gesture? WTF? Israeli politicians always wanted to get rid of the Gaza headache, and Sharon disengaged to \"consolidate\" bigger colonies and build a  M A S S I V E  W A L L  running through Palestinian land. \n\nVery practical, but the press went there en masse to film those poor people being evacualted from their fancy homes (for shitloads of cash).\n", "gilded": 0, "created_utc": "1231416649", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "he should be sworn in on the constitution, its ridiculous that the bible is even in a court. When i went to court a few days ago they made me hold the bible with my left hand, i said i don't believe in that book. And the judge got very angry. I don't understand why, it seems to directly go against what the founding fathers wrote, separation of church and state. I believe as much in the bible as i do in the book of scientology, its fiction. Maybe not to you.. but to people who think with their brain and not their heart it is the only outcome, F I C T I O N. I also dont believe in magic, aka creationism. ROFL.. anyway\n\nI dont think the bible should even be allowed in public places, especially government buildings. Swearing on the bible is like swearing that you will uphold the truths that are self evident in the bible, rather than the constitution.\n\nWho else thinks that the bible should not be used for anyone, ANYONE, to be sworn in during ANY COURT or inauguration?", "gilded": 0, "created_utc": "1231427438", "subreddit": "obama", "score": -4, "controversiality": 0}
{"body": "Red and cyan are complementary colors and do indeed average to gray. This may seem \"weird\" to us because of human color perception, but for most practical purposes, this is the correct way to mix colors.\n\nSuppose you have a bunch of single-pixel columns alternating between cyan and red. At a subpixel scale, you'd have this: (Where an \"X\" means the subpixel is completely on, and a blank means it's off)\n\n    R G B R G B R G B R G B R G B R G B R G B R G B \n    X       X X X       X X X       X X X       X X\n\nNow lets chop off the left and right sides, and see what the middle looks like:\n\n    G B R G B R G B R G B R G B R G B R G B R \n          X X X       X X X       X X X      \n\nIf we look at these as \"GBR\" pixels (the \"RGB\" order is, after all, arbitrary), we can see that we have alternating *black* and *white* columns. In fact, that's exactly what it looks like; here's a [demo](http://preview.tinyurl.com/a7vrpc) using javascript.\n\nOne common use of averaging is to downscale an image. If you have an image which appears to contain single-pixel black and white stripes, and you scale it down by 50%, you would expect the stripes to turn gray (the average of black and white). For the image above, averaging the RGB values *will* give you this result. Averaging the values as HSV will give you either yellow-green (if red has hue=0) or lavender (if red has hue=360). Either way, it won't look right.", "gilded": 0, "created_utc": "1231446559", "subreddit": "programming", "score": 3, "controversiality": 0}
{"body": "So will someone tell me what happens if Israel ceases hostile action immediately and Hamas continues on its avowed goal of destroying the state of Israel? Will the outrage be the same if Israeli children are the ones being killed? No one is going to tell Israel to do what they would consider not defending themselves for a very simple reason. H O L O C A U S T. It probably does really terrible things to your negotiation skills when the world stands by while your nearly exterminated from the face of the planet,so no one's going to tell them what to do in terms of their defense because no high ranking official wants to be laughed at as if he were an extraordinarily simple child.", "gilded": 0, "created_utc": "1231452206", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "&gt;\"screen of screens\" (master screen session with multiple ssh sessions, each connected to a screen session on that system\n\nC-a a a a a a d? Quite a key combo.", "gilded": 0, "created_utc": "1231458618", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "Wow... can you say, N E R V O U S!\n\nIt looks like he's about to swallow his tongue the whole way through.\n\nI can't believe Bill allowed this guy to take the reigns.  He's got about as much charisma as GWB.", "gilded": 0, "created_utc": "1231524424", "subreddit": "apple", "score": 2, "controversiality": 0}
{"body": "S u p e r B o w l. Nine Letters.", "gilded": 0, "created_utc": "1231685814", "subreddit": "atheism", "score": 25, "controversiality": 0}
{"body": "S P R B W L:  Six Consonants.", "gilded": 0, "created_utc": "1231687430", "subreddit": "atheism", "score": 24, "controversiality": 0}
{"body": "Oh P U L E A S E!!!", "gilded": 0, "created_utc": "1231696932", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "**I T  I S  A  F U C K I N G  J O K E  Y O U  S T U P I D  M O T H E R F U C K E R S !**", "gilded": 0, "created_utc": "1231711532", "subreddit": "gaming", "score": -2, "controversiality": 0}
{"body": "school? what is this s c h o o l you speak of?", "gilded": 0, "created_utc": "1231712611", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "I heard a rumor once that a nightstick could be used **D E F E N S I V E L Y**.", "gilded": 0, "created_utc": "1231771162", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "If you could email the wallet back, i bet more young people would have been honest. Many young people are unaware of what a P O S T O F F I C E is or where to find one.", "gilded": 0, "created_utc": "1231903262", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "Does anyone else find it r e a l l y slow?\n\nI mean, I know that flickering all those bitmaps around is probably expensive, but...\n\n", "gilded": 0, "created_utc": "1232051399", "subreddit": "linux", "score": 0, "controversiality": 0}
{"body": "mortal kombat...2..i think?\n\nA B A C A B B!", "gilded": 0, "created_utc": "1232056222", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "C D E D B D FEET? U R CORRECT. M R DUCKS.", "gilded": 0, "created_utc": "1232065141", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Transposing doesn't really have anything to do with moving chords by fifths. If I wanted to transpose the progression C F G C to the key of D, I'd move each chord up two half-steps (D G A D).", "gilded": 0, "created_utc": "1232134238", "subreddit": "programming", "score": 0, "controversiality": 0}
{"body": "&gt; You would need a with-md5-round macro in Factor that looked similar to the original (ABCD). That would at least be similar in spirit to the md5.lisp example, wouldn't it?\n\nSure, I could do that, but why? I prefer splitting code up into short functions.\n\n    MACRO:: with-md5-round ( ops func -- )\n        ops [\n            [| x a b c d k s i |\n                a [\n                    b get c get d get func call w+\n                    k x nth-unsafe w+\n                    i T w+\n                    s bitroll-32\n                    b get w+\n                ] change\n            ] compose\n        ] map '[ _ cleave ] ;\n\n&gt; Your own with-md5-round rewrite is a stunning example of how difficult Factor's macro system is to use.\n\nWhy?\n\n&gt; What would it take for you to say Factor's macros are hard to use?\n\nNothing, because you're wrong. Your claims have one grain of truth, and that is that CL programmers use macros more often than Factor programmers. However the rest is just hyperbole. Since you don't use Factor, I don't think you're in any position to claim that something is hard or easy in that language.\n\nAt this stage I have to admit that I suspect you're just trolling. You've shifted the goal-posts so many times and failed to produce a single shred of evidence. I guess you feel you're doing a good service to the Common Lisp community by spreading the good word, but instead I think you'd do better by following Edi Weitz's example and writing some code (how about fixing SBCL's windows port, or making a tree shaker than can produce small binaries?).", "gilded": 0, "created_utc": "1232135111", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "What shall we do with the drunken sailor. The beginning should sound ok:\n\na a a a a a a d f a g g g g g g g c e g...\n\nThe rest could sound weird because of the jumps.\n", "gilded": 0, "created_utc": "1232151367", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "Mexico? Mexico.         \nMexico.            \nPolicia de M E X I C O.", "gilded": 0, "created_utc": "1232193847", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "*W H O O S H*", "gilded": 0, "created_utc": "1232222597", "subreddit": "programming", "score": 7, "controversiality": 0}
{"body": "Here is my theory:  The most frequently used letters (in English) need to be on the home row, the second most frequent on the top row, and the least on the bottom:\n\nl c u m w  f g y p b\n\ne t a o i  n s h r d\n\nv j k ? ,  . \" x q z\n\n      &lt;space&gt;\n\nCuriously, punctuation is very frequently used and the &lt;space&gt; key is the most used in the English language.\n\nIt makes sense to me that the most frequently used keys be under the most used digit, the forefinger and the thumb.  So, e should be under the right forefinger, and t should be to the left.  Since the dexterity of most peoples third and pinkie fingers are terrible, the next most common should be under the first two digits of the other hand, so now the middle row looks like this:\n\ns n a o i  t e h r d\n\nDvorak looks like this:\n\na o e u i  d h t n s\n\nSomeone needs to develop a computer program that statistically analyzes the 100,000 most common English words and juxtaposes frequency of usage over the keyboard...", "gilded": 0, "created_utc": "1232296630", "subreddit": "programming", "score": 9, "controversiality": 0}
{"body": "I tried that with a perl script I wrote, and it's really hard. What is a genotype when it comes to a layout? What is a gene?\n\nThe hard part is when you realise that you can't have more than one letter, and they all have to be there once only. eg a layout with two \"e\"s might be more successful than one with a z or q.\n\nThat was something I struggled with when I tried it. It's just faster to randomly swap letters and test.\n\nupdate: This http://seventwoseven.com/2008/06/overnight.html was the best I ever managed:\n\nz l g m y  f d o p v\n\nr n t h s  i u a e c\n\n; . w ' b  x k , q j", "gilded": 0, "created_utc": "1232316792", "subreddit": "programming", "score": 6, "controversiality": 0}
{"body": "fuck fuck fuck ... this is just too A W E S O M E ! 1 1", "gilded": 0, "created_utc": "1232371754", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "OMG! This retarded advise not to wear jeans! Believe me E V E R Y B O D Y wears jeans in Europe, really. Jeans are great for traveling in Europe. Ridiculous advice. Moronic.\n\nI'd like to add some suggestions: stay away from following outfit: \n\nHawaii shirts with bright patterns, sandals on top of knee high socks, hard jungle hat and just below the armpit shorts, add BIG shiny camera on your chest. Feel free to add bright red \"ouchy\" tan.", "gilded": 0, "created_utc": "1232408462", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "b b b b b b bbb bbb but i had always been told the rich got richer?!", "gilded": 0, "created_utc": "1232409532", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Oh, re just reading them straight off the Voronoi diagram: \r\n\r\nPlacing the nodes W X Y Z on a line,\r\n\r\nW -|- X -|- Y -|- Z \r\n\r\nW, one of three nearest neighbors of Y does not share a Delaunay edge or Voronoi cell face with Y.\r\n\r\nHence, you have to traverse outward, and cannot just check your neighbors, so you need a proof that I don't have handy the number of neighbors incorporated in the traversal of a given node is O(log n) on average. \r\n\r\nOn the other hand, I do have such appropriate known bounds for such on deletion, etc. yielding the appropriate asymptotics for the overall solution.", "gilded": 0, "created_utc": "1232479869", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "yeh, switching back and forth all the time, its B A N A N A S!!!", "gilded": 0, "created_utc": "1232489821", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "The alphabet says different: ... **Q** R S T U V W **X** ...", "gilded": 0, "created_utc": "1232520792", "subreddit": "comics", "score": 13, "controversiality": 0}
{"body": "No, the alphabet agrees.  Ever do a string comparison?\n\n**F** G H I J K **L**", "gilded": 0, "created_utc": "1232522588", "subreddit": "comics", "score": 7, "controversiality": 0}
{"body": "via proxies and other users:\n\n&gt;B S R O C K A E U (F - CONFIRMED) **T**   \n\n**removed duplicate c, keep in mind any of the letters may repeat more than once**\n\nedit: fuck it, I'm bored, someone else take over :P. (9 comments as of this writing)\n\nedit2: how can I say no now?\n\nedit3: got all the letters I think, solve away people\n\n\n**ABUSER COCK** &lt;-- wrong, but honorable mention\n\n\n**Giving up @ 26 comments, FYI it seems to let you guess without using up guesses if you don't input your reddit username**\n\n\n**Congrats, dumbasshit, word was STARBUCKS COFFEE**\n\n", "gilded": 0, "created_utc": "1232567941", "subreddit": "entertainment", "score": 6, "controversiality": 0}
{"body": "&gt; It's just so wonderfully... mathematical.\n\nFor what it's worth, I find usual mathematical expressions difficult to decode as well. I think a big part of it is that terseness is so valued in Haskell culture, causing authors to cram as much as they can into a line instead of spreading it out a bit. Experienced Haskellers can read it, no doubt, but it's awfully hard to find code that is both high-quality and accessible to newbies.\n\nFor example, a function from XMonad:\n\n    ensureTags :: Eq i =&gt; l -&gt; [i] -&gt; StackSet i l a s sd -&gt; StackSet i l a s sd\n    ensureTags l allt st = et allt (map tag (workspaces st) \\\\ allt) st\n        where et [] _ s = s\n              et (i:is) rn s | i `tagMember` s = et is rn s\n              et (i:is) [] s = et is [] (s { hidden = Workspace i l Nothing : hidden s })\n              et (i:is) (r:rs) s = et is rs $ renameTag r i s", "gilded": 0, "created_utc": "1232594740", "subreddit": "programming", "score": 2, "controversiality": 0}
{"body": "Wow, I just felt like I was in the movie \"Boiler Room\".\n\nAnyone else receive calls recently regarding automobile extended warranties?\n\nIt starts out something like:\n\"This is your second notice that your current automobile is out of warranty, stay on the line to talk to a warranty specialist\".  (caller id: 909-650-9175)\n\nAs it turns out my Benz did actually just come off its extended warranty, so I was actually somewhat interested in hearing more (but I didn't recall ever getting a first notice).  I initially thought that it might have been Mercedes offering to sell me more extended warranty.\n\nWow, no such luck. After giving someone my car information \"for confirmation\" (they most likely didn't have it at all, and just wanted to see how much they should charge me), I started talking to \"Gale\" their \"warranty specialist\".  She starts in on this total Boiler Room style pressure sale, on how they have this super limited time offer, rushes through the coverage (which initially sounded pretty lame), and then tried to grab my credit card number to process the $300 down payment.\n\nHold the phone lady...\n\nMe - \"how about you send me the details, I will review them, and then I will call you back\"\nG - \"this is a limited time offer sir, we would need to get it processed today, I can answer your questions right now, I have the brochure in front of me\" (or something to that effect)\nMe - \"can you fax me the brochure?\"\nG - \"No, &lt;now started to get really aggressive&gt; but you can check on the website\"\nMe - \"okay, give me the web address\"\nG - \"&lt;really sounding like a biotch at this point&gt; www.thechoice.net\nMe - \"sorry, I don't think I got that right (I input the website and get 'a fine source for Sri Lankin Gems')\"\nG - \"&lt;speaking slower now, like I am an idiot&gt; w w w. t h e c h o i c e . n e t.\nMe - \"lady, this is a web site selling Sri Lankin Gems.\nG - \"www.the \"hyphen\" choice.net\"\nMe - \"minor detail, fine got it, how about I take a look at the site and give you a call back in 10 minutes\"\nG - \"&lt;all flustered like I just asked her to sell her soul to the devil or something&gt; well, that's typically not how this works, but okay, just make sure that you talk to me when you call back\"\n\nThe website itself was an instant red flag... just open it to see, but I let it slide for now.\n\nI read the information and came to the conclusion that they could probably weasel their way out of any claim payments. I also notice that there is a requirement to add some sort of \"The Choice\" radiator fluid, in order for the warranty to be valid... and change the oil every 4000miles (about twice as often as required for my car). Say what?\n\nSo I call back to be courteous and asks to talk to Gale, to tell her that I'm not interested in the warranty, but some dude answers the phone and totally intercepts, and tries to steal the sale.  I talked to him about how ridiculous it was that you need to change the oil every 4000 miles as indicated on the website.  He puts me on hold for a minute (and probably just does a few chair rotations), and comes back online saying that this was an old policy and that it is now ~10,000km or six months.  At this point I was pretty sure they would say absolutely anything to get my credit card number.  I decided to just play it polite, thank them, but no thanks... but buddy just wouldn't quit... finally after realizing there was no way he was going to close the deal, he proceeds to chuckle.  At which point I get a little pissed and ask him if he thinks I am an idiot just because I didn't want to partake in their ridiculous warranty program.  Douchebag responds \"well, I have on record that we called you already about this offer, so there is nothing I can do for you anyways... click\".\n\nWTF just happened there?\n\nDoing a little more research, it has been confirmed to be a total and utter scam:\n\nhttp://www.canada.com/northshorenews/news/rev/story.html?id=24e7d506-82ea-4e1b-a70a-dc0e5e36b06b (The Choice is called out by name here)\n\nhttp://blog.callercomplaints.com/2008/11/car-warranty-scams-out-of-control.html\n\nI have no idea how they got my number, but if they are just randomly cold calling people, and you receive the call, I would actually encourage each and every one of you to eff with them as much as possible.  Tell them you have expensive automobiles that just came off warranties and really string them along.  Then when you have finished giving them that bogus card number, and they start licking their chops over the commission, say \"PROCESS THAT BIOTCH!\".\n\nThese people have no shame.", "gilded": 0, "created_utc": "1232736024", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "If using a dictionary like in /usr/share/dict it would probably get better results, except when people use names or words they invented.\r\n\r\nI tried \"PLAY\" and the order it guessed was:\r\nE S A A R L L F C B P P N Y\r\n\r\nAt least half of those were non-useful guesses (PLAP doesn't exist, dumbass). Someone should build a decision tree using a dictionary, and I'm certain it'd be a lot more intelligent.\r\n\r\nEdit: but I guess it's a fine proof of concept of the algorithm he's using.", "gilded": 0, "created_utc": "1232836607", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "I won with C U N T :D", "gilded": 0, "created_utc": "1232840959", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "W U F T ! H C K E U ?", "gilded": 0, "created_utc": "1232951167", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Totally.  What are we doing joking about a pathetic sad poor BLIND dog???  The dog is B L I N D and we are all going to hell for making jokes.  And in hell, we will all be BLIND and left to starve in a kitchen where all we can hear are people laughing and all we can smell is a strange sweet 'cake like' smell coming from somewhere just ahead of us...yet...NEVER to be reached....EEEVVVEEEERRRRR... NO MATTER HOW HUNGRY WE ARE.... oh yeah and we will be MUTE so we can't simply ask \"please someone give me some of that cake-like sweet smelling food from somewhere out there in this room...I am so so soooooooo hungry\".......  ", "gilded": 0, "created_utc": "1233052605", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "P U L E A S E!!  No more fat women, and not more BBW.  We are all ill and some of us may not make it.", "gilded": 0, "created_utc": "1233077338", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Steal $100 from a banker, get the book thrown at you, gov't steals trillions from you and gives to bankers - let freedom reign! woohoo motherfucker - A M E R I C A!", "gilded": 0, "created_utc": "1233100428", "subreddit": "worldnews", "score": 66, "controversiality": 0}
{"body": "aaaaa Jj uu ss tttt yyy ooooo rRrr p iii c l ee dd kk n g w t f ", "gilded": 0, "created_utc": "1233110841", "subreddit": "funny", "score": -5, "controversiality": 0}
{"body": "I am dumbfounded by the down vote. Are you a thin-skinned graphic designer? Or are we only suppose to make captcha jokes here? In case anyone thinks I am off my rocker in my statement, look closely, you can see the letters G o o g l e underneath the swirling lines.  Look at a Jackson Pollock \"drip\" [painting](http://2modern.blogs.com/photos/uncategorized/jackson_pollock.jpg) he is famous for. And Jan 28 was his birthday.  \n\nAs we've all seen, Google tries to honor certain famous people's birthday by modifying the Google name temporarily.  You've probably seen it done with Van Gogh.\n\n\n", "gilded": 0, "created_utc": "1233233111", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "And now picture all of them waving and nodding to people just like they wanted.  Once you can break free from this nightmarish hell of a protocol break, come back and renounce your careless dismissal of P R O T O C O L.  \n\n(Why does it suddenly read like a retarded 70s programming language when capitalized?)", "gilded": 0, "created_utc": "1233250808", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "A B C D E F G, Eric the half a bee.", "gilded": 0, "created_utc": "1233330997", "subreddit": "science", "score": 10, "controversiality": 0}
{"body": "Let me spell this out A D B L O C K.\n\nI have never used adblock until this exact ad truely pushed me to it. Now the only time I ever see it is when some dillhole on reddit has to post it again!", "gilded": 0, "created_utc": "1233339744", "subreddit": "pics", "score": 489, "controversiality": 0}
{"body": "I can't install A D B L O C K On my work machine and it shows up on so many pages it's mystifying.", "gilded": 0, "created_utc": "1233348882", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "&gt; Let me spell this out A D B L O C K.\n\nWait, how do you spell AdBlock Plus?  Can you spell it out for me please?", "gilded": 0, "created_utc": "1233362888", "subreddit": "pics", "score": 1, "controversiality": 0}
