{"body": "Still not answered my questions. Whats the matter?\n\n&gt;Unfortunately, I read stuff, and then I use my own brain to think about what I read.\n\nI wonder what \"stuff\" you have read. Care to enlighten us? \n\n--\n\n\nNot all vesgitial appendages/structures have uses: http://en.wikipedia.org/wiki/Human_vestigiality\n\n\nThis is because they are the result of evolution. Maybe you ought to try disproving it, I mean there is a cash bonus for the Nobel prize..\n\n&gt;But you can teach physics, electronics, and other real sciences from 50 year old textbooks and absolutely nothing would be incorrect.\n\n\nOK, I'm going to take a wild guess that either you've been in a coma this past century or you're purposely twisting the truth. Physics has changed RADICALLY when the introduction of some of the advances in quantum theory. Science changes *ALL* the time. Any **ANY** given moment. Science's position is - this is the best explanation we can come up with. After evolution was proposed - get this - N O N E of the observed data w.r.t. species, genes, chromosomes, what have you has E V E R disproved evolution. Not even close.\n\n\n&gt;tell me specific examples, what useful mutations have been observed, and how does new information make into DNA? \n\nIts not my job to educate you. Why dont you read a book and come here debating specific points in those books which are taught in graduate schools? Since I'm in a nice mood : Go read all the books cited here. http://en.wikipedia.org/wiki/Mutation\n\n\n&gt;Well, these would be devolution, and I am not arguing against that. I have never heard anybody say that still born babies are examples that prove evolution, I am starting to question what you think evolution is.\n\nI fail to see where I assert this. I asked you to explain this. You can read right? I mean please, let me assume you at least have a college degree. I don't want to be stuck with a religious nutbag.\n\n\n&gt;Something is a fact because anyone who had adequate laboratory equipment can do an experiment that proves the fact is true. \n\n\nYou have no clue about how science works and it looks like you're 100% illiterate when it comes to science and discoveries. \n\n\nHow do we know the suns temperature, how do we know that our universe is expanding, how do we know dinosaurs existed ( i mean really.. i never saw them in a lab!), how did we know electrons existed **BEFORE** we even invented the electron microscope...  I cant believe I'm typing this shit here.. JUST WOW..\n\n\n\n", "gilded": 0, "created_utc": "1217819254", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Guys out there in police land... r e l a x and think, we know its a tough job but you have people trying to defend you now that are making matters worse... its o k to r e l a x.  Here is a blanket... CALM DOWN.", "gilded": 0, "created_utc": "1217960707", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "And both units are used, when calibrating a...\n(let's all say it together...)\n\nF L U X  C A P A C I T O R .", "gilded": 0, "created_utc": "1218010165", "subreddit": "science", "score": 32, "controversiality": 0}
{"body": "John McCain is so old that if he's elected, he'll make sure that penny candy will once again be available on Eastern Airlines flights to Siam... \"them penny candy people just don't get it!!!\"\n\n\"M A T L O C K!\"\n\n(Also, in  the new McCain administration, flat-top haircuts and hula hoops will be \"all the rage\" for hep cats... if you know what's good for you.)", "gilded": 0, "created_utc": "1218031774", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "As a dyslexic with great reading skills, but terrible handwriting abilities, I'd suggest its how I read that causes the problem with spelling. The text above is remarkably readable to me, but give me words in poor handwriting, a stupid font or s p a c e d o u t l e t t e r s, and I can't make head nor tail of it.\nI'd guess this is because I read the word as a whole not the letters, which means I'm not being given the same constant repetition of letters and where they go that others get. I quite frequently put letters in the wrong space or use the wrong letters entirely because I have no real idea what it might contain. I also occasionally have to look up the definitions of words that pop-up in spell check because I can't tell which might be the right one.\n\n\nI think saying its a lack of discipline and memory is a complete disservice as I don't think memory has anything to do with it. I deliberately remember quite a few words that I use frequently and  keep getting stuck on, but there are loads of words I just know, which is how I assume everyone else spells. I'd say it's more that dyslexics just have less words they 'know' without thinking about then most people, which I'd guess is largely because they don't pick up the spelling of words every time they read them. ", "gilded": 0, "created_utc": "1218046223", "subreddit": "programming", "score": 6, "controversiality": 0}
{"body": "M A T L O C K ! ! !", "gilded": 0, "created_utc": "1218047839", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "This is true...in no way is this filter perfect.  If a user wanted to bypass such a system, they could do so easily.  Fuck would be f-u-c-k or f u c k or whatever.  To say it's worthless is a bit harsh, though.  The type of filter that would be able to solve the problems you're talking about would be magnitudes higher in complexity (if such an algorithm is even possible).  I think the simplicity of this filter is a strength, not a weakness.  Imagine having to deal with problems a heuristical algorithm would almost certainly create.\n\nOne more thing to add:  Having all \"bad words\" in a simple list is not such a bad thing, assuming the list is easily extended.  You avoid false positives with the heuristical approach and any word that you come across that you think is \"bad\" can just be added to the list.\n\nPerhaps this filter along with some function to allow users to report words they think are offensive?", "gilded": 0, "created_utc": "1218100861", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "http://blog.360.yahoo.com/blog-HQckkRgydLTpvnX8LtIVNrEP0Q--?cq=1\nFund been in operation?  Front Matter Preface The McGraw Hill Companies, 2001 P R E F A C E We wrote the first edition of this textbook more than ten years ago. The intervening years have been ...", "gilded": 0, "created_utc": "1218187160", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "d u p l i c a t e", "gilded": 0, "created_utc": "1218350093", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "WHAT THE FRIGG?!  This kid was doing DRUGS.  \nW H I L E  D R I V I N G!!!!\n\nThey should have pulled his pants down (probably were already down to his butt crack anyway), slammed a boot in so far the kid turned into goatse without using hands.  Then, they should have tasered every other 'sensitive' area exposed by said pants dropping.\n\nI'm sick and tired of you liberals ruining our country with your drugs, sexual deviation, and communism.  You guys just want everyone to be assigned a job and a place to live, and assigned marriages, etc.  You want someone else to run your lives!  But I wsay HELL NO, THIS IS AMERICA.  GOD\"S COUNTRY!\n\nI hope this kids ends up in prison for life, eating cocmeat sandwhiches.  WE DON\"T USE DRUGS IN AMERICA, LIB.", "gilded": 0, "created_utc": "1218392996", "subreddit": "politics", "score": -18, "controversiality": 0}
{"body": "W E I R D ! ! !!", "gilded": 0, "created_utc": "1218523686", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "When reddit sees h t t p : / / without spaces it tries to make that a link, and I wanted to avoid that.", "gilded": 0, "created_utc": "1218820058", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "cha cha. good post. just want to tell you that wtf? hell yes i agree with you and what is with the toot toot noob train all about the _M I C R O S O F T  E X P R E S S  T O   S U C C E S S_ ?\n\nSOfties are such total spineless whores connected to the pimp Balmer and they don't even know it. It is like prostitutes, work for the pimp and happy to be predatory to the johns (general public).\n\nI _really_ friggin hate that company and their monopoly and anti-trust crime is unacceptable. But especially in the USA, there is a generation of sociopath workers who literally do not know what makes the world go around or that prosperity comes from diverse producers.\n\nMS = Nazi Control Machine.\n\nand has anyone noticed how fine the monopoly thrives during the reign of Herr Bush?\n\nElect Obama. Smash Microsoft. Create Open Standards and Enforce Interoperability. To do otherwise is to be controlled by a bunch of friggin exploiters.\n\n_And what about that docx innovation.....?_ ", "gilded": 0, "created_utc": "1218822834", "subreddit": "programming", "score": -8, "controversiality": 0}
{"body": "_M I C R O S O F T E X P R E S S T O S U C C E S S_\n", "gilded": 0, "created_utc": "1218840237", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "He is the guy who rants against the rich putting their money in trusts despite the fact that he has setup two trusts himself.\n\nHe feels like he is special and that the social changes he says are needed should not apply to those like him because they are special.\n\nyou may also know him as n o a m chomsky\n\n", "gilded": 0, "created_utc": "1218843564", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "McStupid = \"S T U P I D F U C K T W I S T\"?", "gilded": 0, "created_utc": "1218917511", "subreddit": "technology", "score": 10, "controversiality": 0}
{"body": "Oh, give it a rest, all you disabled who somehow manage to be abled enough to whine us half to death. Get over yourselves. It's a M O V I E, not a call to arms. ", "gilded": 0, "created_utc": "1218937684", "subreddit": "entertainment", "score": 2, "controversiality": 0}
{"body": "__Entry 1:__\n\n    proc start {} {\n      read_word_list \"wordlist.txt\"\n      search_arrangements_of [list d o c u m e n t i n g] [list]\n    }\n\n    proc search_arrangements_of {movable_letters fixed_prefix} {\n      if {[llength $movable_letters] == 0} {\n        set arrangement $fixed_prefix\n        search_bisections_of $arrangement\n      } else {\n        foreach new_fixed_letter $movable_letters {\n          set new_fixed_prefix \\\n            [concat $fixed_prefix $new_fixed_letter]\n          set remaining_letters \\\n            [exclude $new_fixed_letter $movable_letters]\n          search_arrangements_of \\\n            $remaining_letters $new_fixed_prefix\n        }\n      }\n    }\n\n    proc search_bisections_of {letters} {\n      set num_letters [llength $letters]\n      for {set bisect_at 1} {$bisect_at &lt; $num_letters} {incr bisect_at} {\n        set left_letters  [lrange $letters 0 [expr {$bisect_at - 1}]]\n        set right_letters [lrange $letters $bisect_at end]\n        set left_word  [join $left_letters  \"\"]\n        set right_word [join $right_letters \"\"]\n        if {[is_a_word $left_word] &amp;&amp; [is_a_word $right_word]} {\n          if {![info exists ::SEEN($left_word,$right_word)]} {\n            puts \"$left_word - $right_word\"\n            set ::SEEN($left_word,$right_word) 1\n          }\n        }\n      }\n    }\n\n    proc exclude {exclude_letter letters} {\n      set remove_at [lsearch $letters $exclude_letter]\n      set letters_before [lrange $letters 0 [expr {$remove_at - 1}]]\n      set letters_after  [lrange $letters [expr {$remove_at + 1}] end]\n      return [concat $letters_before $letters_after]\n    }\n\n    proc read_word_list {filename} {\n      set file_contents [read [open $filename]]\n      set newline \"\\n\"\n      set words [split $file_contents $newline]\n      foreach word $words {\n        set lower_case_word [string tolower $word]\n        set ::IS_WORD($lower_case_word) 1\n      }\n    }\n\n    proc is_a_word {word} {\n      return [info exists ::IS_WORD($word)]\n    }\n\n    start", "gilded": 0, "created_utc": "1219045534", "subreddit": "sdcc1", "score": 1, "controversiality": 0}
{"body": "The key to successful defunctionalization is to lambda-lift the continuation closures, otherwise, getting the types that reify them right is a chore. For instance, given the type of binary trees:\n\n    type 'a btree = E | T of 'a * 'a btree * 'a btree\n\nthe DFS right fold is:\n\n    let rec foldr f g e = function\n    | E -&gt; f e\n    | T (x, l, r) -&gt; g x (foldr f g e l) (foldr f g e r)\n\n(I use two accumulating functions, so the type of `foldr` is `('a -&gt; 'b) -&gt; ('c -&gt; 'b -&gt; 'b -&gt; 'b) -&gt; 'a -&gt; 'c btree -&gt; 'b`). First, I like to convert the function to SSA form so I don't have to think (much!) what my continuations will be:\n\n    let rec foldr_ssa f g e = function\n    | E -&gt; f e\n    | T (x, l, r) -&gt;\n      let v0 = foldr_ssa f g e l in\n      let v1 = foldr_ssa f g e r in\n      let v2 = g x v0 v1 in\n      v2\n\nChanging that to CPS is, in this case, rather mechanical:\n\n    let rec foldr_cps f g e t k = match t with\n    | E -&gt; k (f e)\n    | T (x, l, r) -&gt;\n      foldr_cps f g e l (fun v0 -&gt;\n      foldr_cps f g e r (fun v1 -&gt;\n      k (g x v0 v1)))\n\nNow the key step is to lambda-lift the continuations: for each closure, find the free variables and pass them explicitly as parameters:\n\n    let rec foldr_cps' f g e t k = match t with\n    | E -&gt; k (f e)\n    | T (x, l, r) -&gt;\n      foldr_cps f g e l ((fun k x r  v0 -&gt;\n      foldr_cps f g e r ((fun k x v0 v1 -&gt;\n      k (g x v0 v1)) k x v0)) k x r)\n\nThat's it. Always remember that you start the whole process by invoking the CPS function with the identity continuation, and that must be reified, too:\n\n    type ('a, 'b) t =\n    | KIdent\n    | KTree of 'a * 'a btree * ('a, 'b) t\n    | KNode of 'a * 'b       * ('a, 'b) t\n\n    let rec foldr_cont f g e t k = match t with\n    | E           -&gt; apply_cont f g e (f e) k\n    | T (x, l, r) -&gt; foldr_cont f g e l (KTree (x, r, k))\n\n    and apply_cont f g e v = function\n    | KIdent           -&gt; v\n    | KTree  (x, r, k) -&gt; foldr_cont f g e r (KNode (x, v, k))\n    | KNode  (x, w, k) -&gt; apply_cont f g e (g x w v) k\n\nAs with your code, the fold and the apply are mutually recursive, and it's to be expected: the fold proceeds down the left spine, recording the right siblings it must visit next; apply \"reverses\" the suspended right call back to the fold. With a bit more effort, this is directly a pointer reversal algorithm, as in the paper cited in my post. But, we can do better: the type of the reified continuation can be right-factored into the variant part (either a right sibling or a folded value, together with the node's value) and a recursive right part (the next continuation in the chain); this means that a list of simpler types suffices as our defunctionalized representation:\n\n    type ('a, 'b) either = Left of 'a | Right of 'b\n\n    let rec foldr_cont f g e t k = match t with\n    | E           -&gt; apply_cont f g e (f e) k\n    | T (x, l, r) -&gt; foldr_cont f g e l ((Left r, x) :: k)\n\n    and apply_cont f g e v = function\n    | []                -&gt; v\n    | (Left  r, x) :: k -&gt; foldr_cont f g e r ((Right v, x) :: k)\n    | (Right w, x) :: k -&gt; apply_cont f g e (g x w v) k\n\nThat's it, it's only a matter of thinking like a compiler. MLton is an implementation that does exactly this sequence of steps to compile.\n\n", "gilded": 0, "created_utc": "1219119561", "subreddit": "programming", "score": 4, "controversiality": 0}
{"body": "That's very informative. It's right that the lambda-lifting step has to be done meticulously, and I must have failed on that part, then tried to \"see the big picture\" (wich eventually worked but probably requires a bigger effort).\n\nA small remark on your continuation type : KTree of 'a * ('a, 'b) t * 'a btree  seems to be a more natural type representation as I feel it models the \"spatial\" situation better : we're working on the left spine, so it is natural to place the awaiting continuation in the left hole of the tree data structure.\n\nThe first concerned clause,\n| T (x, l, r) -&gt; foldr_cont f g e l (KTree (x, r, k))\nthen becomes :\n| T (x, l, r) -&gt; foldr_cont f g e l (KTree (x, k, r))\n\nWich is a bit better imho because the inversion of the right sibling was not really justified. Reciprocally, the KTree clause of apply_cont is inversed :\n| KTree  (x, k, r) -&gt; foldr_cont f g e r (KNode (x, v, k))\n\nHaving a spatial inversion here (the continuation goes from the left hole to the right hole) makes sense, because there is a general direction change in the whole computation (from the left tree to the right tree).\n\nThe advantage of your representation is that it helps to see the factorisation better (moreover, perhaps the habit to always put the continuation in the last position comes from practice, wich I lack). However, the factorized type also reflect that direction p.o.v., in the very lucky choice of the constructor names : Left r represent a left-branch computation (and records the right branch for further use).\n\n&gt; That's it, it's only a matter of thinking like a \n&gt; compiler. MLton is an implementation that does \n&gt; exactly this sequence of steps to compile.\nYou mean, MLton actually makes recursive programs tail-recursive by doing through these steps ?\nAre there limitations, and do they have data on the performance advantage of this approach (apart from not flooding the call stack) ?\n\nThat's definitely interesting and I should have a look someday (but I shall read the article you cited first).", "gilded": 0, "created_utc": "1219145442", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "Crazy Eddie's Liquor Prices are I N S A N E.\n\n\nthis? not so much.", "gilded": 0, "created_utc": "1219156406", "subreddit": "WTF", "score": 9, "controversiality": 0}
{"body": "Most people get to vote in about 12 national elections during their adult life, give or take a few. \n\nX X X X X X X X X X X X \n\nThat's your lifetime's supply of Democracy, right there. Use it well. ", "gilded": 0, "created_utc": "1219234976", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Sectarian? Is that honestly the best you have?\nLet me make something clear to you. Socialism cannot be two completely counter-posed things.\n\nNo where do Marx or Engels, or their successors for that matter, say to the people \"Fight for reform! Install a new ruling class minority!\" On the contrary, they said, very clearly (and for good reason), \"Destroy the state apparatus of the bourgeois!\"\n\nSo yes, all of this crap you're polluting the data stream with is - f i l t h - it is counter-revolutionary, bourgeois compromising, anti-working class, pro-capitalist reformism with the rhetoric of marxist socialism.\n\nSectarian? Please, bore me some more. You are not a Socialist, you're a reformist. The only sectarian views flung from me are that the only viable leftist politics are those of revolutionary stand-points, and that all other counter-posed stand-points serve only to undermine the vast majority for the benefit of a tiny minority.\n\nTake your shit, reformist, and get out. Grow up, discover what Socialism truely is, and if you disagree with it, stop calling your fucking politics Socialist.\n\nP.S. Who the hell do you think you are calling -me- a Sectarian? Was it not you who decided to try to propagate an attack on another Socialist organisation? Was I dreaming when you blatantly tried to undermine the validity of the arguments made by said organisation based on the subjectivity of your flawed bourgeois compromising politics? ", "gilded": 0, "created_utc": "1219327968", "subreddit": "socialism", "score": 3, "controversiality": 0}
{"body": "by pressing the following keys on your keyboard b a b b y.", "gilded": 0, "created_utc": "1219365197", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "**Y o u .  m  i g h t . w a n t . t o . h e l p . t h e . \nr e p u g l i c a n s\n\n\" p u r g e \"  . y o u r . p a r t y   \no f . s e l f - r i g h t e o u s . m o r a l i z e r s . a n d  \n\na s s o r t e d . p s e u d o - r e l i g i o u s\n\nn u t j o b s, . f l a g - w a v i n g . w a r m o n g e r s,\n\na n d . c o n s t i t u t i o n - s h r e d d i n g . \n\nf a s c i s t s . . .  **\n\nBut then... who in the GOP would be left???\n\n**Have you ever thought of just finding a different political party instead of trying to resuscitate a festering old elephant carcass???**\n\n- - -\n\nI found a new website and can't stop laughing...\n\nlarrycraigslist.org", "gilded": 0, "created_utc": "1219423087", "subreddit": "politics", "score": -10, "controversiality": 0}
{"body": "Gimme a P R I V A C Y.", "gilded": 0, "created_utc": "1219664803", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "D L D L D  aughter\n\nDaughter becomes Laughter with one consonant change.  English shouldn't be that broken.\n\n\n", "gilded": 0, "created_utc": "1219685934", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Dude.  That's   T O T A L L Y  C O O L !!", "gilded": 0, "created_utc": "1219695951", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "\"When the Saints go Marching In\" is the only tune I can play on a piano.\n\nEasy peasy as well CEFG CEFG CEFG E C E D . EEDC CE GG GF EFG E C DC.\n\nThat's it.  Take you an hour to learn.", "gilded": 0, "created_utc": "1219777463", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "My Bacon has a first name its K E V I N\nMy Bacon has a second name its B A C O N\nDon't give me the 6th degree, bad jokes deserve up-votes.", "gilded": 0, "created_utc": "1219811196", "subreddit": "Bacon", "score": 9, "controversiality": 0}
{"body": "Whenever I see some third party twit brag about voting 3rd party, I picture a person with a huge halo with a 10-12 foot radius and around the edges, in tall neon letters in an Arial font that spell A R S E H O L E. ", "gilded": 0, "created_utc": "1219862286", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "sounds like a pretty typical Alaskan uncle.\n\n\"Colberg said his office's review began after state Sen. Hollis French was quoted in The Wall Street Journal about two weeks ago saying the governor could be  i m p e a c h e d  as a result of the probe. That raised questions about how impartial the Legislature's investigation was going to be, according to the governor's office.\"\n", "gilded": 0, "created_utc": "1220092811", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "and apparently her own legal troubles. Yep, this is right up the alley of the american dickheads association, also known as the republican party.\n\n\"Colberg said his office's review began after state Sen. Hollis French was quoted in The Wall Street Journal about two weeks ago saying the governor could be i m p e a c h e d  as a result of the probe. That raised questions about how impartial the Legislature's investigation was going to be, according to the governor's office.\"", "gilded": 0, "created_utc": "1220093562", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "\"Colberg said his office's review began after state Sen. Hollis French was quoted in The Wall Street Journal about two weeks ago saying the governor could be  i m p e a c h e d  as a result of the probe. That raised questions about how impartial the Legislature's investigation was going to be, according to the governor's office.\"", "gilded": 0, "created_utc": "1220094312", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "and comes with her own legal troubles. typical of crooks in the red party.\n\n\"Colberg said his office's review began after state Sen. Hollis French was quoted in The Wall Street Journal about two weeks ago saying the governor could be i m p e a c h e d as a result of the probe. That raised questions about how impartial the Legislature's investigation was going to be, according to the governor's office.\"\n\nYep, this is right up the alley of the american dickheads association, also known as the republican party.\n", "gilded": 0, "created_utc": "1220111252", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "And please her crooks typical of the red party.\n\n\"Colberg said his office's review began after state Sen. Hollis French was quoted in The Wall Street Journal about two weeks ago saying the governor could be i m p e a c h e d as a result of the probe. That raised questions about how impartial the Legislature's investigation was going to be, according to the governor's office.\"\n\nYep, this is right up the alley of the american dickheads association, also known as the republican party.", "gilded": 0, "created_utc": "1220112042", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "\"Colberg said his office's review began after state Sen. Hollis French was quoted in The Wall Street Journal about two weeks ago saying the governor could be  i m p e a c h e d  as a result of the probe. That raised questions about how impartial the Legislature's investigation was going to be, according to the governor's office.\"", "gilded": 0, "created_utc": "1220112791", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Ladies, Gentlemen and Gentlewomen;\n\n**F A C I S M**\n\nWhat if that were the country that **YOU** lived in?  Huh?", "gilded": 0, "created_utc": "1220120133", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "\"Colberg said his office's review began after state Sen. Hollis French was quoted in The Wall Street Journal about two weeks ago saying the governor could be  i m p e a c h e d  as a result of the probe. That raised questions about how impartial the Legislature's investigation was going to be, according to the governor's office.\"", "gilded": 0, "created_utc": "1220202778", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "The link you provided is such a good description of me that I couldn't read past the second paragraph. But I will soon. I really felt as if the writer had lifted off the top of my skull and looked inside. So thank you but STOP doing that.\n\nI'm one of those people who has trouble finishing projects. It's almost done and just requires a bit of collating, formatting, etc. but I have this r e a l problem doing that last bit, probably because I know I'll be judged by the finished product and I'm frigging afraid of being judged.\n\nThis will sound like braggadocio but I've had two textbooks published. Neither was anywhere near a best seller but I'm confident that they were in the reasonably kinda-sorta good range compared to other texts in that field. Writing them was easy and fun but for the last FIVE years I've had the material right here on my computer for another textbook that will be much better than the other two even though I know it will not make me famous even on a local level and will hardly make any money at all. So the material was there and it could have been ready for the publisher if I had worked every weekend for about three months or had two weeks off from work and kept solidly at it for those fourteen days. So I arranged to have one whole month off from work to get that sucker finished once and for all. The first week I did no work on it at all. I caught up on my email, spent hours looking at reddit and around five in the afternoon starting drinking red wine. The second week I took long bicycle rides and one day went over fifty miles. The third week I was getting desperate so one day around noon I cracked a bottle of wine. Then for about an hour I got a helluva lot of work done but felt guilty. Next day, no booze but I didn't make any progress at all. The next day I went to the best wine shop in my area and bought a case of some really good stuff. By noon I was back home and on my second glass. I'm not proud of this but from that day forward I was pouring a glass of wine with breakfast and it felt GOOD and I started making solid progress  and I finished it and delivered it to the publisher on the last day of my month off. At this point you and I both are wondering how the hell I am going to finish this digression in a way that will make it worthwhile. All right, here it is: think of booze as a tool that you should use sparingly, but if need be it can be used much less sparingly for short bursts to get you past some hump or block. In the short term it can be a good friend but let me warn you: once you've tried a glass of wine with breakfast it's gonna be really hard to go back to coffee. ", "gilded": 0, "created_utc": "1220215458", "subreddit": "books", "score": 3, "controversiality": 0}
{"body": "Looks like we have a case of an irritated English major over here.\r\n\r\n\r\n\r\nM I S S I O N  - - - -  *A C C O M P L I S H E D*", "gilded": 0, "created_utc": "1220218845", "subreddit": "comics", "score": 5, "controversiality": 0}
{"body": "\"Colberg said his office's review began after state Sen. Hollis French was quoted in The Wall Street Journal about two weeks ago saying the governor could be  i m p e a c h e d  as a result of the probe. That raised questions about how impartial the Legislature's investigation was going to be, according to the governor's office.\"", "gilded": 0, "created_utc": "1220220060", "subreddit": "politics", "score": 1, "controversiality": 0}
