{"body": "A B C D E F G H I J K L M N O P Q AURA S T U V W X Y Z", "gilded": 0, "created_utc": "1272680332", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "R E S P E C T.\r\n\r\nWhen people start tripping on you it's your job as an adult to give them a reality check.  Don't let the haters make you feel this way and ruin Your Good Time.\r\n\r\nSome people seem to think we gotta deal with the straights because they are the majority, be extra sensitive to gay people *but* it's somehow OK to shit all over bi people (etc).  And that my friend is some bogus.", "gilded": 0, "created_utc": "1272695756", "subreddit": "lgbt", "score": 2, "controversiality": 0}
{"body": "Now I can't look at the word \"enough\" without thinking it makes no sense whatsoever.\n\nenough\n\nenough\n\nenough\n\n*enough*\n\n**enough**\n\n***enough***\n\n***e n o u g h***\n\n***e n o u g***\n\n***n o u g***\n\n***n o u***\n\n***NO U***", "gilded": 0, "created_utc": "1272706958", "subreddit": "fffffffuuuuuuuuuuuu", "score": 12, "controversiality": 0}
{"body": "P p p p p power", "gilded": 0, "created_utc": "1272707545", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Been there, and wish I knew this when I started.....\n\n1. Don't overplay your notes.  There is taste in the space. :)\n2. Pick and fingerstyle are worth being good at.  Some music simply sounds better with a pick...Old Metallica to most punk.  Fingerstyle is great for tonal and muting control...for stuff like funk, slap/pop, country.\n3. Don't worry if singing doesn't come to you right away when you switch.  You have different (instrument related)things to consider singing with bass compared to guitar.  Singing and bass in general is harder but comes with time.\n4. Get to know your amp.  Bass amps are different than guitar amps.\n5. If you really really want to get over to fingers quicker, you can do exercises with the bass.  Practice just using two fingers(more fingers later on) and learn to mute the notes with control.  I suggest focusing on finger muting since you probably have palm muting down with guitar.  Start with scales or even simply the E A D G until you have muting down.\n", "gilded": 0, "created_utc": "1272710407", "subreddit": "Guitar", "score": 5, "controversiality": 0}
{"body": "**F o o t b a l l**  \n  \nTry English/Scottish Premier League where diving is despised.", "gilded": 0, "created_utc": "1272729191", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Atta boy!!!!! C a n  n o t  u p v o t e  e n o u g h.", "gilded": 0, "created_utc": "1272750836", "subreddit": "gonewild", "score": 1, "controversiality": 0}
{"body": "ahaha this is so true!! i keep pressing A even though I know it's automatic and doesn't fastforward! and when this happenes, i'm like 'nooooo!! B B B B B B B B B B B B !'", "gilded": 0, "created_utc": "1272758835", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "what the hell is wrong with foo bar baz bing a b c d x y z etc?", "gilded": 0, "created_utc": "1272831719", "subreddit": "programming", "score": 19, "controversiality": 0}
{"body": "    * g o a t s e x * g o a t s e x * g o a t s e x *\r\n    g                                               g  \r\n    o /     \\             \\            /    \\       o\r\n    a|       |             \\          |      |      a\r\n    t|       `.             |         |       :     t\r\n    s`        |             |        \\|       |     s\r\n    e \\       | /       /  \\\\\\   --__ \\\\       :    e\r\n    x  \\      \\/   _--~~          ~--__| \\     |    x  \r\n    *   \\      \\_-~                    ~-_\\    |    *\r\n    g    \\_     \\        _.--------.______\\|   |    g\r\n    o      \\     \\______// _ ___ _ (_(__&gt;  \\   |    o\r\n    a       \\   .  C ___)  ______ (_(____&gt;  |  /    a\r\n    t       /\\ |   C ____)/      \\ (_____&gt;  |_/     t\r\n    s      / /\\|   C_____)       |  (___&gt;   /  \\    s\r\n    e     |   (   _C_____)\\______/  // _/ /     \\   e\r\n    x     |    \\  |__   \\\\_________// (__/       |  x\r\n    *    | \\    \\____)   `----   --'             |  *\r\n    g    |  \\_          ___\\       /_          _/ | g\r\n    o   |              /    |     |  \\            | o\r\n    a   |             |    /       \\  \\           | a\r\n    t   |          / /    |         |  \\           |t\r\n    s   |         / /      \\__/\\___/    |          |s\r\n    e  |           /        |    |       |         |e\r\n    x  |          |         |    |       |         |x\r\n    * g o a t s e x * g o a t s e x * g o a t s e x *", "gilded": 0, "created_utc": "1272836035", "subreddit": "technology", "score": -11, "controversiality": 0}
{"body": "Real's last few games:  W W W W W W W W W W L W W W W\n\nL stands for Barca.\n\nBarca fans, go ahead and downvote me, but this is looking more and more like a championship run.", "gilded": 0, "created_utc": "1272852155", "subreddit": "soccer", "score": 5, "controversiality": 0}
{"body": "I spell out words in signs/sentences that I can see around me.\n\nI space S P E L L space O U T space W O R D S etc.", "gilded": 0, "created_utc": "1272856669", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "My gamertag is s T o P b R o. gamebattles?", "gilded": 0, "created_utc": "1272860242", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "Cheap acoustic guitar = $100-$200. First learn how to tune it. A guitar tuner ($10ish) will be invaluable in this regard. \n\nLearn the following chords: E A C G D F Em Am Dm Bm F#m \n\nThey will be very difficult to hold down at first but will get very easy very quickly. Practice moving between them. \n\nPractice strumming in straight 4s, 8s, 16s, 8 triplets, and combinations of all of these. \n\nCongratulations - you're now an intermediate guitarist and will be able to hold your own at any drunken party singalong. ", "gilded": 0, "created_utc": "1272865242", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "i y q y q r", "gilded": 0, "created_utc": "1272893980", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I WILL DO IT.\n\nLet me know when they release the L O S T series finale.", "gilded": 0, "created_utc": "1272908553", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Just for flavor:\n    (define number-between\n      (lambda (low high)\n        (let loop ((i low))\n          (if (&gt; i high) (amb)\n              (amb i (loop (+ i 1)))))))\n    \n    (define all-unique?\n      (lambda (lst)\n        (let ((x (car lst))\n              (xs (cdr lst)))\n          (if (eqv? '() xs) #t\n              (if (memv x xs) #f\n                  (all-unique? (cdr xs)))))))\n    \n    (define puzzle \n      (lambda ()   \n        (let ((a (number-between 1 9))\n              (b (number-between 1 9))\n              (c (number-between 1 9))\n              (d (number-between 1 9))\n              (e (number-between 1 9))\n              (f (number-between 1 9))\n              (g (number-between 1 9))\n              (h (number-between 1 9))\n              (i (number-between 1 9))) \n          (assert (all-unique? (list a b c d e f g h i)))\n          (assert (eqv? 9  (+ a (* b c))))\n          (assert (eqv? 28 (+ d (* e f))))\n          (assert (eqv? 27 (+ g (* h i))))\n          (assert (eqv? 25 (* a (+ d g))))\n          (assert (eqv? 31 (* b (+ e h))))\n          (assert (eqv? 11 (* c (+ f i))))\n          (display (list a b c d e f g h i)))))\n", "gilded": 0, "created_utc": "1272913121", "subreddit": "math", "score": 2, "controversiality": 0}
{"body": "W h y t h e u n n e c e s s a r y s p a c i n g ?", "gilded": 0, "created_utc": "1272953803", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "whoaaaaaaaaa a a a a aaaa oo o oooooooo. whoa. niiiiiiiiice. more pics?", "gilded": 0, "created_utc": "1272966767", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "thanks, good to know your background - and no wonder your editorial comments are so informative and right on spot. great to know that in UK medical treatment is free at the point of service, this situation is surely a d r e a m for people in majority of Asian and African countries. I have lived in Thailand for few years and there with 30 Baht (USD 1) scheme, people can get annual 'health insurance cover' or get all healthcare in public sector hospitals for free. In India, 80% or so people don't go to public sector hospitals at the first consultation - so no doubt situation is very complex, and unique and solutions will take a long time to have an impact", "gilded": 0, "created_utc": "1272983167", "subreddit": "Health", "score": 1, "controversiality": 0}
{"body": "I can't do math. I can do simple addition and subtraction, assuming it's with 1 or 2 digit numbers, and I can do some multiplication. I can only do all that because I've memorized a lot of equations over years of having to do math in school.\nI've never brought it up with a doctor/therapist, but I've done some research and I think I might have dyscalculia (like dyslexia but with numbers).\n\nTo me, numbers aren't values, they're letters. Even single/double digit math I have to count on my fingers because 7 to me isn't o o o o o o o , it's 7, a letter just like L or P. It's a picture. So 7 - 5 results in me counting on my fingers to remember which numbers come next  (the way a person recites the alphabet to remember which letter comes next). To make it faster I count the distance. 5...6, 7. So 7-5=2.\n\nThis is pretty shitty for me because I literally *can't* do calculus, and I'm a biology major. God damnit.", "gilded": 0, "created_utc": "1272984627", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I was at that party man. Shit was b a n a n a s. ", "gilded": 0, "created_utc": "1272989667", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "L A N I S M Y C O U S I N \n\nLan is a fairly common vietnamese name ..... ", "gilded": 0, "created_utc": "1272995081", "subreddit": "DoesAnybodyElse", "score": 1, "controversiality": 0}
{"body": "C o n f i d e n c e.", "gilded": 0, "created_utc": "1273000440", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "C L I C H E.", "gilded": 0, "created_utc": "1273008360", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "(I may have gotten a bit carried away and written an essay.  I hope you don't mind?)\n\nI probably won't be able to get through all of it right now, but I'll go through and write down some things as I see them.  Keep in mind I don't know what skill level you are beyond this video (and I haven't watched it all, so I'm guessing as I go here) so some of it may seem a bit obvious.  Just calling it as I see it :)\n\n6:40 - make a decision and stick with it.  By choosing to kill scvs, then deciding to kill the two marines, then scvs again, then the marauder again, you did a lot less damage than concentrating wholly on scvs or your opponent's forces.  Not sure how much of that was the AI, but even if it was - you built up over 1k minerals trying to micro all of it.  Sometimes it's best to just cut your losses, let your lings run wild, and go back to your base to macro.  I think this is probably one of those times.\n\n7:25 - the second an overlord gets shot at, check your supply.  Is it expandable?  (i.e. do you have enough food even if you lose it?)  If no, make a new one immediately.\nSomething to keep in mind vs Terran though: make sure you don't lose OLs to things like that.  Once you knew where your opponent was, it probably would have been better to redirect him to a safer rally point.\n\n8:50 - man you have a lot of minerals.  I see you have your hatches hotkeyed, which is good, but something you should be doing more often than anything else is checking larva.  Press 1 then s.  If you have larva, use it as often as possible (unless you're waiting on your spire to finish or something like that).  In this case, the second your roach warren finished: 1 s r r r r r r r r r r r r r r r... you get the point.\nOn that note, keep on top of your spawn larva ability.  Your queen has 150 energy right now.  Check your hatchery periodically and see if you can use it again... it might be beneficial to hotkey your queen and check her energy every once in a while.  Even if you can't spawn larva, throw down a creep tumor... every little thing helps\n\n9:10 - I like where your head's at with this second attack, but a competent Terran player would have never let you into their base, much less done damage with 6 lings.  At this point, I think you should have sat back and amassed a large roach army, then attacked again.\nAnd geez, 2200 minerals... SPEND IT!  That's really the key to your improvement at this point, I think.  Spending minerals means you're getting units, or tech, or something - usually units though.  More units means more damage dealt, which usually means winning.  I like your playstyle though so far, very aggressive... just not macro oriented.\n\n9:30 - Think critically while you're playing.  That many marauders will pretty much decimate any ground army you throw at it - especially with concussive shells.  The first thing you should have done when you saw his unit composition was think \"wow, how can I beat these units?\"  If your answer doesn't coincide what what units you have out on the field, tech switch.  The answer in this case was simply \"air.\"  I would have thrown down a spire immediately on seeing that.\n\n952 - Don't be so stubborn to not change what you want to do.  By this, I mean that you should always be asking yourself: What is this going to accomplish?  (That's something you should always be asking yourself watching replays, too.)  When you threw down the infestation pit, what was your motivation?  I'm assuming for Hive tech, but the only thing I can really see beneficial from that is brood lords - which isn't a bad idea vs this unit comp, but they're SO expensive and you didn't have an army around to defend yourself while you built them, so I'm not really sure what it was for.  Maybe I'm just not seeing it.... *watches on*\n(15:35 - oh, duh, infestors.  I underuse infestors when I play zerg, so excuse my momentary lapse.  Very good idea, but I think you're getting a bit ahead of yourself.  Infestors are great support units, but you NEED to use them behind an army - which you didn't really have at that point.  I withdraw my critique - it was a bit hasty.)\n\n10:30 - just noticed you only have 1 drone on gas.  3 is max, and with so many minerals and so little gas you should really check to make sure you have 3 on all the geysers you're mining from.  And why do you know have one extractor at your main?!  When you have so many excess minerals, there's SOMETHING wrong... try to figure out what it is.\n\n12:20 - You see a lot of units on the field.  You don't have the army to deal with these.  First response?  Make more units.  You have a lot of larva sitting around... you did a good job with spawn larva for a little while, but you didn't actually use the larva... \n\n14:20 - nice defense, but I would have liked to see you overreact enough to counterattack immediately with a much larger force - you left a lot of larva unused.  (Hopefully I don't sound too repetitive here, I'm just hoping it'll sink in by the end of this :P)\n\n15:00 - nice job running from a losing battle (I just figured that with all the critiquing, a compliment wouldn't hurt haha)\n\n18:10 - very nice fungal growth.  I feel like you're getting better as the game goes on... your 5k minerals bug the hell out of me though.  With so many excess minerals and even loose map control, I'd be expanding like crazy.  Even if you don't actually mine much at the expansions, you can still use the extra hatches for unit production.  \n\n18:35 - Earlier in the game, when you attacked the second time, you should have noticed your opponent trying to destroy the rocks.  Instead of running up here and attacking him from the front (and the chokepoint that's there), I think it may have been a good idea to go around to the side and try to break the rocks to take out his expansion.  I haven't watched the battle yet, so I don't know how it goes - just providing an alternative to what you did that may be worth considering.\n\n19:20 - I just noticed you never remade a queen at your expansion, might be a good idea in the future.  Also, creep tumors!  You run faster on creep, so it's never a bad idea if you have excess energy.\nAlso, when you have so many drones at a mineral patch that's so low on minerals (like at your main), it's best to move the drones elsewhere (an expansion, if at all possible).  Your income is SO much lower right now than it should be because so many of your drones are just sitting around waiting to get their turn at the mineral patch.\n\n\n(Haha, too long.  Part 2 as a reply.)", "gilded": 0, "created_utc": "1273029539", "subreddit": "starcraft", "score": 6, "controversiality": 0}
{"body": "20:45 - whoa whoa whoa, why are you breaking the wrong rocks?!  There are rocks to that expansion sitting in your main, which makes the expansion MUCH easier to defend.  Always take those out first, IMO.\n\n21:00 - So...much....larvae...........\n\n22:50 - nice job going over to check for an expansion.  As zerg, it's a really good idea to send overlords over to all the expansions as monitors - knowing when your opponent is expanding is game-changing knowledge.  Once you get lair tech, you can make them lay down creep as well, which delays them from expanding when they want to.\n\n23:05 - Oh, nevermind, you were taking my advice from earlier and breaking down his rocks hahaha\n\n23:45 - When you're attacking anyone near a still-mining base, you almost always want to go for their scvs first.  Taking out production buildings is great, but their miners are much more valuable in the long run.\n\n24:50 - Nice micro with your infestors, but try not to keep them in the same hotkey as the rest of your army.  It keeps them on the front line and ends up with them dying very quickly to an opponent that knows what he's doing.  Also, your army can kill things without you watching - go back to your base every once in a while to macro (spawn larva, build more units, etc) more.\n\n25:15 - Any reason you have overlords running around with your army?  They're no longer detectors (you have to upgrade them to brood lords (correction: overseers, thanks to Forbizzle for catching it) for that), so having them around is just liable to supply block you when they die.  Having one near is a very good idea in case your opponent breaks out cloaked units, but I can't really see much of a reason for having on right there (although, if you make them autocast creep, it might be a good idea - but I'm still not sure it's worth it)\n\n25:30 - One of my favorite rules of thumb: reward yourself for winning a battle with an expansion.  You just took out one of your opponent's expansions and you still have a sizeable army, expand like mad!  (I'm also getting increasingly angry at your 7500 minerals)\n\n25:50 - A cool trick is to make a unit and add them to your control group before they hatch using shift + # (shift + 4 in this case).  Just a good way of saving a bit of time later on.\n\n26:15 - You have no gas still... and no extractors at your second expansion.  You're making me cry.\nAlso, you have no weapon/armor upgrades.  Don't neglect them!  They're very, very valuable in long games like this.\n\n26:50 - As if on cue, you get gas.  Haha thank you for listening!\n\n27:40 - Remember how I criticized you for having overlords in your army?  This is a good time to have them.  You're being attacked by the high ground and you have two overlords very close by which could have acted as spotters.  Not a big deal vs 2 marauders, but you could have taken some very unnecessary heavy losses.\n\n29:20 - Don't forget to add any more hatches you make to your hatch hotkey - it's SO much easier to press 1 s h h h h h h and queue up a crapload of hydras than to go around to each individual one.\n\n29:30 - Why did you go around to the choke after you already had a foothold in the side of his base?  I can understand checking for expansions - which is good - but an overlord very easily could have done that and saved you from attacking from the choke.\nOn that note, when attacking with ranked units in a chokepoint like that, a + click is not your best friend.  Right click up to as close as you can get before attacking.  This lets as many of your units as possible attack, instead of just a small line at the front.\nAnd don't forget to focus fire on the bunker!\n........and then you back up.  LOL I should probably watch a little bit more before commenting on things.  But still, there wasn't all that much of a point to that attack.  You went in, destroyed a depot, lost a few units, and then backed up.  It wasn't deciding by any means, but you took more damage than you dealt and you didn't have to.\n\n30:40 - And then you did the whole right click as far as possible thing.  I swear you're reading my mind.\n\n31:00 - 10,000 minerals.  My god.\n\nNice win :)\n\nWithout question, the biggest thing you should focus on is macro.  Keep up with spawn larva, and use it all every chance you get.  If you have such a big imbalance between gas and minerals and can't make units because of it, either figure out what is causing it (i.e. not enough drones in your extractors, not enough extractors, etc) or make units/buildings that don't require as much of what you're short on to try to balance it out (in this case zerglings) - it's better to use the minerals and larva than to let it sit around, useless.\n\nOkay this is long enough as it is, so I'm just going to post it.  Others can feel free to pick it apart, ask questions, add to it, subscribe to my newsletter, whatever they want :)\n\nEdit:  I feel slightly embarrassed to have written all of that about a single replay.  Someone tell me I didn't get carried away, please.", "gilded": 0, "created_utc": "1273029599", "subreddit": "starcraft", "score": 6, "controversiality": 0}
{"body": "Just count 1 2 3 4 5 6 7 8 9 and say your A B C D E F G H I J K L MNOP Q R S T U V W X Y Z's", "gilded": 0, "created_utc": "1273038223", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "B A N A N A S", "gilded": 0, "created_utc": "1273082124", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Very interesting!\nHow does it scale? Can you try a bigger problem?\nFor example..\n\n     H 1 . . .  A . L . K  C . . . .  3 F . 7 T  . . N . .\n     D . . . 4  N 7 6 . .  . L J 5 .  . . . . 1  0 . . . H\n     . . F . .  . 9 . . 0  . . D E .  . 8 . . .  . . . J T\n     . . . . 0  C . . . .  . 8 . T .  . . . . .  . K . . .\n     . . A 8 .  . . D . .  . 4 1 3 9  . . J . .  . P 5 . 7\n    \n     J 8 . . .  B . K . .  . . M . .  . R P . .  . . . E .\n     N 3 R . .  . . . . 7  . D . . .  . . . . .  B . . . .\n     . . . . K  . N . . .  . 6 . 7 .  . . . J .  . . 9 . .\n     . . 6 . 7  3 P . . 2  . 0 9 B .  . . K E .  A . L . .\n     . . . . .  D . 4 . 5  . . . . .  . 6 . 8 2  R . 1 . .\n    \n     . . . . P  7 1 0 K .  . . . . .  . . . . .  . N . H .\n     . B . J 9  . . . . 4  . K . . .  . . C . L  5 . P A E\n     5 0 N . 3  2 T . . .  . . . H 7  R . M P .  . . C D L\n     . L . A D  P . . . .  . . . . 1  . . . . 9  4 8 . . J\n     . . E . .  . . R N A  8 . . F .  2 J . . .  . . 3 . .\n    \n     . H . . F  . . . 8 B  . . P . .  . . . . 7  M 4 . L .\n     8 T C P L  . . . . .  H 9 . . D  . M . . F  . 7 . 0 .\n     . . 4 . .  R . 3 . H  . . N 8 .  B 2 9 . .  . . . 6 .\n     E . 5 . .  4 C F M .  . . T . .  . K R 0 P  3 . D . .\n     A . . . .  . . . . .  . 2 . 1 .  . 5 H . .  E B R T K\n    \n     . . 3 C .  6 8 . . .  . J 2 . B  0 . . . 5  H D . . .\n     . A 2 . .  . M 1 . .  . C . 6 .  L B N . E  8 . T 9 R\n     . . 7 . E  . . . . C  0 5 . . P  . 9 . T .  . A . 2 N\n     . 4 . . .  . 0 . E .  . . . M R  . . 3 . C  . . B . 1\n     6 D P N T  9 F H . .  L . 7 . .  1 4 . . 8  . . . . .\n\nThe solution is:\n\n     H 1 J 9 6  A 4 L 5 K  C R 0 P M  3 F E 7 T  D 2 N B 8\n     D P T 2 4  N 7 6 F 8  B L J 5 K  9 C A R 1  0 E M 3 H\n     3 N F K 5  1 9 B 2 0  7 H D E A  P 8 L 4 M  C R 6 J T\n     M 7 L E 0  C R P 3 J  F 8 6 T 2  D H 5 N B  9 K 4 1 A\n     R C A 8 B  T E D H M  N 4 1 3 9  6 0 J 2 K  L P 5 F 7\n    \n     J 8 0 T 2  B A K L 6  3 1 M 4 5  7 R P 9 N  F C H E D\n     N 3 R 4 H  M J E 9 7  P D C 2 T  F L 1 5 A  B 0 8 K 6\n     P E 1 D K  8 N C R F  A 6 H 7 L  4 3 B J 0  T M 9 5 2\n     F 5 6 M 7  3 P T 1 2  R 0 9 B 8  C D K E H  A J L N 4\n     C 9 B L A  D H 4 0 5  E F K J N  M 6 T 8 2  R 3 1 7 P\n    \n     4 R M 6 P  7 1 0 K 9  D T L C J  5 E 8 A 3  2 N F H B\n     1 B 8 J 9  F 6 M D 4  2 K R 0 3  N 7 C H L  5 T P A E\n     5 0 N F 3  2 T 8 J E  9 B A H 7  R 1 M P 4  K 6 C D L\n     2 L H A D  P B 5 C 3  6 M E N 1  K T 0 F 9  4 8 7 R J\n     T K E 7 C  H L R N A  8 P 5 F 4  2 J D B 6  1 9 3 M 0\n    \n     K H D R F  E 2 9 8 B  5 3 P A 0  T N 6 1 7  M 4 J L C\n     8 T C P L  J K A 6 1  H 9 B R D  E M 4 3 F  N 7 2 0 5\n     7 J 4 0 M  R 5 3 T H  K E N 8 C  B 2 9 L D  P 1 A 6 F\n     E 2 5 B 1  4 C F M N  J 7 T L 6  A K R 0 P  3 H D 8 9\n     A 6 9 3 N  0 D 7 P L  M 2 4 1 F  8 5 H C J  E B R T K\n    \n     L F 3 C R  6 8 N A T  1 J 2 9 B  0 P 7 K 5  H D E 4 M\n     0 A 2 5 J  K M 1 7 P  4 C 3 6 H  L B N D E  8 F T 9 R\n     B M 7 1 E  L 3 J 4 C  0 5 8 D P  H 9 F T R  6 A K 2 N\n     9 4 K H 8  5 0 2 E D  T N F M R  J A 3 6 C  7 L B P 1\n     6 D P N T  9 F H B R  L A 7 K E  1 4 2 M 8  J 5 0 C 3\n\nI can post problems of other sizes, if you are interested ;-)\n", "gilded": 0, "created_utc": "1273157414", "subreddit": "programming", "score": 6, "controversiality": 0}
{"body": "**W A R N I N G**  \n\nThere's an apparent fairly major spoiler in that interview.  Or two: casting, and the role that the person was cast in.  Read at you own risk.\n\nPlease do not post anything here in comments about that upcoming spoiler without using the spoiler tag... Thanks!", "gilded": 0, "created_utc": "1273158216", "subreddit": "lost", "score": 19, "controversiality": 0}
{"body": "if you are going to explode based on space: explode(\" \", $str)\n\nYour string needs to have spaces: \"a b c d e f g\"\n\nYa dig?", "gilded": 0, "created_utc": "1273165051", "subreddit": "mentors", "score": 1, "controversiality": 0}
{"body": "i r z n u interlol pre roasting un-dont u sea breen b5\n\n...TFTUFY...", "gilded": 0, "created_utc": "1273179090", "subreddit": "shittyadvice", "score": 1, "controversiality": 0}
{"body": "Blue bro, Wow,  f u c k i n g BLUE!!", "gilded": 0, "created_utc": "1273192439", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "__ L O L S T __ ", "gilded": 0, "created_utc": "1273194773", "subreddit": "lost", "score": 16, "controversiality": 0}
{"body": "Episode was A W E S O M E. And I couldn't fall asleep after it because I kept theorizing and thinking about the two part Season finale.\n\nI did think it was interesting how in \"Peter\" they showed a whole team working with Walternate in his lab. Did you see his team of super soldiers in the preview for the finale? And the \"jacked\" looking parallel Broyles? Super exciting stuff.\n\nWeird thing is there was a lot of grass in one of the scenes from the alternate universe. Hope they aren't retconning \"the Blight\"", "gilded": 0, "created_utc": "1273237256", "subreddit": "fringetv", "score": 3, "controversiality": 0}
{"body": " Dear customers, thank you for your support of our company.\nHere, there's good news to tell you: The company recently\nlaunched a number of new fashion items! ! Fashionable\nand welcome everyone to come buy. If necessary,\nwelcome to :===== http://www.soozone.com ====\n\nAir jordan(1-24)shoes \n\nHandbags(Coach l v f e n d i d&amp;g) \n\nTshirts (ed hardy,lacoste)\n\nJean(True Religion,ed hardy,coogi) \n\nSunglasses(Oakey,coach,gucci,A r m a i n i) \n\nNew era cap \n\nBikini (Ed hardy,) \n\nFREE sHIPPING\n\n====== http://www.soozone.com ====\n\n\n    \nsfsfsdf", "gilded": 0, "created_utc": "1273240386", "subreddit": "promos", "score": -7, "controversiality": 0}
{"body": "For the interested party, arbitrary recursive linear combinations in Haskell:\n\n\n    type Scaler = Integer\n    type Row    = [Scaler]\n    type Matrix = [Row]\n\n    inner :: Row -&gt; Row -&gt; Scaler\n    inner a b = sum $ zipWith (*) a b  \n\n    mm :: Matrix -&gt; Matrix -&gt; Matrix\n    mm a b = [[inner row col | col &lt;- transpose a] | row &lt;- b]\n\n    exptree f u x n | n &lt;= 0  = u\n                    | even n  = exptree f u       (f x x) half\n                    | odd  n  = exptree f (f u x) (f x x) half\n       where half = (n `div` 2)\n\n    unit :: Int -&gt; Matrix\n    unit k = [onein k x | x &lt;- [1..k]]\n\n    onein k i = [if x == i then 1 else 0 | x &lt;- [1..k]]\n\n    fibm k = (take k [1,1..]) : [onein k x | x &lt;- [1..(k - 1)]]\n\n    lincomb k n | n &gt; 0     = last $ last $ exptree mm (unit k) (fibm k) n\n                | otherwise = 0\n\n    fib  = lincomb 2\n    fib3 = lincomb 3\n    fib4 = lincomb 4\n", "gilded": 0, "created_utc": "1273242729", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "the pierogies sound a m a z i n g.", "gilded": 0, "created_utc": "1273263522", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Yes, tax and spend.  I did not dispute that.\n\nI said\n\n&gt;It does not mean the congress can legislate for the general welfare\n\n*l e g i s l a t e*\n\n", "gilded": 0, "created_utc": "1273266221", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I didn't know so f f f f f f f f f f u u u u u u u u u u ", "gilded": 0, "created_utc": "1273276027", "subreddit": "pics", "score": -2, "controversiality": 0}
{"body": "Yeah, crew gets substantial discounts but they F U C K the passengers. ", "gilded": 0, "created_utc": "1273280970", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "Oh my freakin gawd YES! Her name Brittney and she freaking talks in text speak. Instead of saying she's joking about something its J K J K or my new favorite, instead of \"i don't know\" its IDK. I'm her supervisor and i feel bad because i just want her to STFU and DIAF! She spends her whole shift texting and every time the boss makes the schedule she comes in with a list of changes because of \"sorority things\" and it screws the rest of us. The boss allows all this so i really can't do much if anything about it.", "gilded": 0, "created_utc": "1273282384", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "My name is Nick Nicholas. My father has a stutter. I have seven middle names, N N N N N N N.", "gilded": 0, "created_utc": "1273284301", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "I s   t h i s   b e t t e r ?", "gilded": 0, "created_utc": "1273285645", "subreddit": "atheism", "score": -2, "controversiality": 0}
{"body": "Dude free courses online. Typing programs and games take 6 weeks top to get the basic letter keys down. You may have to glance occasionally after that for your z c b q etc. but even then you will be able to type way faster.", "gilded": 0, "created_utc": "1273288074", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "E V O L V E S", "gilded": 0, "created_utc": "1273299181", "subreddit": "starcraft", "score": 10, "controversiality": 0}
{"body": "Hello &gt; this was a SELL \"OFF\" M A J O R highs, this is all carefully planned to strengthen the economy and put stocks back at buyable levels, for another run up then the crash, by that time many companies have gotten back on their feet.  ", "gilded": 0, "created_utc": "1273317695", "subreddit": "economy", "score": -5, "controversiality": 0}
{"body": "Let's go line-by-line to review:\n\n    $string = 'a b c d e f g h i j k l m n o p q r s t u v w x y z';\n    $array = explode(' ', $string); \n\nAt this point $array = a, b, c, d... etc (all letters are in the array)\n\n    for($i = 0; $i &lt; count($array); $i++){\n\nCycle through $array until we reach the last item...\n\n    echo \"The Alphabet = \".$array[$i];\n\nPrint the $i item from the array, from 0-25 (we have 26 items in $array)\n\n    }\n\nClose loop. \n\n$array contains all 26 letters; $array[$i] simply displays the value contained in the $i index. When you run this you should see:\n\n    The Alphabet = a\n    The Alphabet = b\n    The Alphabet = c\n    The Alphabet = d\n    etc.\n\nTo use another example:\n\n    $memes = array('narwhals', 'bacon', 'kittens');\n    echo $memes[0]; // narwhals\n    echo $memes[1]; // bacon\n    echo $memes[2]; // kittens \n\nYa dig?\n\nLet's say you just wanted a single line, which printed all the letters. We might do this:\n\n    $string = 'a b c d e f g h i j k l m n o p q r s t u v w x y z';\n    $array = explode(' ', $string); \n    $new_string = 'The Alphabet - '; // used to hold our new string\n    for($i = 0; $i &lt; count($array); $i++){\n        $new_string .= $array[$i].' ';\n    }\n    echo 'Here is our new string: &lt;b&gt;'.$new_string.'&lt;b&gt;';\n\nThis should produce: \n\nHere is our new string: **The Alphabet - a b c d e f....**\n\nHandy trick you may not know:\n\n    print '&lt;pre&gt;'; print_r($array); print '&lt;/pre&gt;'; \n\nThis will show the contents of your array; makes debugging much easier. ", "gilded": 0, "created_utc": "1273339098", "subreddit": "mentors", "score": 1, "controversiality": 0}
{"body": "wow!!!!!!! thanks. I never thought it would give me an explanation if I wait a little bit. What I did was to right click on the dashed lines and never tried to hover... T H A N K S ! ", "gilded": 0, "created_utc": "1273340478", "subreddit": "apple", "score": 2, "controversiality": 0}
{"body": "Ex-cellent. *E x a c t l y.*", "gilded": 0, "created_utc": "1273368338", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "wake the fuck up; nobody hates you for freedoms. nobody. no body. n o b o d y.\n\nwell, some idiot dictator perhaps.\n\nbut their people? no fucking way.\n\nhating you for unfair wealth distribution? sure.", "gilded": 0, "created_utc": "1273371831", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Actually three \"e\" keys, two \"a\" keys, two \"u\" keys and two \"c\" keys. Confusion at its finest.\n\nEdit: I was using azerty to type my comment, \"é\" is located above \"a\" to the right:\n\n       ² &amp; é \" ' ( ...\n    [TAB]a z e r t y u i ...\n\nSo I unconsciously tried to type \"é\", but instead I typed \"e\". This happens to me with \"a\" and \"à\", \"u\" and \"ù\", and \"c\" and \"ç\".", "gilded": 0, "created_utc": "1273385380", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "enough for me to win\r\n\r\n    39% of the student body voted, I got 26%.  P H H H B B T !", "gilded": 0, "created_utc": "1273399290", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I once amused a friend of mine by singing the alphabet song with the lyrics \"Q W E R T Y U...\".  It almost fit, too.  Almost.", "gilded": 0, "created_utc": "1273437669", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I'd probably use A dorian over most of this. That F# isn't diatonic to C major/A minor, but it's the natural 6th of an A dorian scale. \n\nOver the cord with the G# in it, I'd just make a small adjustment to the aforementioned A dorian scale - changing the G to a G#, and making it A melodic minor. \n\nThe notes for A dorian are A B C D E F# G, and A melodic minor is A B C D F# G#. You can use a minor pentatonic as well, but make sure not to play the a G note over that chord with the G# in it.\n\nEDIT: to easily get the sound of A dorian, you can play a B minor pentatonic scale. This contains B D E F# and A, which are all the notes you need to really get the classic dorian sound. Switching between this and an A minor pentatonic would sound really good. Also notice that the B minor pentatonic doesn't have a G in it, so you don't have to worry about the G/G# switch.", "gilded": 0, "created_utc": "1273446393", "subreddit": "Guitar", "score": 9, "controversiality": 0}
{"body": "Well, most of my 'career' in design was all stuff I was doing for myself.  I ran a small independent record label, and I did all of the art for our releases and promotional materials and tshirts and such.  Thru that, I got a lot of clients in the music scene who paid me for album art/postcards/etc.  I didn't make much doing that, so I had a seperate job that was completely unrelated to my design degree.  Did that for about 5 years.\n\nFirst job I had doing design was for a porno company (web design, DVD covers, DVD menus, etc.)  Job was T E R R I B L E.  Boss was a jerk, pay was shit.\n\nI now work for a nonprofit international development organization, and I'm the entirety of the art department.  Coming in w/some experience dealing with printers was very helpful, as I'm now responsible for all of the print work, as well as web design (no coding) and internal documents.  I _love_ my job, but I'd never recommend going into design to someone who didn't really love it.  There are two billion designers out there, and about 5 jobs.  Moving to NYC is probably the only reason I make what I do in the field that I love.", "gilded": 0, "created_utc": "1273548315", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I like the chic 60s vibe the art has.  It reminds me of something from a pixar or alfred hitchcock credits sequence.  I also like how its screaming out L O S T to everyone I meet but the people who know the show might catch it.", "gilded": 0, "created_utc": "1273549588", "subreddit": "lost", "score": 1, "controversiality": 0}
{"body": "Wow, that is a H O T picture. Thanks for sharing, hope to see more of you two.", "gilded": 0, "created_utc": "1273553444", "subreddit": "gonewild", "score": 2, "controversiality": 0}
{"body": "very interesting question indeed ... can you spell C R A S H )", "gilded": 0, "created_utc": "1273630567", "subreddit": "Economics", "score": 1, "controversiality": 0}
{"body": "So, MIB still doesn't have a name. \n\nHe's only referred to as \"Brother\" in this episode. \n\nThat's why he's so afraid of Desmond. He knows his true name, and is therefore immune to his black smokey powers.\n\n\n**B R O T H A**\n", "gilded": 0, "created_utc": "1273630658", "subreddit": "lost", "score": 134, "controversiality": 0}
{"body": "Say this in english:\r\n\r\n2 T N S L P P B N T S O\r\n\r\n\r\nspanish speakers will love you.", "gilded": 0, "created_utc": "1273644482", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "L I N D E L O F ", "gilded": 0, "created_utc": "1273645350", "subreddit": "lost", "score": 8, "controversiality": 0}
{"body": "L O S T T I M E", "gilded": 0, "created_utc": "1273651498", "subreddit": "lost", "score": 1, "controversiality": 0}
{"body": "*F l A s H B a C k*", "gilded": 0, "created_utc": "1273682623", "subreddit": "gaming", "score": -9, "controversiality": 0}
{"body": "It says P U S S Y", "gilded": 0, "created_utc": "1273747238", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "H E R P E S?", "gilded": 0, "created_utc": "1273748822", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "A B A C A B B \"Get over Here\"  \nBLOOD ON!", "gilded": 0, "created_utc": "1273763791", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "    T H E   T R U T H   I S   O U T   T H E R E", "gilded": 0, "created_utc": "1273763951", "subreddit": "lost", "score": 6, "controversiality": 0}
{"body": "So did we! A science teacher who would also do multiple choice exams with A A A A A A A A A A A A A the whole way through so it would be easier to mark. ", "gilded": 0, "created_utc": "1273765891", "subreddit": "AskReddit", "score": 60, "controversiality": 0}
{"body": "Go to Erase Game, B A R R A L L\n\n50 lives, DKC", "gilded": 0, "created_utc": "1273767789", "subreddit": "gaming", "score": 4, "controversiality": 0}
{"body": "Vector Man:\nC A Left Left A C A B (call a cab)\n\nDown Right A C Up Left A (Dracula)", "gilded": 0, "created_utc": "1273768591", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "Today is a good day to die - Warcraft 2. (pc) **/**\r\nPower Overwhelming/Operation Cwal - Starcraft (pc) **/**\r\nBBBB BBBB BBBB BBBB BBBB B - Top gear 3000 (snes) **/**\r\nbewareoblivionisathand - turok 2 (n64) **/**\r\nL R R L R R L R L R - Donkey Kong Country 3 (snes) **/**\r\nAspirine - Gta Vice city (Pc)\r\n\r\nthose are the only ones i can remember right now.\r\n", "gilded": 0, "created_utc": "1273779344", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "4:1 Zergling to Zealot ratio. Lings can't get a surround on a well micro-ed reaper without speed upgrade. My bologna has a first name, it's L I N G S.", "gilded": 0, "created_utc": "1273780469", "subreddit": "starcraft", "score": 1, "controversiality": 0}
{"body": "Sure everyone knows the Konami code, but can anyone remember the Super C code?  It's R L D U A B start, for 10 lives...BOO-YEEEAAAHHH!", "gilded": 0, "created_utc": "1273798603", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "D G C G D G A\n\nD A D A D A G A\n\nD G A D\n\n/It isn't A and I don't recall the chord name.  Do an A with the 3rd string open.", "gilded": 0, "created_utc": "1273798989", "subreddit": "Guitar", "score": 3, "controversiality": 0}
{"body": "I shall now begin giving people URLs by saying H T T P Colon Virgule Virgule W W W dot.\n\n(Also, its always pissed me off that saying WWW takes more effort than saying World Wide Web and that 90% of the time its redundant anyway).", "gilded": 0, "created_utc": "1273801922", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "I will never forget SF2 turbo 10 stars cheat. D R U L Y B X A", "gilded": 0, "created_utc": "1273825660", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "b a n n............ no wait b a n a a no no wait......... b a n n a ........ FUCK, whats the name of that shit song again by that Swen Gtefani girl?  I know it when she is playing!\n\nwhy couldn't this guy just spell it for me?\n\nhttp://www.youtube.com/watch?v=LH5ay10RTGY", "gilded": 0, "created_utc": "1273848405", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "City dwellers have a much lower carbon footprint though.  It takes a lot more resources to do things when everything is  s p r e a d   o u t .", "gilded": 0, "created_utc": "1273863431", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "This is correct.\n\nCle o o o o o o patra.", "gilded": 0, "created_utc": "1273867116", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "B L A C K I E", "gilded": 0, "created_utc": "1273892596", "subreddit": "Music", "score": 1, "controversiality": 0}
{"body": "    T H E   T R U T H   I S   O U T   T H E R E", "gilded": 0, "created_utc": "1273897708", "subreddit": "lost", "score": 5, "controversiality": 0}
{"body": "X A N A X ! ! ! ", "gilded": 0, "created_utc": "1273953861", "subreddit": "trees", "score": 3, "controversiality": 0}
{"body": "&gt;The Spartans, hard-asses that they were, felt hot water was for the weak and unmanly. When they did take baths (which was, like, once a year) they used only cold water because they thought it tempered the body and made it vigorous for ass kicking.\r\n\r\n(jumps into the freezing bath and then shouts) S P A R T A !", "gilded": 0, "created_utc": "1273954580", "subreddit": "Health", "score": 3, "controversiality": 0}
{"body": "the cited defunct h t t p ://justice4mothers.wordpress.com/:\n\n&gt;This blog has been archived or suspended for a violation of our Terms of Service. You can create your own free blog on WordPress.com.\n", "gilded": 0, "created_utc": "1273972947", "subreddit": "Equality", "score": 2, "controversiality": 0}
{"body": "\r\nHello,everybody,the good shoping place,the new season approaching, click in. Let's facelift bar! \r\n''''''''''''''''''''' http://www.ccshopping.us '''''''''''''''''''''\r\n\r\nNew era cap $9\r\n\r\nEDHARDY BIKINI $ 16\r\n\r\nAir jordan(1-24)shoes $30\r\n\r\n\r\nSunglasses Oakey,coach,gucci $12\r\n\r\n\r\nHandbags(Coach l v f e n d i d&amp;g) $30\r\n\r\n\r\nTshirts (Polo ,ed hardy,lacoste) $15\r\n\r\n\r\nJean(True Religion,ed hardy,coogi) $30\r\n\r\n\r\nBikini (Ed hardy,polo) $18\r\n\r\n\r\nFREE sHIPPING\r\n\r\n''''''''''''''''''''' http://www.ccshopping.us '''''''''''''''''''''\r\n\r\nWE ACCEPT PYAPAL PAYMENT AND CREDIT CARD \r\nYOU MUST NOT MISS IT!!!\r\n\r\n", "gilded": 0, "created_utc": "1274016422", "subreddit": "KASIS", "score": 1, "controversiality": 0}
{"body": "\"i don't know the chords\"\n\nhttp://www.all-guitar-chords.com/\n\nhttp://www.ultimate-guitar.com/lessons/chords/caged_minormajor_chord_utilization.html\n\n\n\"I don't even know what string is which\"\n\nE A D G B E . Learn them, praise them, love them.\n\n6 5 4 3 2 1\n\n\"my little finger for example, is shit. I've avoided using it for most of my guitar playing life and when I try to use it now, it's unflexible and weak\"\n\nThen use it more. \n\nThere's no real magic technique or trick man. It's just practice. Steve Vai practices for 8 hours a day, and Chris Broderick's (Megadeth) day consists of 5 hours of electric guitar, 5 hours of classical guitar, 2 hours of piano, and 2 hours of violin. \n\nAll of the good guitarists worked very hard to achieve their skills and there's no exception. Talent will make you a god instead of a great guitarist. But everybody can be like Chris Broderick with enough practice.\n\nNow for some good sites:\n\nhttp://www.cyberfret.com/\n\nhttp://www.ultimate-guitar.com/lessons\n\n\nAbout memorizing the notes:\n\nLearn the notes on the 6th string. Then remember that two strings below and 2 frets to the right is the same note. Example: If A is the 5th fret of the 6th string, then you have an A in the 7th fret of the 4th string. You can figure out most of the other notes that way and with time it turns easy. \n\n\nSeriously, we all go through times where it seems like we don't improve anymore but it's just a matter of not giving up and practicing as much as you can.\n\nOther tip: It's better to practice one hour every day than to practice 7 hours straight once a week. And like everyone said, practice **SLOWLY**. That's the only way to pay attention for your pinky for example. Once you get it right, you practice a bit faster and faster.\n\nWatch the John Petrucci's DVD \"Rock Discipline\". It was in Google Video the last time I checked. And get Guitar Pro. It's going to make your life A LOT easier.", "gilded": 0, "created_utc": "1274026175", "subreddit": "Guitar", "score": 2, "controversiality": 0}
{"body": "I thought by myself before reading the article \"and the whistle blower was sacked\"... right on. It is the fucking same E V E R Y W H E R E. Hush all you little servants of the godly managers.", "gilded": 0, "created_utc": "1274026808", "subreddit": "environment", "score": 1, "controversiality": 0}
{"body": "L E G E N D. \n\n", "gilded": 0, "created_utc": "1274032966", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "As has been said before:\n\n    T H E   T R U T H   I S   O U T   T H E R E", "gilded": 0, "created_utc": "1274041391", "subreddit": "lost", "score": 1, "controversiality": 0}
{"body": "B R E A K I N G  B A D", "gilded": 0, "created_utc": "1274054743", "subreddit": "funny", "score": 14, "controversiality": 0}
{"body": "**D E T R O I T**", "gilded": 0, "created_utc": "1274063793", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "G E T   W E L L   S O O N ,   G R E E N S L E E V E S !\n\n:(\n\n&lt;3", "gilded": 0, "created_utc": "1274095630", "subreddit": "gonewild", "score": 2, "controversiality": 0}
{"body": "\r\n\r\n''''''''''''''''''''' http://www.ccshopping.us '''''''''''''''''''''\r\n\r\nNew era cap $9\r\n\r\n\r\nEDHARDY BIKINI $ 16\r\n\r\n\r\nAir jordan(1-24)shoes $30\r\n\r\n\r\nSunglasses Oakey,coach,gucci $12\r\n\r\n\r\nHandbags(Coach l v f e n d i d&amp;g) $30\r\n\r\n\r\nTshirts (Polo ,ed hardy,lacoste) $15\r\n\r\n\r\nJean(True Religion,ed hardy,coogi) $30\r\n\r\n\r\nBikini (Ed hardy,polo) $18\r\n\r\n\r\nFREE sHIPPING\r\n\r\n''''''''''''''''''''' http://www.ccshopping.us '''''''''''''''''''''\r\n\r\nWE ACCEPT PYAPAL PAYMENT AND CREDIT CARD \r\nYOU MUST NOT MISS IT!!!\r\n\r\n", "gilded": 0, "created_utc": "1274109084", "subreddit": "reddit.com", "score": -19, "controversiality": 0}
{"body": "\r\n\r\n''''''''''''''''''''' http://www.ccshopping.us '''''''''''''''''''''\r\n\r\nNew era cap $9\r\n\r\n\r\nEDHARDY BIKINI $ 16\r\n\r\n\r\nAir jordan(1-24)shoes $30\r\n\r\n\r\nSunglasses Oakey,coach,gucci $12\r\n\r\n\r\nHandbags(Coach l v f e n d i d&amp;g) $30\r\n\r\n\r\nTshirts (Polo ,ed hardy,lacoste) $15\r\n\r\n\r\nJean(True Religion,ed hardy,coogi) $30\r\n\r\n\r\nBikini (Ed hardy,polo) $18\r\n\r\n\r\nFREE sHIPPING\r\n\r\n''''''''''''''''''''' http://www.ccshopping.us '''''''''''''''''''''\r\n\r\nWE ACCEPT PYAPAL PAYMENT AND CREDIT CARD \r\nYOU MUST NOT MISS IT!!!\r\n\r\n", "gilded": 0, "created_utc": "1274109686", "subreddit": "AskReddit", "score": -8, "controversiality": 0}
{"body": "N A S T Y !", "gilded": 0, "created_utc": "1274113079", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "How in the world am I supposed to know what to put in for four letters right off the bat? The fan has 3 words: **P**eopl**e**, **W**in**d**, and **E**nergy. I tried using the bolded letters to spell a word but P E W D do not spell anything I can think of. I tried putting them in in order of appearance from top to bottom ( PEWD &amp; EWDP ), no luck. I tried using the dots on the buttons above to use the 5th, 1st, 3rd and 6th letters of the alphabet. I then tried using those letters in the words People and Energy (Wind is not long enough for a 5th and 6th character). STILL NO LUCK.\n\nI tried obviously crap like LOCK, WIND, EOPL (inside of People), And various plays on hitting the up/down letter buttons in various ways to correlate with the dot son the front. Nothing works.\n\nThis is retarded.\n\nEdit: The word **D**evelo**p** is hidden on the back of the fan which you reach by hitting \"Back\" when you are looking at the front of the fan. It is retardedly hard to get to. The controls for these games are what makes them so difficult, I swear.", "gilded": 0, "created_utc": "1274116617", "subreddit": "WebGames", "score": 6, "controversiality": 0}
{"body": "c r e e p y", "gilded": 0, "created_utc": "1274152372", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "I was going to come and post something about this but I can't remember quite wha.. oh right -F U C K I N G- OLD!", "gilded": 0, "created_utc": "1274152786", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "**F R I N G E**", "gilded": 0, "created_utc": "1274188675", "subreddit": "gaming", "score": 21, "controversiality": 0}
{"body": "**R O A D H O U S E**", "gilded": 0, "created_utc": "1274189858", "subreddit": "gaming", "score": 56, "controversiality": 0}
{"body": "** G R I N D H O U S E **", "gilded": 0, "created_utc": "1274190160", "subreddit": "gaming", "score": 18, "controversiality": 0}
{"body": "**L I T T L E   H O U S E   O N   T H E   P R A I R I E**", "gilded": 0, "created_utc": "1274190745", "subreddit": "gaming", "score": 104, "controversiality": 0}
{"body": "A S S C I O W N S - O V - T E H - R I A A", "gilded": 0, "created_utc": "1274190782", "subreddit": "technology", "score": 7, "controversiality": 0}
{"body": "**P H A N T O M**\n\n**O F**\n\n**T H E**", "gilded": 0, "created_utc": "1274191551", "subreddit": "gaming", "score": 4, "controversiality": 0}
{"body": "**D O L L H O U S E**", "gilded": 0, "created_utc": "1274191928", "subreddit": "gaming", "score": 0, "controversiality": 0}
{"body": "**L I T T L E S H O P O F H O R R O R S**", "gilded": 0, "created_utc": "1274191980", "subreddit": "gaming", "score": 5, "controversiality": 0}
{"body": "**P A R K E R L E W I S C A N ' T L O S E**", "gilded": 0, "created_utc": "1274192069", "subreddit": "gaming", "score": 5, "controversiality": 0}
{"body": "**C O Y O T E   U G L Y**", "gilded": 0, "created_utc": "1274192673", "subreddit": "gaming", "score": -7, "controversiality": 0}
{"body": "**H E R O E S**", "gilded": 0, "created_utc": "1274197736", "subreddit": "gaming", "score": -5, "controversiality": 0}
{"body": "**H O U S E O F A T H O U S A N D C O R P S E S**", "gilded": 0, "created_utc": "1274197789", "subreddit": "gaming", "score": -2, "controversiality": 0}
{"body": "**H O G A N S H E R O E S**", "gilded": 0, "created_utc": "1274198319", "subreddit": "gaming", "score": 0, "controversiality": 0}
{"body": "**D O C T O R**", "gilded": 0, "created_utc": "1274198485", "subreddit": "gaming", "score": 0, "controversiality": 0}
{"body": "**H U L K H O G A N ' S R O C K ' N ' W R E S T L I N G**", "gilded": 0, "created_utc": "1274198794", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "**H O U S E P A R T Y**", "gilded": 0, "created_utc": "1274199233", "subreddit": "gaming", "score": 0, "controversiality": 0}
{"body": "**A N I M A L H O U S E**", "gilded": 0, "created_utc": "1274199715", "subreddit": "gaming", "score": -2, "controversiality": 0}
{"body": "**T H E I N C R E D I B L E H U L K**", "gilded": 0, "created_utc": "1274200767", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "D b s a e t b t b.", "gilded": 0, "created_utc": "1274208408", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "**T H I S O L D H O U S E**", "gilded": 0, "created_utc": "1274209552", "subreddit": "gaming", "score": 3, "controversiality": 0}
{"body": "F O U N D - black letters on a white field - rotating clockwise ", "gilded": 0, "created_utc": "1274209585", "subreddit": "lost", "score": 17, "controversiality": 0}
{"body": "m r b's\n\nm r not b's\n\no s a r\n\nc m e d b d i's", "gilded": 0, "created_utc": "1274209783", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "**H O U S E O F F L Y I N G D A G G E R S**", "gilded": 0, "created_utc": "1274211350", "subreddit": "gaming", "score": -2, "controversiality": 0}
{"body": "**T H E I N C R E D I B L E S**", "gilded": 0, "created_utc": "1274211450", "subreddit": "gaming", "score": 0, "controversiality": 0}
{"body": "M A G N E T S ", "gilded": 0, "created_utc": "1274211763", "subreddit": "lost", "score": 1, "controversiality": 0}
{"body": "**T H E I N C R E D I B L E S H R I N K I N G W O M A N**", "gilded": 0, "created_utc": "1274212198", "subreddit": "gaming", "score": -1, "controversiality": 0}
{"body": "L O S T  M A G N E T S", "gilded": 0, "created_utc": "1274212854", "subreddit": "lost", "score": 5, "controversiality": 0}
{"body": "I'm going with T H A N K  Y O U", "gilded": 0, "created_utc": "1274213687", "subreddit": "lost", "score": -5, "controversiality": 0}
{"body": "and i thought it was Punch Doug. My buddy Doug H A T E S me.", "gilded": 0, "created_utc": "1274226262", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "R O F L O S T ", "gilded": 0, "created_utc": "1274227637", "subreddit": "lost", "score": 2, "controversiality": 0}
{"body": "Well bear in mind she just got shot and probably L O S T quite a bit of blood.", "gilded": 0, "created_utc": "1274235278", "subreddit": "lost", "score": 15, "controversiality": 0}
{"body": "**W A L L L L L L L L L T**", "gilded": 0, "created_utc": "1274235465", "subreddit": "lost", "score": 10, "controversiality": 0}
{"body": "**S U R P R I S E  ,  S E E    Y O U    N E X T   S E A S O N   T R O L O L O L O L O L O**", "gilded": 0, "created_utc": "1274239264", "subreddit": "lost", "score": 8, "controversiality": 0}
{"body": "**T H E     A R I S T O C R A T S**", "gilded": 0, "created_utc": "1274256955", "subreddit": "lost", "score": 1, "controversiality": 0}
{"body": "Your theory is good, it makes sense.  But I refuse to accept it!  I don't want Desmond to become a smoke monster!\n\nMaybe Desmond can turn the Frozen Donkey Wheel and not get teleported off the island, which would let him KEEP turning the FDW until the island reaches the Alt Universe.  Then,\n\n1. the Island reaches the alt universe at the same time that all the alt-candidates are gathered together at the concert.\n\n2. ???\n\n3. ** P R O F I T **", "gilded": 0, "created_utc": "1274269117", "subreddit": "lost", "score": 3, "controversiality": 0}
{"body": "**T H R I L L H O**", "gilded": 0, "created_utc": "1274270873", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Yeah I'm not sure what it should look like.  Can I change my request to a L O S T theme instead?  I think would be cool for the icons to be Dharma Symbols!", "gilded": 0, "created_utc": "1274286345", "subreddit": "iphone", "score": 1, "controversiality": 0}
{"body": "**A T L A N T I S**", "gilded": 0, "created_utc": "1274300487", "subreddit": "lost", "score": 11, "controversiality": 0}
{"body": "I hope this quick intro to theory helps. I should be studying..\nIn a 12 bar blues in G you have three chords, each made up of four notes.\n&gt;G7 G B D F\n\n&gt;C7 C E G Bb\n\n&gt;D7 D F# A C\n\nWhen improvising over the blues, one can either play over the changes, or through the changes:\n\n* Playing over the changes requires no knowledge of the chords. For example, playing your blues scale. It always works.\n\n* To play though the changes, one must outline each chord in some way as it passes. The easiest way to play the chord is to play the notes that it is comprised of. \n\nTo play all of these notes on a C harp though would require some bends.\n\nAfter understanding how these notes outline the chords, you should work on playing the Mixolydian scale for each chord. The one for G7 is easy  G A B C D E F G\n\nIf you need any clarification or have any more questions. Please ask!\n\n\n", "gilded": 0, "created_utc": "1274312643", "subreddit": "Learnmusic", "score": 2, "controversiality": 0}
{"body": "I'd say that before you go all out on a kit, there's a number of things you can do.  \n\nFirst, I'd try just seeing if you can keep a beat with your hands and feet. Firstly, just 1-2-3-4-1-2 ..., then try 1-and-2-and-3-and-4-and-1-and... \n\nTriplets are fun, playing:\n\n1-and-A-2-and-A-3-and-A.\n\nIf you're playing the triplets, the basic way to do it is R l r L r l R l r L r l, (Right left right, Left right left...) where the emphasis is on the upper case letters. (I think of it as passing the emphasis between my hands). But there are many ways to play simple triplets.\n\nIf you can do that, I'd recommend investing in a practice pad, a book of drum exercises and some drum sticks. If you're at college, there may be an actual kit you can use if you join a band or music society.  \n\nTo practice actual grooves, a simple rock beat is 1-and-2-and-3-and-4-and. Tap your right hand (hi-hat) to every beat. Tap your right foot (bass pedal) on 1 and 3. Tap your left hand (snare) on 2 and 4. That's a basic rock beat, often tabbed out as:\n         1 + 2 + 3 + 4 +\n    HH | x x x x x x x x   &lt;- hi hat, left hand\n    S  |     o       o     &lt;- snare, right hand\n    B  | o       o         &lt;- bass, right foot\n\nThat's a basic rock beat. Simples!  \n\nGet a drummer friend to show you some styles for holding the sticks correctly. Misholding the sticks sends the vibrations and shocks up your arm, and can lead to injuries if you play for a long time. If you still like it after a couple weeks of basic exercises, good! Look into getting an actual drum tutor (like, a real person). You'll progress a lot faster, especially if you do practice, and the drum tutor will almost certainly have a kit to practice on.\n\nFinally, and possibly most importantly, if you're going to play on a kit **Wear ear protection**", "gilded": 0, "created_utc": "1274314845", "subreddit": "IWantToLearn", "score": 1, "controversiality": 0}
{"body": "The Best Thing I Ever Ate. Except when Marc Summers starts talking. That guy has H O R R I B L E taste in food.", "gilded": 0, "created_utc": "1274325456", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "\nAt School of Management Sciences every possible step is taken to shorten the distance between the students and the external world. One such step was the arrangement of an\ne x p e r t t a l k o n “ INDO-US Economic relations- The road ahead”. Dignitaries present on the occasion were Ms. Nicole Weber, The Economic Officer of American\nembassy in India and Mr. Richard Silver. Apart from being a high voltage knowledge session for the PG students of School Of Management Sciences, Varanasi, the day was of high importance for the arrived dignitaries as the event was organized on America Day.SMS a contemporary management institute never forgets it's own Indian ethics and spirituality. So as usual the event started off with lightening of the lamp and garlanding the statue of goddess Saraswati by the dignitaries accompanied by Prof. P. N. Jha, Director, SMS, Varanasi. Ms. Nicole Weber's delegation made the students aware of the Indo-US economic relations and took the listeners to a new world where brotherhood among nations and healthy environment was easily visualized nations. On the occasion SMS paid full attention to show the credibility of Indian management system\n", "gilded": 0, "created_utc": "1274349780", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "**M A G N E T S**", "gilded": 0, "created_utc": "1274371096", "subreddit": "lost", "score": 1, "controversiality": 0}
{"body": "G C A F D G E C... doo doo dooo....", "gilded": 0, "created_utc": "1274378306", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "tl;dr; \n\nA B C D E F G # b funny stuff funny stuff not really", "gilded": 0, "created_utc": "1274392808", "subreddit": "Guitar", "score": -13, "controversiality": 0}
{"body": "This is the best L O S T article I've read in a while. A quote I particularly like:\n\n&gt;Here's one of the things about mysteries: not everything is a clue. If you went to the headquarters of a company and you were trying to solve a murder, you would find a few things related to the murder, but you would also find lots of isolated, noteworthy things that aren't related to the murder. That's because the building exists outside the murder occurring. The building wasn't built just to house the murder.\n\nedit: oh and this is also great -- \n\n&gt;But it also respects the fact that when you solve a real mystery, there are blind alleys. There are things that don't mean anything. Haven't you ever watched *Law &amp; Order*?\n\nThat last bit, about *Law &amp; Order* is so much better and biting than any diss I've come up with for the perpetual whiners.\n\nlast edit: Thanks a lot for posting this. It's possibly the best article I've read about the series and I wouldn't have found it otherwise.", "gilded": 0, "created_utc": "1274399652", "subreddit": "lost", "score": 23, "controversiality": 0}
{"body": "Does anybody know why some languages that aren't Germanic/Latin have the same alphabet, in the same order (more or less)?\n\nHebrew:** א ב** ג **ד** ה ו ז **ח** ט **י** **כ  ל מ נ** ס **ע פ** צ ק **ר ש ת**\n\nEnglish: **A B** C **D** E F G **H I** J **K L M N O P** Q **R S T** U V W X Y Z\n\nIn bold are letters that sound alike and are in the same place in the alphabet, about two thirds of the Hebrew alphabet correlates to the English, even though it's roots are almost entirely in Arabic and Aramaic.", "gilded": 0, "created_utc": "1274402910", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I thought this was a L O S T thread", "gilded": 0, "created_utc": "1274409739", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "I usually put my middle finger on the F. I never look down. I just kind of rest my hands there. I'll put my hands down the way I usually do I press each key I'm touching, starting with my left pinkie.\n\na e f h n i o enter\n\nIt all depends on the angle I'm sitting at. My chair is turned slightly to the right so I can glance over at the TV. This is why my left hand lands higher on the keyboard. I curled my left middle finger inward to find the notch and I go from there. I rarely set my fingers down with all of them landing on the home row. ", "gilded": 0, "created_utc": "1274410467", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "**M A N O W A R**", "gilded": 0, "created_utc": "1274412879", "subreddit": "Music", "score": 11, "controversiality": 0}
{"body": "Wow, what a way to look at it.  For me it's been 4 jobs and yesterday I just accepted an offer for my 5th.  My first of 3 children was born during Season 1.  My wife and I were on our first year of marriage and yesterday was our 6th anniversary (got a promotion and raise also!).  Also, I've had 4 cars since L O S T started.  I can't wait for L O S T to end... maybe I will stay put in one place finally.  I move around more than the island.", "gilded": 0, "created_utc": "1274441300", "subreddit": "lost", "score": 3, "controversiality": 0}
{"body": "The next time you are in the final round of Wheel of Fortune, select H D C A for your additional letters.\n\n\nYou're welcome.", "gilded": 0, "created_utc": "1274442113", "subreddit": "todayilearned", "score": 21, "controversiality": 0}
{"body": "It's hard to disagree with the lameness of the midichlorians....but when you read the comments of that vocal group of vehemently dissatisfied L O S T fans you can't help but see that they're \"asking for the midichlorians.\"", "gilded": 0, "created_utc": "1274446766", "subreddit": "lost", "score": 1, "controversiality": 0}
{"body": "Comparison with scrabble letters:\r\n    e t a o i n s r h l d c u m f p g w y b v k x j q  z\r\n    1 1 1 1 1 1 1 1 4 1 2 3 1 3 4 3 2 4 4 3 4 5 8 8 10 10", "gilded": 0, "created_utc": "1274449963", "subreddit": "todayilearned", "score": 67, "controversiality": 0}
{"body": "I learned it as \"e t a o i n s h r d l u\" ... wrong now?", "gilded": 0, "created_utc": "1274454390", "subreddit": "todayilearned", "score": 0, "controversiality": 0}
{"body": "**F R I N G E**\n\nAlso:\n\nhttp://www.reddit.com/r/gaming/comments/c6gvo/who_remembers_bleem/", "gilded": 0, "created_utc": "1274454720", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "[Le scaphandre et le papillon](http://www.imdb.com/title/tt0401383/)\n\nE S A I T N R U L O D C P M É V Q F B G H J À X Y È Ê Z W Ç Ù K Œ Ï Ë", "gilded": 0, "created_utc": "1274457293", "subreddit": "todayilearned", "score": 6, "controversiality": 0}
{"body": "F U N E M N X", "gilded": 0, "created_utc": "1274459234", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "I thought for sure it started \"R S T L N E\" ...", "gilded": 0, "created_utc": "1274473959", "subreddit": "todayilearned", "score": 0, "controversiality": 0}
{"body": "Plural word letter frequency is probably more appropriate:\n\n    e i s a r n t o l c d u g p m h b y f v k w z  x j q\n    1 1 1 1 1 1 1 1 1 3 2 1 2 3 3 4 3 4 4 4 5 4 10 8 8 10", "gilded": 0, "created_utc": "1274474802", "subreddit": "todayilearned", "score": 4, "controversiality": 0}
{"body": "+/- systems *fucking suck*\n\nGive me an A B C D or F, not some wishy-washy inbetween bullshit.\n\nand, a C- is not passing anymore [](/fu)", "gilded": 0, "created_utc": "1274529169", "subreddit": "fffffffuuuuuuuuuuuu", "score": 0, "controversiality": 0}
{"body": "The [Curried functions](http://learnyouahaskell.com/higher-order-functions#curried-functions) section of Learn You a Haskell probably explains it better than I could.\n\nTry playing with partial application in ghci.  And use :type (abbreviated to :t) to see the type of anything.\n\n    Prelude&gt; let f x y z = x * y * z\n    Prelude&gt; :type f\n    f :: (Num a) =&gt; a -&gt; a -&gt; a -&gt; a\n\nLet's constrain the type to only work for Int rather than any Num to keep things simple.\n\n    Prelude&gt; let f x y z = x * y * (z :: Int)\n    Prelude&gt; :type f\n    f :: Int -&gt; Int -&gt; Int -&gt; Int\n    Prelude&gt; :type f 3\n    f 3 :: Int -&gt; Int -&gt; Int\n    Prelude&gt; :type f 3 2\n    f 3 2 :: Int -&gt; Int\n    Prelude&gt; :type f 3 2 1\n    f 3 2 1 :: Int\n    Prelude&gt; map (f 3 2) [1..10] -- A common use of partial application\n    [6,12,18,24,30,36,42,48,54,60]", "gilded": 0, "created_utc": "1274538416", "subreddit": "programming", "score": 3, "controversiality": 0}
{"body": "&gt; There have been numerous RPGs that i have played where love between characters is not explicitly stated, but is meant to be understood... Projecting content would be more along the lines of seeing love connections between completely random characters.\n\nSo you've touched on something important I think. I have said that there are plenty of times that one can leave out parts and have their meaning implied, but there are varying degrees that you can do this to.\n\nTake an example where I have you a pattern and you have to fill in the blank. If we take something like this:\n\nI O I O I O _ O I O\n\nit is pretty easy to fill in what the blank is. This is because you are given enough context to be able to properly identify the meaning, even without it being explicitly said. Now if we take something like:\n\nI O _ O I O _ O I\n\nIt can be more difficult. The simplest interpretation would put I's in there, however an equally valid interpretation would be to put other letters in. It fits and would be symmetric, so you can make a case for it. This is when stories leave out things in order to give an aura of uncertainty. For example, perhaps a game with am implied love is more ambiguous; maybe each one has mixed feelings, or maybe one or both is giving mixed signals and the other is unsure how to interpret, etc. This method can work because although the user is projecting *some* onto the story it is just particular parts that still have full context around them. There is also evidence to support certain answers over others while leaving some room for interpretation.\n\nNow, what if you were given something such as:\n\nI _ _ _ _ _ _ _ _ _ _ _ I\n\nAnd were told to fill in the pattern. We no longer have much to go on, and all of the sudden we aren't just filling in certain details but the entire pattern. Whoever is filling in the pattern can make it as mundane or as special as they want to, however any pattern that gets generated will be unique to the one generating it and not intrinsic to the original pattern.\n\nThe concept is the more content that the user must generate, the fewer qualities the medium intrinsically has. This isn't necessarily bad, but it does mean that the quality of the pattern will vary greatly from person to person.\n\nNow if the goal of someone is \"I want to look at a beautiful pattern, can someone recommend a template for me?\" a well structured pattern that is already largely created will give a much more reliable experience, whereas the blank pattern has the potential to be much better (and much worse) than any other pattern that is largely pre-determined.\n\nI'm not saying there should be a hard line as to how much content the user has to project for some kind of classification that doesn't even exist yet, but I think it is important to note that such a distinction exists and the implications of it on the medium itself.\n\n&gt; it sounds like you dislike feelings of uncertainty during narrative as well as disliking open-ended stories.\n\nI wouldn't say I *dislike* them, I just feel that in general it doesn't intrigue me and offers me little or no incentive to want to play the game. To me when I am playing a game, I am the main character. That is not to say that the main character is me with my feelings/hopes/desires/etc, but I put myself in the position of the character and try to understand what he is going through and his own desires. His motivation is my motivation. If I am not given any motivation for what I am doing, I end up having no motivation to play the game because it feels like I'm just wandering around for no reason.\n\nIn SOTC all the motivation is left up to the observer to create, as well as any feeling of progression (at least up to the point I'm at). Am I making progress? Well, the number of colossi killed in my save point goes up. Yay? That doesn't really motivate me. I want to revive this woman who has never been introduced to me, I am merely told that it should be motivation for me. In all honesty I would get about the same motivation from being told that I fuckin *LOVE* carrots and the only way to eat another carrot again is to listen to what this voice above me says (that is to say, I get virtually nothing out of it).\n\nDon't get me wrong, there are plenty of times when I like being imaginative and creating my own narratives and crafting characters that I would find realistic and human. I've written my share of short stories, I got about 200 pages into writing a novel some years back, etc. but when I play games a completely blank environment that I have to project into does nothing for me.\n\n&gt; i disagree with you philosophically about a story without a clear ending not being able to be good. Although it is rare, there are several good stories in which the ending is left to interpretation.\n\nI wasn't exactly clear on that point, there are plenty of examples in which you can create an event that is ambiguous or never explained and still have it meaningful. In order to do so though you need to put the unexplained event into context with the rest of the story. It is entirely possible to create a story where the exact outcome of the final battle (or whatever climactic end point you choose) doesn't matter. However if you create an unexplained event and then don't put it in the proper context with the rest of the story you aren't creating something mysteriously meaningful, you just failed to create content. If the observer decides to project their own content into it that is fine, but that projected content doesn't give the story itself merit. The story is still lacking that content.\n\n&gt; but as a devil's advocate, i can argue that video games have not matured in their art form to the point where movies and books have\n\nAgreed, but at the same time maturing as an art form isn't an absolute thing. Games may not have as many shades of gray on the \"art\" side, but I don't think that really gives an excuse to say \"all games are just games, don't try to split hairs\". I think that if gamers started taking the attitude of games being more mature and including a range from artsy to cheesy that it would allow developers to be more free in their development and be able to communicate what type of game they have in order for consumers to be able to find the games they feel they would enjoy more.", "gilded": 0, "created_utc": "1274542336", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "###A V A T A R \t　 2", "gilded": 0, "created_utc": "1274553684", "subreddit": "funny", "score": 115, "controversiality": 0}
{"body": "I'd say its 'evidence' of just how desperate the authorities are to REGAIN control over an issue - by identifying people who signed the bill, in this case - that is already beyond their control. D E S P E R A T E. What is ultimately of more concern is that, given the general (voting) public's interest is seeing pot-smokers left alone and NOT criminalized for simple possession, the threat to law enforcement's ADDICTION to the funding they receive from government is fueling this type of action by police, most likely perpetrated at the behest of local politicians and non-elected bureaucrats. Public money is being spent on these raids while the public's wishes are being ignored. Will those in power learn to listen before they have a revolution on their hands? Only time will tell, I guess. ", "gilded": 0, "created_utc": "1274554122", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "## A V A T A R    2", "gilded": 0, "created_utc": "1274556472", "subreddit": "funny", "score": 12, "controversiality": 0}
{"body": "G G G G G G G G G  \nG G G G G G G G G  \nG G G G G G G G G  \nG G G G G G G G G", "gilded": 0, "created_utc": "1274563071", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "While I admire the vast amounts of improved logic over the grandparent post displayed in the parent, I have to point out that while your math seems accurate, your approach is wrong.\n\nGoing with previous estimates of man needing seat down 33% of the time, woman 100%.  That means that given 6 times of the restroom being used, 4 will be with seat down, 2 with seat up.  caps are men, lower case are women using. Here are some examples:\n\n* A.  d U D d U d\n\n* B.  D d U d d U\n\n* C.  U d D U d d\n\n* D.  d d U U d D\n\nLet's go through each suggestion, and count the number of flips (We'll assume the seat was in the position that it ends with for the first use), each asterisk is a flip:\n\n#1. Toilet seat should always be down when finished.\n\n* d \\*U\\* D d \\*U\\* d  - 4 - men 4, women 0\n\n* D d \\*U\\* d d \\*U\\* - 4 - men 4, women 0\n\n* \\*U\\* d D \\*U\\* d d - 4 - men 4, women 0\n\n* d d \\*U\\* \\*U\\* d D - 4 - men 4, women 0\n\n\n#2. Toilet lid should always be put down when finished\n\n* \\*d\\* \\*U\\* \\*D\\* \\*d\\* \\*U\\* \\*d\\* - 12 - men 6, women 6\n\n* \\*D\\* \\*d\\* \\*U\\* \\*d\\* \\*d\\* \\*U\\* - 12 - men 6, women 6\n\n* \\*U\\* \\*d\\* \\*D\\* \\*U\\* \\*d\\* \\*d\\* - 12 - men 6, women 6\n\n* \\*d\\* \\*d\\* \\*U\\* \\*U\\* \\*d\\* \\*D\\* - 12 - men 6, women 6\n\n#3. Men should leave it down, women up.\n\n* \\*d\\* U\\* D d\\* U\\* d\\* - 6 - men 2, women 4\n\n* D d\\* U\\* d\\* \\*d\\* U\\* - 6 - men 2, women 4\n\n* U\\* d\\* \\*D \\*U\\* d\\* d\\* - 7 - men 4, women 3\n\n* d\\* d\\* U\\* \\*U\\* d\\* D - 6 - men 3, women 3\n\n#4. Position should be changed as needed immediately before use, never after.\n\n* d \\*U \\*D d \\*U \\*d - 4 - men 3, women 1\n\n* \\*D d \\*U \\*d d \\*U - 4 - men 3, women 1\n\n* \\*U \\*d D \\*U \\*d d - 4 - men 2, women 2\n\n* d d \\*U U \\*d D - 2 - men 1, women 1\n\n\nAll that said, I think the following can be extracted: \n\n* The \"always down\" rule is the least gender-fair rule.\n* Women prefer the \"always down\" rule because it means they never have to change the position.\n* The \"lid down\" rule is the most gender-fair rule, but the least efficient.\n* \"men down, women up\" (parent post) is medium efficiency, and mostly fair.  It's a slightly more fair version of the \"always down\" rule, but it gives up efficiency for fairness.\n* Position should not be changed after, only before is the most efficient, and is very close to fair.  In my opinion, this is the best solution.\n\nNotes:\n\n* There is some value in \"lid down\" and \"seat down\" for consistency sake, that isn't really looked at here.\n\n* I'd welcome someone to do the full blown solution for the problem and analyze all possible orderings, or to observe real life scenarios and apply the comparisons to them.  I'd also be interested in other scenarios... 2 women 1 men.  But I think mathematically, there is no beating the \"leave it in the position where it ends up\" because it is by definition the most efficient.  The only question left open is whether it remains fair when the gender balance changes.", "gilded": 0, "created_utc": "1274589887", "subreddit": "AskReddit", "score": 13, "controversiality": 0}
{"body": "W E L C O\n\nM E T O T\n\nH E N E X\n\nT L E V E L", "gilded": 0, "created_utc": "1274596234", "subreddit": "videos", "score": 8, "controversiality": 0}
{"body": "THE Google UK GIVEAWAY TEAM.\nBelgrave House, 76 Buckingham Palace Road London SW1W 9TQ.\nPh: +447024053930, +447024028674, +44702409 2805,\nFax: +44 8704951196 . Office Open 7 Days, 8am-8pm.\n\nATTN: GOOGLER,\nThe receipt of your correspondence have been duly acknowledged, please pardon me for this late response. I'm pleased to inform you that your email address have been checked and it falls among our lucky winning email addresses for this year draw . On behalf of all team, I'm happy to inform you that you emerged a winner under Category(A), which is part of our anniversary promotional draws. The draws were held to mark  her 11th year of existence(Anniversary) here in UK . No purchase of t i c k e t s were required for this draw, all Participants (email addresses) for this draws were randomly selected from a worldwide range of web searchers who uses the Google search engine(Googler) and other Google ancillary services and this is how your email was picked. Participants were selected through a computer ballot system drawn from 2,500,000 email addresses of individuals and companies from Africa, America, Asia, Australia, Europe, Middle East, and Oceania as part of our International Promotions Program. Therefore, Your  winning payout is £850,000 GBP(Eight hundred and fifty thousand Great  British Pound Sterling) as you already know ,your email address was randomly selected along with others from over 100, 000 email addresses on the internet and each email address was attached to a ticket number.\n\nPRIZE PAYMENT MODALITIES (INFORMATION) :\n\n1 - Personal prize Pickup:\nAll winners are required to come down in person to personally pickup their prize at any of our disbursement locations (cash pickup centers) here in LONDON.\nRequirements for personal prize pickup are :\n(a) A printed copy of your WINNING NOTIFICATION(the first mail you received from us)\n(b) An International Passport or Drivers license\n(c) A tax clearance certificate of your country .\n(d) An Affidavit of age Declaration\n(e) A Printed copy of your Verification form (you may be asked to fill\nit as done before)\n(f)police report attesting your patriotism and crime free citizen of\nyour Country (Note: You are only required to present the above documents only when\nyou are coming down to UK.)\n  In receipt of these requirements your cash prize will be made available to you after 24hrs. Please .This option is basically for lucky winners who can easily visit us in person with the above stated pickup requirements. Your claim deadline is exactly 3weeks from the receipt of this email. Inability to meet up with this stipulated date either due to none availability of some claims documents above,  none availability of travel documents etc. may result to loss of winnings as funds will be re-used for other upcoming draws.This option is recommended by the Google lotto management to clear doubts and unnecessary thinking.This is because we have had series of complaints from individuals that people are using our company name for various forms of indecent acts. So the lotto management would prefer beneficiary winners to come and verify things for themselves about their winning.\n\n2- Online Swift Telegraphic Bank Transfer:\nYour £ 850,000 GBP(Eight hundred and fifty thousand Pounds) which you have won will be transfer to your bank account via swift bank transfer. Condition: The international transfer commission fee being charged by our transferring bank in remitting your fund to your local Bank account must be your responsibility since no tickets were sold. Also note, Your prize will be insured on a bond policy that will debar us of deducting or withdrawing any amount from it  before getting to you. Note that this option is basically design for winners who are not resident of UK and winners who can not visit our payment office in London. I shall refer you to our affiliated BANK for details about the remittance procedure and cost of transfer information if you opt to use this mode of payment. \n\nFind below the lottery payment release order form, please fill it correctly and send back to me asap. Note;For you to be able to fillout the form below, just click on reply from your mail box then double click(click twice) on the space box by this way you will be able to write in space box. Alternatively, you can just writeout the required information out and send to me via this email in plain text if you are unable to fillout the form as directed.\n\n Swift Bank Transfer.\nI expect you to fill and return the Giveaway payment release order form above within 24hrs upon receipt of this message so that appropriate arrangement can be put in place.\nRegards,\nMR. GRAHAMS BENFIELD.\n", "gilded": 0, "created_utc": "1274614529", "subreddit": "WTF", "score": 11, "controversiality": 0}
{"body": "i use a tuning that seems really obvious to me, but i've not met anyone else who uses it. it's a hybrid of standard tuning, Robert Fripp's New Standard Tuning, and open G. low to high it is C G D G B E. what makes it great is that i can play it like a cello or like a guitar at the same time. ", "gilded": 0, "created_utc": "1274633452", "subreddit": "Guitar", "score": 3, "controversiality": 0}
{"body": "U S A U S A", "gilded": 0, "created_utc": "1274659565", "subreddit": "wc2010_crests", "score": 1, "controversiality": 0}
{"body": "**A R R E S T E D  D E V E L O P M E N T**", "gilded": 0, "created_utc": "1274671951", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Fuck this bitch ass shit... F U C K L O S T ", "gilded": 0, "created_utc": "1274672553", "subreddit": "lost", "score": -8, "controversiality": 0}
{"body": "**B E N   A N D   H U R L E Y ' S  M A G I C  I S L A N D**", "gilded": 0, "created_utc": "1274672589", "subreddit": "lost", "score": 75, "controversiality": 0}
{"body": "**F I R E F L Y**", "gilded": 0, "created_utc": "1274675107", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "If L O S T were a game, then Vincent clearly won.", "gilded": 0, "created_utc": "1274675706", "subreddit": "lost", "score": 14, "controversiality": 0}
{"body": "I am so glad that they didn't end with ** F O U N D **.", "gilded": 0, "created_utc": "1274705409", "subreddit": "lost", "score": 3, "controversiality": 0}
{"body": "Heh, I felt the same way, we watched the preshow recap and it was all \"Hey, hey, hey Look over here!  No it's not about mystery its about characters.  Hey no don't look at the statue look at me, C H A R A C T E R S.\"\n\nGood show, the ending felt good but the mysteries were what kept me coming back.  Every show has characters and most do a decent job of being likable.  Lost had a really cool island with cool mysteries that never paid off for me.", "gilded": 0, "created_utc": "1274711304", "subreddit": "lost", "score": 2, "controversiality": 0}
{"body": "There's plenty of vowels in Welsh. In fact, there's more in Welsh than there is in English!\n\nEnglish vowels:\n\nA E I O U\n\nWelsh vowels:\n\nA E I O U W Y (sometimes h)", "gilded": 0, "created_utc": "1274712822", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "Yes, the Welsh alphabet is rather different. In fact, here it is.\n\nWelsh: \n\nA B C CH D DD E F FF G NG H I (J) (K) L LL M N O P PH R RH S T TH U W Y\n\nEnglish (for ease of comparison):\n\nA B C D E F G H I J K L M N O P Q R S T U V W X Y Z\n\nJ and K have brackets around them as they are used in some non official words, technically they are used but they are not an official part of the alphabet.", "gilded": 0, "created_utc": "1274713452", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "**G R E Y ' S  A N A T O M Y**", "gilded": 0, "created_utc": "1274718372", "subreddit": "lost", "score": 9, "controversiality": 0}
{"body": "**B E N  A N D  H U R L E Y ' S  M A G I C  I S L A N D**", "gilded": 0, "created_utc": "1274718386", "subreddit": "lost", "score": 46, "controversiality": 0}
{"body": "**S U B R E D D I T**", "gilded": 0, "created_utc": "1274718692", "subreddit": "lost", "score": 10, "controversiality": 0}
{"body": "I believe the submitter said \"sort\" paragraph.  I've fixed your reply:\n\n&gt;\"ascend\" \"join (a (again, (Dharma) (twice). - - a a a a a a a able all all amount an an and and and and and and and and and and and and are are are at at been black black. brother, by cast centuries Charles consciousness contains crash destroyed, die discover end energy enlightenment Eventually, everyone evil evil faced find find find for for forms. good groups happiness has has has has has he hearted him his his his home If/once in in in in indefinite into is is is is is is island island island island island island, It its Jacob Jacob Jacob, Jacob, knows leave life life. life. like lives long main man man man man man-in-black many many means meet merges monster more most. mysteries. mystical named named named near near never new no nothing of of of of of on on on Over Over over. passed passed, people people perfect. person person. place place place plane power powers, protect protected protector purgatory purgatory, raw replacement search sent smoke source source source\". source, summoned summons take take taken tested than that the the the the the the the the the the the the The the The the the their their their they they they they They this through time time), time, timeless to to to to to to to to tried true try turned uncover various wants war way we wealthy When where where which who Widmore) with with with ", "gilded": 0, "created_utc": "1274718798", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "**L O S T I E R**", "gilded": 0, "created_utc": "1274729854", "subreddit": "reddit.com", "score": 4, "controversiality": 0}
{"body": "My biggest complaint about when they do battle is that, technically, Kate killed him. Jack would have L O S T the fight if she hadn't shown up with her \"hey that was foreshadowing before\" line and shot him. Jack just kicked his mortally wounded ass off the cliff.", "gilded": 0, "created_utc": "1274730468", "subreddit": "lost", "score": 1, "controversiality": 0}
{"body": "He is the *master* of the understated piano soundtrack.\n\nBetween L O S T and Up - he makes magic from the simplest chord changes. ", "gilded": 0, "created_utc": "1274735371", "subreddit": "lost", "score": 18, "controversiality": 0}
{"body": "\"it just doesn't feel like they were building to that at all then suddenly pulled a 180 in the last 10 minutes\" - ...have you seen L O S T before?", "gilded": 0, "created_utc": "1274742028", "subreddit": "lost", "score": 1, "controversiality": 0}
{"body": "Exactly. It's not called \"I S L A N D\"", "gilded": 0, "created_utc": "1274742143", "subreddit": "lost", "score": 1, "controversiality": 0}
{"body": "Which letter comes next in the following sequence of letters ..w l c n i t f s o ", "gilded": 0, "created_utc": "1274744255", "subreddit": "self", "score": 1, "controversiality": 0}
{"body": "May I suggest that you have to register your sex before using it. It doesn't let *men* on if they're over .10 BAC. However, it doesn't let *women* on if they are *under* .15 BAC and posting photos. \n\nAlso, typing the letters F A R M and any other word gets you an electric shock. ", "gilded": 0, "created_utc": "1274747331", "subreddit": "drunk", "score": 15, "controversiality": 0}
{"body": "I feel like everytime he enters a room the lost music should play. And when he leaves the word\n\n**G I A C C H I N O**\n\nshould appear.", "gilded": 0, "created_utc": "1274754218", "subreddit": "lost", "score": 1, "controversiality": 0}
{"body": "Tha blur's not workin for me photographically on this one. \n\nH O W E V E R .....\n\nYour wife has such an EPIC ASS even a blurry photo can't make it look bad.", "gilded": 0, "created_utc": "1274754818", "subreddit": "gonewild", "score": 5, "controversiality": 0}
{"body": "You know you'd r e a l l y get even with him \n\nby re-doing the 'E', 'V', AND 'R' poses \n\nWITHOUT those niggling pieces of paper :)))", "gilded": 0, "created_utc": "1274756996", "subreddit": "gonewild", "score": 3, "controversiality": 0}
{"body": "Heh. I thought of L O T R when Meriadoc finally got to join Frodo and the elves in Valinor.", "gilded": 0, "created_utc": "1274758919", "subreddit": "lost", "score": 2, "controversiality": 0}
{"body": "The answer via http://www.rot13.com/index.php:\nQ N Q O R\nQ Q R Q N\nO N Q O N\nQ O N O R \n\nOh, and Happy Birthday Cullend!", "gilded": 0, "created_utc": "1274763828", "subreddit": "self", "score": 1, "controversiality": 0}
{"body": "**T O S S E D**", "gilded": 0, "created_utc": "1274767496", "subreddit": "lost", "score": 4, "controversiality": 0}
{"body": "B E N A N D H U R L E Y ' S M A G I C A L I S L A N D", "gilded": 0, "created_utc": "1274777071", "subreddit": "lost", "score": 8, "controversiality": 0}
{"body": "**V I N C E N T**", "gilded": 0, "created_utc": "1274786041", "subreddit": "lost", "score": 1, "controversiality": 0}
{"body": "[A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A A](http://uncyclopedia.wikia.com/wiki/AAAAAAAAA! \"HA!\")", "gilded": 0, "created_utc": "1274788972", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "1. L O S I N G\r\n\r\n2. Because BP doesn't set oil prices, they're determined by [the market](http://www.wtrg.com/daily/oilandgasspot.html).", "gilded": 0, "created_utc": "1274792805", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "**C H I C K E N**   **B U T T**", "gilded": 0, "created_utc": "1274797953", "subreddit": "lost", "score": -1, "controversiality": 0}
{"body": "S p a c i n g", "gilded": 0, "created_utc": "1274803284", "subreddit": "linguistics", "score": 1, "controversiality": 0}
{"body": "Maybe you should learn to quickly name and find by name the notes on the 2 biggest strings on the fretboard.  Especially A C D E G.  If you can grab a few power chords that'll get you somewhere in a lot of situations.", "gilded": 0, "created_utc": "1274804527", "subreddit": "Guitar", "score": 1, "controversiality": 0}
{"body": "A B A C A B B on the title screen", "gilded": 0, "created_utc": "1274823596", "subreddit": "AskReddit", "score": -5, "controversiality": 0}
{"body": "it's C I T R I C not CRITIC. I won't bother answering any of the things you posed because clearly you can't read.\n\nIf I create something, I own it, I get to choose what happens with it. If I want it to be free for everyone, it should be, if I want to charge $100,000 I should be allowed to, some douchebag shouldn't be allowed to come along and say \"yeah whatever, I don't care, I'm having it for free!\".\n\nWhether or not you or I agree with the way music works (as a business model) is completely irrelevant, it is the content creators choice what happens with it, not someone not connected with it. \n\nWhere is the line? Can I just walk into a shop and take something because **I** don't think it's worth what the owner wants for it? ", "gilded": 0, "created_utc": "1274825188", "subreddit": "DoesAnybodyElse", "score": 0, "controversiality": 0}
{"body": "**L O S T R I X**", "gilded": 0, "created_utc": "1274827671", "subreddit": "lost", "score": 0, "controversiality": 0}
{"body": "###o h  b r o t h a!\n\nthe new sitcom spinoff", "gilded": 0, "created_utc": "1274845893", "subreddit": "lost", "score": 2, "controversiality": 0}
{"body": "M M M M M EGA COMBO! ", "gilded": 0, "created_utc": "1274855328", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "In the immortal words of James Ford....\n\n**S U N U V A B I T C H**", "gilded": 0, "created_utc": "1274859728", "subreddit": "lost", "score": 1, "controversiality": 0}
{"body": "Most elaborate promo for L O S T ever.", "gilded": 0, "created_utc": "1274873327", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Superman was a bunch of ridiculous tripe also for one because his power level changes to suit the story. In the last movie he lifts an entire island made of kryptonite. Fuck you, superman writers. Now, that being said, I still allow somewhat for the ridiculous explanation because despite it not making a lot of sense at least they gave a explanation. He's an alien, he's not made like us and he gains energy from sunlight. However, this is *not* equal to lost. Let me demonstrate how this would be if it were like Lost.\n\nA man wakes up in the morning, he looks around, gets out of bed, brushes his teeth *then flies through the fucking wall*, saves a bunch of people, everyone claps and the movie ends. S U P E R M A N", "gilded": 0, "created_utc": "1274884961", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Also, as a traveler that occasionally flies with items of extreme sensitivity in an intellectual property sense that I basically won't let leave my person I have some insight into how to avoid this exact situation. The things I carry would probably set off the metal detector. You simply keep it in a pocket and request that you have a hand inspection. They wave you through the metal detector and take you aside. This can create a tense situation as they don't like doing this, but they have to when you set off the metal detector. NEVER let the object be visible or they can force you to put it on the tray. Conceal it, slightly, but not so much that you appear that you deliberately trying to hide it or things can take FOREVER and or you may not get through security. Then once they break out the wand they hit the area, the wand goes off you say \"OH OOPS.. I forgot about this and you take the item out. You then discreetly explain the item could not leave your reach. One time I had a TSA agent examine it closely (USB stick). Told them A.) I forgot and B.) I could not lose it or have it go out of my reach or I would lose my job and that it slipped my mind. (True and True, and Not Quite True). It is unpleasant. You can also request a private screening area which insures less chaos and less potential for item loss. You *NEVER* check a valuable unless you absolutely have to due to its size or restrictions you can't sneak past (size, weapon-like, etc.). \n\nFirearms are not likely to be stolen (nor the case holding them).. but it is out of your control and not the best place to put things. You lose ALL control of that situation, which is not acceptable. In some rare cases the risk assessment indicated it was worthwhile to simply drive instead of fly due to the potential damage loss of a valuable can cause. \n\nI should point out modern cryptography makes this almost a non-concern as most files and things can safely be transferred over the Internet. However, when you need more or less absolute assurance and as few potential chances for theft as possible, this is the kind of risk assessment you perform. There are estimated dollar ranges where the risk of flying and idiocy at the hands of the TSA becomes unacceptable.\n\nedit: this is for corporate world trade secrets. I have friends from the DoD who report they get the same kind of bullshit! They have had issues getting really expensive equipment past the TSA, even when the TSA guys are threatened with security clearances and a giant pile of govt bureaucracy falling down on them in a shitstorm they can't even begin to comprehend. The lesson is you do not fuck with these guys because they are like dinosaur's. They will be to slow to realize pain... and you could get hurt in the process. Stupid is is stupid does and our TSA is S T U P I D. Not just ignorant but plainly a stupid thing. \n\nedit edit: random thought. It helps to be obsequious and ridiculously polite. Remain calm... very calm. It takes very little provocation to set these guys off. Ask for a supervisor. Explain the situation. If you don't appear hopped up and your being rational your chances improve a lot. The instant they feel you are being confrontational they will fuck you over regardless of their policies and rules. ", "gilded": 0, "created_utc": "1274888569", "subreddit": "reddit.com", "score": 118, "controversiality": 0}
{"body": "This has happened to be despite being a white guy from an upper class neighborhood.  Awhile back i was a \"landscape architect\" (gardener) at a local junior college.  It was me and like 7 Mexicans in that department.  We occasionally had to work nights to help the local high school football teams that played there cart equipment around. \n\nWell one time I'm just chillin on my john deer cart and this middle-age white lady walks up to me and starts with the, \"H E L L O.  C A N  Y O U  H E L P  M E  M O V E  T H I S  S T U F F?\"  All the while using some over-the-top sign gestures pointing at me then her then her equipment.  I look at her and say, \"Lady, I'm an American and can ONLY speak English.\"\n\nTo which she replied, \"O K  W E L L  L E T S  L O A D  T H I S  E Q U I P M E N T  T H E N.\"   Still using the exaggerated hand gestures. \n\nHer ignorance pissed me off so badly I have never spoken like this to someone who can't speak English well again.  If I'm having trouble communicating with someone I will ask them if they would like me to speak slower, and by slower I mean pauses in between words NOT elongating words and speaking loudly like a jackass.", "gilded": 0, "created_utc": "1274893832", "subreddit": "AskReddit", "score": 23, "controversiality": 0}
{"body": "**B E N A N D H U R L E Y S M A G I C A  L  I  S  L A N D M Y S T E R Y A D V E N T U R E S**", "gilded": 0, "created_utc": "1274898849", "subreddit": "lost", "score": 2, "controversiality": 0}
{"body": "Theorising is what makes L O S T so tantalising and will keep it's fans alive long after the show is over.", "gilded": 0, "created_utc": "1274899942", "subreddit": "lost", "score": 2, "controversiality": 0}
{"body": "I met her in a club down in old Soho where they drink champagne that tastes just like Coca Cola. C. O. L. A. - Cola. She walked up to me and she asked me to dance. I asked her her name, and in a dark brown voice she said: Leeeeeela! L e e l a Leeela Lee-lee-leela bah bah bah bah bum de de de de de!", "gilded": 0, "created_utc": "1274907043", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Going from Japanese to Korean :\r\n\r\nKorean alphabet is a fair bit easier to deal with, since there are no Kanji used when you're first learning the language.  Even when you get fairly advanced, there's not much need for more than the basic Kanji you'd learn in Japanese anyway\r\n\r\nKorean phonemes are kind of a pain in the dick.  Japanese is easy their vowels are just A I U E O, but Korean have all sorts of crazy rounded vowels, and two vowels that sound almost identical and that even Koreans mess up at times.  So, speaking Korean and sounding correct and being able to map sounds to letters and vice versa won't be nearly as easy as it is Japanese.  Even Korean consonants can be hard to distinguish and pronounce properly.\r\n\r\nJapanese spelling is ridiculously easy, especially if you're an English speaker.  Korean spelling is a huge pain in the butt.  It's #1 one of the major problems American-born-Koreans have with the language.  \r\n\r\nAnd yes, Korean and Japanese both use S-O-V.  Helpful I suppose, but not that big a deal either way.  \r\n\r\nKorean and Japanese also both do conjugation.  I don't think one is significantly more difficult than the other.  They also both have counters.\r\n\r\nOff the top of my head, those are the things you'll notice in your first year or so of study.", "gilded": 0, "created_utc": "1274914948", "subreddit": "starcraft", "score": 1, "controversiality": 0}
{"body": "I still think the best ending ever is if they'd played the 2 hours as normal, and then after the commercial break that starts the last 30 minutes, they played the last episode of Evangelion, finally ending it with the L O S T logo. \n\nI think I would have died. Of awesome.", "gilded": 0, "created_utc": "1274915658", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "**B E N A N D H U R L E Y S M A G I C I S L A N D**", "gilded": 0, "created_utc": "1274917249", "subreddit": "pics", "score": 54, "controversiality": 0}
{"body": "Not a double standard.\n\nAs evidenced by Takumi's post, this image is freely available for viewing on the internet. Requesting permission before posting to Reddit would be courteous, and it's nice to give people credit for their work.\n\nWhether you torrent L O S T or download it from iTunes, we all know who wrote, produced, directed and acted in the show -&gt; go look it up on IMDB.", "gilded": 0, "created_utc": "1274935261", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "F L A S H F O R W A R D", "gilded": 0, "created_utc": "1274938548", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "My wife plays this horrible game and found some snazzy L O S T related items. I thought, I'd share...", "gilded": 0, "created_utc": "1274965489", "subreddit": "lost", "score": 1, "controversiality": 0}
{"body": "t u r t l e power! ", "gilded": 0, "created_utc": "1274965738", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "as someone who has driven thru Texas (we drove from Lafayette, LA to El Paso and back non-stop in 35 hrs) there are H U G E stretches where you wont have cell signal or radio signal. Speed limit is 75 and from El Paso you can probably see San Antonio.. ~480 miles of straight road with nothing on either sides. If you get to El Paso, plan on driving 100 miles into the barren land and see one of the most beautiful sun rises. \r\nAlso remember there are no exits for abt 90 miles ~ about the amt of gas you would ALWAYS need to have. And as iHelix mentioned ALWAYS prepare for any blown tires. You would probably reach there in August it's gonna be hot. like H O T. endless road and endless travel. but i loved it. when you get to DC drop by, we can have a drink or two!! have fun man", "gilded": 0, "created_utc": "1274988870", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "**G A R F I E L D**", "gilded": 0, "created_utc": "1274995949", "subreddit": "comics", "score": 12, "controversiality": 0}
{"body": "**R E D D I T**", "gilded": 0, "created_utc": "1275016447", "subreddit": "Design", "score": 3, "controversiality": 0}
{"body": "O U T S O U R C E.", "gilded": 0, "created_utc": "1275018119", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Fantastic work....and an interesting read. You've earned the right to move on. Head on over to the church and wait for the rest of us.\n\nI have but one observation to add - this thread confirms that one of the smartest lines the writers ever wrote in L O S T was, \"Every question I answer will simply lead to another question.\"", "gilded": 0, "created_utc": "1275037170", "subreddit": "lost", "score": 3, "controversiality": 0}
{"body": "A \"V\" would probably work. Or do a \"F c k Y o U\"", "gilded": 0, "created_utc": "1275037955", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "d o u c h e b a g !!!!", "gilded": 0, "created_utc": "1275041999", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Yeah it's always overpriced so they should deff pay you more for what you do. Where I lived in Quebec there was this spa thing called Nordik scandinavian spas in Chelsea near Ottawa, it had massive hot tubs and cold waterfalls freakin awesome, 40$ for the spas but the massages were like 100+... I love it here tho, down in the kootnays theres lots of natural non-commercial hot springs, one near banff here called White Swan, if you're ever around, it is FREAKIN A M A Z I N G except the sulfur smell but you get over it pretty quickly.... In fact, I think I'm headed there tomorrow :) I wanna visit Van and especially Victoria, I wanna go to QC before st-jean but I'm comin back to Nelson in august.", "gilded": 0, "created_utc": "1275098912", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "Duche is spelled S T E V E J O B S right? Or have I been doing that wrong my entire life?", "gilded": 0, "created_utc": "1275160302", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "S C R U B S", "gilded": 0, "created_utc": "1275163248", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "ur an asshole... lol\nplus y r u a bitch?", "gilded": 0, "created_utc": "1275178652", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Bastard from a basket! BASTARD FROM A B A S K E T!", "gilded": 0, "created_utc": "1275236477", "subreddit": "movies", "score": 7, "controversiality": 0}
{"body": "But most importantly --&gt; F U C K I N G O L D &lt;-- ! ! ! ! ! ! ! ! ! ! ", "gilded": 0, "created_utc": "1275245207", "subreddit": "videos", "score": 0, "controversiality": 0}
{"body": "&gt;Meant as a joke.\n\n&gt;I'm not laughing.\n\nI don't get it. What's funny about posting an exceptionally bigoted statement?\n\nEDIT: Yes, downvote rather than explain. R E D D I T.", "gilded": 0, "created_utc": "1275269709", "subreddit": "worldnews", "score": -5, "controversiality": 0}
{"body": "My suggestion is to send all the negatives to [ScanCafe](http://www.scancafe.com/) (at 35 cents per scan that's $4200), then buy a Canon 8800f flatbed scanner for less than $200 and scan the prints yourself.\n\nThis is  t e d i o u s  work that is easy to mess up if you don't know what you're doing.\n\nI think you should try both routes before you commit: get the 8800f, scan some prints and negatives (see if it's something you really can commit the time and effort to), and also send a small batch off to ScanCafe to see if you like their work. At that point you'll know which options are the most attractive for your situation.\n\nAlso: When scanning yourself you need to take the time to figure out the best settings and software so you don't end up discovering something only after scanning 1000 images and wanting to redo your work.\n\nAnd, FYI, the flatbed scanners may be a better option than a dedicated film scanner because they can scan two strips of 35mm film in one pass; they also scan prints. Although there are some film scanners that can scan an entire uncut roll in one pass: this would be a valuable timesaver if your negatives are in uncut strips of 36.", "gilded": 0, "created_utc": "1275283564", "subreddit": "photography", "score": 3, "controversiality": 0}
{"body": "The worst part is that since L O S T was such a huge success, new shows will be imitating it for the next few years, trying to get away with all kinds of building-mysteries-but-never-answering-them nonsense by slapping on a kumbaya ending.\n\nI think I'll avoid broadcast network TV altogether for the next 5-10 years.", "gilded": 0, "created_utc": "1275283669", "subreddit": "lost", "score": 4, "controversiality": 0}
{"body": "Let me spell it for you: Y E L L O W", "gilded": 0, "created_utc": "1275298910", "subreddit": "funny", "score": 10, "controversiality": 0}
{"body": "Even 5 should be hard to reach unless you have banana fingers.\n\nYou are technically supposed to use 1-4, q e r t f g z x c v b plus all of the above with shift/control modifiers. Alt is hard to reach as well, so use Alt modifier as a last resort. Should never be using any buttons past 5  or any of the F# keys. Use ONLY keys that you can reach comfortably. Most of the actions for most of the classes will fit quite nicely onto the basic buttons mentioned above.\n\nAvoid binding things you don't really need a quick access to (path of frost, deathgate, etc).\n\nThere's a great addon that can free up a lot of space on your bars and let you access abilities/items/macros faster than clicking. It's called Opie. Essentially it lets you bind multiple actions to one key. I have path of frost, deathgate, some engineering stuff and consumables bound to Alt+F for example.", "gilded": 0, "created_utc": "1275306063", "subreddit": "wow", "score": 0, "controversiality": 0}
{"body": "S T O P \n\nU S I N G\n\nE X P L O R E R ! ! ! ! \n\nThe web and all its developers implore you.\n\n[please](http://www.google.com/chrome/index.html?hl=en&amp;brand=CHFX&amp;utm_campaign=en&amp;utm_source=en-oa-na-us-sk-bng&amp;utm_medium=oa)", "gilded": 0, "created_utc": "1275323375", "subreddit": "netsec", "score": -6, "controversiality": 0}
{"body": "10 year competitive here.  8 years of comp. cs, 2 years of GB on XBL.  gamertag is s T o P b R o.  44k on GB and I need a team", "gilded": 0, "created_utc": "1275343511", "subreddit": "360MW2", "score": 1, "controversiality": 0}
