{"body": "The first, and to my mind, the last thing you need to know about Michele Bachmann is that shes a graduate of Oral Roberts University School of Law.\n\nThat's the deviant clown who asked for and received several million dollars in contributions from his flock because Jesus threatened to take him home...WTF.\n\nIf I remember correctly, he also saw Jesus in person and claimed he was 900 feet tall...or maybe that was some televangelist, like there's are difference.\n\nOther then the Bush administration, where the fuck does a graduate of O R L S work? ", "gilded": 0, "created_utc": "1225543171", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "My Epson has a first name it's E P S O N.", "gilded": 0, "created_utc": "1225640410", "subreddit": "pics", "score": 17, "controversiality": 0}
{"body": "u forgot one...\n\n\nB U Z Z W O R D S", "gilded": 0, "created_utc": "1225689536", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "McCain and Palin\nSitting in a Tree\nF A I L I N G", "gilded": 0, "created_utc": "1225701913", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "&gt;E L E C T O R I A L", "gilded": 0, "created_utc": "1225727363", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "N i i i i i i i i i i c e.", "gilded": 0, "created_utc": "1225856189", "subreddit": "nsfw", "score": 3, "controversiality": 0}
{"body": "ROFL R O F L \n\n\nPoor Bush, stole Billions with his Bonesman friends and still can't get no respect..\n\n", "gilded": 0, "created_utc": "1225916449", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "B R E A K E R!", "gilded": 0, "created_utc": "1225923188", "subreddit": "business", "score": -2, "controversiality": 0}
{"body": "NO, if you were realistic you would remember that Ron Paul didn't want you to vote for him!\n\nHe had no delusions of grandeur.  The whole point of his running was to get people interested in politics and the principles of our country.  The fact that he told people not to vote for him since he didn't win the Republican nomination only goes to highlight the fact that our system is a two party system and is inherently broken.  Aren't you pissed that you can't vote for him? no...\n\nInstead you choose to ignore this and do nothing, and instead write R O N P A U L on the shifty little touch screen keyboard and pretend like you are doing something great.  ", "gilded": 0, "created_utc": "1225942545", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "A A A A A A !!!", "gilded": 0, "created_utc": "1226087499", "subreddit": "funny", "score": -4, "controversiality": 0}
{"body": "r1 r2 l1 r2 u d l r u d l r, IIRC, but that may be Vice City.\n\nWhy the hell do I remember this?", "gilded": 0, "created_utc": "1226088326", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "No, no, no, it's A B A C A B B", "gilded": 0, "created_utc": "1226092319", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "  Rahm Emanuel and Obama’s Civilian Security Force\n\nKurt Nimmo\nInfowars\nNovember 6, 2008\n\nAs Paul Joseph Watson notes this morning, Obama’s apparent pick for chief of staff, Illinois Democrat Rahm Emanuel, is disturbing in light of the fact he is a staunch supporter of reactionary forces in Israel and his father was an Irgun terrorist.\n\t\n\t\n\t\n\n“The son of a man who helped carry out this slaughter [the Deir Yassin massacre of Palestinians] has now been selected by Obama to be his chief-of-staff. Cries of ’sins of the father’ lose their gusto when one considers the fact that, after the 1996 re-election of Bill Clinton, Rahm Emanuel ‘Was so angry at the president’s enemies that he stood up at a celebratory dinner with colleagues from the campaign, grabbed a steak knife and began rattling off a list of betrayers, shouting “Dead! … Dead! … Dead!” and plunging the knife into the table after every name.’ Sounds like a nice guy,” writes Watson. (Emphasis mine.)\n\nEmanuel’s emotional response to Clinton’s enemies reveals how he will likely deal with new perceived enemies as Obama’s right-hand man. In his book, The Plan: Big Ideas for America, published in 2006, Emanuel sketches out his ideas on how to “fight against the spread of evil and totalitarianism.” In addition to fortifying “the military’s ‘thin green line’ around the world by adding to the U.S. Special Forces and the Marines, and by expanding the U.S. army by 100,000 more troops,” Emanuel suggests “we must protect our homeland and civil liberties by creating a new domestic counterterrorism force like Britain’s MI5.”\n\n    * A d v e r t i s e m e n t\n    * Obama - The Postmodern Coup\n\n“A new domestic spying operation is an obvious threat to our civil liberties,” notes John Walsh in response to Emanuel’s suggestion. “MI5 holds secret files on one in 160 adults in Britain along with files on 53,000 organizations.” It should be noted that MI5 also specialized in the infiltration of British unions and was responsible for directing many of the IRA’s atrocities.\n\nRahm Emanuel’s ideas on defeating the alleged specter of “domestic counterterrorism” dovetail with frightening precision with Obama’s declaration that once elected he will create a Civilian Security Force “just as powerful, just as strong, just as well-funded” as the U.S. military. “People of all ages, stations, and skills will be asked to serve.”\n\nThe U.S. Army alone has nearly 500,000 troops, not counting the National Guard. “Is Obama serious about creating some kind of domestic security force bigger and more expensive than that?” muses Joseph Farah of WorldNetDaily. “If not, why did he say it? What did he mean?”\n\nIt should be obvious what he meant, although we cannot expect the corporate media to fill in the blanks. If Obama’s soon-to-be chief of staff stabs a knife into a table as a form of punctuation while denouncing the enemies of his former boss, Bill Clinton, it does not take a lot of imagination to predict how Obama’s Civilian Security Force will be used.\n\nIs it possible the acorn does not fall far from the tree? Emanuel’s father belonged to a terrorist organization that killed the opposition, including women and children. Is it possible this psychopathic mindset was passed on to his son and will now manifest itself in Obama’s Civilian Security Force?", "gilded": 0, "created_utc": "1226127849", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks.\n\nNot to mention that by changing the 2 to N, you end up with all sorts of new constructs/situations that simply didn't really exist before.\n\nLike a \"marriage\" that can merge two different groups/families that are already established.\n\nOr what about constructs like, say, what're they called? \"line marriages\" maybe? ie, consider five people A B C D E in which each is married to the two next to it (A and E are only married to one each, either that or they close the ring eventually)\n\nI mean, eventually it may get to the point that lawyers working in this field have to also be graph theorists. :)", "gilded": 0, "created_utc": "1226253100", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I don't get it. \n\n    B T S S R T C E ? \n    B U/V T T S U/V C E ? \n\nWhat am I doing wrong? Is there a real solution?", "gilded": 0, "created_utc": "1226436228", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "If we're gonna say lest we forget - let's also say - never again.\n\nI hate to break it to you all, but Iraq and Afghanistan are agains - and we are still sending soldiers there.\n\nN e v e r  A g a i n !", "gilded": 0, "created_utc": "1226482234", "subreddit": "australia", "score": 1, "controversiality": 0}
{"body": "B b b b b but Obama's doing it...it's for the workers!", "gilded": 0, "created_utc": "1226550904", "subreddit": "Libertarian", "score": 1, "controversiality": 0}
{"body": "S p e l l c h e c k e r", "gilded": 0, "created_utc": "1226583803", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "p a t h e t i c", "gilded": 0, "created_utc": "1226680928", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "I had an Asus m307 cell phone with all my contacts in it. Needless to say i lost it but i had backed the contacts on a mini SD. I have all the file but i haven't been able to figure out how to open the fucking thing. All the files have a .bk file extension but iv googled for hours and i still dont know how to open it. If i open it in notepad i get this:\n\n\"O BC Transitÿÿÿÿÿÿÿÿÿÿ\u0006R0(\u0016\u0016                                                     ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ    ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ/ f f s / S u b W a l l p a p e r / P 0 0 0 6 7 0 0 . J P G     A             #      \u001d\u001e / f f s / D e f R T / P o w e r _ O f f _ T o n e . m m f                           \u0002\u001c\u001d / f f s / D e f R T / P o w e r _ O n _ T o n e . m m f   # #                             M\u0004\u0004     \u0003   L\u0004B     \u0004   L\u0004?     \u0003   L\u0004A         L\u0004?     \u0003   Ì   T!q\u0002&lt;   Ì       \u0003   L\u0004=         M\u0004\u0004     \u0003   L\u0004A     \u0003   L\u0004A     \u0003   L\u0004A         T\u0004      \u0003   M\u0004\u0004        \u0003\u0004 G i l     L\u0004E     \u0003   L\u0004G     h\u0002  L\u0004I     \u0003   L\u0004I         M\u0004\u0004     \u0003   L\u0004D   ÿ  ÿ\"\nIm stumped... Any help would be awesome.", "gilded": 0, "created_utc": "1226717837", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "**IF THIS PERSON READ THE BIBLE, HE\"D KNOW TWO THINGS.  ONE, THAT GREED IS A SIN, AND TWO, THAT MONEY IS THE ROOT OF ALL EVIL.  I DON\"T FEEL SYPATHY FOR ANYONE THAT GETS CONED.  THE ONLY PEOPLE THAT GET CONED ARE GREEDY SCUM OF THE EARTH, AND PEOPLE THAT ARE TYPICALLY ON THEYRE WAY TO HELL.  EVIL PEOPLE ARE THE PEOPLE THAT GET TORMENTED ON EARTH BY SATAN, AND THE REASON WHY THEY ARE SO UNHAPPY.  (AGAIN, READ THE BIBLE).  EVER WONDER WHY CALIFORNIA GOT A HUGE WILDFIRE THAT SEEMS TO BE ATTRACTED TO LIBERAL HOLLYWOOD ELITESTS HOMES?!?  TWO WORDS.  G A Y  M A R R I A G E.  iM SUPRISED THT SANFRANSISCO HASNT BEEN LEVELED BY A HUGE EARTH QUAKE YET.  GODS PROBABLY ALLOWING THE HANDFULL OF GOOD PEOPLE TIME TO LEAVE BEFORE THE PLACE GETS DESTROYED.  ONCE GODS DONE WITH THAT SESSPOOL, ITLL LOOK LIKE GROUND ZERO BUT A HUNDRED THOUSAND TIMES THE SIZE, AND A LOT MORE RED STAINED CONCRETE.  WAKE UP PEOPLE, THE TIME OF THE LORD IS AT HAND.  GOOD LUCK TRYING TO PUT OUT THE FIRE IN YOUR HOUSE WHEN A THOUSAND OTHER LIBS ARE TRYING TO USE THE SAME FIRE TRUCK.  THE REST OF US (CHRISTIANS) WILL BE SAFE INSIDE THERE HOMES WITH THEYRE KIDS AND WIFE (OF THE OPPOSITE SEX) WATCHING HIS WRATH UNFOLD ON FOX.  PASS THE POPCORN.**", "gilded": 0, "created_utc": "1226775823", "subreddit": "science", "score": -21, "controversiality": 0}
{"body": "I wish the article was about a L O S T/Beatles epic...but this is cool too.", "gilded": 0, "created_utc": "1226811915", "subreddit": "entertainment", "score": -2, "controversiality": 0}
{"body": "Just found this comment after searching for games like Light Bot. Comments/criticisms about your game:\n\n * Robo's Escape is slightly more sophisticated than Light Bot (up to 5 user defined functions, instead of just 2).\n * Light Bot is easier to get into for a beginner.\n * Robo's Escape is more challenging (especially if you try to maximize the score for each level).\n * In Robo's Escape, you can't easily reposition already placed controls. You have to delete them and place them again from the menu. Annoying when you have to move a whole function one space to the right to insert an extra symbol... Light Bot is slightly less annoying.\n * Robo's Escape doesn't allow you to save your progress or to replay a level to see if you can beat your score.\n * Some of the solutions can get extremely long. It would nice to be able to speed up the animations.\n * Highscore table. The game should send the moves to a central server, which will verify them and then post the score, without revealing the move sequences publicly.\n\nI think Robo's Escape is fun. If I have time, I will see if I can find good solutions for all 12 levels. What are the best scores for each level?\n\nHere are my scores (with spoilers):\n\n * Level 1: 68 (J1 J1 F J1 L 1: L F F F G Ret)\n * Level 2: 95 (R R J1 X J1 F J1 R 1: R F F G F Ret)\n * Level 3: 43 (F G L F F R Ret)\n * Level 4: 67 (F J1 J1 J1 J1 L 1: L F G R F Ret)\n * Level 5: 72 (X L J1 J1 J1 F G Ret)\n * Level 6: 46 (J1 J1 J1 J2 R R 1: R X F F F G Ret)\n * Level 7: 55 (J2 R 2: J3 X J1 R R J1 1: G F L F Ret)\n * Level 8: 61 (J2 J3 J1 J1 J1 J2 J2 2: R R 1: L J3 J3 F G X F Ret)\n * Level 9: 43 (R J1 J1 J1 G F Ret) \n * Level 10: 57 (J1 R J2 J2 1: J2 F F L F G F Ret)\n * Level 11: 64 (J1 R 1: J5 J2 J4 L 2: J5 J4 J4 R R J4 R J3 J4 3: R X 4: F F G L Ret)\n * Level 12: 51 (R F J2 J2 2: J1 R 1: R G X J3 J3 J3 F L F R Ret)\n\n", "gilded": 0, "created_utc": "1226870622", "subreddit": "programming", "score": 2, "controversiality": 0}
{"body": "B u l l s h i t .", "gilded": 0, "created_utc": "1226916898", "subreddit": "technology", "score": 3, "controversiality": 0}
{"body": "Wrong.\n\nThe correct answer was t h a t .", "gilded": 0, "created_utc": "1226920624", "subreddit": "technology", "score": 2, "controversiality": 0}
{"body": "I've reposted this article, only changing the language slightly to fit the Joos subreddit:\n\n[TEH JOO KILLS... TEH JOO!!! Joo boms kill joo criminal. CRIMINAL. C R I M I N A L !!!!!1!1111||||911](http://www.reddit.com/r/joos/comments/7dzyi/teh_joo_kills_teh_joo_joo_boms_kill_joo_criminal/)\n", "gilded": 0, "created_utc": "1226967696", "subreddit": "Israel", "score": 1, "controversiality": 0}
{"body": "What scandals? A blowjob pffft. Get a fucking life! The only ones making a fuss about it, because they have n o t h i n g  else to talk about is the right-wing ass poke sniffers.", "gilded": 0, "created_utc": "1227039185", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "J U S T I C E ????\n\nI can hope, we can hope.", "gilded": 0, "created_utc": "1227055688", "subreddit": "reddit.com", "score": -9, "controversiality": 0}
{"body": "thx u r a q t", "gilded": 0, "created_utc": "1227229385", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "shhhh shhhhh shhhhh let it happen let it happen relax and it wont hurt j u s t l e t i t h a p p e n", "gilded": 0, "created_utc": "1227314122", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "    * g o a t s e x * g o a t s e x * g o a t s e x *\n    g                                               g  \n    o /     \\             \\            /    \\       o\n    a|       |             \\          |      |      a\n    t|       `.             |         |       :     t\n    s`        |             |        \\|       |     s\n    e \\       | /       /  \\\\\\   --__ \\\\       :    e\n    x  \\      \\/   _--~~          ~--__| \\     |    x  \n    *   \\      \\_-~                    ~-_\\    |    *\n    g    \\_     \\        _.--------.______\\|   |    g\n    o      \\     \\______// _ ___ _ (_(__&gt;  \\   |    o\n    a       \\   .  C ___)  ______ (_(____&gt;  |  /    a\n    t       /\\ |   C ____)/      \\ (_____&gt;  |_/     t\n    s      / /\\|   C_____)       |  (___&gt;   /  \\    s\n    e     |   (   _C_____)\\______/  // _/ /     \\   e\n    x     |    \\  |__   \\\\_________// (__/       |  x\n    *    | \\    \\____)   `----   --'             |  *\n    g    |  \\_          ___\\       /_          _/ | g\n    o   |              /    |     |  \\            | o\n    a   |             |    /       \\  \\           | a\n    t   |          / /    |         |  \\           |t\n    s   |         / /      \\__/\\___/    |          |s\n    e  |           /        |    |       |         |e\n    x  |          |         |    |       |         |x\n    * g o a t s e x * g o a t s e x * g o a t s e x *", "gilded": 0, "created_utc": "1227319345", "subreddit": "AskReddit", "score": 17, "controversiality": 0}
{"body": "W H O    F U C K I N G    C A R E S ?", "gilded": 0, "created_utc": "1227356403", "subreddit": "gadgets", "score": -2, "controversiality": 0}
{"body": "Essex.\n\nLondon!\n\nEssex!\n\nLONDON!\n\nESSEX!\n\nL O N D O N !!\n\nE S S E X !!\n\n**L O N D O N !!!**\n\n**E S S E X !!!**", "gilded": 0, "created_utc": "1227452046", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "M M M M M Mime Raper?", "gilded": 0, "created_utc": "1227483471", "subreddit": "pics", "score": -3, "controversiality": 0}
{"body": "Calibre, D Bridge, Breakage  put out some of the most interesting DnB that has come out in the last 6 months. AAron Spectre is a long time label boss who has recently been making dubstep influenced D n B that is also interesting. Hospital Records has also been creating a lot of buzz outside of the the drum and bass scene this last year because some of their releases appeal to a more eclectic aesthetic. A lot of the replies to this comment are pointing you to artists that peaked 8-10 years ago.  Doesn't mean they aren't good, but the sound has evolved. If you are going to dig in history I recommend looking for mixes on soulseek. There were some classic mixes circulating back in the day by Dj Dara. Also of note:, A Guy called Gerald's \"Black Secret Technology\" is held up by all electronic music heads as an all time classic, way beyond the confines of the Drum and Bass scene, even though it is a D n B record. ", "gilded": 0, "created_utc": "1227542833", "subreddit": "Music", "score": 2, "controversiality": 0}
{"body": "Umm, I'm pretty sure that \"ain't\" was popular before Nixon became president. Yep. OED says the 18th century. So there goes that assumption.\n\nThere's a difference between linguistics and composition and rhetoric. Yeah, linguistics still study prescription and traditional grammar, but studies have shown time and time again that students don't actually learn to write any more effectively using those pedagogies than they do with others, such as generative transformational. Some studies even show that students that are taught using traditional grammar are more likely to hate writing altogether. \n\nEnglish speaking people will always speak using the same grammar. We're a S V O speaking people, and that won't change. What does change is that over time, we figure out ways to become more efficient in speaking and writing. Most people lose sight of the fact that writing and speaking is, at its most basic, about communicating information. \n\nThe average, uneducated person gives less than two shits about the difference between who and whom, or about the comma rule as it applies to separating dependent and independent clauses. Why? Because that kind of stuff doesn't affect MEANING, and that's all they care about. BTW is a perfect example of that. So is the rule about independent clauses, which you clearly broke in your last sentence. Of course, I understood you perfectly because breaking that rule, or not knowing it, didn't affect the meaning you were trying to convey.\n\nAlso, words come in and out of popular usage, and a change in spelling or an incident of linguistic conversion isn't odd. It's a normal evolution of any language. Take a look at Chaucerian English, Elizabethan English, or hell, even the English of the Transcendentals, and you'll notice a hell of a big difference between then and now.  \n\n", "gilded": 0, "created_utc": "1227636034", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Yeah, I'm so anti-self.reddits that I feel like a tool for posting this, but I thought maybe somebody can help.\n\nAnyone know how to make a spreadsheet wrap in Excel such that it will take columns:\n\n\n|--- Page Width ---|\n\nA B C D E F G H I J K L M N O P\n\n\nAnd print columns:\n\n|--- Page Width ---|\n\n1A B C D E F G H I\n\nJ K L M N O P\n\n2A B C D E F G H I\n\nJ K L M N O P\n\n\n\nIdeas?", "gilded": 0, "created_utc": "1227691264", "subreddit": "programming", "score": -1, "controversiality": 0}
{"body": "Old MacDonald had a farm e i e i o! ", "gilded": 0, "created_utc": "1227879071", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "And he sold that farm to a mean old butcher e i e i o!", "gilded": 0, "created_utc": "1227885171", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "And that butcher jerked off on the meat e i e i o", "gilded": 0, "created_utc": "1227891529", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "**R E A D A B O OO-KAY!**", "gilded": 0, "created_utc": "1227977748", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "T R O L L !", "gilded": 0, "created_utc": "1228006277", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
