{"body": "Can some please spell - C A R C I N O G E N I C !", "gilded": 0, "created_utc": "1257048545", "subreddit": "WTF", "score": -5, "controversiality": 0}
{"body": "Do the D A N C E", "gilded": 0, "created_utc": "1257096226", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "D A D G A D\n\nChanged my life.", "gilded": 0, "created_utc": "1257110864", "subreddit": "Music", "score": 6, "controversiality": 0}
{"body": "c a d g c d", "gilded": 0, "created_utc": "1257111641", "subreddit": "Music", "score": 1, "controversiality": 0}
{"body": "e b e b e b", "gilded": 0, "created_utc": "1257111778", "subreddit": "Music", "score": 1, "controversiality": 0}
{"body": "Some great advice in this thread. And some not so great.\n\nI just created a throw-away account in order to answer this question. Because I've been having buttsecks for decades. I practically invented it!\n\nFirstly, because you are a guy, the quick answer is **out of this world fantastic**.\n\nBut that's all about you. We need to talk about her...\n\nIf you do this wrong the first time, she will never entertain the idea of doing it again. And that would suck for you. And, even for her! So, here goes the advice:\n\nBE NICE!\n\nFirstly, people's (women's) biology vary greatly. With some women, you's swear they never pooped in their lives. An ass as clean as a whistle. Every single time. Others, not so much. If she's of the 'not so much' variety, she can use a laxative beforehand. My last GF did this.\n\nWhat you *never* see in porn is a girl running to the bathroom with shit flying. Or a guy with big gobs of crap on his dick. Thankfully, I've never see this first-hand either! But I'm sure it could happen. There have been smaller messes. A wet washcloth next to the bed is a really good idea. I purchased dark washcloths and towels for this very activity.\n\nStart the ass-play during regular sex. Put some lube (or just spit) on your pinkie while having regular sex. Use it to rub around and on her anus as you have vaginal sex. This is kind of a warm-up exercise and can continue until you actually penetrate her anus with your finger. Which might happen in only a few minutes!\n\nYou should actually do this for a week or so. Perhaps four or five sexual encounters. You can upgrade to ring finger, then thumb over the course of a week. If she's an anal virgin (and we're assuming so here) it is going to feel unnatural and unnerving. Let her get used to this (originally strange) feeling.\n\nLube - There can never be too much lube. Lube her butt and every last mm of your cock. Slather your penis with lube. Really.\n\nWater-based lube cleans-up really quickly. Silicone lube is difficult to clean-up, requiring a lot of soap and water. Basically, a shower. But, is much slicker. Lube is expensive. :(\n\nFrom my experience, the first actual penis-anus penetration should be in the missionary position. Face-to-face. You're doing something really intimate here and you want to look directly at her (pretty!) face while doing it. So you can see how this is all playing-out for her. Talk. Ask how it feels. Go super slow. Be happy the tip is in. Say something encouraging here. \"OMG I can totally feel the tip is in. You feel like heaven!\"\n\nHere's a million-dollar trick: Once you have the tip in, and are doing the face-to-face thing, and you are going super slow... At this point, bite the lobe of one of her ears while you insert yourself s l o w l y.\n\nThis is her first anal sex. It **has** to be about her. It has to be slow and nice and you have to be happy with the simple fact that you are where you are. It should be more than enough to get you to cum.\n\nAfter a couple of these encounters, she will beg you to plow her ass. And, will start to push back during doggie-style (Which is the best thing ever, btw.) You'll soon be able to tap that ass full length and, full speed. But, get there slowly.\n\nTL;DR - If you do it wrong the first time, all bets are off! Which is sad, because great anal sex is the best thing in the world.", "gilded": 0, "created_utc": "1257121518", "subreddit": "nsfw", "score": 8, "controversiality": 0}
{"body": "D A D G B D\n\nB A D G B D\n\nA A D G B D\n\nB F# B E G# B/C\n\nF# F# B E G# B\n\nOccasionally, I tune the E string up in standard tuning so it's F# A D G B D. I have tuned to A# something once but I didn't like how it sounded. I rarely stick to a standard form tuning, and I choose not to use open tunings.", "gilded": 0, "created_utc": "1257124586", "subreddit": "Music", "score": 3, "controversiality": 0}
{"body": "1994 and I and two friends flew from Australia to the UK for a two year working holiday.  We arrived at Gatwick airport, got on the train to Brighton, checked into a bed and breakfast then went to the closet public phone to talk to our parents. \n\nI was wandering about waiting to make my call when I hear \"**OI!**\" yelled directly at me. Startled, I looked around to see a mate of mine from Australia waving to me and walking my way and grinning like an idiot.  \n\nSo, the *very* first person I met in the UK I already knew well.  I had no idea he was there either, pure coincidence.  F r e a k y ! ", "gilded": 0, "created_utc": "1257149726", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "David Bowie spells out D A V I D in place of P I X I E S in his cover of *Cactus*. I'd say it works, but probably only because it's David Bowie covering the Pixies.", "gilded": 0, "created_utc": "1257200770", "subreddit": "AskReddit", "score": 8, "controversiality": 0}
{"body": "From the squid conf:\n\n    acl kids-laptop arp  00:19:D2:FF:FF:FF\n    acl schoolnights time S M T W H 21:30-22:30\n    acl schooldays time S M T W H 00:30-16:30\n\n    # redirect them to an informative page letting them know I SAID NO DAMMIT\n    deny_info http://192.168.1.1/locked.html schoolnights\n    deny_info http://192.168.1.1/locked.html schooldays\n\n    http_access deny kids-laptop schoolnights\n    http_access deny kids-laptop schooldays\n\nEt voila: teen angst at having no access to myspace or facebook when they should be in bed or doing homework.", "gilded": 0, "created_utc": "1257201736", "subreddit": "linux", "score": 7, "controversiality": 0}
{"body": "I listened to about 10 after this.  [\"Angry(feet)\"](http://www.youtube.com/watch?v=-lktd1OBHVI&amp;feature=related) was my favorite for his writing/performance.  \"Take My Wife\" made me think I was watching myself in an alternate universe where I had talent, but the piano seemed unnecessary.  I'd put \"G G R E I N\" first, then \"Inflatable You\", overall, from what I saw.", "gilded": 0, "created_utc": "1257228753", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "&gt;As we discussed the initial beginning of life upon the earth in that class, we talked about the synthesis of various primitive chemical materials such as deoxyribonucleic acid (DNA). As we discussed this, I once again asked a question related to the one that I had asked previously. I asked this professor what the process was by which the original life--the original living cells upon the earth--came into existence. How did the structure or generation of DNA occur? Once again, this man said, \"Young man, that is not a question that falls within the realm of science.\"\n\nScience is very much concerned with how DNA (and information within it) came about. Evolution  and Abiogenesis answer this to a satisfactory degree. What kind of a biology professor would claim this doesn't fall within the realm of science? B U L L S H I T.\n\nAlthough I'm certain there are atheists who became theists, I don't believe he was one. The whole thing sounds as made up as all those \"Atheist university professor schooled by meek Christian student\" stories out there.\n", "gilded": 0, "created_utc": "1257268722", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "Singer-songwriter C a r n i e Wilson has just landed her own weight loss reality show that will \n\nair this January on the Game Show Network ", "gilded": 0, "created_utc": "1257270773", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "B U L L S H I T ! ! !\n\nSince Johnny did it too that makes it ok.  \n\nWhat logic! &lt;/sarcasm&gt;", "gilded": 0, "created_utc": "1257284454", "subreddit": "worldnews", "score": 2, "controversiality": 0}
{"body": "That is like saying the only way to read is by reading each word out loud S L O W L Y because some people may not be smart enough to read in their head...", "gilded": 0, "created_utc": "1257351540", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "v a l e r i e and r a c h a e l ray Tune in this Wednesday, November 4 to the Rachael Ray Show to go behind the scenes of Valerie B e r t i n e l l i’ s new workout DVD", "gilded": 0, "created_utc": "1257355874", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "He used to run a 1-900-T E L E T A P", "gilded": 0, "created_utc": "1257401965", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "b u l l s h i t", "gilded": 0, "created_utc": "1257410180", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Oh my.. since you brought up the whole 'home alone' bullshit i figured you would get the bucket of paint reference but it was obviously wasted on you. I really don't understand why your even arguing when it's blatantly obvious your wrong. L E T M E T R Y A S K I N G S L O O O O W L Y . . . ", "gilded": 0, "created_utc": "1257421408", "subreddit": "IAmA", "score": -6, "controversiality": 0}
{"body": " M E X I C A N   flu\n\n people, it came from mexico.", "gilded": 0, "created_utc": "1257425392", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "\"A B A C A D A B A\"  Also worked sometimes.  Almost magically...", "gilded": 0, "created_utc": "1257456457", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "It actually has multiple letters... S H I F T E N A V are also on the keyboard. ", "gilded": 0, "created_utc": "1257495620", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "To quote her MySpace:\n\n\"i am pretty new to the porn w o r l d♥ and so far im in freakinnnn love with it...im a porn star bitches!\"", "gilded": 0, "created_utc": "1257498813", "subreddit": "nsfw", "score": 1, "controversiality": 0}
{"body": "Yeah the installation time is way-off, but I'd agree with him on the s l o w front. Can't speak for any new version, but my latpop and family computer used to just stop when AVG ran it's scan. Eveyone got into the habit of hitting pause/stop which rather ruins the point of an Anti-Virus.\n\nMoved on to Avast now. Touch more confusing (IMO) but it does some weird magic meaning it never scans and keeps everything running properly.  Also I don't believe it tries to add any toolbars.", "gilded": 0, "created_utc": "1257532399", "subreddit": "windows", "score": 1, "controversiality": 0}
{"body": "Paradiddle diddle - R L R R L L | R L R R L L | R L R R ", "gilded": 0, "created_utc": "1257537978", "subreddit": "drums", "score": 1, "controversiality": 0}
{"body": "P A S S I O N\n\ngot me in a jam again", "gilded": 0, "created_utc": "1257541575", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I'm guessing its because of GBF's history as an SEO spammer and self-proclaimed expert in \"viral marketing\" and \"link baiting\".\r\n\r\nYou can see a previous hissy fit of his [on reddit](http://www.reddit.com/r/reddit.com/comments/7aee7/douchebag_steals_my_work_and_gets_it_on_the/), which is mostly summed up by his statment (since removed from his blog):\r\n\r\n&gt;Hey that's the viral marketing campaign I've implemented for my strategic bunk bed market domination conquest! That (c) you saw at the bottom of my work of art sez I owned the 1,000 eyeballs that Stumble[d]Upon your otherwise deliberate attack on my creativity. Because my ego has been shamed I'm going to threaten to sue the pants off you! And blog about it too! And attempt to destroy your character! AND POST PICTURES! AND NAME, ADDRESS, PHONE, SOCIAL, ZIP, GIRLFRIEND, BLOOD TYPE BITCH! I GOT YOUR BLOOD TYPE! AND I'LL POST IT TO REDDIT TO GET A FRONT PAGE VOTE! IT'S ALL ABOUT V I R A L!!!\r\n\r\nPushing viral marketing campaigns to reddit's front page isn't something most people want to see again, which is probably why they are somewhat wary.\r\n\r\nedit: typo", "gilded": 0, "created_utc": "1257542599", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "[**T R E M U L O U S**](http://tremulous.net/)", "gilded": 0, "created_utc": "1257544371", "subreddit": "programming", "score": 2, "controversiality": 0}
{"body": "Oh man what a real true red blooded American BADASS, holy fucking shit U S A U S A U S A U S A U S A!!!!!!!!!!!!!!  American troops are the baddest mother fuckers on the planet and they can do no harm and thank you for your service and when does the movie/book/action figure blah blah blah blah blah SHUT THE FUCK UP.", "gilded": 0, "created_utc": "1257561648", "subreddit": "reddit.com", "score": -16, "controversiality": 0}
{"body": "fuck you!\n\ncare to take it to real life, a s s h o l e ?", "gilded": 0, "created_utc": "1257566197", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "This is A W K W A R D", "gilded": 0, "created_utc": "1257658020", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Start start start start A A A B A A B B Up Up Up Up Down start Up Right Up Up", "gilded": 0, "created_utc": "1257688753", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "For the record, banks H A T E credit unions - this alone has got to tell you something.  ;)\n\nThe American Banking Association (ABA) has to follow different rules that the credit unions don't have to - the differences (and offhand I'm not sure what they are) allow credit unions to benefit you.  I've heard what some of the differences in rules are, but I just can't remember them right now.  [Clark Howard](http://www.clarkhoward.com) (regarded by some as a frugal god) has this to say about the ABA's hostile focus on credit unions:\n\n*[ABA now offering bankers $1,000 reward for any outing of a credit union offering \"illegal\" membership.](http://clarkhoward.com/liveweb/shownotes/2004/09/06/8145/)*\n\nMost credit unions require members meet some sort of minimal group membership requirements (e.g., teacher, firefighter, police officer, military, medical worker, city worker, etc.) or be related to someone in that group or something of that nature.  So if they offer membership (i.e., an account) to someone who doesn't qualify it's a violation of their rules and they can get into trouble.  So the banks are salivating at the idea of \"catching\" a credit union in such a situation.\n\nCredit unions rarely charge the fees that banks do, they generally pay better interest than banks, and they often offer far better interest rates on loans.  Banks H A T E them.\n\nThat means I love mine.", "gilded": 0, "created_utc": "1257689525", "subreddit": "Frugal", "score": 14, "controversiality": 0}
{"body": "If you look at the phonemes, there's an \"ih\" and \"eh\" in there...\n\nBut then they mean A E I O U. So they're correct.\n\nHow come you say Y is a vowel?", "gilded": 0, "created_utc": "1257711141", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "&gt; M d d m \nm d d m \nm d d m \nda d d d d m\n\n", "gilded": 0, "created_utc": "1257717925", "subreddit": "tf2", "score": 29, "controversiality": 0}
{"body": "Come come baby i want your shaft in me please i can fix your problems. x x x x x x x x x x x x ", "gilded": 0, "created_utc": "1257764932", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "K e r n i n g.", "gilded": 0, "created_utc": "1257793780", "subreddit": "science", "score": 3, "controversiality": 0}
{"body": "C D E D B D ducks?  \nM R not ducks.  \nO S M R!  C D E D B D wings?  \nL I B!  M R ducks!", "gilded": 0, "created_utc": "1257825021", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "i n f l a t i o n", "gilded": 0, "created_utc": "1257913622", "subreddit": "Economics", "score": 1, "controversiality": 0}
{"body": "actually it's F A G G :)", "gilded": 0, "created_utc": "1257914584", "subreddit": "gonewild", "score": 2, "controversiality": 0}
{"body": "1. learn to tune it\n2. learn how to hold the pic correctly\n3. learn the major chords c g e a f and d\n4. learn basic strumming patterns\n5. learn the major pentatonic scale\n6. fuck around on it using the above.\n7. Have sex with drunk females.", "gilded": 0, "created_utc": "1257919146", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "C D E F G A B are the maj chords thank you.", "gilded": 0, "created_utc": "1257928395", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Yeah I find that many of the newest people that get interested  in Entheogens\nReally do not understand the metaphors that are used and go about \"looking\" for them as material concepts.  A basic difficulty is trying to relate all these thoughts and \"?\" to people that simply may have no basis for understanding.   \n\nIf there's *something* happening that's really outside of our normal perception of reality... involving entities ... is really unknown.   Subjectively I have my own opinions of there being something there or that there's more to our being then what modern convention tells us.\n\nI think it's best to leave that door W I D E open for the time being until we get a better understanding of what these molecular keys do to our mind and  the possibilities of different intersecting realities of dimension.\n", "gilded": 0, "created_utc": "1257929622", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Oh what a wonderful (reddit) world! I was just about to confess the same thing, though I started as a closet kpop fan, but now everyone knows and they, indeed, give me the shits about it. All I know is that this stuff is totally addictive and fun and I just can not help it. I started off with DBSK's Mirotic (a w e s o m e gayness) and from then on, I've been thrilled about most of the hits, be it girl or boy bands. And Diva is the ultimate ear bug! Love it.\r\n", "gilded": 0, "created_utc": "1257968815", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "ah yes, America. Reads A M E R I C A .", "gilded": 0, "created_utc": "1257992540", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "I have always loved Jamie O and some of the campaigns he's started have been really admirable - but if you've ever seen him cook this salt story will be no surprise - cos he adds tons to everything!!! Jamie O O O O Oh what the hell are you doing mate????? leave it out - gorgeous, pukka, fresh food ingredients dont need it! ", "gilded": 0, "created_utc": "1258020767", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "H o l y s h i t. I didn't know such a thing could happen.", "gilded": 0, "created_utc": "1258056642", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "exactly what the fuck is this? The miss manners show? it's L A R R Y  F U C K I N G  K I N G  bitch. You betta recognize!", "gilded": 0, "created_utc": "1258058312", "subreddit": "offbeat", "score": -1, "controversiality": 0}
{"body": "Because the conservative agenda is to subvert human rights.\n\nIt is fucking crazy, and B A R B A R I C\n\nIt is the 21st century, the time discussing the merits of the Republican agenda is far gone. History has spoken.", "gilded": 0, "created_utc": "1258059614", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "same.. \n\nwe're brainwashed\n\nPedos *e v e r y w h e r e*...", "gilded": 0, "created_utc": "1258080030", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "A W E S O M E.", "gilded": 0, "created_utc": "1258149607", "subreddit": "environment", "score": 1, "controversiality": 0}
{"body": "I was on digg in the computer lab and some guy walks up and goes 'reddit is better.' i was like \"what?\" and then he spelled it out for me 'r e d d i t'", "gilded": 0, "created_utc": "1258178106", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "a v o i d i n g  f i l t e r s  i s  q u i t e  e a s y .  j u s t  t y p e  l i k e  t h i s .\n\n\nM E E P .\n\nedit: i think reddits system robot overlords took away some of my spaces. you get what i did though.", "gilded": 0, "created_utc": "1258239785", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "was just going to say that that is a F A K T fact!", "gilded": 0, "created_utc": "1258240105", "subreddit": "DoesAnybodyElse", "score": 0, "controversiality": 0}
{"body": "    * g o a t s e x * g o a t s e x * g o a t s e x *\n    g                                               g  \n    o /     \\             \\            /    \\       o\n    a|       |             \\          |      |      a\n    t|       `.             |         |       :     t\n    s`        |             |        \\|       |     s\n    e \\       | /       /  \\\\\\   --__ \\\\       :    e\n    x  \\      \\/   _--~~          ~--__| \\     |    x  \n    *   \\      \\_-~                    ~-_\\    |    *\n    g    \\_     \\        _.--------.______\\|   |    g\n    o      \\     \\______// _ ___ _ (_(__&gt;  \\   |    o\n    a       \\   .  C ___)  ______ (_(____&gt;  |  /    a\n    t       /\\ |   C ____)/      \\ (_____&gt;  |_/     t\n    s      / /\\|   C_____)       |  (___&gt;   /  \\    s\n    e     |   (   _C_____)\\______/  // _/ /     \\   e\n    x     |    \\  |__   \\\\_________// (__/       |  x\n    *    | \\    \\____)   `----   --'             |  *\n    g    |  \\_          ___\\       /_          _/ | g\n    o   |              /    |     |  \\            | o\n    a   |             |    /       \\  \\           | a\n    t   |          / /    |         |  \\           |t\n    s   |         / /      \\__/\\___/    |          |s\n    e  |           /        |    |       |         |e\n    x  |          |         |    |       |         |x\n    * g o a t s e x * g o a t s e x * g o a t s e x *", "gilded": 0, "created_utc": "1258243143", "subreddit": "WTF", "score": -1, "controversiality": 0}
{"body": "Here's one:  E V O L U T I O N.", "gilded": 0, "created_utc": "1258244866", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Good luck-be sure to tell us all about it, s l o w l y", "gilded": 0, "created_utc": "1258253262", "subreddit": "AskReddit", "score": 25, "controversiality": 0}
{"body": "Kitteh! B E L I E V E ! LOLIDDQD", "gilded": 0, "created_utc": "1258268521", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "You know what really grinds my gears? When someone does something as awesome as this and then gets one or two notes wrong.\n\nThe theme at 0:14 should go C, G, E, A B Bb A but instead the engraver plays C, G, E, A B **A Ab**.\n\nThen the theme at 0:24 should go G Gb F D# E, G A C, A C D but instead the engraver plays G Gb F D# E, G A C, A **B** D.\n\nThe theme at 0:55 goes E C G, G# A F F A, B A A A G F E C A G but the engraver plays E C G, **G** A F F A, B A A A G **E F Eb** C A G!\n\nI won't get into the rhythm or harmonization because those are fair game for interpretation. But if you're going to re-interpret which notes are in the melody it should be more than just missing them by a half step. Otherwise my head hurts when the melody in my head plays a C at the same time the melody in the video plays a B.", "gilded": 0, "created_utc": "1258308407", "subreddit": "gaming", "score": 17, "controversiality": 0}
{"body": "Well, for the record, there are plenty of non-bar chords you can play higher up on the neck.  They could also be playing only a few strings when you might see it as open.\n\nThat aside, another popular open tuning is open G.\n\nD G D G B D\n\nAlso, I am assuming you would have noticed if they were using a capo or not.\n\nHope this helps.", "gilded": 0, "created_utc": "1258313571", "subreddit": "Guitar", "score": 1, "controversiality": 0}
{"body": "**T O  H E L L  W I T H  T H A T  B I T C H ,  P L E A S E !**", "gilded": 0, "created_utc": "1258332920", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "Id love a big juicy pear now to melt in your mouth like when I used to be in the longing way then Ill throw him up his eggs and tea in the moustachecup she gave him to make his mouth bigger I suppose hed like my nice cream too I know what Ill do Ill go about rather gay not too much singing a bit now and then mi fa pieta Masetto then Ill start dressing myself to go out presto non son piu forte Ill put on my best shift and drawers let him have a good eyeful out of that to make his micky stand for him Ill let him know if thats what he wanted that his wife is I s l o fucked yes and damn well fucked too up to my neck nearly not by him 5 or 6 times handrunning theres the mark of his spunk on the clean sheet I wouldnt bother to even iron it out that ought to satisfy him if you dont believe me feel my belly unless I made him stand there and put him into me Ive a mind to tell him every scrap and make him do it out in front of me serve him right its all his own fault if I am an adulteress as the thing in the gallery said O much about it if thats all the harm ever we did in this vale of tears God knows its not much doesnt everybody only they hide it I suppose thats what a woman is supposed to be there for or He wouldnt have made us the way He did so attractive to men then if he wants to kiss my bottom Ill drag open my drawers and bulge it right out in his face as large as life he can stick his tongue 7 miles up my hole as hes there my brown part then Ill tell him I want LI or perhaps 30/- Ill tell him I want to buy underclothes then if he gives me that well he wont be too bad I dont want to soak it all out of him like other women do I could often have written out a fine cheque for myself and write his name on it for a couple of pounds a few times he forgot to lock it up besides he wont spend it Ill let him do it off on me behind provided he doesnt smear all my good drawers O I suppose that cant be helped Ill do the indifferent l or 2 questions Ill know by the answers when hes like that he cant keep a thing back I know every turn in him Ill tighten my bottom well and let out a few smutty words smellrump or lick my shit or the first mad thing comes into my head then Ill suggest about yes O wait now sonny my turn is coming Ill be quite gay and friendly over it O but I was forgetting this bloody pest of a thing pfooh you wouldnt know which to laugh or cry were such a mixture of plum and apple no Ill have to wear the old things so much the better itll be more pointed hell never know whether he did it or not there thats good enough for you any old thing at all then Ill wipe him off me just like a business his omission then Ill go out Ill have him eying up at the ceiling where is she gone now make him want me thats the only way a quarter after what an unearthly hour I suppose theyre just getting up in China now combing out their pigtails for the day well soon have the nuns ringing the angelus theyve nobody coming in to spoil their sleep except an odd priest or two for his night office or the alarmclock next door at cockshout clattering the brains out of itself let me see if I can doze off 1 2 3 4 5 what kind of flowers are those they invented like the stars the wallpaper in Lombard street was much nicer the apron he gave me was like that something only I only wore it twice better lower this lamp and try again so as I can get up early Ill go to Lambes there beside Findlaters and get them to send us some flowers to put about the place in case he brings him home tomorrow today I mean no no Fridays an unlucky day first I want to do the place up someway the dust grows in it I think while Im asleep then we can have music and cigarettes I can accompany him first I must clean the keys of the piano with milk whatll I wear shall I wear a white rose or those fairy cakes in Liptons I love the smell of a rich big shop at 7 1/2d a lb or the other ones with the cherries in them and the pinky sugar I Id a couple of lbs of those a nice plant for the middle of the table Id get that cheaper in wait wheres this I saw them not long ago I love flowers Id love to have the whole place swimming in roses God of heaven theres nothing like nature the wild mountains then the sea and the waves rushing then the beautiful country with the fields of oats and wheat and all kinds of things and all the fine cattle going about that would do your heart good to see rivers and lakes and flowers all sorts of shapes and smells and colours springing up even out of the ditches primroses and violets nature it is as for them saying theres no God I wouldnt give a snap of my two fingers for all their learning why dont they go and create something I often asked him atheists or whatever they call themselves go and wash the cobbles off themselves first then they go howling for the priest and they dying and why why because theyre afraid of hell on account of their bad conscience ah yes I know them well who was the first person in the universe before there was anybody that made it all who ah that they dont know neither do I so there you are they might as well try to stop the sun from rising tomorrow the sun shines for you he said the day we were lying among the rhododendrons on Howth head in the grey tweed suit and his straw hat the day I got him to propose to me yes first I gave him the bit of seedcake out of my mouth and it was leapyear like now yes 16 years ago my God after that long kiss I near lost my breath yes he said I was a flower of the mountain yes so we are flowers all a womans body yes that was one true thing he said in his life and the sun shines for you today yes that was why I liked him because I saw he understood or felt what a woman is and I knew I could always get round him and I gave him all the pleasure I could leading him on till he asked me to say yes and I wouldnt answer first only looked out over the sea and the sky I was thinking of so many things he didnt know of Mulvey and Mr Stanhope and Hester and father and old captain Groves and the sailors playing all birds fly and I say stoop and washing up dishes they called it on the pier and the sentry in front of the governors house with the thing round his white helmet poor devil half roasted and the Spanish girls laughing in their shawls and their tall combs and the auctions in the morning the Greeks and the jews and the Arabs and the devil knows who else from all the ends of Europe and Duke street and the fowl market all clucking outside Larby Sharons and the poor donkeys slipping half asleep and the vague fellows in the cloaks asleep in the shade on the steps and the big wheels of the carts of the bulls and the old castle thousands of years old yes and those handsome Moors all in white and turbans like kings asking you to sit down in their little bit of a shop and Ronda with the old windows of the posadas 2 glancing eyes a lattice hid for her lover to kiss the iron and the wineshops half open at night and the castanets and the night we missed the boat at Algeciras the watchman going about serene with his lamp and O that awful deepdown torrent O and the sea the sea crimson sometimes like fire and the glorious sunsets and the figtrees in the Alameda gardens yes and all the queer little streets and the pink and blue and yellow houses and the rosegardens and the jessamine and geraniums and cactuses and Gibraltar as a girl where I was a Flower of the mountain yes when I put the rose in my hair like the Andalusian girls used or shall I wear a red yes and how he kissed me under the Moorish wall and I thought well as well him as another and then I asked him with my eyes to ask again yes and then he asked me would I yes to say yes my mountain flower and first I put my arms around him yes and drew him down to me so he could feel my breasts all perfume yes and his heart was going like mad and yes I said yes I will Yes.  \n(Ulysses, James Joyce)", "gilded": 0, "created_utc": "1258360209", "subreddit": "books", "score": 2, "controversiality": 0}
{"body": "wasn't being literal.  \n\ni'll type s.l.o.w.l.y. and c l e a r l y for you.  ;)  \n\nsome times we spend very little, some times so much it makes my head spin.  ", "gilded": 0, "created_utc": "1258367870", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "    +-----------------------------------------------------------+\n    |                                                           |\n    |    +-------------------------------------------------+    |\n    |    |                                                 |    |\n    |    |  I fucking hate motivational posters. They're   |    |\n    |    |  utterly utterly overused and are the internet  |    |\n    |    |  equivalent of 'Geddit? GEDDIT?' after what     |    |\n    |    |  may have otherwise been a good joke.           |    |\n    |    |                                                 |    |\n    |    +-------------------------------------------------+    |\n    |                                                           |\n    |         M O T I V A T I O N A L    P O S T E R S          |\n    |                                                           |\n    |          Ruining the joke by overexplaining it            |\n    |                       since 2007.                         |\n    |                                                           |\n    +-----------------------------------------------------------+", "gilded": 0, "created_utc": "1258395731", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "that was a m a z i n g !!!", "gilded": 0, "created_utc": "1258400294", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "K I L L  S M U R F S", "gilded": 0, "created_utc": "1258409849", "subreddit": "reddit.com", "score": 29, "controversiality": 0}
{"body": "I have the same issue where I am.  Oh well.  I actually think Mac OS is pretty nice - better than the Windows Vista I have to run - but D A M N is FileMaker a pain.\n\nThe worst part is perhaps that your application behavior (from UI to schema) is part of the same file as the application data, making a reasonable development cycle with separate test and production servers, version control, and the like impossible (or at least only possible with dirty dirty hacks, which kind of undermines the point of good development practices).", "gilded": 0, "created_utc": "1258437230", "subreddit": "programming", "score": 2, "controversiality": 0}
{"body": "Quite important as since Microsoft did the throttling thing on XP. Easy to patch around but unless you do it, all access goes v e r y  s l o w l y.", "gilded": 0, "created_utc": "1258481091", "subreddit": "geek", "score": 2, "controversiality": 0}
{"body": "Actually he said the skin **around** the anus, *around*, so yea, I'm going with  pigmentation as long as it \n\nsays *a r o u n d*. ", "gilded": 0, "created_utc": "1258498793", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "...and after June it says J A S O N ", "gilded": 0, "created_utc": "1258517571", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Contra:\nUP UP DOWN DOWN LEFT RIGHT LEFT RIGHT B A B A SELECT START \n\nMetroid:\nJUSTIN BAILEY", "gilded": 0, "created_utc": "1258531629", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "         X X X X X X X X X X X X X X X X X X X X X X X X X X\n         X                                                 X\n         X                     0   0                       X\n         X                     |   |                       X\n         X                 ____|___|____                   X\n         X              0  |~ ~ ~ ~ ~ ~|   0               X\n         X              |  |           |   |               X\n         X           ___|__|___________|___|__             X\n         X           |/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/|             X\n         X       0   |       H a p p y       |   0         X\n         X       |   |/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/|   |         X\n         X     __|___|_______________________|___|__       X\n         X     |/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/|       X\n         X     |                                   |       X\n         X     |         B i r t h d a y! ! !      |       X\n         X     | ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ |       X\n         X     |___________________________________|       X\n         X                                                 X\n         X X X X X X X X X X X X X X X X X X X X X X X X X X", "gilded": 0, "created_utc": "1258551251", "subreddit": "Etab", "score": 11, "controversiality": 0}
{"body": "That is what I came to say.  I played Contra when I was 13 and that is exactly how I saw the game.  up up down down B A B A select start...  ", "gilded": 0, "created_utc": "1258552639", "subreddit": "gaming", "score": -11, "controversiality": 0}
{"body": "thinly veiled threats from a clam - what a surprise? NOT\n\nI have a surprise for Mr CLAM though - OSA is too busy and enturbulated to come after me\n\nxenu xenu xenu xenu xenu\n75 million years ago there was a fellow by the name of xenu could be spelled x e m u ..", "gilded": 0, "created_utc": "1258586241", "subreddit": "scientology", "score": 3, "controversiality": 0}
{"body": "r i g h t . . . .\n\n/me backs away slowly.", "gilded": 0, "created_utc": "1258599998", "subreddit": "MensRights", "score": 2, "controversiality": 0}
{"body": "How could you not like this melody?:\n\nA A A A A A A A", "gilded": 0, "created_utc": "1258612844", "subreddit": "gaming", "score": 5, "controversiality": 0}
{"body": "Show yourself all your ten fingers. Count in your fingers from left to right the number you want to multiply nine for, starting from 1. Lower that finger. Whatever amount of fingers to the left of the lowered finger is the tenths and whatever amount of fingers to right is the singles.\n\n9x2 is like I i I I I **|** I I I I I. 1 finger to the left makes 10 and 8 fingers to the right makes 8. 10 + 8 = 18 and that is the answer.", "gilded": 0, "created_utc": "1258651502", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "That's nice, that's nice. Now I'm not saying it's not very very good as it is, it is. I'm also not saying it may be better with F F F F F F U U U U U U U U U letters being tossed around in the washing machine with the head. I'm just not saying that.", "gilded": 0, "created_utc": "1258673166", "subreddit": "fffffffuuuuuuuuuuuu", "score": 8, "controversiality": 0}
{"body": "G I M M I C K", "gilded": 0, "created_utc": "1258676080", "subreddit": "gaming", "score": -1, "controversiality": 0}
{"body": "P E O P L E  S T I L L  L I S T E N  T O  R E C O R D S", "gilded": 0, "created_utc": "1258690226", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "What thread?  The threat that all headlines  w i l l  b e  w r i t t e n   l i k e   t h i s   in the future?", "gilded": 0, "created_utc": "1258713174", "subreddit": "wikipedia", "score": 5, "controversiality": 0}
{"body": "I the verb you're looking for is **C R E A M E D** by Hamilton.", "gilded": 0, "created_utc": "1258714482", "subreddit": "formula1", "score": 1, "controversiality": 0}
{"body": "K I S S I N G!", "gilded": 0, "created_utc": "1258716679", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Good thing there's a W T F subreddit.", "gilded": 0, "created_utc": "1258726288", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Each fret is a semitone or half step apart. A whole step is two frets from the fret you are on and a half step is the next or previous fret. You can construct any scale on a single string by taking this information into account.\n\nw = Whole step\nh = half step\n\nMajor Scale:\nw w h w w w h\n\nNatural Minor Scale:\nw h w w h w w\n\nAll scales and modes can be defined this way.\n\nEdit: They should have used a key signature on the first example, G-major has one sharp.    You can down vote me all you want put a little bit of theory is better than a stack of tablature.", "gilded": 0, "created_utc": "1258739111", "subreddit": "Guitar", "score": 1, "controversiality": 0}
{"body": "I could write about how much I want to hurt everyone who calls me \"criticsquid\" because it's **C I T R I C**, like a mother fucking lemon. \n\n:D", "gilded": 0, "created_utc": "1258751637", "subreddit": "secretsanta", "score": 9, "controversiality": 0}
{"body": "I thought it was b a b a ?", "gilded": 0, "created_utc": "1258763839", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "\"Take the number of vehicles in the field \"A\", multiply it by the probable rate of failure \"B\", then multiply the result by the average out of court settlement \"C\". A x B x C equals \"X\", If X is less than the cost of a recall, we don't do one.\"", "gilded": 0, "created_utc": "1258816468", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "[Hallmark did it as a TV production](http://www.imdb.com/title/tt0068680/fullcredits#cast) year ago. With Jimmy Stewart and Jesse White in their original roles and Fred Gwynne and Madeline Kahn and Helen Hayes and Richard Mulligan. If those names mean anything to you you will know it was a great show.\n\nAnd here are my two favorite quotes:\n\n\"Years ago my mother used to say to me, she'd say, \"In this world, Elwood, you must be\" - she always called me Elwood - \"In this world, Elwood, you must be oh so smart or oh so pleasant.\" Well, for years I was smart. I recommend pleasant. You may quote me.\"\n\n\nWilson: [reading from an encyclopedia] \"P O O K A - Pooka - from old Celtic mythology - a fairy spirit in animal form - always very large. The pooka appears here and there - now and then - to this one and that one - a benign but mischievous creature - very fond of rumpots, crackpots, and how are you, Mr. Wilson?\" \"How are you, Mr. Wilson?\" Who in the encyclopedia wants to know? \n\n\n", "gilded": 0, "created_utc": "1258827501", "subreddit": "movies", "score": 0, "controversiality": 0}
{"body": "The Diving Bell and the Butterfly.\n\nE S A I T N R U ...\n", "gilded": 0, "created_utc": "1258864105", "subreddit": "wikipedia", "score": 7, "controversiality": 0}
{"body": "Sure, blame it on the a a a a a a alcohol", "gilded": 0, "created_utc": "1258892591", "subreddit": "Health", "score": 1, "controversiality": 0}
{"body": "h o l y s h i t\n\nthis looks amazing. Thanks for the post.", "gilded": 0, "created_utc": "1258912189", "subreddit": "food", "score": 2, "controversiality": 0}
{"body": "Doctor what is he saying?  *tap tap tap tap tap tap tap tap tap tap tap*\n\n\"N E V E R  G O N N A  G I V E  Y O U  U P\"", "gilded": 0, "created_utc": "1258951829", "subreddit": "reddit.com", "score": 24, "controversiality": 0}
{"body": "Read the bold letters, it spells out amaz o n k i n d l e.\n\nIn context of his fears of not getting what he wants from his/hers SS, its pretty obvious that he wants one.\n", "gilded": 0, "created_utc": "1259019722", "subreddit": "secretsanta", "score": -7, "controversiality": 0}
{"body": "good/excellent use of textures and orchestration\n\n(since it won't help you if I give you only praise, here are some nits to pick)\n\nThe sound of the harmonic writing sometimes sounds off, sounds like some of the dissonances are not handled consistently - A slightly inconsistent harmonic language throws it off in the center section. Some of the dissonances you seem to handle merely by muscling them with the wall of sound. (edit: see at around the 6 min mark; It just sounds wrong.) This detracts from the over all effect.\n\nThe point is to be consistent in your musical language. It seems to vary here. \n\nThe treble in the strings and percussion seems weak in spots\n\nThus the melody gets lost.\n\nI end up being impressed by the wall of sound, but unable to remember a melody to sing, whistle or hum after it is finished.\n\nThis may be mostly a sound balance thing. But it needs to be fixed, because I really want to remember a theme. \n\nThe over all effect is very good, but it needs work. \n\n---\n\nedit yes there is a notable theme in the middle section starting at about 4 min. This gets pushed aside with the wall of sound in the final section.\n\nAlso there is so much potential in the first few bars, but you leave it aside after you use it once. It is certainly worth bringing back in, maybe re-harmonized and inserted starting at 6m20s or so, an echo somehow of the original, before moving on to you final section.\n\nUsing the material you have, you could make this a bigger piece. You would repeat sections in a later section, but transformed somehow.\n\nThe wall of sound tends to act as an eraser on what went before. The music should imply a larger drama.\n\nIt should not be just A B C D E \n\nIn this case I would go A B C A' B' D E\n\nA' B' indicate repeated elements that are modified \n\nEdit 2: Properly done, It will be both longer as a piece of music, and will feel shorter, due to the repeated elements.", "gilded": 0, "created_utc": "1259042891", "subreddit": "WeAreTheMusicMakers", "score": 6, "controversiality": 0}
{"body": "It's not your fault that you drank so much that you can't even remember whether or not you may have actually been stroking or sucking his cock before he went down on you. He probably doesn't remember so well either. But this is America in the 21st century so he is the bad guy no matter what and you can certainly wreck his life over this if you please.\r\n\r\nOr ya could just blame it on The A A A A A Alcohol Baby...", "gilded": 0, "created_utc": "1259045276", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "1 - ryannorth was taken and \"q\" has a proud tradition of being a handy middle initial!\r\n2 - Qwantz is literally randomly generated, and has no meaning, though I saw an image of someone who showed the lines q w a n t z forms on a qwerty keyboard and drew a T-Rex out of that, constellation style.", "gilded": 0, "created_utc": "1259070255", "subreddit": "IAmA", "score": 19, "controversiality": 0}
{"body": "D e m o c r a t s   W i l l    N o t    B e    R e - e  l e c t e d ", "gilded": 0, "created_utc": "1259087404", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "When I've ssh'd through half a dozen boxen and I feel hardcore, I press Enter, \"~\" and \".\".\n\nNo only faster than Ctrl-D D D D D D-ing the terminal, but also much more satisfying, somehow.\n\nIt's ssh's version of clicking your heels 3 times.\n", "gilded": 0, "created_utc": "1259118585", "subreddit": "YouShouldKnow", "score": 5, "controversiality": 0}
{"body": "Sir I understand your pain, but you must see it from a European side.\n\nNow I must preface my comment with the fact that I lived in America for 4 months and it completely blew my mind.  Mainly because I could not understand why the Americans I had met in my own country and around Europe were nothing like the Americans I met while living in the country.\n\nThe types of American I have met in Europe are:\n\nAmerican Tourist Family:  A group of at least 4 Americans that even in an English speaking country speak loudly about how terrible everything is, can not find national monuments that are over 300ft high and visible from many parts of the city they are in, find public transport with English maps and English speaking information assistants confusing, commenting on how old the buildings are and speaking 12 times louder than anyone else.\n\nDouchebag Students:  Loud obnoxious people that can not handle the amount of alcohol they drink, that travel around Europe getting fucked up and pretending that they are on spring break in some of the most picturesque and serene places in Europe while intently speaking English v e r y  s l o w ly (Not the only people guilty of this) to natives and treating them like they are retards.\n\nThose are the two main types most Europeans run into, and the fact we are bombarded by your media and affected by your countries whims makes Europeans resentful.  Unfortunately we can't go down to the local bar, shoot some pool and watch Monday night football with the other 99.999999% of Americans and realise that all the other people we met from America actually had learning difficulties or were just douches.", "gilded": 0, "created_utc": "1259170134", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "y a a a a rt", "gilded": 0, "created_utc": "1259186986", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "one of my favorites is \"Ain't no half steppin'\"....I always think of when he spells his name out...\"B I G D A double D Y K A N E\"...only one to do it like him is snoop in with \"Capital S oh yes the fresh N double OP, D O double G Y D O double G ya see\"", "gilded": 0, "created_utc": "1259196009", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "s u p e r s t a r d e s t r o y e r @ g m a i l", "gilded": 0, "created_utc": "1259196483", "subreddit": "self", "score": 1, "controversiality": 0}
{"body": "I know this thread's about fashion but GOD DAMIT IF I HEAR ONE MORE PERSON SAY \"SIR\" ON THE INTERNET WHEN NOT GENUINELY REFERRING TO A PERSON WORTHY OF SUCH A TITLE I'M GOING TO EXPLODE AND ALL MY BODY PARTS ARE GOING TO FLY AROUND THE ROOM SPLUDGING AND SPLATTING ALL OVER THE PLACE WITH BLOOD E V E R Y W H E R E!!!!!!!!!!", "gilded": 0, "created_utc": "1259203020", "subreddit": "AskReddit", "score": -4, "controversiality": 0}
{"body": "c c c c c combo breaker", "gilded": 0, "created_utc": "1259282439", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "Up Up Down Down Left Right Left Right B A B A Select Start", "gilded": 0, "created_utc": "1259289858", "subreddit": "AskReddit", "score": 20, "controversiality": 0}
{"body": "I would upvote but it's actually \"Up Up Down Down Left Right Left Right B A B A Select Start\" Ohh what the hell, it's Thanksgiving, happy upvote.", "gilded": 0, "created_utc": "1259296197", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Ahh... I love you P H I L I P  J  F R Y", "gilded": 0, "created_utc": "1259300639", "subreddit": "funny", "score": 15, "controversiality": 0}
{"body": "I only have problems with a very small subset of captchas.  everyone's brain works differently.  I have problems most often with case sensitive ones that mix numbers and letters.  Then I start mixing up 1 l and I, 6 G 0 with O and 9 g.  depending on how they distort the letters s S v V w W u U o O z Z x X c C all can look the same as their other case.", "gilded": 0, "created_utc": "1259382594", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "They charge you for those services? C R I M I N A L", "gilded": 0, "created_utc": "1259417711", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Highschool, junior year, my friend's history class is studying WWII for 2 weeks. One day towards the end of these two *weeks*, this one girl raises her hand and asks the teacher \"What is this W W i i thing that keeps coming up in the book?\" The teacher looks at her in total disbelief and shakes her head.", "gilded": 0, "created_utc": "1259453760", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "s p a c e b a r                                                                                       ", "gilded": 0, "created_utc": "1259566165", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Hear hear! (Tho I'm a little baffled by your terminology: what's \"sophisti-tunes\" or \"sophisticated tunes\"?)  I've been tending this way too.  Here's my contribution of names.\n\n[Sully](http://www.youtube.com/watch?v=W1ANg-zXPio)\n\n[Grievous Angel](http://www.youtube.com/watch?v=W1ANg-zXPio)\n\n[sbtrkt](http://www.youtube.com/watch?v=L4PzG1u5jj8)\n\n[s p a t i a l](http://www.myspace.com/spatialdubs)\n\n[mount kimbie](http://www.youtube.com/watch?v=LnWN2gZ6se0)\n\n[James Blake](http://www.youtube.com/watch?v=ClKhjCzLxc4&amp;feature=related)", "gilded": 0, "created_utc": "1259581755", "subreddit": "dubstep", "score": 2, "controversiality": 0}
{"body": "Yes, it was great, people would stand up, rub their belly, and do many other goofy things if they did not read the whole test first (she modified it slightly to do physical things).  Teacher would write down all the crap they did.  I think it was like 25 questions, depending on the physical things they got to (every fifth question) your grade went from A B C D -&gt; Fail.\n\nI think at this point in my career, I try to extend this thought to my niece and nephews as well as my coworkers.  For any procedure we do or installation/upgrade we perform on equipment, we always review the whole thing top to bottom, make sure we have the right equipment, and more importantly make sure we have the right tools.  I think its important to have an idea of where you need to end up so that along the way you understand why things are done in the steps provided.  I think I took the test in middle school, so about 20 years ago.  I remeber it fondly, it was one of those tests where I got to see my classmates make asses out of themselves =)", "gilded": 0, "created_utc": "1259603268", "subreddit": "DoesAnybodyElse", "score": 4, "controversiality": 0}
{"body": "I used to do this with older controllers. Even made my own DDR pads in the past.\r\n\r\nIt will involve cutting the wires to the pad though, so you may lose your ability to use it on the Wii unless you make a connector that can be swapped from the wii cord to a 360 controller plug in.\r\n\r\nBasically you want to open up the controller and find a ground lead as well as a spot that all of the buttons use. Look at the pattern on the circuit board underneath the A B X Y buttons and it shuold be pretty clear. There will be a rubber plunger that comes down and connects two leads on the PCB, connecting the ground and the button.\r\n\r\nSo what you can do is take a wire while the controller is connected and touch the ground and the other part together and find out where all of the buttons can be activated from.\r\n\r\n\r\nYou'll need to know which wire coming from the dance pad goes to which arrow/button on it, which can be figured out from some trial and error. Then you just solder wires going from dance pad onto the PCB of the controller.\r\n\r\nIt works, but it can be quite a bit of work. \r\n\r\nEDIT: It would be advised to buy the cheapest 360 controller you can find to do it with. Partly because you risk less if you mess up, and partly because they tend to have much more simplistic innerds. You can figure it out and not have to worry about so many things on the inside.", "gilded": 0, "created_utc": "1259603370", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "No. It spells it correctly:\nB A N A N A S.", "gilded": 0, "created_utc": "1259620599", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "A B C D E F G H I J K LMNOP Q R S T U V W X Y Z.\r\n\r\nLMNOP was a letter for the longest time.", "gilded": 0, "created_utc": "1259621610", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
