{"body": "E D I T O R I A L", "gilded": 0, "created_utc": "1212348604", "subreddit": "worldnews", "score": 40, "controversiality": 0}
{"body": "[S T A T I S T I C S](http://icasualties.org/oif/USDeathByMonth.aspx)\n\nCasualties fluctuate often.  If this editorial claims there's a trend, maybe it should provide data on more than one month.\n\nNot only that, but this time the Mahdi army [declared a truce on May 10th](http://news.yahoo.com/s/afp/20080528/wl_mideast_afp/iraquspoliticsmilitaryshiite_080528075623).  \n\n2 facts beat out 4 paragraphs of corporate media bullshit.  They don't publish the facts.  They don't publish editorials that contain the facts.  \n\nThat's the point.\n", "gilded": 0, "created_utc": "1212359052", "subreddit": "worldnews", "score": 17, "controversiality": 0}
{"body": "a w e s o m e  reddit - the firefox hypemachine is in a need of the odd bitch slap.  Sure, it's a great browser and I  use it myself - but....mozilla are starting to look like a bunch of sulky devs pissed at Micro$oft....oh, wait.", "gilded": 0, "created_utc": "1212406481", "subreddit": "programming", "score": -5, "controversiality": 0}
{"body": "Sounds like the assailants need to be restrained and shot point blank in the neck with a small caliber handgun...then just let them bleed to death.\r\n\r\nJ U S T I C E", "gilded": 0, "created_utc": "1212422623", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "None\n\n* ctrl+alt+del\n* t\n* (If not on processes tab) Ctrl+Tab{1,3} Tab\n* f (i r e f o x . e x e)\n* Alt+E \n* Enter|Alt+Y\n* Alt+F4 (optional, if you want to close Task manager afterwards as well.)", "gilded": 0, "created_utc": "1212431311", "subreddit": "programming", "score": 3, "controversiality": 0}
{"body": "For a typist of American English, a French format keyboard is even more difficult to master, i.e.: I am in a French internet cafe; it is very difficult to type because the keyboard is not the same as an English one::: the Q key is where the A should be; and the A W Z M and even the period are not where they normally are. I have to use the shift key to get a period; and if you have not guessed by now; the semicolon is where the comma used to be; and the colon is where I would expect a period: ", "gilded": 0, "created_utc": "1212537734", "subreddit": "Design", "score": 1, "controversiality": 0}
{"body": "duuuude!...eat some 'shrooms!  \r\n...smoke something other than tobacco.  \r\n[C H I L L - O U T !]**!!!**", "gilded": 0, "created_utc": "1212542485", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Ava Gardner invested in the forties in what became one of the key elements in every cell phone out there today.. She was fine and she was s m a r t.  ", "gilded": 0, "created_utc": "1212862573", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "a a a a a a", "gilded": 0, "created_utc": "1212951462", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "The fundamental problem with comparing editors is that it's rare for someone to have enough knowledge of two major editors to compare them.  The users who use these things are serious and often open-source hackers who have built an absolutely mind-boggling degree of functionality into each.  Partly due to retaining compatibility with existing settings, partly because of a non-menu-based UI (though menu-based UIs don't really scale to the number of features involved, as can be seen by xemacs's options menu), features are often off and not discovered until someone goes browsing through the associated documentation, and even then, *nobody*, and I do mean *nobody*, uses a majority of the functionality in either editor.\n\nUsing either emacs or vi (including for the purposes of discussion, integration of external tools with vi) fully, learning both feature sets would take a tremendous time investment.  I think that many people are kind of like myself -- they primarily use one but can get along in the others if necessary.  Often, I'll see statements like \"Editor X can't do Y\", which usually gets promptly shot down.\n\nThe best way to do a comparison of editors would be to get an old hand at each and have them list their *complaints*.  That way, instead of saying \"I know how to do Y in my favorite editor but not in my occasionally-used editor\", they're saying \"I can't do Y in my favorite editor.\"\n\nOne problem with this is that most things that irritate people have already been fixed.\n\nIf I was going to list complaints about emacs, I'd say:\n\n* No support for multiple TTYs -- you can't have a terminal on two different computers showing the windows on the same emacs session.  GNU screen is cool -- it allows detaching and re-attaching, but isn't really the same thing.  Being added in emacs-23.\n\n* emacs fontification is slow, not as complete as it could be, and I've seen a few cases, like with perl-mode, where fontification isn't correct.  I don't know whether most editors use regexes or a full-blown parser to do highlighting, but doing the latter might improve things for emacs.\n\n* I don't have a convenient way to quickly make an existing window display the same contents as another window (yeah, a bit of a UI problem, though not hard to add in elisp).  This is a common operation for me.\n\n* On the same note (multiple windows displaying the same buffer), it's possible to have multiple points (cursor positions) in a buffer, but only as long as we retain a window displaying that buffer.  Make the window display something else, and emacs forgets the cursor position.  If displaying that buffer in the window again, and one has to go back to that location, unless one manually saves it.  A real annoyance -- it'd be nice to push point onto a per-buffer stack when leaving a buffer in a window and pop it back when re-entering it, rather than simply grabbing the last point in that window.  A workaround is using multiple frames -- you can leave your windows open in another frame so that they don't eat screen space -- but that's really not a very clean solution.\n\n* Emacs's tagging is a pretty primitive (albeit supporting-of-many-languages) alternative to VS's Intellisense.  [CEDET](http://cedet.sourceforge.net/intellisense.shtml) has an alternative in the form of semantic bovinator, but it only supports a few languages.  It also isn't bundled with the base emacs package.\n\n* C-- C-x o is not a very convenient keybinding to cycle backwards through windows.  I added C-x O, and IMHO, this should be a default.\n\n* I'm not a fan of any of the built-in boilerplate text systems (yes, there [are add-ons that do this](http://www.emacswiki.org/cgi-bin/wiki/CategoryTemplates), but it's kind of a surprising omission for the base package).  Basically, I'd like to be able to save a bunch of named snippits of text and insert one, with point set to a specified location in that text after insertion.  Abbrev-mode isn't quite what I'm looking for, because abbrevs must be words, and I'd rather hit something like C-c i &lt;snippitname&gt; than SPACE s e p a r a t o r C-x ' -- also, it would mean that I'd have to turn off auto-expansion of abbrevs.\n\n* emacs does not have the ability to do out-of-memory editing of large files.  This severely curtails its hex editor -- most hex editors provide this feature, and can happily work on a 3GB file.\n\n* dired is handy, but doesn't have (out of box -- again, a couple lines of elisp fixes this, but) a nice way to \"store\" a command and then use it on multiple files.  It's possible to set a default action for a file, a la Windows' Explorer, possible to tag multiple files and then execute a command on them, but not so convenient if one wants to sequentially run a non-default command on multiple files.  I fixed this on my box, but I'm surprised that this isn't a default feature.\n\n* Emacs blocks on a number of operations.  There are lots of network-using programs for emacs -- IRC clients, mail programs, you name it -- and they generally cause the entire surrounding emacs instance to block while performing some operations.  That's very annoying -- the calls being made should really be asynch.", "gilded": 0, "created_utc": "1212998234", "subreddit": "programming", "score": 9, "controversiality": 0}
{"body": "Holy molly, we put corn in everything. I mean seriously e v e r y t h i n g.", "gilded": 0, "created_utc": "1213221737", "subreddit": "Economics", "score": 3, "controversiality": 0}
{"body": "whoa whoa whoa. \"good work, reddit\"? You're joking, right?\n\nWhat's next on the front page?\n\n\"Obama Clinches Nomination: Good Job Reddit!\"\n\n\"Bush Impeachment Proceedings Being Put To Vote: Good Job Reddit!\"\n\n\nYou've GOTTA be fucking KIDDING me. Anyone who believes 1000 nerds on this site talking about the puppy throwing incident had A N Y T H I N G to do with his being fired is delusional. ", "gilded": 0, "created_utc": "1213267072", "subreddit": "WTF", "score": 195, "controversiality": 0}
{"body": "l a d y b u g. Not ladybird...", "gilded": 0, "created_utc": "1213317956", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "You ditched me for Shiite who murdered 2 million souls, displaced 4.6 million and have 13 million unemployed not to mention millions are tortured, raped in prison.\nYou ditched me for Shiite who denied the incineration holocaust of you ancestors and your flush and blood.\nYou ditch me for Pseudo Africa who is vanishing by AIDS and Genocide.\nYou ditched me for not standing my unspoken fact fireworks.\nOBAMA-CONDI-KENTI\nVirginia Jihad Network God Textbook High School Gitmo's Hezbollah Israel's Saudi Arabia Paintball Gang Nuclear  지하드(아랍어: جهاد)는 아랍어로 고투 혹은 분투를 의미한다. 이는 단순히 종교적인 면에만 국한 되는 Ultimate Terror  Intelcenter Alexandria Radical Centrist Craig's Idaho Restroom Kos ערך זה עוסק בג'יהאד כמושג באסלאם. אם התכוונתם לארגוני טרור בשם הג'יאהד האסלאמי, ראו הג'יהאד האסלאמי (פירושונים). Dar Al-Hijrah Pro-Jihad Brotherhood Assembly Failed जेहाद का मतलब है मेहनत और मशक़्क़त करना. इस्लाम में इसकी बड़ी अहमियत है. दो तरह के जेहाद बताए गए हैं. एक है जेहाद अल अकबर यानी बड़ा जेहाद और दूसरा है जेहाद अल असग़र यानी छोटा जेहाद. Controversial Edinburgh Fringe Actsジハード（アラビア語  は、イスラームにおいて信徒（ムスリム）の義務とされている行為のひとつ。 Squabble Fundamentally Race Nomination Justice Dept Investigate ഇസ്ലാം മതത്തിലെ ഉദാത്തമായ വിശ്വാസങ്ങളിലൊന്നാണ് ജിഹാദ്. വിശ്വാസി തനിക്കുള്ളതെന്തിനേക്കാളും  സ്വന്തം ജീവനേക്കാള്‍ വരെ - വിശ്വാസ താല്പര്യങ്ങള്‍ക്കു പ്രാധാന്യം Violent Teachings Felicia Ann Wilson Kathryn Ellen Wirzbicki Krystihanna Marie ومعناه بالعربية بذل الجهد والعزم لبلوغ هدف محدد والتعبير الكامل هو الجهاد في سبيل الله وقد درجت العادة في الأدبيات الأوربية بمختلف لغاتها على ترجمة الجهاد باستعمال اصطلاح الحرب المقدسة وذلك في محاولةٍ لاستيفاءً المعنى . والجهاد ليس حرب مقدسة مدفوعة بالحقد وغايتها الإبادة ولكن وبحسب النص القرآني هدف الجهاد المحدد هو نشر الإسلام أو الدفاع عنه. Wright Ahmad Yasin Megan Rose Yebba Kylie Paige Young Jonathan มาจากคำกริยา ญะฮะดะ ในภาษาอาหรับหมายถึง ความพยายาม ในทางศาสนาหมายถึง David Zlotnik Gardner Global Kansas Collaborate Al Qaeda Terrorist Assassinate Imam Johari Abdul-Malik Outreach خدا کی راہ میں جانی و مالی قربانی سے دریغ نہ کرنا ۔ قیام امن اور مظلوم کو ظالم کے ظلم سے نجات دلانے کے لیے تلوار اٹھانا۔ یا اس مقصد کے حصول کے لیے جنگ کے کسی متعلقہ شعبے میں خلوص نیت سے خدمات انجام دینا جہاد کہلاتا ہے۔ قرآن مجیدمیں جہاد پر Mosque Ali Asad Chandia Lashkar-E-Taiba Convicted Terrorists Sabri Benkahla Slumping Market Mitt FuturesAsserts ஜீகாத் (அரபு மொழி: அரபு ழொழியில் போராட்டம் என பொருள்படும் இசுலாமியர்களின் கடமையாகும். சுணி இசுலாமில் அதிகாரபட்சமாக Politicians Politics  Crutchfield Divisiveness Doomsday Scenario Weapons ou djihâd  est un terme arabe faisant partie du vocabulaire de l'islam et signifiant  exercer une force  tâcher  ou  combattre. Il apparait fréquemment dans le Coran, particulièrement dans l'expression聖戰(英文：Jihad、亞拉伯話：جهاد、Jihād)，音譯「吉哈德」，係一個伊斯蘭教術語，字面意思係「奮鬥」、「儘力」，引伸成為「為主道而奮鬥」。《古籣經》關於為主道而戰嘅訓令主要集中喺講麥地那時期嗰陣嘅經文 al-jihad bi anfousikoum  Mass Destruction nawa Zîmanê kurdî da deweçên Şahara bo Allah û Islamê. Êw cîhad êy Islam û Mislimanê Dynaêda. Nawa Qur'an da Lêkrîeya Pêxember Mîhemmed, çê cîhad bû Misilman û Mislimanaya واژه جهاد از ریشه جهد به معنی کوشش و مبارزه و فعالیت است. این کوشش و مبارزه می‌تواند در عرصه‌های گوناگونی صورت گیرد از جمله کوشش در مبارزه با Cultivating Hamas Islamic Gaza Israeli Security Official Mcconnell Nomani Muslim American Джиха́д (от араб. جهاد‎‎ — усилие) — понятие в исламе, означающее усердие на пути Всевышнего Аллаха, и ложно называемое ориенталистами \"Священной войной против неверных\". Обычно джихад ассоциируется с Women Striving Europeans Authority Multinational Amolsch Terrorism Defending Abdur-Raheem Randall Todd Ismail Royer Prison Trained Arrested Abu Ali باراك حسين أوباما، Барак Обама বারাক হোসাইন ওবামা জুনিয়র Ο Μπαράκ Χουσεΐν Ομπάμα باراک حسین اوباما ברק חוסיין אובאמה הבן बराक हुसैन ओबामाバラック・フセイン・オバマ・ジュニアბარაკ ჰუსეინ ობამა  버락 오바마  ബറാക്ക് ഹുസൈന്‍ ഒബാമ  बराक ओबामा  பராக் உசேன் ஒபாமா มีชื่อเต็มว่า บาราก ฮุสเซน โอบามา  Бара́к Хусе́йн Оба́ма  באראק אבאמא  小巴拉克•侯賽因•奧巴馬  奧巴馬  或者歐巴馬、\nUnemployable Social Outcast Former Deputy Minister Obaid Karki St. Sheetrock is a Victim of Dubai Electricity and Water Authority (DEWA) forfeited his hard earned money worth $10 millions on 1984. It is boring but if you wish to probe deep into supporting documents its all there at: http://www.geocities.com/oktrade Dubai Holding owned by Dubai's ruler, Sheik Mohammed bin Rashid Al Maktoum   توسلت كل عمري رذيل دبي وكريمها رد بضاعتي لسد ديني عبثاّ فلما وصفتهما بالكذب والغدر مدحتهم وان نعتهم بالشرف لظلمتهم. ناهيك اعتبار سردي هذا توسلا لمال استبيح سرقته لان السن تقدم بي وتعديته ارجع إلى معزك تيسا ذا حيد فسبحان الله الذي خلق ابن العاص والعباس\nعبيد كركي\nPlease accept my subscription and Friendship.\nBest wishes\nObaid Karki\nAn Outcast Underdog Libertarian Diogenesist Kabbalist Spinoziste Pantheon Hexalingual Automath Former UAE Under Secretary Independant Street-Knowledge Talkshow Guru. Unaffiliated to a State, an Organized Religion Group, a Sect or a Kin and an Anti Tribal Gentile.\nR O N P A U L  F O R  P R E S I D E N T  2 0 0 8\n\n", "gilded": 0, "created_utc": "1213466150", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "You are completely unmitigatedly W R O N G.\n\nThe constitution is merely an agency agreement between the people, whose Republic this is, and the government, a political/statis entity that is created by the people to have LIMITED POWERS.  INALIENABLE rights are INHERENT and not government given.  The constitution merely limits what government can and cannot do.\n\nSheesh... no wonder Americans are the dumbest population on earth...\n\nRead the constitution and declaration of independence someday.  Maybe you, unlike the four political tools on the court who dissented, will someday getaclue.", "gilded": 0, "created_utc": "1213478435", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "70,000 Spanish truckers blockade border France Activist ICE ALF target farming union offices badger cull anarchists wells fargo tacoma, wa McD's Victoria APOC Enough Modesto Solidarity Eric McDavid Birmingham Mash-Up Bloomington Michael Baker Jr./I-69 Sean Kirtley Radical Parenting Zine Squads iOaxaca Victorville Freedom  Imprisoned Munich Squatters Friendly Fire Collective GM Canada autoworkers court blockade Grand Rapids Starbucks Hallelujah Bum! Utah Phillips Spirit  Resistance Jordan Vietnamese Face Off Crooked Labor Export Firms Angola Prison Louisiana's Slave Plantation Queer Nation Swinging Right Revolting Lucio Bandit Reflections G8 McDonalds redecorated SUV Jeff Luers Alicia Corn باراك حسين أوباما، Барак Обама বারাক হোসাইন ওবামা জুনিয়র Ο Μπαράκ Χουσεΐν Ομπάμα باراک حسین اوباما ברק חוסיין אובאמה הבן बराक हुसैन ओबामाバラック・フセイン・オバマ・ジュニアბარაკ ჰუსეინ ობამა  버락 오바마  ബറാക്ക് ഹുസൈന്‍ ഒബാമ  बराक ओबामा  பராக் உசேன் ஒபாமா มีชื่อเต็มว่า บาราก ฮุสเซน โอบามา  Бара́к Хусе́йн Оба́ма  באראק אבאמא  小巴拉克•侯賽因•奧巴馬  奧巴馬  或者歐巴馬、 Virtual PrisonRaytheon Protesters Acquitted Northwest USA Founding Class Action Alliance NYC Crane failure/System failure Philadelphia Police critics arrested seized raid Pipeline Opponents Poland Cegielski Portland Oregon Portuguese Russia Solidarity Russian Nestle Santa Cruz Courthouse Smashed Artist Fights Real-Life Deportation Widow's Penalty Second Life Herald Neferi Chajit Vampiric Malkavian Neko Grrrrrl SL Militia Force Marines Shut Down Migrant Hunters Solidarity Active Slaughter Mexico South Korea  Solemnity Rallies Squaters Tacoma Restless Pitch Pipe Infoshop Tag reveals UK sharks' secrets Nadal Djokovic asylum seeker Paper Man prosecutor salon boom Thousands forced US floods Troops pour south Iraqi city fuel hit supply Kosovo Albanians Ethiopia drought row Uneven Growth Leaves South Africa's Poor Behind Life Mars lost Villa's flourish glosses doubts Volunteers Save Homes  Guantanamo Deadlock Young author voice China's rebels John Cusack Movie His Life Labour MP backs Davis's challenge Levees Breached Des Moines  Forcing Evacuation Lifetime honour actor Beatty Sweden v Spain government files train Mugabe vows fight 'traitors'  lose wage war Diamond Hoo Ha Season of Sweets Nato concedes Taleban jail blow homes slump worst since 1945 strike Argentine farmers Ojo offers solace shaken England Rare Manuscripts Rising Floodwater Relief Agencies Cue FEMA Rwandan genocide 'suspect' held S Africa mob burns Mozambican man quake Settlements 'a problem' Shuttle Discovery Crew Back Earth Florida landing Slayings Shock Weleetka, Okla. Stalemate Extending U.S. Military Presence Statue  Che's '80th birthday' Stricken transatlantic rowers rescued cracks amoeba attack tactic isolate Eurovision Nul Evangelicals stray Republicans Falling ton bricks Family Tasering feud India Flooded Farmers Loss Iowa Dylan Thomas trail Foreclosure Phil Free instruments poor children German Left Courts Working Class Graduates warning long job hunt Gypsies Berlusconi UN Breast Cancer 'Cheer up, love... ' Japanese captive freed  Civil  'utterly antiquated' Coercive Diplomacy Disputed Centrist Stamford Hill's Jews integration? Ecologist Power Plant Pollute Mountain Empire EU Iran Ireland treaty vote \nBank Common Knowledge money art Time Warner Usenet access anti-child porn zealots\nWorries Mount Farmers Big Harvest Hamish Smash State War Coast Resistance  Development British Columbia Water Alive Hears Words Abducted Cameroonians dead African aid shortfall endangers 5m Flood Waters Recede Damaged Surveyed Iowa Nuclear Family Vacation Brazilian samba legend 95 Bush Sarkozy's wife Brown Iraq force World-Bank Bogus 'Clean Energy' Funds Cargo ships green spell San Pietro Chadian rebels attack Chinese healing Chronology Construction West Palm Beach Everglades Earth Democratic National Convention Crimethinc Human Rights Violations Iraq’s\nIt is boring but if you wish to probe deep into supporting documents its all there at: http://www.geocities.com/oktrade Dubai Holding owned by Dubai's ruler, Sheik Mohammed bin Rashid Al Maktoum   توسلت كل عمري رذيل دبي وكريمها رد بضاعتي لسد ديني عبثاّ فلما وصفتهما بالكذب والغدر مدحتهم وان نعتهم بالشرف لظلمتهم. ناهيك اعتبار سردي هذا توسلا لمال استبيح سرقته لان السن تقدم بي وتعديته ارجع إلى معزك تيسا ذا حيد فسبحان الله الذي خلق ابن العاص والعباس\nعبيد كركي\nPlease accept my subscription and Friendship.\nBest wishes\nObaid Karki\nAn Outcast Underdog Libertarian Diogenesist Kabbalist Spinoziste Pantheon Hexalingual Automath Former UAE Under Secretary Independant Street-Knowledge Talkshow Guru. Unaffiliated to a State, an Organized Religion Group, a Sect or a Kin and an Anti Tribal Gentile.\nR O N P A U L  F O R  P R E S I D E N T  2 0 0 8\n", "gilded": 0, "created_utc": "1213514651", "subreddit": "reddit.com", "score": -2, "controversiality": 0}
{"body": "i m n u r subreddit stealin all u r karmaz!\nima chargin muh space bar\nshoop da woop\n", "gilded": 0, "created_utc": "1213530278", "subreddit": "PS3", "score": 2, "controversiality": 0}
{"body": "Tim Russert\nForgive US\nI was waiting to express my respect to the fact of death. Is watched TR heart diagram on fox:  A huge cholesterol crumb emerges from artery wall jumped into bloodstream, stops blood supply. 15 sec. Tim Russert technically dead?  Unbelievable. I witnessed how TR brain fabricate lies and forcefully insert them into Saint Ron Paul mouth.  That brain made heaven and earth shiver.  The same brain turned into a lipid because it was short of few oxygen atoms due to that blockade. توسلت  كل عمري عبثاّ رذيل دبي وكريمها رد بضاعتي لسد ديني  فلم ارد وصفهم بالكذب لمدحتهم وبالغدر اجلالا وان نعتهم بالشرف لظلمتهم.فلقد تدرعو بالاثم والسحت الذي شاهدته عند اقوام كانوا فراعنة واليوم  منعدم ناهيك اعتبار سردي هذا توسلا لمال استبيح سرقته لان السن تقدم بي وتعديته ارجع إلى معزك تيسا ذا حيد فسبحان الله الذي خلق ابن العاص والعباس عبيد كركي Tim Russert Spanish truckers blockade border France Activist ICE ALF target farming union offices badger cull anarchists wells fargo tacoma, wa McD's Victoria APOC Enough Modesto Solidarity Eric McDavid Birmingham Mash-Up Bloomington Michael Baker Jr./I-69 Sean Kirtley Radical Parenting Zine Squads iOaxaca Victorville Freedom  Imprisoned Munich Squatters Friendly Fire Collective GM Canada autoworkers court blockade Grand Rapids Starbucks Hallelujah Bum! Utah Phillips Spirit  Resistance Jordan Vietnamese Face Off Crooked Labor Export Firms Angola Prison Louisiana's Slave Plantation Queer Nation Swinging Right Revolting Lucio Bandit Reflections G8 McDonalds redecorated SUV Jeff Luers Alicia Corn باراك حسين أوباما، Барак Обама বারাক হোসাইন ওবামা জুনিয়র Ο Μπαράκ Χουσεΐν Ομπάμα باراک حسین اوباما ברק חוסיין אובאמה הבן बराक हुसैन ओबामाバラック・フセイン・オバマ・ジュニアბარაკ ჰუსეინ ობამა  버락 오바마  ബറാക്ക് ഹുസൈന്‍ ഒബാമ  बराक ओबामा  பராக் உசேன் ஒபாமா มีชื่อเต็มว่า บาราก ฮุสเซน โอบามา  Бара́к Хусе́йн Оба́ма  באראק אבאמא  小巴拉克•侯賽因•奧巴馬  奧巴馬  或者歐巴馬、 Virtual PrisonRaytheon Protesters Acquitted Northwest USA Founding Class Action Alliance NYC Crane failure/System failure Philadelphia Police critics arrested seized raid Pipeline Opponents Poland Cegielski Portland Oregon Portuguese Russia Solidarity Russian Nestle Santa Cruz Courthouse Smashed Artist Fights Real-Life Deportation Widow's Penalty Second Life Herald Neferi Chajit Vampiric Malkavian Neko Grrrrrl SL Militia Force Marines Shut Down Migrant Hunters Solidarity Active Slaughter Mexico South Korea  Solemnity Rallies Squaters Tacoma Restless Pitch Pipe Infoshop Tag reveals UK sharks' secrets Nadal Djokovic asylum seeker Paper Man prosecutor salon boom Thousands forced US floods Troops pour south Iraqi city fuel hit supply Kosovo Albanians Ethiopia drought row Uneven Growth Leaves South Africa's Poor Behind Life Mars lost Villa's flourish glosses doubts Volunteers Save Homes  Guantanamo Deadlock Young author voice China's rebels John Cusack Movie His Life Labour MP backs Davis's challenge Levees Breached Des Moines  Forcing Evacuation Lifetime honour actor Beatty Sweden v Spain government files train Mugabe vows fight 'traitors'  lose wage war Diamond Hoo Ha Season of Sweets Nato concedes Taleban jail blow homes slump worst since 1945 strike Argentine farmers Ojo offers solace shaken England Rare Manuscripts Rising Floodwater Relief Agencies Cue FEMA Rwandan genocide 'suspect' held S Africa mob burns Mozambican man quake Settlements 'a problem' Shuttle Discovery Crew Back Earth Florida landing Slayings Shock Weleetka, Okla. Stalemate Extending U.S. Military Presence Statue  Che's '80th birthday' Stricken transatlantic rowers rescued cracks amoeba attack tactic isolate Eurovision Nul Evangelicals stray Republicans Falling ton bricks Family Tasering feud India Flooded Farmers Loss Iowa Dylan Thomas trail Foreclosure Phil Free instruments poor children German Left Courts Working Class Graduates warning long job hunt Gypsies Berlusconi UN Breast Cancer 'Cheer up, love... ' Japanese captive freed  Civil  'utterly antiquated' Coercive Diplomacy Disputed Centrist Stamford Hill's Jews integration? Ecologist Power Plant Pollute Mountain Empire EU Iran Ireland treaty vote \nBank Common Knowledge money art Time Warner Usenet access anti-child porn zealots\nWorries Mount Farmers Big Harvest Hamish Smash State War Coast Resistance  Development British Columbia Water Alive Hears Words Abducted Cameroonians dead African aid shortfall endangers 5m Flood Waters Recede Damaged Surveyed Iowa Nuclear Family Vacation Brazilian samba legend 95 Bush Sarkozy's wife Brown Iraq force World-Bank Bogus 'Clean Energy' Funds Cargo ships green spell San Pietro Chadian rebels attack Chinese healing Chronology Construction West Palm Beach Everglades Earth Democratic National Convention Crimethinc Human Rights Violations Iraq’s\nIt is boring but if you wish to probe deep into supporting documents its all there at: http://www.geocities.com/oktrade Dubai Holding owned by Dubai's ruler, Sheik Mohammed bin Rashid Al Maktoum   \nR O N P A U L  F O R  P R E S I D E N T  2 0 0 8 \nObaid Karki", "gilded": 0, "created_utc": "1213648391", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "h e l l o   isn't it just obvious that God created homosexuals as a critical part of his larger plan of intelligent  design I mean, like,if not we would never know what \" intelligent interior design\" would be.  ", "gilded": 0, "created_utc": "1213760841", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "Give me a B R E A K...", "gilded": 0, "created_utc": "1213898604", "subreddit": "entertainment", "score": 0, "controversiality": 0}
{"body": "C l a s s i c\n\nThey really don't write them like that anymore.  Today's reality-tv crowds really aren't bright enough to understand humor, I'm afraid... ", "gilded": 0, "created_utc": "1214056300", "subreddit": "entertainment", "score": 4, "controversiality": 0}
{"body": "*real* bank robbers would respond with something other than \"but but but, I have a b b b bomb!\" ", "gilded": 0, "created_utc": "1214184852", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "I think there needs to be a good balance of music in baseball stadiums. Nowadays (and my more current experience is with Nationals Stadium) it's mostly monotonous. You'll hear an organ two or three times during the game (recorded, not played live), and that shitty \"ev-ry-body clap your hands... x x x x x x x x x x x x x x x x\" five or six times, in addition to several other pre-recorded, repetitive ditties. Rock music certainly has a great place at a live sporting event for filling space between innings, but nothing beats an organ for leading cheers imo. It's familiar and nostalgic, and the crowd responds.", "gilded": 0, "created_utc": "1214327467", "subreddit": "sports", "score": 3, "controversiality": 0}
{"body": "W O R L D  W A R  I I I", "gilded": 0, "created_utc": "1214355597", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "H I T L E R?", "gilded": 0, "created_utc": "1214364501", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "&gt;In short, the Bush administration is refusing to let others on the planet achieve even a fraction of the development the U.S. has — even at the cost of the planet.\n\nHow do you spell hypocrisy? R e p u b l i c a n. ", "gilded": 0, "created_utc": "1214426636", "subreddit": "environment", "score": 2, "controversiality": 0}
{"body": "up down up down left right left right b a b a start.", "gilded": 0, "created_utc": "1214458210", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Oh, you're missing my favorite part where they spend the rest of their lives being extremely annoyed every time someone at...say...a library, help desk, government office, or bank (among others) searches for their names in these wonderful databases by the common spelling. \n\n\"You don't seem to be in our system\"\n\n\"But, I opened the account three years ago\"\n\n\"How do you spell your name.\"\n\n\"...It's Justyn\" \n\n\"Oh...Justine....gotcha'....nope. Still not here.\"\n\n\"J U S T Y N\" \n\n\"Did you say, there was a 'y' in there.\"\n\n\"YES!!!\"\n\n\"Oh hell, that's it...last straw...\" \n\n*BANG*BANG*BANG*....and that's how Justyn became dead-Justyn.  ", "gilded": 0, "created_utc": "1214472352", "subreddit": "funny", "score": 7, "controversiality": 0}
{"body": "Gasoline is predominantly a mix of the molecules below.  The combustion energy--every joule of it--comes from breaking the carbon bonds.  I would expect putting a magnet on the fuel line to be about as effective as putting a donut in the glove box.  It just doesn't come into play.  \n \n      H H H H H H H\n      | | | | | | |\n    H-C-C-C-C-C-C-C-H         Heptane\n      | | | | | | |\n      H H H H H H H\n\n\n      H H H H H H H H\n      | | | | | | | |\n    H-C-C-C-C-C-C-C-C-H       Octane\n      | | | | | | | |\n      H H H H H H H H\n\n\n      H H H H H H H H H\n      | | | | | | | | |\n    H-C-C-C-C-C-C-C-C-C-H     Nonane\n      | | | | | | | | |\n      H H H H H H H H H\n\n\n      H H H H H H H H H H\n      | | | | | | | | | |\n    H-C-C-C-C-C-C-C-C-C-C-H   Decane\n      | | | | | | | | | |\n      H H H H H H H H H H", "gilded": 0, "created_utc": "1214602326", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "HLLY WA TASHGISISIOSITTTTTTT  a a a a a AAAJASJSJDJS !!!!11.1...ASD.ASDJIASHFJKLSDGHFDJKGHJKDFGDFHGJKFDHKJ", "gilded": 0, "created_utc": "1214668039", "subreddit": "entertainment", "score": 17, "controversiality": 0}
{"body": "&gt;Am I wrong that most of the songs are based around personal relationships\n\nWhile it is commendable to write lyrics about world issues, is it not also possible to be artistic by drawing upon more immediateevents in your life? I'm not defending thoughtless talk about guns, money and bitches, however personal relationships are an incredible part of our lives.\n\nHere are some lyrics from Seattle based hip hop duo Common Market's \"Push\" that you might appreciate.\n\n&gt;Lest ye judge and deem the position extremely biased/\nIdentify me as ‘self righteous’ and ‘pious’/\nI assail even the stale efforts of the Baha’is/\nEndeavors have failed to make available Hiphop/\nTo the youth at large, when in truth it’s hard to refute God/\nMusic is conducive to producin’ art/\nBetween you and me, I’m through with stringin’ beads/\nAnd singin’ of flowers and waves and leaves – it’s not\nThat I’m a separatist, my suggestion is: we address the risk/\nOf giving the impression we missed the point/\nTo progress with the kids – not in spite of ‘em/\nBy request, invited ‘em to bless this spot/\nSo when it must be justice, we clutch this (mic)/\nClingin’ to the cord – they cannot afford to ignore the value/\nAnd when they doubt you/\nRecognize your right to push back…/\n\nAnother thing is that hip hop stresses poetic devices more than most types of music. Alliteration, feminine rhymes, cadence, and complex rhyme schemes (aab/ccb) these techniques are pushed to the limit. Take for example Nas on the song \"Memory Lane\" off of the album \"Illmatic\":\n\n&gt;True in the game, as long as blood is blue in my veins/\nI pour my Heineken brew to my deceased crew on memory lane/\n\nThe rhyme pattern is A B A B A A B which mixes up what rhyme you expect to hear next and keeps you guessing as to how Nas will end the line.\n\nOften, in hip hop, you will hear MCs bragging about themselves, and their lyrical skills. When hip hop was blossoming on the streets of New York, these MCs would battle each other to show wits and gain fame for themselves. This is where this tradition in particular comes from. If you do not understand the original culture it is very easy to view these rhymes as vain or narcissistic. However once you understand the concepts behind these songs it is much easier to appreciate what goes into them. An example of battle raps that have thought and creativity behind them is KRS-One's \"Build Ya Skillz\" from his self titled release:\n\n&gt;Don't make me come out on that ass start flippin'/\nYour mental I'm afflictin'/\nActin' ill and sickin'/\nPickin' the victim at random, slammin' em/\nDraggin' them to the stage and dismantlin' them/\nAs my Hydrogen turns to Helium/\nI Shine! None of your lyrics I'm feelin' em/\nYou rhyme! Like you should be wearin' an apron scrapin' a pot with a name like Merriam/\n\nAs with \"Slam Poetry\", delivery is of utmost importance as well, and KRS is the epitome of rhyme delivery on that track.\n\nAlright I'm growing tired, but I hope I have inspired some of you redditors to take a second look at hip hop and check out some of these artists. Please don't wantonly disregard a whole genre of art out of ignorance though. I happen to despise listening to country and techno music but it doesn't mean that I don't recognize there is talent in those genres.\n\nEDIT: put slashes between lines in my quotes", "gilded": 0, "created_utc": "1214803556", "subreddit": "offbeat", "score": 2, "controversiality": 0}
