{"body": "Is that what he's doing?\n\nI think he's stuck in a flashback.  It **IS** September 11, 2001 in Guiliani land *f o r e v e r*.", "gilded": 0, "created_utc": "1220593916", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "WTF?  D O W N M O D D E D .", "gilded": 0, "created_utc": "1220628353", "subreddit": "reddit.com", "score": -12, "controversiality": 0}
{"body": "P O W P O W P O W", "gilded": 0, "created_utc": "1220642286", "subreddit": "pics", "score": 11, "controversiality": 0}
{"body": "First, you did right to 'ask reddit'. Ok, so what you do is choose the font you like, and the point size, and then you simply type 't e s t a b l e' and if that worked out ok, you do 'c o d e'. Like that. A piece of cake, right? ", "gilded": 0, "created_utc": "1220668854", "subreddit": "programming", "score": -10, "controversiality": 0}
{"body": "You have just proved my point. Your political understanding is sub-par.\n\nI am not RE-defining sexism. I am pointing out what sexism actually is.\n\nAs for racism, the only 'race' that racism does not apply to are europeans (inc. white australians, north americans and so forth) Because they are not oppressed systematically based on their ethnicity. \n\nSame goes for women vs men with sexism. Men are not oppressed based on their sex systematically, thereby, sexism only applies to women.\n\nI do not need to ask those men's rights people. They are perpetuating identity politics based on their own arrogant idea that women have more rights than they do.\n\nIf you and your girlfriend - mind you, she is not your 'girl'friend. She is your partner, who happens to be a W O M A N - sexism at work right there - are offended by what I have said, then you are clearly in denial. It is a matter of fact that it is sexism to perpetuate sexism. Deal with it.\n\nNow good day to you.", "gilded": 0, "created_utc": "1220718571", "subreddit": "feminisms", "score": -2, "controversiality": 0}
{"body": "C O M E D Y C E N T R A L, was that sloooooow enough for all of you taking this as serious journalism.\r\n\r\nBecause if this is serious journalism to you or where you get your facts on such a monumental decision, your pathetic", "gilded": 0, "created_utc": "1220720153", "subreddit": "politics", "score": -21, "controversiality": 0}
{"body": "I find it seriously disturbing that you even have the courage to admit this is the most honest news show on the air today.\r\n\r\n1. as previously stated its on a C O M E D Y channel\r\n\r\n2.  It's a S H O W \r\n\r\nso indulge me and let me educate the uneducated.\r\n\r\nDo your own research FROM THE source upon the issue you have a question.  Here's a partial list of the pathetic places I use for research and to help develop an opinion.  They might not be as powerful as a show on a comedy channel but I'm trying\r\n\r\nhttp://www.loc.gov/index.html\r\n\r\nhttp://www.lib.ncsu.edu/congbibs/senate/\r\n\r\nhttp://www.gpoaccess.gov/libraries.html\r\n\r\nhttp://www.senate.gov/pagelayout/committees/d_three_sections_with_teasers/committees_home.htm\r\n\r\nhttp://catalog.gpo.gov/F\r\n\r\nhttp://www.lib.umich.edu/govdocs/hearings.html\r\n", "gilded": 0, "created_utc": "1220741270", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "FLAME FLAME FLAME from the F L A M E T H R O W E R!!!", "gilded": 0, "created_utc": "1220815526", "subreddit": "feminisms", "score": 1, "controversiality": 0}
{"body": "Reminds me of a guy on a computer mailing list I frequented some time ago.  He went on vacation and put up his autoresponder, and put himself as a recipient for every \"I'm not here\" email sent out...\n\nhe was a M C S E ", "gilded": 0, "created_utc": "1220841840", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I believe it's \"M A V R I C K S\"", "gilded": 0, "created_utc": "1220895531", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Joseph Smith is a C U N T!! who's with me!\n\noh wait, wrong cult.", "gilded": 0, "created_utc": "1220918760", "subreddit": "WTF", "score": 7, "controversiality": 0}
{"body": "Yeah, I don't understand it.\n\nIt's your future, it's if your family can afford a home... Jesus people... self interest is meant to run elections.\n\nWho cares about Palin?  You're losing your homes, and your taxes are being thrown into a national money-pit called Fannie and Freddie?\n\nH E L L O O O O O o o o o . . . ", "gilded": 0, "created_utc": "1220965703", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "I modded you even if the spirit was willing, but the flesh was weak\r\n\r\n\r\n\r\n   S P A R T A !!!!!!", "gilded": 0, "created_utc": "1220971174", "subreddit": "business", "score": 1, "controversiality": 0}
{"body": "&gt; If you're using a pen for input, why not just write the letters?\n\nbecause writing out letters will always be slower than typing, and if works as demoed...swyping.\n\ndrag your finger from left to right over the q w e r t y keys, then write 'qwerty' on a piece of paper... it's pretty obvious which one is a better method (with the caveat that the dictionary lookup on the device is accurate and fast)", "gilded": 0, "created_utc": "1221071439", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "&gt; drag your finger from left to right over the q w e r t y keys, then write 'qwerty' on a piece of paper\n\nBut would \"Swyping\" q w e r t y actually work?\n\nI think thumbing on a qwerty keyboard is pretty hard to beat. Only a full size keyboard or voice recognition would be faster.", "gilded": 0, "created_utc": "1221074138", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "yes\ndo it\nbecause you can n a b i s ", "gilded": 0, "created_utc": "1221101682", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Ah yes, the soothing attributes of,\n\nD S O P U E B A L K E", "gilded": 0, "created_utc": "1221340483", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "oh come on people, s a r c a s m ... he even put \"all the time\" in &lt;i&gt; :P", "gilded": 0, "created_utc": "1221405355", "subreddit": "programming", "score": 4, "controversiality": 0}
{"body": "From MAIN.m65 comes the following brief history of the project:\n\n    ;;\t\t\t    D O N K E Y\n    ;;\t\t\t      K O N G\n    ;;\n    ;;\n    ;;Just when you thought it was safe to come back from the arcades....;;\n    ;;\n    ;;Perpetrator: Landon Dyer\n    ;;\n    ;;HISTORY:\n    ;;Nov '82 - IDS, initial coding\n    ;;Dec '82 - more coding, hair pulling, general cruftiness\n    ;;Jan '83 - schedule screaming, rampant insanity, accusations\n    ;;Feb '83 - semi-winnage, accompanied by cries of anguish and threats;;\n    ;;Mar '83 - Lucifer announces a cooling trend\n", "gilded": 0, "created_utc": "1221439353", "subreddit": "programming", "score": 2, "controversiality": 0}
{"body": "    W A R N I N G !\n\n  Don't be taking a drink when you start  watching this!", "gilded": 0, "created_utc": "1221441382", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "\nGet big bold street sign letters and spell\n\n**P R I N G L E S**.\n\nBetter just get your own internet connection.", "gilded": 0, "created_utc": "1221441642", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "f u c k  i s r a e l", "gilded": 0, "created_utc": "1221446149", "subreddit": "worldnews", "score": -2, "controversiality": 0}
{"body": "connect: invest three hours watching this [BBC documentary](http://video.google.com/videoplay?docid=2798679275960015727&amp;ei=dYPNSJOWCpKYrQKy2Pm4Ag&amp;q=power+of+nightmares) and it all becomes really clear.. it's by far the most informative and terrifying explanation i've ever seen.. \n\nthe 50% who support Bush and the mythical neocon battle between Good and Evil are fucking terrified.. of a myth\n\nfacts:\n\n* no criminal charges against Bin Laden for 911\n* bin laden did not claim responsibility for 911\n* most ensuing \"al qaeda\" sleeper cell busts are proven bogus, then buried\n* no evidence of pre 911 al qaeda in iraq\n* plenty of evidence of politicians L Y I N G to us to scare the living shit out of us\n\nMcCain is taking lying to a whole new level, but it doesn't really matter because people are scared too shitless to open their eyes\n\nif you wanna argue with me, fine.. but first: please please please watch [the first hour](http://video.google.com/videoplay?docid=2798679275960015727&amp;ei=dYPNSJOWCpKYrQKy2Pm4Ag&amp;q=power+of+nightmares) of the movie", "gilded": 0, "created_utc": "1221505079", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Y O U D O U C H E B A G", "gilded": 0, "created_utc": "1221551281", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Abkhazia and Samachablo (so-called South Ossetia) WAS IS AND WILL ALWAYS BE recognized I N S I D E Georgian territory by UN, so you are not making any sense at all!", "gilded": 0, "created_utc": "1221575690", "subreddit": "worldnews", "score": 2, "controversiality": 0}
{"body": "O M G I C O U L D N O T F U C K I N G R E A D T H A T\n\n[What I see with Firefox 3 on Gentoo](http://cvk.qubes.org/spothopping.png)\n\n...until I disabled your stylesheet, and then I read it just fine.", "gilded": 0, "created_utc": "1221772191", "subreddit": "geek", "score": 3, "controversiality": 0}
{"body": "I propose a standardized text format for posting solutions, so we don't have to post screenshots.\n\nSolutions are textually represented as a string of characters: F for forward, R for Right, L for Left, J for Jump, O for On, 1 for function 1, 2 for function 2.\n\nThus, \"move forward three times and jump\" would be \"FFFJ\". \"Move forward three times, turn right, and do function 1\" would be \"FFFR1\".\n\nTo specify the contents of a function, use \"F1: FFF\" and \"F2: RRJ\". This means that function 1 is forward, forward, forward and function 2 is right, right, jump.\n\nOne of the many solutions to level 10 would be:\n\n1 J L F R J F F O 1 1 2\n\nF1: F F J L J J L\n\nF2: R R J J F O\n\n(Whitespace is optional, but appreciated.)\n\n\nAlso, how can we encourage the author release a level editor? Any ideas? (Tip jar?)", "gilded": 0, "created_utc": "1221786009", "subreddit": "programming", "score": -1, "controversiality": 0}
{"body": "I know!!!\n\nG O O G L E\n\nWhat do I win?", "gilded": 0, "created_utc": "1221800415", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "F J 1 1 L O 1 2\n\nF1: 2 2\n\nF2: O J O J O J R\n\nTotal: 17", "gilded": 0, "created_utc": "1221800596", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "...has a first name, its O S C A R", "gilded": 0, "created_utc": "1221861256", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I love how behind the camera was the slow roll of   9 0 0 0     P E N I S E S  across her dumb teleprompter.", "gilded": 0, "created_utc": "1221916226", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "\"Don't just sit on Reddit and be a fucking cynic.\"\n\nYeah, because the system is F A I R.\n\nAnd it works for the good of the C O M M O N   C I T I Z E N.\n\nspare me bud.", "gilded": 0, "created_utc": "1221950953", "subreddit": "Economics", "score": 1, "controversiality": 0}
{"body": "she could have custom bound some other letters.  Back in my heydays of WoW I bound all the keys around WASD so that they made a circle and my hand never moved.  (1 2 3 4 r f v c x z all with or without shift)", "gilded": 0, "created_utc": "1221990177", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "\"We can now rule out the idea that the illusion originates solely in the brain\"\n\nThey they didn't check if the microsaccades were just increasing because the brain was thinking \"hey, this picture's freaking out, do that shakie thing you do, I know you want to.\"\n\nSo it's STILL A MYSTERY!\n\n- S C I E N C E ! -", "gilded": 0, "created_utc": "1222192768", "subreddit": "science", "score": 7, "controversiality": 0}
{"body": "U S A U S A U S A U S A U S A U S A", "gilded": 0, "created_utc": "1222309804", "subreddit": "WTF", "score": -4, "controversiality": 0}
{"body": "Except it's spelled different.\r\n\r\nThat's spelled f l e s h l i g h t.", "gilded": 0, "created_utc": "1222375103", "subreddit": "sex", "score": 2, "controversiality": 0}
{"body": "I came in here to suggest using alternate tunings as well.  Sometimes the fingers just want to play the same patterns, and changing those tunings can yield interesting results.\n\nThe one I've been getting the most out of is the \"lute\" tuning.  Just drop the third (G) string down to F# and then the intervals between the strings are the same as for the six-course lute and the renaissance vihuela.\n\nIf you want a challenge, and you're good at fingerpicking, you can learn to read lute tablature. There's two main styles, the most prominent being French which is similar to modern tab (so quick to learn) but uses letters (a,b,c,d...) for the fret positions and the other is Italian which uses numbers, but reverses the string position from modern tab (that is, the top line represents the bottom (E)string).  \n\nThere's an enormous repertoire of this music that, until very recently (like the last two decades), had been completely neglected.  I've collected around 1400 files of this tablature from the net and been playing around with this stuff for the past couple years. Some of it is fairly easy, but a lot of it is mind-blowingly difficult.  \n\nTigerthink, I'll have to try out your major-thirds tuning, that's very different from what anything I've ever tried.\n\nI also like these tunings from Alex DeGrassi's album fantastically influential album Slow Circle:\n\n* E B E F# B E (Causeway, Inverness, White Rain, March Sky)\n* E B E G A D (Klamath, Slow Circle I, Slow Circle II) \n* E B E G# B D (Midwestern Snow)\n* E B E F# B D (Sleeping Lady)", "gilded": 0, "created_utc": "1222406209", "subreddit": "Guitar", "score": 2, "controversiality": 0}
{"body": "They're going to crash the economy with or without the bailout.  This is just a last ditch effort to clean what's left out of the treasury.\n\nThese people are the financial BORG.  They drift from country to country, sucking up all the wealth and natural resources then leave people in poverty with no futures and no way out.\n\nThey have no national, religious or any fealty to anything except M O N E Y.\n\nPrior to 2003 there were 3 nations left on the face of the earth that DO NOT have central banks.  One is Iraq.  Can you guess the other two?\n\n... \n...\n...\n\nIran and North Korea ...the other two \"axes\" in the axis of \"eeevil\"\n\nThe banksters want total control of the Earth's currency.  Then we all will be slaves forever.", "gilded": 0, "created_utc": "1222472063", "subreddit": "reddit.com", "score": 6, "controversiality": 0}
{"body": "You know the feeling you get when you are cramming for an exam because you NEVER studied or attended any classes...You don't know shit but you have a TON of material to cover and learn. And as quicky as you learn one fact you forget another...and this test determines if you pass or fail. Sleepless nights, panic stricken all nighters to learn factoids about issues you know nothing about?... Well that is her times a million. She is F U C K E D next week at the debate. SO FUCKED.", "gilded": 0, "created_utc": "1222524530", "subreddit": "WTF", "score": 4, "controversiality": 0}
{"body": "Good, I hope they boot lying anti-Israel Jewish conspiracy theorists like you off reddit.\n\nR E P O R T E D !!!", "gilded": 0, "created_utc": "1222553333", "subreddit": "religion", "score": 3, "controversiality": 0}
{"body": "I was not aware some troll cloned your user name? what did he do swap the \"o\"s with zeros?\r\n\r\ntell me troll what color is the sky in the world you live? \r\n\r\nI thought the thread speaks for itself! \r\n***R O T F L M F A O***\r\n\r\n***FAIL***\r\n\r\nEPIC ***FAIL***", "gilded": 0, "created_utc": "1222570222", "subreddit": "religion", "score": 3, "controversiality": 0}
{"body": "As if you ever had a \"first time\" \r\n\r\n***R O T F L M F A O***", "gilded": 0, "created_utc": "1222640839", "subreddit": "nsfw", "score": -5, "controversiality": 0}
{"body": "Maybe she's speaking s l o w l y because she's really dumb and just doesn't get it.", "gilded": 0, "created_utc": "1222737247", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Please allow me to introduce myself; I'm a C E O of taste.....", "gilded": 0, "created_utc": "1222812625", "subreddit": "Economics", "score": 1, "controversiality": 0}
