{"body": "I think the Christians need a do-over. The bible is too full of horse shit for anyone to continue believing it is the actual word of God. Just re-write the damn thing and be done with it for another 2000 years....\n\nBut NOoooo, Christians say you can't just read the bible, you have to read it *properly*. What exactly does that mean if we're supposed to believe that Satan coerced a good portion of it now? New rules for how to read the scripture; Read 3, skip 2, read 2, skip 4?? \n\nNewsflash for Christians - All you really need to do, to make the bible make sense, is try to imagine the letters F I C T I O N right under where it says HOLY BIBLE. Read it once, talk about it in your book club, then get on with your life.", "gilded": 0, "created_utc": "1254363733", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "W R O N G ! ! !\n\nRead my comment above.\n\nThe bill already says that no illiegals will be covered!\n\nWho are you? You always show up in my threads with disinformation.", "gilded": 0, "created_utc": "1254364539", "subreddit": "politics", "score": 7, "controversiality": 0}
{"body": "**Did someone say IUD in her?**\n\nM R I U Ds.\n\n_M R KNOT I U Ds_\n\nO S A R. C M WANGS?\n\n_L I B_\n\nYUP. M R  IU Ds N R. \n\n_O I C M R I U Ds N R._", "gilded": 0, "created_utc": "1254426407", "subreddit": "AskReddit", "score": -8, "controversiality": 0}
{"body": "¿Le faltaron T A N A T E S  a la ardillita?\n", "gilded": 0, "created_utc": "1254436773", "subreddit": "mexico", "score": 3, "controversiality": 0}
{"body": "Actress Nicole Sullivan joins fellow dieters Valerie B e r t i n l i and P h y l i c i a R a s h a d as \n\ndevotees of Jenny Craig, the successful weight loss program that has helped millions \n\nof women lose weight", "gilded": 0, "created_utc": "1254482751", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "B O R I N G", "gilded": 0, "created_utc": "1254491879", "subreddit": "ComputerSecurity", "score": -5, "controversiality": 0}
{"body": "    * g o a t s e x * g o a t s e x * g o a t s e x *\n    g                                               g  \n    o /     \\             \\            /    \\       o\n    a|       |             \\          |      |      a\n    t|       `.             |         |       :     t\n    s`        |             |        \\|       |     s\n    e \\       | /       /  \\\\\\   --__ \\\\       :    e\n    x  \\      \\/   _--~~          ~--__| \\     |    x\n    *   \\      \\_-~                    ~-_\\    |    *\n    g    \\_     \\        _.--------.______\\|   |    g\n    o      \\     \\______// _ ___ _ (_(__&gt;  \\   |    o\n    a       \\   .  C ___)  ______ (_(____&gt;  |  /    a\n    t       /\\ |   C ____)/      \\ (_____&gt;  |_/     t\n    s      / /\\|   C_____)       |  (___&gt;   /  \\    s\n    e     |   (   _C_____)\\______/  // _/ /     \\   e\n    x     |    \\  |__   \\\\_________// (__/       |  x\n    *    | \\    \\____)   `----   --'             |  *\n    g    |  \\_          ___\\       /_          _/ | g\n    o   |              /    |     |  \\            | o\n    a   |             |    /       \\  \\           | a\n    t   |          / /    |         |  \\           |t\n    s   |         / /      \\__/\\___/    |          |s\n    e  |           /        |    |       |         |e\n    x  |          |         |    |       |         |x\n    * g o a t s e x * g o a t s e x * g o a t s e x *\n", "gilded": 0, "created_utc": "1254496508", "subreddit": "linux", "score": 5, "controversiality": 0}
{"body": "NOTE: This is _OFFTOPIC_ and advanced, but if you want to explore with strings and memory...\n\nIf you're running windows... you can try this script...\n\n* start &gt; run &gt; cmd\n* cls\n* debug\n* e b800:0 \"H a p p y _ B i r t h d a y \"\n* q\n", "gilded": 0, "created_utc": "1254499373", "subreddit": "carlhprogramming", "score": 1, "controversiality": 0}
{"body": "Okay.... real quick. Spell P A N N U S. ", "gilded": 0, "created_utc": "1254593371", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "f u c k i n g     a w e so m e", "gilded": 0, "created_utc": "1254614431", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "I was one of the few olde-skoole style, all-arounder generalists without a particular specialty, so I never advanced beyond a grunt-level title, although I could do the job of several different Specialists. Not that I ever went for promotions; I didn't ever want to get too comfortable there, so I let the more career-minded colleagues go for any open positions.  I was just there to pay the bills until something better panned out elsewhere (I did *not* get a college degree to wind up with a career at Kinko's), which took a *lot* longer than I'd ever hoped or planned.\n\nI usually spent the first half of my shift in Shipping, then moved to Production/front counter to close. I really should have been a... what was the title, \"Center Specialist\" I think? Whatever position/title they created once they realized they needed a generalist who could fill in anywhere, anytime rather than having everyone be a Specialist, but our CM never even mentioned to anyone that the position a) had even been created and b) was open at our shop, so he wound up hiring from outside to fill it. Whilst I wasn't gunning for the promotion track, it would have been nice to actually get paid more for the job I was already doing anyway...\n\nIt's probably more fun if you work nights and get a shift supervisor who's reasonable and not a policy-Nazi corporate droid.  We'd generally try to get all our jobs cranked out right away, so we could usually slack off for the rest of the shift surfing the Web or \"learning the software\" with personal-interest projects or whatnot, and that also meant we could almost always take short-order jobs to pick up by closing time or first thing next morning. Around the time I left, they'd started cracking down on casual Internet usage, which just resulted in our trying to do our production jobs *r e a l l y s l o w l y* and goofing off a lot, just to avoid being bored and having fuckall to do all night long.", "gilded": 0, "created_utc": "1254637141", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "B U L L S H I T ! , you sir are a idiot", "gilded": 0, "created_utc": "1254666310", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "V shouldn't go to VI.  Not only that, but vi is minor in a major key.  A better chord progression would have been I vi IV V I.  There's your standard progression for most pop songs.  G e C D G (the previous progression in the key of G) occurs so many places that it makes me want to puke.", "gilded": 0, "created_utc": "1254671722", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "Scroll down to the bottom half of the article.\r\n\r\n&gt; Phonetic Alphabet \r\n\r\n&gt; Names of the Letters express'd in the reform'd Characters. Sounded as now in Sounds and Characters.\r\n\r\nLays out each letter, a word with its sound, and description. New letters are just marked as * . Insead of \"a b c d e f g, h i j k lmnop, q r s, t u v, w x, y &amp; z\" he has \"o (new 2nd o) a e i u (new 2nd u), h g k (new sh) (new ng), n r t d l, (new th)  (2nd new th), s z f v b p m.\" \r\n\r\nSay what you will about Ben Franklin, but I'm glad this guy wasn't the head of the Department of Education (if it existed at the the time).", "gilded": 0, "created_utc": "1254686646", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "        L I S A     I M\n    A           T E R D\n      W E N T\n                      T O\n    P A S T E       I N\n    \n      O U R\n    \n      E V E N T\n    T E N S E", "gilded": 0, "created_utc": "1254740857", "subreddit": "DIY", "score": 2, "controversiality": 0}
{"body": "joker face j j j j joker face", "gilded": 0, "created_utc": "1254751743", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "[Gloomy Sunday](http://en.wikipedia.org/wiki/Gloomy_Sunday)\n\nTHAT song - especially when sung by Diamanda Galás - look it up on youtube - some F R E A K Y shit.", "gilded": 0, "created_utc": "1254758018", "subreddit": "Music", "score": 1, "controversiality": 0}
{"body": "i used to think l m n o p was elimenopey, one word. \n\nI thought the words \"brought to you in part by\" were also one word \"BRATUNEPARTBYE\"\n\nand sadly I also thought the word \"rape\" meant someone had taken a rake to you.\n\n", "gilded": 0, "created_utc": "1254763925", "subreddit": "AskReddit", "score": 73, "controversiality": 0}
{"body": "I thought the signs for one way streets  were helpful directions to get to where we needed to go.   and the letters L M N O were just one letter pronounced 'elemeno'", "gilded": 0, "created_utc": "1254774881", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "i always though lmnop was one letter because when you recite the alphabet you say the letters l m n o and p fast in succession\nedited for mispellling", "gilded": 0, "created_utc": "1254775017", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "funny comment, dedication to learn the string names! E A D G B E... Wow,, that took a long time. Hopefully you are not serious. The kid obviously has perfect pitch. Unless you do, (and I doubt you do) there is no way that you could do that! E.ven A. D.umb G.uy B.ecomes E.ducated.  That may help you learn the string names... Good Luck\r\n\r\n", "gilded": 0, "created_utc": "1254816439", "subreddit": "Music", "score": 2, "controversiality": 0}
{"body": "**S O C I A L I S M**", "gilded": 0, "created_utc": "1254873246", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "\"Okay here I go, g o a t s e and enter\".", "gilded": 0, "created_utc": "1254918773", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;\t\t\t\t\t\t\tR\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;\t\t\t\t\t\t\tE\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;\t\t\t\t\t\t\tD\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;\t\t\t\t\t\t\tD\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;\t\t\t\t\t\t\tI\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;\t\t\t\t\t\t\tT\n\n&gt; R E D D I T || B A R C O D E |", "gilded": 0, "created_utc": "1254924898", "subreddit": "technology", "score": 7, "controversiality": 0}
{"body": "Someone who is cheap and stingy?\n\n[N _ G G A R D L Y](http://www.google.com/search?hl=en&amp;source=hp&amp;q=define%3A+niggardly&amp;aq=f&amp;oq=&amp;aqi=g4)", "gilded": 0, "created_utc": "1254929864", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "Church Virus.\n\nQuick, type F U N D and see if money falls from the sky!", "gilded": 0, "created_utc": "1254938873", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "    T r o l l i n g    i s    a    a r t .", "gilded": 0, "created_utc": "1254950413", "subreddit": "4chan", "score": 37, "controversiality": 0}
{"body": "&gt; ST is a simple way to tell the compiler how to sequence destructive writes. It doesn't add complication, on the contrary, it simplifies the problem of identifying which parts can be parallelized, and reasoning about software.\n\nIf that were true then it should be at \"least as easy\" to write a generic parallel quicksort in Haskell but, apparently, it is prohibitively difficult. The problem is, of course, that you have to explain to Haskell which separate subarrays the subsorts will mutate, which is extra work for the programmer.\n\n&gt; All computational tasks are conceptually pure, even if they are implemented using destructive writes or non-pure primitives.\n\nThen what is the point in discussing this \"conceptual purity\"?\n\n&gt; &gt; The code does not seem very pure in the shootout and I had just repeated the same trivial counter example twice only to have it ignored.\n\n&gt; Its pure enough that you can sprinkle it was calls to \"par\" to get correct parallelism almost for free.\n\nCompare serial spectral norm:\n\n    powerMethod :: Int -&gt; Int -&gt; Reals -&gt; Reals -&gt; IO ()\n    powerMethod !i !n !u !v = allocaArray n $ \\t -&gt;\n        replicateM_ i $ timesAtAv t n u v &gt;&gt; timesAtAv t n v u\n\nwith parallel spectral norm:\n\n    powerMethod :: Int -&gt; Int -&gt; Reals -&gt; Reals -&gt; IO ()\n    powerMethod i n u v = do\n        -- roll our own synchronisation\n        children &lt;- newMVar []\n        replicateM_ i $ do\n            me &lt;- newEmptyMVar\n            cs &lt;- takeMVar children\n            putMVar children (me : cs)\n            forkIO (child `finally` putMVar me ())\n        wait children\n      where\n        child = allocaArray n $ \\t -&gt; timesAtAv t n u v &gt;&gt; timesAtAv t n v u\n\n        -- wait on children\n        wait box = do\n          cs &lt;- takeMVar box\n          case cs of\n            []   -&gt; return ()\n            m:ms -&gt; putMVar box ms &gt;&gt; takeMVar m &gt;&gt; wait box\n\nThat is clearly not just a sprinkling of `par`.\n\nAgain, quicksort is another excellent counter example. If you use a pure \"quicksort\" then it is easily parallelized using `par` but it is extremely inefficient, around 6,000x slower than necessary. If you optimize it to use the real in-place quicksort algorithm then you can get decent single core performance from Haskell for certain element types but parallelizing it is hard, much harder than in F# or Cilk++.\n\n&gt; Huh? How do you \"contain\" a large mutable object in a HOF?\n\nI meant contain the algorithm that performs the mutation in the HOF.\n\nProgrammers who throw `static` into a parallelized program without knowing exactly what they are doing are being completely wreckless.\n\n&gt; I just said that the Haskell annotations allow you to specify the extract granularity\n\nThe optimal granularity is a function of the machine the program is being run on. For example, my two-CPU machine requires two orders of magnitude coarser granularity than my multicore or I get massive performance degradation. So the ability to annotate the source code with that information is useless because the information cannot be known when the program is written.\n\nI use an elegant solution in F# that relies heavily upon mutating global state. The algorithm is encapsulated in a HOF. AFAICT, this would be difficult or impossible to implement in Haskell and it solves a problem that has never been solved in Haskell.\n", "gilded": 0, "created_utc": "1255002973", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "! ! **T O T A L L Y   G A Y** ! !", "gilded": 0, "created_utc": "1255014168", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Call it F R O S T. Then make it all tropical except for the polar bear that comes out and occasionally mauls someone. Decorate the walls with crashed plane parts too.", "gilded": 0, "created_utc": "1255035818", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Shows his bullshit cards when he says he started with $10k, and has turns that into \"high 6 figures\" yearly.\n\nF U C K I N G  B U L L S H I T \n\n", "gilded": 0, "created_utc": "1255044690", "subreddit": "IAmA", "score": 15, "controversiality": 0}
{"body": "My grain of salt   ** A F F I N I T Y**\n\nI started with PC in 1986 from an IBM mainframe background (z/OS and predecessors - architecture &amp; discipline).\n\n- IBM/DOS I could tolerate. In 1987, it was just \"a game\".\n\n- OS/2 when things got better with NETSCAPE, of course.\n\n- Sometimes, at clients (I was free lancing) , obliged to paddle in MicroLimp's shit. No way !!\n\n- Discovered Linux via Partition Manager (OS2 HPFS vs other).\n\n- Tried Linux ..... SUSE and KDE vs. myself ... no love story. Workable, but no love.\n\n- Fedora core 2 .... Anaconda/Python installation + **GNOME** = smitten.\n\n- Then Ubuntu with GNOME .... ** hooked for life** started with 4.** ==&gt; 9.10KK now.\n\nIt is just like your taste in women ... and reciprocally if you are female. \n\nNot 1 (ONE) option but 16+ (depending on your MBTI type).", "gilded": 0, "created_utc": "1255095514", "subreddit": "linux4noobs", "score": 1, "controversiality": 0}
{"body": "Wow.  IMHO you have just won the stupidest post I've ever seen on reddit.  Congrats!\n\nd o w n v o t e d", "gilded": 0, "created_utc": "1255106420", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "and then she should r e a d a b o O K.", "gilded": 0, "created_utc": "1255126252", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "This makes things interesting.  So, when using malloc, you can actually see the residual data of some other program?\n\nhttp://codepad.org/u6xUuN1W\n\nAlso note that I forgot to add the include for stdlib.h and it still worked?  Is the compiler encouraging bad programming?\n\nI also tried this in code blocks with one minor tweak, I am displaying the char instead of the hex value:\n\n    Starting String:                8 ? &gt;   8 ? &gt;   i n d o w s _ N T   P a t h = .\n    The 1st string is: One\n    The 2nd string is: Two\n    The 3rd string is: Three\n    The 4th string is: Four\n    Final String:                   O n e   8 ? T w o   d o T h r e e   F o u r   .\n    \n    Process returned 0 (0x0)   execution time : 0.015 s\n    Press any key to continue.\n", "gilded": 0, "created_utc": "1255127120", "subreddit": "carlhprogramming", "score": 1, "controversiality": 0}
{"body": "*Fails in finding a W T F big enough to cover this whack job idiocy* ", "gilded": 0, "created_utc": "1255147948", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "OK, I'll say it.\n\n**N O T  P R O G R A M M I N G**", "gilded": 0, "created_utc": "1255257726", "subreddit": "programming", "score": 15, "controversiality": 0}
{"body": "Indeed.  The letters \"R S T L N E\" are provided for every bonus round.   Also, the joke is partly inspired from an episode of South Park.", "gilded": 0, "created_utc": "1255282192", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "I played the hell out of FFT. Still have the original black label disc and all. Played the game for years, even. (stopped for a while when I hit a red/yellow Chocobo fight. That was worse than most boss fights) And I would have to say that while FFTA (GBA) wasn't quite as good overall, FFTA2 (the only one on DS) is still a fine carrier of the name. There are a lot of overall changes in how it plays (mostly mission based, how \"random\" battles are handled, etc.), but the core gameplay is still the same. The strong advantage Advance 2 has over Advance 1 is the near removal of the law system. That was a terrible hindrance, and made FFTA a burden to play at times. It not only works much better in 2, but actually provides some pretty interesting challenges for the clan trials.\n\nAlso the PSP remake, while still true to the original, has some issues. First, there's a problem with all skills/magic. For unknown reasons, all of the animations for them are at half the framerate as the rest of the game. Hence, any skill/magic used will slow the game down to half speed while it is being displayed. It isn't a game breaker or anything, just an unnecessary annoyance that will slowly eat at your soul. And while the translation is technically much better, those of us who are used to the old FFT will find it a bit weird. All the new item/skill/magic/character names is very odd at first.\n\nOh, and I actually miss l i t t l e   m o n e y.", "gilded": 0, "created_utc": "1255316781", "subreddit": "gaming", "score": 3, "controversiality": 0}
{"body": "*Oh, and I actually miss l i t t l e m o n e y.*\n\nthat is amazing.", "gilded": 0, "created_utc": "1255319027", "subreddit": "gaming", "score": 3, "controversiality": 0}
{"body": "Who the fuck is J O N Q U I E R E  Q U E B E C ?", "gilded": 0, "created_utc": "1255359225", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "W H Y A R E Y O U  T Y P I N G L I K E T H I S ?", "gilded": 0, "created_utc": "1255360215", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "What's up with the reused memory? Is it o.k?\n\nAfter running this code on my machine:\nhttp://codepad.org/bLcHvfa0\n\nI get this:\n\n    word000[6]: Funny\n    word001[7]: Sextet\n    word002[8]: Rhyming\n    ptr004: 070 117 110 110 121 000 083 101 120 116 101 116 000 082 104 121 109 105 110 103 000 \n    ptr004: 46 75 6e 6e 79 00 53 65 78 74 65 74 00 52 68 79 6d 69 6e 67 00 \n    ptr004: F u n n y  S e x t e t  R h y m i n g  \n    \n    word000[7]: The\n    word001[8]: Last\n    word002[6]: Rx\n    ptr006: 084 104 101 000 121 000 083 076 097 115 116 000 000 082 104 082 120 000 110 103 000 \n    ptr006: 54 68 65 00 79 00 53 4c 61 73 74 00 00 52 68 52 78 00 6e 67 00 \n    ptr006: T h e   y  S L a s t    R h R x   n g   \n\nI used different definition lengths but the same overall structure size. Memory is freed after each set of printf's.\n\nThe second set of memory contents [T h e  y  S L a s t   R h R x  n g   ] can't be good, right?", "gilded": 0, "created_utc": "1255371361", "subreddit": "carlhprogramming", "score": 1, "controversiality": 0}
{"body": "That is E P I C .\n\nBe prepared to see that everywhere ... and see it again, sent to you by a young relative in about 5 years.", "gilded": 0, "created_utc": "1255385313", "subreddit": "funny", "score": 7, "controversiality": 0}
{"body": "Not really, I first tried the letters U U D D L R L R A, but then read the comments.", "gilded": 0, "created_utc": "1255438283", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "S U P E R W E E D\r\n\r\nThat story was intense. I think..", "gilded": 0, "created_utc": "1255461837", "subreddit": "Marijuana", "score": 1, "controversiality": 0}
{"body": "Yes!! I'm thinking about ordering the Vtower myself. I've been using my buddy's silver surfer/bubbler combo. V A P O R I Z E ......", "gilded": 0, "created_utc": "1255468498", "subreddit": "Marijuana", "score": 2, "controversiality": 0}
{"body": "\"H T T P S colon wacka wacka double-u....\"    \n     \n\"Wait, did you just say 'wack wacka'\"?    \n    \n\"Why yes I did xD\"    \n    \nI quite like them for this reason. If it's such a pain in your ass then type in the site's name, i.e. 'reddit' and press Ctrl + E. Fixed.", "gilded": 0, "created_utc": "1255536675", "subreddit": "geek", "score": 2, "controversiality": 0}
{"body": "Morse spoiler!  \n\n&gt; -.--/ ---/ ..-/ .-/ .-./ ./ --/ ../ .../ .../ ./ -../  \n&gt; .../ -./ ---/ .--/ -.../ .-/ .-../ .-.. \n&gt; translated is:\n&gt; \"Y O U A R E M I S S E D S N O W B A L L\" ", "gilded": 0, "created_utc": "1255568820", "subreddit": "comics", "score": 5, "controversiality": 0}
{"body": "........L M N O P S T U V W.................?", "gilded": 0, "created_utc": "1255581954", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Loving the comments:\n\n&gt;i want a toilet seat like this so i can cool my balls off when i﻿ take a S H I T ", "gilded": 0, "created_utc": "1255583724", "subreddit": "gadgets", "score": 2, "controversiality": 0}
{"body": "               SINGER-SONGWRITER  DEBUT RECORDING ARTIST, \r\n                                \" L I N D A    N O Y E S \" \r\n\r\n                            RELEASING HER DEBUT SINGLE, \r\n                      \" T A K E   Y O U   T O   P A R A D I S E \" \r\n                 \r\n                 THIS   MONTH   ON   iTUNES   &amp;   IN   STORES !!!\r\n\r\n                  LISTEN AT: WWW.MYSPACE.COM/LINDANOYES\r\n         \r\n            NOW ON SALE AT:    WWW.DIGSTATION.COM/LINDANOYES\r\n                       ", "gilded": 0, "created_utc": "1255586984", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "No one inside the balloon.\r\n\r\nM E G A T R O L L !!!\r\n\r\n\r\nPS: He should have put a portable DVD player there looping Never Gonna Give You Up video.", "gilded": 0, "created_utc": "1255635925", "subreddit": "WTF", "score": 5, "controversiality": 0}
{"body": "Transcript:\n\nIn the \"Barack and a hard place\" segment tonight, as we pointed [out] last night, the White House [is] not happy with Fox News **because it favours** - uh, the White House believes, it favours the Republican party. There is scant - s c a n t - evidence to support that, but [incomprehensible - \"the White House hasn't\", maybe?] made a big deal out of it anyway...\"\n\nEmphasis mine, to indicate the almost-admission.", "gilded": 0, "created_utc": "1255640590", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "\" no no, it's not Bush, its Brusch, b r u s c h\"\"\n", "gilded": 0, "created_utc": "1255646337", "subreddit": "Anarchism", "score": 0, "controversiality": 0}
{"body": "I think I understand what you're saying. Thanks for the help.\n\nI made my changes here:\n\nhttp://codepad.org/a4H9eQOT\n\nMuch better loop results using the malloc-size/type-size loop-termination. Null characters are displayed for ptr008, and stray memory is not displayed for ptr009. And like you said, for the 2 leftover bytes after the ptr009 int's are just ignored.\n\n------- On codepad.org\n    \n    ptr008: loop while: i &lt; strlen(ptr008)\n        A B C D E F G H I \n        65 66 67 68 69 70 71 72 73 \n        41 42 43 44 45 46 47 48 49 \n    \n    ptr008: loop while: * (ptr008 + i) != '\\0'\n        A B C D E F G H I \n        65 66 67 68 69 70 71 72 73 \n        41 42 43 44 45 46 47 48 49 \n    \n    ptr008: loop while: i &lt; malloc_int/sizeof(char)\n        A B C D E F G H I � \n        65 66 67 68 69 70 71 72 73 00 \n        41 42 43 44 45 46 47 48 49 00 \n        \n    ptr009: loop while: * (ptr009 + i) != '\\0'\n        53000 32000 14090313 3969 \n        cf08 7d00 d70049 f81 \n    \n    ptr009: loop while: i &lt; malloc_int/sizeof(int)\n        53000 32000 \n        cf08 7d00 \n\n------- On local machine\n\n    ptr008: loop while: i &lt; strlen(ptr008)\n        A B C D E F G H I \n        65 66 67 68 69 70 71 72 73 \n        41 42 43 44 45 46 47 48 49 \n    \n    ptr008: loop while: * (ptr008 + i) != '\\0'\n        A B C D E F G H I \n        65 66 67 68 69 70 71 72 73 \n        41 42 43 44 45 46 47 48 49 \n    \n    ptr008: loop while: i &lt; malloc_int/sizeof(char)\n        A B C D E F G H I  \n        65 66 67 68 69 70 71 72 73 00 \n        41 42 43 44 45 46 47 48 49 00 \n        \n    ptr009: loop while: * (ptr009 + i) != '\\0'\n        53000 32000 73 \n        cf08 7d00 49 \n    \n    ptr009: loop while: i &lt; malloc_int/sizeof(int)\n        53000 32000 \n        cf08 7d00 ", "gilded": 0, "created_utc": "1255669031", "subreddit": "carlhprogramming", "score": 1, "controversiality": 0}
{"body": "S U B T L E T Y..\r\nalso, it means NUANCED", "gilded": 0, "created_utc": "1255669427", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "America is **S O V E R E I G N** \r\n\r\nAnd if anybody name noseeme responds to this, he's correct, spacebars are tyrrany.", "gilded": 0, "created_utc": "1255672872", "subreddit": "Marijuana", "score": 3, "controversiality": 0}
{"body": "America is S O V E R E I G N T O E S C A P E T H E T Y R A N N Y O F S P A C E B A R .", "gilded": 0, "created_utc": "1255673996", "subreddit": "Marijuana", "score": 7, "controversiality": 0}
{"body": "&lt;signs&gt; hello p u m p v a l v e how are you? &lt;/signs&gt;\n\nExcept that won't work because I only know Auslan and there is a whole computer and internet in the way.  My son's school is also the local deaf facility and has about 15 deaf kids that spend 80% of their time in normal classes and the rest with speech therapists and the like, so all the kids are taught Auslan and they also run classes for interested parents.\n\nCan you point me to any good online ASL introductions?  I know that ASL and Auslan are about as similar as English and Chinese and I would like to know more.  Oh for a one-handed alphabet. ", "gilded": 0, "created_utc": "1255692099", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Starting every sentence with 'again'.\nRepeating words while talking so that others cannot get a word in. I I I I I I think that that that you have a a a a a good point there. So so so so let's discuss that and and and then we'll come to a conclusion. etc....", "gilded": 0, "created_utc": "1255764582", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Fahrenheit? Who measures in fahrenheit? It's called C E L C I U S !", "gilded": 0, "created_utc": "1255791416", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "On Wheel of Fortune, everyone chooses R S T L N E. Those should be on the home row.", "gilded": 0, "created_utc": "1255817487", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "the most common letters in the English language are, in approximate order, [E T A O I N S H R D L U](http://en.wikipedia.org/wiki/ETAOIN_SHRDLU). Accordingly, the home row for Colemak is A R S T D H N E I O, and the home row for Dvorak is A O E U I D H T N S. Colemak has the first ten letters on the home row, and Dvorak has 1-8, 10, and 12. Qwerty has only A S H D L, or numbers 3, 7, 8, 10, 11.", "gilded": 0, "created_utc": "1255828815", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Well I had a tutor once a week for the summer.  That cost me $25 a week.  He was really good.  He gave me this book \"Alfredos Basic Guitar Method 1\".  It teaches you how to read music on guitar, not so much chords.  But you can learn those online or from your tutor.  The main ones you need to know to play a lot of easy songs are C A G E D Em Am.", "gilded": 0, "created_utc": "1255835938", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "    #include &lt;iostream&gt;\n    #include &lt;cmath&gt;\n\n    #define O a++;\n\n    int main()\n    {\n        int a = 0;\n        const double r = 18;\n\n                                  O O O O O O O O\n                            O O O O O O O O O O O O O O\n                        O O O O O O O O O O O O O O O O O O\n                      O O O O O O O O O O O O O O O O O O O O\n                  O O O O O O O O O O O O O O O O O O O O O O O O\n                O O O O O O O O O O O O O O O O O O O O O O O O O O\n              O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n              O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n            O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n          O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n          O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n        O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n        O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n        O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n      O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n      O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n      O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n      O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n      O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n      O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n      O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n      O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n        O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n        O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n        O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n          O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n          O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n            O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n              O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n              O O O O O O O O O O O O O O O O O O O O O O O O O O O O\n                O O O O O O O O O O O O O O O O O O O O O O O O O O\n                  O O O O O O O O O O O O O O O O O O O O O O O O\n                      O O O O O O O O O O O O O O O O O O O O\n                        O O O O O O O O O O O O O O O O O O\n                            O O O O O O O O O O O O O O\n                                  O O O O O O O O\n\n        std::cout &lt;&lt; \"PI = \" &lt;&lt; a / (r * r) &lt;&lt; std::endl;\n    }\n\nMake circle bigger for more accuracy.", "gilded": 0, "created_utc": "1255858489", "subreddit": "programming", "score": 9, "controversiality": 0}
{"body": "$200 waiting! I've been waiting for a year+ for VZW to come out with a decent handset. F I N A L L Y.", "gilded": 0, "created_utc": "1255873969", "subreddit": "gadgets", "score": 1, "controversiality": 0}
{"body": "You can get away with not knowing a terrible amount about theory, especially if you are good sight reader, to get to a decent level. However, if you want to be a pro, then yes learn it. To understand what you are doing, as well as aid in the memorization process, theory is integral. Due to the fact that there is not much improvisation in classical music at all, it is less important than in say...jazz/rock/blues, but I say learn enough that you know your diatonic scales, chord tones, and chord progressions so you can understand it and 'talk shop' with others about it.  \n  \nAny good teacher will work in music theory to some level. I do, at least. Something I can tell you really quickly that is a big help is this. When learning chord tones, understand that the list below is a large part of it. Every chord has a Root (1) third (3) fifth (5), and sometimes a seventh (7). Triads have only 1,3,5 while seventh chords have 1,3,5,7. Here's the important bit, regardless of what kind of chord it is if the root is...lets say an A of any kind (A, Ab, or A#), then the chord will definitely have some form of the notes A C E G in it. Examples; A Major 7th is A C# E G#, while Ab minor seventh flat 5 is Ab Cb Ebb Gb. So, again, regardless to what type of chord quality it is, if the root is an 'A' of some kind, the chord tones involved will be A C E G of some kind. So, memorize the list below and you'll be well on your way to having your chords memorized. Good luck!  \n  \n\nI hope that wasn't TOO confusing, much easier to explain in person.   \n\nList:\n\n1 3 5 7  \n\nA C E G  \nB D F A  \nC E G B  \n \nD F A C  \n \nE G D B  \n  \nF A C E  \n  \nG B D F ", "gilded": 0, "created_utc": "1255889189", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": " N e v e r          t r u s t\n\nJohn  Ca rm ack  ...\n\nThat  b e i ng   said,\n\ngo forth and code\n\n\n", "gilded": 0, "created_utc": "1255907510", "subreddit": "programming", "score": 862, "controversiality": 0}
{"body": "   \n\n     N e v e r t r u s t  \n     John  Carmack . . .  \n     That  being   said,  \n     go  forth  and code  \n     (A fixed width font  \n     makes justification  \n     simpler to achieve)  \n  \n \n\n(EDIT: I say that, yet gfp didn't fuck it up the first time and have to edit his comment!)", "gilded": 0, "created_utc": "1255980610", "subreddit": "programming", "score": 43, "controversiality": 0}
{"body": "    Q W E R F U U\n\nNice touch.", "gilded": 0, "created_utc": "1255986844", "subreddit": "fffffffuuuuuuuuuuuu", "score": 5, "controversiality": 0}
{"body": "Mapping the letters to upside down equivalents just makes the trick more impressive. (ae bp dqg hy ft ir nu mw lj s z o x -- not sure about 'v').", "gilded": 0, "created_utc": "1256011216", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Let me spell that out for you.\n\nS H E L L - S C R I P T\n\nLearn to read.", "gilded": 0, "created_utc": "1256026701", "subreddit": "programming", "score": 4, "controversiality": 0}
{"body": "E I E I O ", "gilded": 0, "created_utc": "1256076471", "subreddit": "todayilearned", "score": 14, "controversiality": 0}
{"body": "&gt; I I I I I I I\n\nSounds like a police siren. ", "gilded": 0, "created_utc": "1256127873", "subreddit": "Music", "score": 4, "controversiality": 0}
{"body": "YOU'RE STEVE!! DONT FUCKING LIE!!!1! I KNOW IT YOUR FUCKING STEVE ADMIT IT!!!\n\nTHATS GROSS YUCK G R O S S\n\nYOU HAVE GONORRHEA IN YOUR MOUTH\n\n\n\nAhem..But seriously sir, ew.", "gilded": 0, "created_utc": "1256178948", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "That, is, A W E S O M E ! ! ! ! ! ! !", "gilded": 0, "created_utc": "1256400573", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "\"Time to relax. Think about nothing. Nothing. The word nothing. N O T H I N G. Let me check my cell phone and go on Reddit.\"", "gilded": 0, "created_utc": "1256434124", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "Probably gojuuon order - when romanized, it would be more or less, a i u e o k/g s/z t/d n(paired with vowel) h/b/p m y r w n(not paired with vowel).", "gilded": 0, "created_utc": "1256482951", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Hello dee c h e s t at gee mail dot com \n\nI am sure your voicemail at 408.256.2438 will be chock full of fun stuff today, along with your email.\n\nWould you be also so kind as to post some of the fun that comes your way?\n\nEDIT: Obfuscated email to trick supposed spiders.", "gilded": 0, "created_utc": "1256486213", "subreddit": "reddit.com", "score": -4, "controversiality": 0}
{"body": "R R r r r rrrrrrrrrappppiiiiiddddddddoooooo!!!", "gilded": 0, "created_utc": "1256526041", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "sfgh    sfgh    sfgh f s f d    dfds  sf h j    jljh g f d s", "gilded": 0, "created_utc": "1256526128", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "    RH: s       f   h   a     sds           \n    LH: t o u o t o u o y o i o t o u o \n\n    RH: j       h   l   h   hjhghg\n    LH: t p i p t o u o r o i  o t o u o\n\n    RH: p asdfghjhgfdsapo pasdfghgfdsapo\n    LH: i           i   u           u   \n\n    RH: i opasdfgfdsapoiu iopasdfdsapoiu\n    LH: y           y   t           t   \n\n    RH: y uiopaHdpaHdfghjklkjhgfghjhgfd...\n    LH: ...", "gilded": 0, "created_utc": "1256528741", "subreddit": "AskReddit", "score": 22, "controversiality": 0}
{"body": "G G s H J . . s G sGF . . \nG G s H G FF . LLJ . g JH . . . \nG G s H J . . s G sGF . . \nG G s H G FF J J J g J . \n\nH----JgHJ J J g J F . GsHG- JgJ\n\nGsHG g g J . FGsF J J H ", "gilded": 0, "created_utc": "1256534990", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "**Saria's Song**:\n\nipa ipa ipa fd asaou yuou\n\n\n**Bolero of Fire**:\n\niyiy pipi iyiy \n\n\n**Zelda's Lullaby**\n\na d p op a d p a d j hd sap\n\n\n**Ocarina of Time intro chords**:\n\nas a chord: 4etu, 1etu\n\n\n**Kokiri Forest (just a snippet)** \n\nosouyui opo ioi uyut\n\n\n**Minuet of Forest**\n\ndzk jkj dzk jkj\n\n\n**Song of Storms**:\n\ndgz dgz xcxcxlj jdghj jdfgf\n\n\n\nI would do the whole soundtrack if there was someway to play both the accidentals and the white keys. :0\n\n*Taking requests, btw*. I know a lot of video game soundtracks on piano.\n\n\n\n\n", "gilded": 0, "created_utc": "1256567878", "subreddit": "AskReddit", "score": 9, "controversiality": 0}
{"body": "Bonus: (portal theme)\n\nH h g g h\n\nH H h g g h D g P\n\nP g h H g d D g P P h", "gilded": 0, "created_utc": "1256573178", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "I'm still working on it, but this is what I got so far.\n\nKjz ljf KjzXxzkXj f Kjz ljf dfd gfdfd a p    \ndfK Khj kXz k h jkj jKH K H kjd jKH K H kXz    \nz X k j K  \nz X k X VV  \nz X k j f fKhKfd h k (repeat)  \n \nIt seems a little off, but it sounds mostly right.", "gilded": 0, "created_utc": "1256589414", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "**600 A.D Theme**\n\nd f gfspd ds p iop o ui ps fg fs\n\n**Peaceful Days**\n\nw u iuyt o yy\n\nw u iuyt o pas apo uop oi u y trt uy e tt r\n\no p opo yi i u y (shift+)a  y u i u y t y t\n\n**Gato's Song**\n\ny tety t y uytet tyt ewe wetyuyty\n\n**The Brink of Time (chords)**\n\nqwey 0weu\nqwey 0weu\n(the last chord is a Bmajor, but yet again, you can't hit the black keys on this keyboard)\n\n\n\n", "gilded": 0, "created_utc": "1256592424", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "r u D o r D y\n\nryup a a pFu\n\nr u D o r D y\n\nryup a a pFu\n\nuDo p a ss dd dsa\n\n...\\*fires up the SNES\\* :D", "gilded": 0, "created_utc": "1256592458", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "B b b B B B**BOOOYYAAHH!!!**  GO Back to your IGLOOS **BiTChES**!\n\nAmerica **=====@**  Eskimo Village Iceland in the  **(0)**!\n\nOMG You dogs god OWNED!  No.  You got PwND!!!!!!!!! by America's greatness.    lol @ poor wittle snow diggers ", "gilded": 0, "created_utc": "1256600547", "subreddit": "reddit.com", "score": -3, "controversiality": 0}
{"body": "fds dfgh jkl k j h\njkl k j h j k l h g f", "gilded": 0, "created_utc": "1256601786", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "m y  i m m u n e  s y s t e m  w i l l  n e v e r  b e  n o r m a l", "gilded": 0, "created_utc": "1256658909", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "I'll spell it out for you, Linux, that's L I N U X (or BSD/Solaris)\r\nYou can't really protect a Windows system that well, plus there's really no protection against viruses, antiviruses only work for known viruses, for new viruses, or crypted ones, they are not much use.\r\n\r\nI don't know software you use, but for a small business of 10-20 I'm pretty sure you're gonna find really neat linux alternatives.\r\nBest of all, it's free. But if you want you can buy support from Canonical, Redhat, or other big companies. It'll still be many times cheaper than buying tens of windows licences. On top of that, you can sleep well nights, not having to worry that some secretary downloaded a new version of Solitaire that has a big surprise for you in it.\r\n\r\nLinux today is really easy to use, and works out of the box. It comes an Office suite built in, and allmost any other programs you need. So you don't need to search around for stuff and install it on each computer.\r\n\r\nI'd still recommend you use Linux even if you need some all-important windows apps, run XP in virtual machine, but don't let the VM have internet.\r\n", "gilded": 0, "created_utc": "1256686053", "subreddit": "ComputerSecurity", "score": 0, "controversiality": 0}
{"body": "Another, cause i'm bored and Halloween is upon us:\n\ny u i  \ny u i u y u i o\n\nbasic saw theme", "gilded": 0, "created_utc": "1256703333", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I call B U L L S H I T !", "gilded": 0, "created_utc": "1256725984", "subreddit": "IAmA", "score": 30, "controversiality": 0}
{"body": "Welcome to ---------------- h t t p : / / w w w . n o b l e s h o p p i n g . c o m -----We are specialized in offering all kinds of top brand shoes, jeans, t-shirts, bikini, swimwear, jacket, jerseys, watches, purses, handbags, belts, wallets , sunglasses and hats etc. Accept paypal ,All the prices list on our website include shipping cost,insurance,tax etc.. $30 nike shoes,air jordan shoes,nike shox shoes,gucci shoes $33 true religion jeans, ed hardy jeans,coogi jeans,affliction jeans, Laguna Beach Jeans $16 ed hardy T-shirts,Coogi T-shirts,Christian Audigier T-shirts,Gucci T-shirts,Polo T-shirts. $30 coach handbag,gucci handbag,prada handbag,chanel handbag, $18 sunglasses,$18 caps. \r\n", "gilded": 0, "created_utc": "1256779129", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "A few weeks ago I was at a school ( I'm a school photographer) and was set up in the library. Several times I heard the librarian announce over the intercom that students needing to have their picture taken to \"come to the  l i b a r y \". I died a little inside.", "gilded": 0, "created_utc": "1256792403", "subreddit": "WTF", "score": 13, "controversiality": 0}
{"body": "Learning about something by googling only works for a limited set of questions. \n\ne.g. I stated learning guitar so I could play a certain tune. Much later, I found out I would have saved myself days of painful searching if I had asked \"How do I play A F C G chords\" (note, this was before tabs were freely available online) . However, I had no clue what chords were much less what form the question would even take.", "gilded": 0, "created_utc": "1256808090", "subreddit": "programming", "score": 3, "controversiality": 0}
{"body": "u r z n m e", "gilded": 0, "created_utc": "1256840217", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "$10 phone bill? Superb idea but perhaps divorced from current reality. Two overseas phone calls totalling 19 mins cost me $94.50 (!!!) from our new local phone company (who will remain nameless but I'm lookin at you, F A I R P O I N T) ... because I just assumed their rates had to be competitive, it's the new telcom age, right?\n\nEdit: they did end up giving me a 30% discount, but not until I did some serious bitchin.\n", "gilded": 0, "created_utc": "1256842648", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "y u c u r a n00b", "gilded": 0, "created_utc": "1256867553", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Old MacDonald had a farm E I E I O\nand on that farm he had an ugly duckling that was sent to him using the FarmVille application by your grandmother who you never talk to...\nE I E I O \n", "gilded": 0, "created_utc": "1256894645", "subreddit": "gaming", "score": 18, "controversiality": 0}
{"body": "This was all I saw when I got to the bottom. \n\n                    (\"`-''-/\").___..--''\"`-._\n                     `6_ 6  )   `-.  (     ).`-.__.`)\n                     (_Y_.)'  ._   )  `._ `. ``-..-'\n                    _..`--'_..-_/ /--'_.' ,'\n                   ((('   (((-(((''  ((((\n                 K R I S T E N' S    C O L L E C T I O N\n\t\t_________________________________________\n", "gilded": 0, "created_utc": "1256913469", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "[The Reddit alien behind a stack of books that read R E D D I T](http://imgur.com/5mDRD). This is a couple ideas combined.", "gilded": 0, "created_utc": "1256933150", "subreddit": "books", "score": 5, "controversiality": 0}
{"body": "Everyone uses Questhelper.\n\nE V E R Y O N E", "gilded": 0, "created_utc": "1256941635", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "A B C D E F R G Q K C R F C", "gilded": 0, "created_utc": "1256950674", "subreddit": "offbeat", "score": -5, "controversiality": 0}
{"body": "Let's format this 3.5\" disk...\n\n    C:\\&gt; a:\n    A:\\&gt; format C:\n    Are you sure? [y/N] y\n\nD'OH!\n\nI need an empty /dev/hda5. Will I use `mke2fs` or just `rm -rfv /`?\nLet's do `rm`....\n\nGo get coffee. Three minutes later, still not done. Look at output\n\n    deleted /mnt/win/Windows/calc.exe\n    deleted /mnt/win/Windows/...\n\nMe: CTRL+C C C C C C C ... too late\n", "gilded": 0, "created_utc": "1257001388", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "F u c k  s c i e n t o l o g y", "gilded": 0, "created_utc": "1257003871", "subreddit": "AskReddit", "score": 130, "controversiality": 0}
{"body": "N N N N N N...... Nike wearers? *ducks*", "gilded": 0, "created_utc": "1257026567", "subreddit": "Frugal", "score": 0, "controversiality": 0}
