{"body": "H A P P Y  N E W  Y E A R ! ! ! ! ", "gilded": 0, "created_utc": "1262322219", "subreddit": "reddit.com", "score": 19, "controversiality": 0}
{"body": "&lt;pre&gt; w h a t G   i ves you t   I dea   &lt;/pre&gt;", "gilded": 0, "created_utc": "1262355542", "subreddit": "AskReddit", "score": -6, "controversiality": 0}
{"body": "Agreed ! :-) N o   B a b i e s ", "gilded": 0, "created_utc": "1262384335", "subreddit": "offbeat", "score": -3, "controversiality": 0}
{"body": "that kid is f u c k e d", "gilded": 0, "created_utc": "1262386804", "subreddit": "WTF", "score": 0, "controversiality": 0}
{"body": "Integrated DVD playerFeaturesSize22 HDTV readyYes Colour of productBlack Connection to PCPC input USB input Display resolution1366 x 768 pixelsContrast Ratio800:1 Display brightness400 cd/m2Response time5 msDimensions W x D x H575 x 191 x 464 mmWarranty1 Year", "gilded": 0, "created_utc": "1262441703", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "B o o H o o", "gilded": 0, "created_utc": "1262443633", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Tort reform is B U L L S H I T\n\nthanks for trying Karl Rove", "gilded": 0, "created_utc": "1262499529", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "[**A B S O L U T E L Y**](http://www.ratical.com/renewables/TherapHoil.html) One of the most whole foods on the planet, and it can grow in almost every climate... ", "gilded": 0, "created_utc": "1262573146", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "B B B B B B B B B BOO BOO BB B B BOOOM BOO B BOOOMER!", "gilded": 0, "created_utc": "1262577090", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Think 'so what' by pink.  Gaga ooooh lala p p p p p p p pokerface my my my p p p p p p p pokerface are not good song lyrics.  They are annoying as hell and I wake up to them thanks to them being played non-stop on the radio.", "gilded": 0, "created_utc": "1262620379", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "&lt;whispering in your ear&gt;*it's M A N I A C dude. One who is experiencing mania.*&lt;/whispering in your ear&gt;", "gilded": 0, "created_utc": "1262637733", "subreddit": "pics", "score": 10, "controversiality": 0}
{"body": "w w s s a d a d ctrl alt space enter", "gilded": 0, "created_utc": "1262640242", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "* Install GNU Solfege and use it a bit. Make sure you spend some time in the dictation section. This will just teach you the basics and lay the groundwork for the rest.\n\n* Practice singing/humming/whistling notes in the pentatonic scale (it's easiest to start with) (C D E G A is a pentatonic scale).  Try making up melodies and just go with it, but be aware of what notes your singing (relative to whatever pitch). Try making melodies that start and end on different notes. Pay attention to how the notes feel and you'll start to notice qualities of the notes that you might not have before. You'll start to feel chord progressions in those qualities too. When you hear music, you will notice those qualities. I do not think it is possible to do this too much.\n\n* This is the hardest part. Listen to music you like over and over again until you can remember how it sounds very well. Then attempt to write down on paper what the melodies, bass lines, and chord progressions are in whatever notation system you want. It doesn't matter. Then play it back on guitar to see if you got it right. You'll probably never be able to know what key the song is in without playing along with a recording (that's an extremely rare gift), but you should be able to figure out what the notes are relative to a key with enough practice. Ideally, the melody, bass line, and chord progressions will all be wrong in the exact same way (for example, the song is be in the key E, but you wrote it down in C, so everything should be a major 3rd higher). This allows you to study music you like, which will help you see the possibilities for your own music.\n\n* When a melody pops in your head, write it down and/or play it on an instrument.\n\n* You should learn to play every instrument you're interested in playing. It's also good to play along with music you like and improvise.\n\nThat should help you understand the music you hear better, give you more control over your musical imagination, and help you move whatever in your head to instruments.", "gilded": 0, "created_utc": "1262643373", "subreddit": "WeAreTheMusicMakers", "score": 1, "controversiality": 0}
{"body": "Typically the 14 lines of the sonnet have a substructure\n\n8 lines\n\n4 lines\n\n2 lines\n\nwhich is a division by 2\n\nThe point here is that the poem is divided into two sections by the two differing rhyme groups. In accordance with the principle (which supposedly applies to all rhymed poetry but often doesn't), a change from one rhyme group to another signifies a change in subject matter. This change occurs at the beginning of L9 in the Italian sonnet and is called the *volta*, or \"turn\"; the turn is an essential element of the sonnet form, perhaps the essential element. It is at the volta that the second idea is introduced \n\nsee\n\nhttp://www.sonnets.org/basicforms.htm\n\n&gt;There are, of course, some sonnets that don't fit any clear recognizable pattern but still certainly function as sonnets. Shelley's \"Ozymandias\" belongs to this category. It's rhyming pattern of *a b a b a c d c e d e f e f* is unique; clearly, however, there is a volta in L9 exactly as in an Italian sonnet:\n\n    \"Ozymandias\"\n\n    I met a traveller from an antique land\n    Who said: Two vast and trunkless legs of stone\n    Stand in the desert . . . Near them, on the sand,\n    Half sunk, a shattered visage lies, whose frown,\n    And wrinkled lip, and sneer of cold command\n    Tell that its sculptor well those passions read\n    Which yet survive, (stamped on these lifeless things,)\n    The hand that mocked them and the heart that fed:\n    \n    And on the pedestal these words appear:\n    \"My name is Ozymandias, king of kings:\n    Look on my works, ye Mighty, and despair!\"\n    Nothing beside remains. Round the decay\n    Of that colossal wreck, boundless and bare\n    The lone and level sands stretch far away.\n", "gilded": 0, "created_utc": "1262664941", "subreddit": "writing", "score": 1, "controversiality": 0}
{"body": "well yeah, that's what I figured.  I dunno, I think I usually just delete and rewrite.  \n\nHowever, for posts with a paragraph of text, I can see that being useful.\n\nwhat's this t l d r thing do?", "gilded": 0, "created_utc": "1262683260", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Prison is not a country club son, **you aren't supposed to want to be there.** A prisoner is not to be catered to. He's to be imprisoned and punished. I think you may have a misguided idea that prison is supposed to rehabilitate you through deep tissue massage and spa combined with a personal chef and tutor so you can become a better man by the time you get out?\n\n***N I G G E R      P L E A S E***", "gilded": 0, "created_utc": "1262702044", "subreddit": "politics", "score": -11, "controversiality": 0}
{"body": "Oh look it's a dumb fucking nigger that has not done his research on any topic.\n\n[Crushing your jaw would be an improvement in your conversation abilities.](http://www.reddit.com/r/AskReddit/comments/als1i/i_got_my_son_16_his_1st_redditor_account_it_seems/c0i8ttz)\n\nand you stupid fucking goddamn nigger- go look up what a vault copy of a birth certificate is. Then review the testimony of the state of hawaii and you will learn something **YOU STUPID FUCKING NIGGER**. \n\n***There is a vault copy, it has not been released.*** \n\n**Certificate of live birth*** is NOT **A VAULT COPY.**\n\nConfirmed, documented. The legal case was thrown out for *jurisdiction* not because of lack of complaint.\n\n**S T U P I D     F U C K I N G      N I G G E R**\n\nand just in case you were wondering if McCain produced a **vault copy** HE DID.", "gilded": 0, "created_utc": "1262707292", "subreddit": "AskReddit", "score": -6, "controversiality": 0}
{"body": "I'm not realmacuser (thank god, the guy is the one that gives mac users a bad name), but here's why zoom works like it does in OS X.\n\nIt's more efficient that way. You almost never need a true maximize, and it slows things down to use a full max. Especially on a 17\" or bigger screen, if you are maximizing windows, you waste a lot of screen real estate. My wife often has a browser open that looks like this:\n\n[ w h i t e s p a c e ] browser content [ w h i t e s p a c e ]\n\nShe could use the zoom function instead, and have something like\n\n[browser content][email window][im window][music]\n\nJust being able to see the window is generally easier. The \"maximize\" button is a holdover from small, low res screens where it made sense to max the window and alt-tab around. That's not really the case anymore. Even on my 13\" macbook, I don't use windows that way because it's more efficient to see other things, and have them readily accessible without hunting for the window.\n\nAlso, there is a different paradigm on OS X. The program is not the window. The window on OS X is meant to be a document within the program. Explaining this well could take pages though.\n\nThis is something that I see crop up on OS X from time to time. They don't do things just because \"that's the way we've always done it\". Because of this, switchers are often annoyed because they are used to doing something on windows and it doesn't work that way on OS X. I had to google how to install apps when I first switched because I had gotten used to downloading an exe, double clicking, slamming next 8 times, and be done. Couldn't believe you just drag the app to the app folder.", "gilded": 0, "created_utc": "1262715814", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "[**M U S I C A L  C H A I R S**](http://www.reddit.com/r/AskReddit/comments/alwyy/who_feels_like_life_is_turning_into_a_real_life/)\n\nNo this game is not fun anymore...", "gilded": 0, "created_utc": "1262727046", "subreddit": "collapse", "score": 1, "controversiality": 0}
{"body": "R E G I O N.", "gilded": 0, "created_utc": "1262734938", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Just wait until we're in a Police State. Then they will be e v e r y w h e r e. ", "gilded": 0, "created_utc": "1262739571", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "L R A B B A\n\nD R B B L\n\nOk. I'm ready.", "gilded": 0, "created_utc": "1262749544", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "Mmm, but the build quality of the 20D and 5D is s l i g h t l y different than the entry model 1000D which has a plastic housing. I'm just guessing here but can the shutter mechanics be affected in very cold temperatures?", "gilded": 0, "created_utc": "1262780258", "subreddit": "photography", "score": 2, "controversiality": 0}
{"body": "I got,\n\n12521: r e d d i t\n\nbut I cheated with bash.", "gilded": 0, "created_utc": "1262780720", "subreddit": "math", "score": 1, "controversiality": 0}
{"body": "My friend people will disagree with you but you are right.\n\nYou could have skipped all of the gumpf and just posted this:\n\n&gt;[ w h i t e s p a c e ] browser content [ w h i t e s p a c e ]", "gilded": 0, "created_utc": "1262782188", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "so i did this assuming the following based on the original explanation:\n\nmax length: 6\nletters available: r, e, d, d, i, t =&gt; r, e, d, i, t\nany permutations, and any number of repetitions of the individual letters, e.g. 'd d d d r e' would be a valid entry, as would 'i t'.\n\nif that is acceptable then im pretty sure it is correct.  if not could you clarify which of those assumptions is incorrect?", "gilded": 0, "created_utc": "1262792994", "subreddit": "math", "score": 1, "controversiality": 0}
{"body": "[i m a f o o l f o r d e p e c h e m o d e](http://www.youtube.com/watch?v=xops0E-ThDA&amp;feature=related)", "gilded": 0, "created_utc": "1262794347", "subreddit": "Music", "score": 5, "controversiality": 0}
{"body": "A R R E S T E D     D E V E L O P M E N T", "gilded": 0, "created_utc": "1262806908", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "B e f o r e.  I'm not sure why we need to go back over a hundred years for it to be considered better.  Yes greedy people have been manipulating the rest of us to our detriment since the first pimp monopolized all of the cave-bitches millions of years ago.  Had we never left the caves yet somehow made civil progress while staving off our very nature as competitive biological entities the world would be better, happy?", "gilded": 0, "created_utc": "1262822010", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "&gt;But it really isn't so funny. It shows you that modern Conservatives can't ever appeal to group big enough to let them achieve any more than temporary power. They are not even interested in venturing out of their own echo chamber. They therefore must, by default, force themselves on the majority. They preach a good line about small government, which works when they're not in government. But the moment they are, their social ideology is so unpalatable by the majority, they must grow incrementally dictatorial if they are ever to survive long enough to implement substantive policy changes. They simply cannot win an honest election because they cannot relate to the majority. Especially now.\n\nThis is why the Harpercons only speak to their base, and why they only speak to the US equivelent of their base. It is also why they don't even attempt to conform to parliamentary norms and procedures, because if they did, they would not survive. Twice now, we've had situations where their hold on power was threatened through proper functioning of parliament, and twice now, they've shut it down. Whatever majority they got in a fair election would be slim and tenuous. To keep power, they would have to completely subvert the spirit of free elections and democracy. They would h a v e t o invoke measures like defunding the opposition, gerrymandering ridings, or much worse. Or their own policy reforms would destroy them.|\n\nhttp://thegallopingbeaver.blogspot.com/2010/01/default-dicatorships.html\n", "gilded": 0, "created_utc": "1262836801", "subreddit": "canada", "score": 2, "controversiality": 0}
{"body": "My favorite is the lady who confided in me she was seriously concerned about the people living in her computer, \"trying to steal her Microsoft Office.\"  She said they even had pictures that they showed of themselves to her and tried to speak with her when she was working on documents or spreadsheets.  \n\nI had a hunch and started image googling \"Microsoft Office\" and \"Microsoft Access\" while we were talking.  She freaked out and pointed at the screen and look legitimately scared and said, \"oh my god! you have them too!\"  I then had to explain to her that those were simply icons that come with the software and that there was nothing wrong with her machine.  She was seriously afraid of the little paper clip man.\n\nA m a z i n g.", "gilded": 0, "created_utc": "1262838149", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "***S L A T E S ! ! !   S L A T E S ! ! !   S L A A A A T E S! ! !***", "gilded": 0, "created_utc": "1262861356", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "[Motorboatin' son of a bitch.](http://www.movieline.com/2009/04/losts-henry-ian-cusick-sued-for-meticulously-described-motorboating.php)\n\nIt'd be a shame if they wrote him out because of this - not that I'm condoning what he allegedly did. Just that I'd hate to see him out of the show. Though L O S T does have a history of taking criminal charges very seriously (Ana Lucia, Libby, etc.).", "gilded": 0, "created_utc": "1262881549", "subreddit": "lost", "score": 6, "controversiality": 0}
{"body": "My SO does this.  My mom can't seem to double click fast enough to make an actual double click when it's necessary, so that takes f o r e v e r.", "gilded": 0, "created_utc": "1262892682", "subreddit": "DoesAnybodyElse", "score": 1, "controversiality": 0}
{"body": "Oh look it's a dumb fucking nigger that has not done his research on any topic.\n\n[Crushing your jaw would be an improvement in your conversation abilities.](http://www.reddit.com/r/AskReddit/comments/als1i/i_got_my_son_16_his_1st_redditor_account_it_seems/c0i8ttz)\n\nand you stupid fucking goddamn nigger- go look up what a vault copy of a birth certificate is. Then review the testimony of the state of hawaii and you will learn something **YOU STUPID FUCKING NIGGER**. \n\n***There is a vault copy, it has not been released.*** \n\n**Certificate of live birth*** is NOT **A VAULT COPY.**\n\nConfirmed, documented. The legal case was thrown out for *jurisdiction* not because of lack of complaint.\n\n**S T U P I D     F U C K I N G      N I G G E R**\n\nand just in case you were wondering if McCain produced a **vault copy** HE DID.", "gilded": 0, "created_utc": "1262942462", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "I think you mean,\n\n    H A P P Y  B I R T H D A Y...\n\n(*ducks and runs*)", "gilded": 0, "created_utc": "1262944888", "subreddit": "science", "score": 22, "controversiality": 0}
{"body": "    H A H A H A H A H A", "gilded": 0, "created_utc": "1262971887", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "F I G G A R R O,,, (repeat in your head as necessary)", "gilded": 0, "created_utc": "1262999186", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "No, they're in the process of making another album. \n\nEdit: Oops, wrong answer (most likely). When originally making this comment I failed to realize you were speaking of b e u l a h.  ", "gilded": 0, "created_utc": "1263009803", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Z a c h    G a l i f i a n a k i s\n\nI know it's a bitch to spell but the man is amazing, show him respect spell his name right.\n", "gilded": 0, "created_utc": "1263010916", "subreddit": "Music", "score": 3, "controversiality": 0}
{"body": "D A R Y\n\n... Unfortunately I could not affix a picture reading L E G E N ", "gilded": 0, "created_utc": "1263038685", "subreddit": "pics", "score": 43, "controversiality": 0}
{"body": ".. C A M O  C A M O  C A M O  C A M O  C H A M E L E O N\n\n..because 'karma' would be too obvious, right?", "gilded": 0, "created_utc": "1263040874", "subreddit": "pics", "score": 116, "controversiality": 0}
{"body": "© [**buddydvd**](http://www.reddit.com/r/pics/comments/anic0/u_f_l_a_g_e/c0ih7gi)\n\nIn response to: [C A M O U F L A G E](http://www.reddit.com/r/pics/comments/anic0/u_f_l_a_g_e/)", "gilded": 0, "created_utc": "1263042002", "subreddit": "pics", "score": 24, "controversiality": 0}
{"body": "[L E G E N D A R Y](http://www.reddit.com/r/pics/comments/anirr/n_d_a_r_y/)\n\n[*S T O L E N   F R O M   H E R E*](http://www.reddit.com/r/pics/comments/anic0/u_f_l_a_g_e/c0ih7c7)", "gilded": 0, "created_utc": "1263042454", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "Y O U C U M A N D [G O](http://www.youtube.com/watch?v=4ZeowfcCNnI)\n\n    \n    NUDGE NUDGE WINK WINK", "gilded": 0, "created_utc": "1263042839", "subreddit": "pics", "score": 26, "controversiality": 0}
{"body": "[Y O U ' V E    D I S C O V E R E D    S O M E T H I N G    A M A Z I N G !](http://www.reddit.com/r/pics/comments/anic0/u_f_l_a_g_e/c0iheg6)", "gilded": 0, "created_utc": "1263054052", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "U F L A G E is now a meme. ", "gilded": 0, "created_utc": "1263056296", "subreddit": "pics", "score": -8, "controversiality": 0}
{"body": "thats really awesome! first i dont understand what is it ..but when i am selecting the text is only select U F L A G E then i know about what the great work has been done..", "gilded": 0, "created_utc": "1263060059", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "How much do you make?\nShit. I make $15.00 an hour. it's not quite as bad as it sounds as overtime bumps that up on 24hr shifts. But I do contract programming and web development on the side to make better money. (That was what I did before I got in to medicine)\n\nDo you get immunity from any and all non-serious traffic violations?\nGood question, and it all depends on the department pulling you over. If I get pulled over in my district by city PD, absolutely. (in fact I have a small identifying sticker on my back window and I have had cops turn on their lights, notice the sticker, kill the lights and drive off)\n\nHighway patrol, not a chance. They give tickets to their own. Bastards.\n\nAnd other cities are hit or miss, just depends. If you are in uniform though, you most likely aren't getting a ticket.\n\nHow do shifts work?\nI work what 's called a kelly schedule, which looks like this:\nA O A O A O A O O O O O O A O A O A O A O O O O\nWith A representing being on duty, and O being off duty. The pattern  just repeats like this. It comes out to about 11 24hour shifts a month, with a \"six day\" ( six days off in a row) and a \"four day\" (four days off in a row.\n\nIf you google Kelly Schedule, you can see a better representation.", "gilded": 0, "created_utc": "1263069644", "subreddit": "IAmA", "score": 15, "controversiality": 0}
{"body": "Pssh, mainlining L O S T is many a man's coping mechanism.", "gilded": 0, "created_utc": "1263073058", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Alert! I had the displeasure of a bladder infection after viewing of The Matrix this way. I was *h o l d i n g*  it the last hour and a half. I had evac'ed the bladder before the movie of course, but it was long. Like Avatar. Ran to the bathroom, all was well.               \n3 days later, it felt like a bowling ball dropped on my business.", "gilded": 0, "created_utc": "1263093534", "subreddit": "Drugs", "score": 1, "controversiality": 0}
{"body": "**S H O W G I R L S**", "gilded": 0, "created_utc": "1263099201", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Anyone else notice that the submission technically ought to be \"U F L A G E\" instead of camouflage?", "gilded": 0, "created_utc": "1263114332", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "N a G G E R, you idiots", "gilded": 0, "created_utc": "1263117951", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "C A M O U F L A G E", "gilded": 0, "created_utc": "1263120679", "subreddit": "circlejerk", "score": 2, "controversiality": 0}
{"body": "It had to be done purposely. If it was a bot, it would read \"U F L A G E\"", "gilded": 0, "created_utc": "1263122146", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "People who annoy you\n\n    _ I G G E R S", "gilded": 0, "created_utc": "1263124468", "subreddit": "WTF", "score": 79, "controversiality": 0}
{"body": "LoL I'm retarded I still don't get it. :-( when I click that w/ the thumbnails on, it still doesn't make any sense.  The letters C A M O are in blue, and that ascii look of disapproval beneath it. :-(", "gilded": 0, "created_utc": "1263135222", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "before one clicks on it, the entire word is in blue\r\n\r\nC A M O U F L A G E\r\n\r\nthen after clicking, the link title changes colour so it doesn't work any more, i was lucky enough to see it, and it's clever :)", "gilded": 0, "created_utc": "1263137911", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Sprint car, Midget, Indycar, NASCAR, F1, Karting, Rally, Road racing, A1GP, Hill Climb, Drag Racing, Legend \n { A   C o l  l a b o r a t i v e    S i t e    F o r    A u t o   R a c i n g }                                                            Create your racer page  -  expand your presence  -  stay connected      \n\nRacertube is a new site to help racers stay connected.  You can add your content to promote your race team's success.  Create your free racer page a racertube.com  ", "gilded": 0, "created_utc": "1263168292", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Spelled M E R C E N A R I E S", "gilded": 0, "created_utc": "1263169009", "subreddit": "worldnews", "score": 3, "controversiality": 0}
{"body": "do it.\n\n**B O Z A R K I N G**", "gilded": 0, "created_utc": "1263189171", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "From this angle, it looks as if his dicktowel showed the real thing. [s a r c a s m s].", "gilded": 0, "created_utc": "1263195607", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Damn... I thought it was N o G G E R...", "gilded": 0, "created_utc": "1263205865", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "if christ really did love you, he would have sent you a sign. quick! go make some toast! that seems to his method du jour. if you see the letters T R A J A N, then there IS no god.", "gilded": 0, "created_utc": "1263206739", "subreddit": "web_design", "score": 0, "controversiality": 0}
{"body": "I think the proper expression is:\n\nQ U I C K S A N D ! ! ! \n\nIn this case it's:\n\nM U C K ! ! !", "gilded": 0, "created_utc": "1263218113", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Right, I think that's what Pentax uses. I think that Nikon and Canon use A S M P for the \"advanced\" modes. [Here's how Nikon's mode selection button looks like](http://a.img-dpreview.com/reviews/NikonD3000/images/D3000_hand2.jpg) on a D3000.", "gilded": 0, "created_utc": "1263219363", "subreddit": "photography", "score": 2, "controversiality": 0}
{"body": "He's also taking into account what chord is sounding which is important.  Ie he usually lands on a \"G\" note when she switches to G and likewise for D, frequently with a run of lead up notes.  Very common thing for rhythm and bass but works for leads too. \n\nIf you can record a G/D progression and play around with a G major scale over it looping, you'll quickly realize that some notes sound better than others.  Don't be afraid to go outside the key, the flattened (or minor) 3rd adds nice flavor and the flatten 7th over the D chord (ie a \"C\" note) will sound interesting.\n\nAlso a good weapon is the pentatonic scale which takes out two notes from the major scale.   The G major pentatonic has just the  G A B D E (no 4 or 7) and those notes will pretty much all sound good with a I V progression.", "gilded": 0, "created_utc": "1263233630", "subreddit": "Guitar", "score": 3, "controversiality": 0}
{"body": "ORANGE!\n\nEat and orange or a clementine and save the peel while eating half the fruit now, and saving the rest for your next crash. \n\nSQUEEZE, or rather pinch the peel so that the oils and juices are released into the air. The combination of the taste and the essence in the air is  E N E R G I Z I N G!\n\nIf you can hop on a treadmill, then 15 to 20 minutes of intervals or a moderate pace will serve you well too.\n\nEat the second half of the orange after the run...", "gilded": 0, "created_utc": "1263317183", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "T H A T ' S\n\nE N O U G H\n\nJ A Y\n\nL E N O !", "gilded": 0, "created_utc": "1263353562", "subreddit": "reddit.com", "score": 5, "controversiality": 0}
{"body": "Ctrl+F ... p o r t a l\n\n...\n\nPORTAL", "gilded": 0, "created_utc": "1263358365", "subreddit": "gaming", "score": 10, "controversiality": 0}
{"body": "You are g g g g g g... foolish!\n\nWatch it with the commentary, it's awesome.", "gilded": 0, "created_utc": "1263365791", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "A M A Z I N G", "gilded": 0, "created_utc": "1263375676", "subreddit": "gonewild", "score": 1, "controversiality": 0}
{"body": "It is confusing. Especially [the Wikipedia article](http://en.wikipedia.org/wiki/Meter_%28music%29), which seems like a complete nightmare unless you have a basic grasp of what's it's on about already.\n\nTo the best of my understanding, it has to do with how bars can broken up into sections based on which beats are stressed.\n\nGenerally, each bar is divided into several sections (usually 2 or 3, called 'duple' or 'triple' meter respectively), with the first beat in each section being strong and the others being weak. In simple meter, the number of beats in each section is just one or two. If there are three beats in each section, it's said to be in compound meter instead.\n\nExamples of simple time:\n\n    2/4: S S (2 parts with 1 beat each)\n    3/4: S S S (3 parts with 1 beat each)\n    4/4: S w S w (2 parts with 2 beats each)\n\nExamples of compound time:\n\n    6/8: S w w S w w (2 parts with 3 beats each)\n    9/8: S w w S w w S w w (3 parts with 3 beats each)", "gilded": 0, "created_utc": "1263393235", "subreddit": "WeAreTheMusicMakers", "score": 3, "controversiality": 0}
{"body": "Jimmy Kimmel and Hulu sittin in a tree, k i s s i n g", "gilded": 0, "created_utc": "1263400874", "subreddit": "videos", "score": 6, "controversiality": 0}
{"body": "Actually, it's more like A B C D E F and G transformed to A B C D E F and G plus O. The question is, is it OK to be eating O?", "gilded": 0, "created_utc": "1263414414", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "      G O O G L E\n\nNow Serving Ballsiness ", "gilded": 0, "created_utc": "1263416819", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "    U R N X\n    U R N X, N I, I M N X\n    I C T V\n    I C T V, N I C U\n    I C U, I C U, N U R O K\n    U R N X\n    U R N X, N I, I W\n    I C A T V, I C A D V D, N I C U\n    I C U, I C U, N U R O K\n    I C U, I C U, N U R O K\n\nedit: there's little love for TMBG :(", "gilded": 0, "created_utc": "1263419625", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "    w i t h  s p a c e s.", "gilded": 0, "created_utc": "1263455599", "subreddit": "tf2au", "score": 1, "controversiality": 0}
{"body": "`i    h a v e    b e e n    s h o w n    w h o    i s    b o s s`", "gilded": 0, "created_utc": "1263456329", "subreddit": "tf2au", "score": 2, "controversiality": 0}
{"body": "T H U N D E R B O L T  A I R P L A N E", "gilded": 0, "created_utc": "1263489154", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "great comment.\n\nummm...  **G R E A T  C O M M E N T**  :-)", "gilded": 0, "created_utc": "1263491690", "subreddit": "programming", "score": -1, "controversiality": 0}
{"body": "W H O O S H", "gilded": 0, "created_utc": "1263497362", "subreddit": "AskReddit", "score": -3, "controversiality": 0}
{"body": "[R E A D A B O OK](http://www.youtube.com/watch?v=GlKL_EpnSp8)", "gilded": 0, "created_utc": "1263515050", "subreddit": "AskReddit", "score": 8, "controversiality": 0}
{"body": "Try Cyberfret. Otherwise just grab a guitar, look up some chords, memorize the A C D E F and G major/minor chords, and fuck around. I'm aware that I skipped B, but honestly I never really use it and it's the hardest one to finger :P\n\nOnce you've got the chords down, you can try some more complicated chords and some lead. But start with the easy chords.", "gilded": 0, "created_utc": "1263515944", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "Why justified text fails: \"B E V M C C L E N D O N C L E A R L Y\"", "gilded": 0, "created_utc": "1263577464", "subreddit": "reddit.com", "score": 13, "controversiality": 0}
{"body": "Bottom left to upper right to upper left to bottom right A B A B select start!", "gilded": 0, "created_utc": "1263586117", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "&gt;B E V M C C L E N D O N C L E A R L Y...\n\nBEVMCCLWTF IS GOING ON.\n\n*10 seconds later*\n\n&gt;Bev McClendon clearly...\n\nOh. *In any case*, awards should be based exclusively on merit, completely blind to race, gender, etc. If there is an underlying problem which disadvantages one group, that problem should be addressed directly - however, under no circumstances should one group receive a \"handicap\" because of their disadvantage. Equality of opportunity, **not** equality of outcome.", "gilded": 0, "created_utc": "1263611203", "subreddit": "Equality", "score": 8, "controversiality": 0}
{"body": "So now you want a divorce/ a D I V O R C E ?", "gilded": 0, "created_utc": "1263611354", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "fuck fuck fuck Fuck Fuck FUCK FUCK FUCK F U C K !!!\n\nI'm in Canada and it drives me batshit insane to see \n\n\"In Canada, Comedy Central videos are available on The Comedy Network\".\n\n... with NO DIRECT LINK TO THE VIDEO!   \n\nCan't they automate that message to link to the relevant video?  Like I'm going to go to the Comedy Network site &amp; sift through thousands of videos looking for the right one.  \n\nok...I'll calm down now.", "gilded": 0, "created_utc": "1263614375", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Ok, i will speak slowly for you\n\nD o n ' t   d r u g  t h e  b e e r !\n\nA n d m a k e o u t  w i t h h e r k i s s i n g a n d s e e w h e r e i t g o  e s !", "gilded": 0, "created_utc": "1263631387", "subreddit": "relationship_advice", "score": 1, "controversiality": 0}
{"body": "[Apparently](http://www.havenworks.com/language/morse-code/) I wrote:\n\n&gt;&gt;I H D Z S I I I Y X U\n\nSo, watch yourself.", "gilded": 0, "created_utc": "1263677848", "subreddit": "Anarchism", "score": 1, "controversiality": 0}
{"body": "In August 2000 at Burning Man, I paused at camp a few blocks away from Center Camp to bounce on a trampoline.  There are a few places there where the road on both sides is only about 50 yards away from each other.  After getting throughly bouncy, the little group got tired and someone from that camp pulls out from somewhere a bong.  We pass it around a few times and then I and one other guy see a sheriff's K9 SUV creep by on the outer road away from the esplanade...   We're a little edged about that and start to tell the guy who brought it out and he's, ' aww, he was to far away to see and he'll keep on going.\"   Yep, 4 minutes later the K9 and ANOTHER  cop comes back our way on the inside road...  both me and the guy who had seen it had turned our heads to the exact spot they were appearing from only about 120 feet away and tell the dude that owned the bong ( who very luckily had the bong just come to him ) and he tips it between his legs almost under his crotch...  \nBIG COLLECTIVE SILENCE as the two cars S L O W L Y roll by...  I'm thinking and feeling as much calm and relaxation into everybody there, the cops and myself as I can.  They roll by and we feel like everything's good.. and the rear car stops 50 feet beyond us and a tall skinny cop gets out and starts walking towards us.  I feel everybody start to freak out inside themselves and hear inside my self a countdown from three to one...  as my inner 'voice' goes to zero, the cop's gaze (which had surveyed everyone there swung right to me and I, as completely nonchalantly as I've ever seen or felt anyone ever be, smile at him and really slowly and thoroughly grab the big bottle of water I've got in my lap, open it up, and drink from it feeling like it's the best water in the universe right then .   \nThe cop stops in his tracks 10 feet away from the guy with the bong in his lap ( spilling bong water all over him btw) and gets this shocked, confused and embarrassed look on his face.  While he turns around to his vehicle, he apologizes and says that he must have mistaken me drinking from my water bottle earlier with something else, sorry about the interruption.  The two cars pull away and everyone on the trampoline sits around in complete silence for about 3 minutes.  I was the first one to get up and leave.  Freaked me out in a good way so much I had to zoom the fuck outta there.  Totally am unable to remember the camp or the guy's name that a bottle of water kept outta jail...  \nGood times.\n\nTL;DR  - Slowly drinking from a bottle of water, I kept a generous fellow from going to jail at Burning Man in 2000.\n\nEdited as detail surfaces... especially about better grammar and syntax.\n", "gilded": 0, "created_utc": "1263694764", "subreddit": "AskReddit", "score": 14, "controversiality": 0}
{"body": "That's not longer the cheer. It's now W A L M A R T SPARK! Which is awesome, because the only meeting I've ever gone to was during orientation. Being a cashier at a 24 hour Walmart isn't always so horrible. Regardless, my two-week notice was given, and somehow became a three-week notice, but I will no longer be working at Walmart on 2/3/10. I'm excited.  \n  \nPS, waiting to get shut down for breaks becomes awesome when you no longer care about the job. I just shut down and walk off provided my lane is empty-ish, or there's an empty lane near me. I also take half hour 15-minute breaks. :D", "gilded": 0, "created_utc": "1263716245", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "M o s t   o f   t h e   t i m e ,   i t   w o r k s   e v e r y   t i m e !", "gilded": 0, "created_utc": "1263740979", "subreddit": "reddit.com", "score": 8, "controversiality": 0}
{"body": "People..the Haitians made a pact with the D E V I L ! This is what happens.\n", "gilded": 0, "created_utc": "1263749338", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "you mean like google?  \n\n    r e d d d d d d d d d d i t\n\nand the page numbers below like   \n\n    1 2 3 4 5 6 7 8 9 ....", "gilded": 0, "created_utc": "1263761576", "subreddit": "programming", "score": 10, "controversiality": 0}
{"body": " m i n o r s. young people.", "gilded": 0, "created_utc": "1263790614", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "On a calendar that only abbreviates the name of the day with its first letter: Wednesday, Thursday, Friday = WTF. M T W T F S S", "gilded": 0, "created_utc": "1263821300", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "tbh it goes into way too much detail for me, it's all very interesting, but  hardly a quick reference manual.\n \n&gt;Electromyography   studie s   hav e   show n   that   th e   glutes   and   hamstring s   are   the   prime   movers \nout    of  th e   b o t t o m  of  th e  full  squat ,  (adductor s   contribut e    a s  well,   although     this   ha s   not   occurred \nto   many   researchers)        an d  it   i s  best  though t   of a s  a  \" h i p s \"   movement .     After   the  bottom   position \nhas    been    established ,   c o m e   up   out   o f  th e  b o t t o m  by   driving   your  butt   straight   up  in   the  air.  Up , \nnot    forward .      Thi s   keep s   your    weight    solidly    over    th e  whol e   foot   instead    of   shifting   to  the  toes . \nThink      about    a  chain    hooke d     to  your    hips ,   pulling   you    straight    up   out   of   the  bottom     (fig.  2-14). \nD o n ' t  think   abou t    your    knee s   straightening       out ,  don' t   think   about    your    feet  pushing     against    the \nfloor,   don' t   even    think   abou t   your   legs .   Jus t   drive   your   hip s   up  out   of th e   bottom  and   the   rest will \ntake   care   of itself.    Keep     th e   chest   up   while   you   are   driving   the   hips ,   so   that   your   back   maintains   a \nconstant   angle  with   th e   floor      a s   you   m o v e   out   o f th e   deep   position . \n\n\ncopied from pdf - can't be bothered fixing formating", "gilded": 0, "created_utc": "1263850209", "subreddit": "Fitness", "score": 1, "controversiality": 0}
{"body": "B U L L S H I T\n\nI stopped at the maximum per year coverage of 5000 for individual and 10,000 for family.\nWhat they are lying about there is that the mandate will mandate you to buy insurance with those DEDUCTIBLES.\n\nFuck that video is a piece of shit.\n\nEdit but I also think mandating buying junk insurance is bullshit, but you cant even argue that with people because they are distorting the truth with bullshit videos like this.", "gilded": 0, "created_utc": "1263859462", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Nah, I'm good. I just wanted to show up in my wheelchair to trash's \"I had a dream that I couldn't walk\" pity party.\n\nI drive an old boxy benz that says **K O M P R E S S O R** on the trunk.\n\nI do have a handgun license, but that is more because I think it's ridiculous that I've shot video game guns for 20 years but didn't know shit about actual firearm discipline.", "gilded": 0, "created_utc": "1263863142", "subreddit": "IAmA", "score": 8, "controversiality": 0}
{"body": "looks P I M P !!!", "gilded": 0, "created_utc": "1263876663", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "&gt; Why is it a state monad?\n\nWhile it's not *the* state monad, it pretty much behaves like\n\n    Iteratee e a m b = StateT (Chunk a) (ErrorT e m) b\n\nbecause the main operations are\n\n    getInput :: Iteratee e a m (Maybe (Chunk a))\n    getInput = liftI (\\c -&gt; Yield c (Chunk []))\n\nand `throwError`. There's also\n\n    put c = Yield () c\n\nbut I'm not sure that inserting arbitrary chunks back into the stream is a good idea.\n\nHm, but only caring about the result `b` misses the point of functions like `dropWhile`. Looks like there's still confusion left about how exactly the abstraction works.\n", "gilded": 0, "created_utc": "1263909152", "subreddit": "haskell", "score": 2, "controversiality": 0}
{"body": "A D O R A B L E.  Heart warming and inspirational.  Would oooh and aaaahh over again. A ++++++ cuteness!!!!1!!", "gilded": 0, "created_utc": "1263911479", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "b e a u t i f u l", "gilded": 0, "created_utc": "1263939099", "subreddit": "gonewild", "score": 1, "controversiality": 0}
{"body": "Seth Rogen.. I love the guy but I think we'd both be so stoned the fight itself would be E P I C ......", "gilded": 0, "created_utc": "1263942381", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "hm, maybe. I just remember the part that is like F R E E that spells free, something something.", "gilded": 0, "created_utc": "1263968767", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "ns don't have umlauts, so following that convention makes no sense. You should have used ASCII art instead\n\n             ..\n       S p i n a l T a p\n\n", "gilded": 0, "created_utc": "1264002778", "subreddit": "comics", "score": 5, "controversiality": 0}
{"body": "b e a u t i f u l x2\n", "gilded": 0, "created_utc": "1264002969", "subreddit": "gonewild", "score": 1, "controversiality": 0}
{"body": "I hope you have them on VHS.  At least with tape you have the hope that it will just wear out... e v e n t u a l l y.  I'm still waiting.", "gilded": 0, "created_utc": "1264009917", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "\"Now that I'm in LA I go to parties, you know the kind where if a girls name is Jill she spells it J Y L L E...\"", "gilded": 0, "created_utc": "1264013728", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "*You are not going in there!* -\nI have no time to discuss this logically ..... **r e m e m b e r!**", "gilded": 0, "created_utc": "1264032442", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "maybe.. the way i played it though i visited e v e r y square inch of e v e r y planet with my vehicle... some crazy stuff out there!", "gilded": 0, "created_utc": "1264061759", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "1.  A better rail service between Windsor to Ottawa, with all the major stops.  I know this opens a whole can of worms regarding Air Canada and losing it's golden egg so to speak, but trains could be more economical and better for the environment.\n2. Let Ottawa become it's own \"Washington D.C.\" and have a separate pseudo province for it.\n3. Build more subways in Toronto.  Increase transit money for Ottawa so they can actually have a subway and not have to be sued by Siemens on scrapping the deal.  Make transit an essential service.\n4. Scrap bilingualism.  It's a waste of money and only useful if you're the federal government and you want to train a civil servant who is 7 years away from retiring from the Feds and needs a C C C level on testing.\n5. Increase the standard of living for those North West of North Bay - to the majority of residents who have been hit hard economically due to the closing of mines and forestry all the way to the Manitoba border.\n6. Pump more infrastructure into our Northern First Nation reserves - Now, please don't take this as \"give them money to buy huffing gas with\" I'm talking about job training, retention, literacy, civil empowerment and traditional language schools and teachers to have some glimmer of hope for their next generation\n7. Curb urban sprawl in our larger city centers.  When I'm driving through Toronto, I don't want to be driving through Toronto for an hour.  Actually, I'd rather not be driving though Toronto at all, so make it a tunnel or portal.\n8.  Let Jim Balsillie own his hockey team and put it in Hamilton.  \n9.   Free bacon to all new Ontarians.\n\nThoughts?\n\nAnyone else?", "gilded": 0, "created_utc": "1264099371", "subreddit": "canada", "score": 15, "controversiality": 0}
{"body": "Expert texpert choking smokers do you think the joker laughs at you?\n\nO o o e e e a a a", "gilded": 0, "created_utc": "1264112138", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "&gt; ING DIRECT:\n&gt; Disallowed characters: (space)! \" # $ % &amp; ' ( ) * + , - . / : ; &lt; = &gt; ? @ A B C D E F G H I J K L M N O P Q R S T U V W X Y Z [ \\ ] ^ _ ` a b c d e f g h i j k l m n o p q r s t u v w x y z { | } ~\n\nLet's make the list shorter... what characters *can* we use", "gilded": 0, "created_utc": "1264120250", "subreddit": "netsec", "score": 8, "controversiality": 0}
{"body": "Ummm, helllooo? ** F U T U R A M A ** reference here. If you don't dig that you may as well hand in your membership card!", "gilded": 0, "created_utc": "1264125974", "subreddit": "pics", "score": 13, "controversiality": 0}
{"body": "the chords are C A G i could find the order if anyone wants", "gilded": 0, "created_utc": "1264141613", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "c c d d e - g g d d e - a a d d e - f f e e d", "gilded": 0, "created_utc": "1264170929", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "F R E E D O M O F S P E E C H W I N S \n\n+++++++++++++++++++++++++++++++++\n\nWhat are ACORN , SEIU , and the Progresive radicals complaining about now ?\n\n+\n\n\n", "gilded": 0, "created_utc": "1264176829", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "Those Dumb-Rats wont shove their DEATH CARE down OUR THROATS. It's time OBOZO wakes up and smells the TEA.\n\n\n++++++++++++++++++++++++++++++++++++\n\nS A V E A M E R I C A", "gilded": 0, "created_utc": "1264179263", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "No, there's no need for anyone to suffer unnecessarily so long as the proper precautions are taken.  There's very little chance someone actively trying to avoid a pregnancy would actually become pregnant.  If we would get our heads out of the B I B L E and actually educate our young people about sex and pregnancy prevention, I'm pretty sure a lot less unborn children would die at the hands of their mothers.  \n\nI don't view sex as wrong, or the women who have it.  I'm sure there are married women who have sex, become pregnant, and terminate the pregnancy.  Are those \"bad women who must be punished for having sex\"?  Of course not.  I'm all about having the freedom to do as one wishes, so long as it doesn't negatively affect other people (in this sense, the unborn child is negatively affected by the decision to be terminated).  I also don't necessarily view children that are the product of an unplanned pregnancy as \"punishment\" as you clearly do.  And if a child from an unplanned pregnancy is punishment for the woman involved as you suggest, are you willing to admit that terminating such a pregnancy is in essence punishing (i.e. killing) the child-to-be who had no say, no choice, about whether to be created in the first place?  Or is this the part where you argue a fetus is not a person?  Sorry, I just don't see termination of unwanted pregnancies as rectification of a mistake.  I see it as a cop out.  I see it as the shirking of the responsibility that women alone have for their own bodies.  It's like, \"hey, I didn't mean to get pregnant, but I did, so now I'll pass along the responsibility I have to myself and my future potential children, by forcing such responsibility upon my unborn (and soon to be dead) child.\"  \n\nIt irks me that women insist on having reproductive rights, but don't want the associated responsibility, and also don't consider the rights of their potential offspring.  Sorry, but with rights comes responsibility.  That's just the way freedom works.  \n\nEdit: typos", "gilded": 0, "created_utc": "1264188967", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "Track 17 from Half Life 2: E Q E W L Q J H G J H J\n\nThis: http://www.youtube.com/watch?v=EIGZVtjO9JQ", "gilded": 0, "created_utc": "1264198624", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Sometimes it should say different things, like \"M I N D F U C K\" or \"Oh, good, new characters. That will make it easier to follow.\"", "gilded": 0, "created_utc": "1264280292", "subreddit": "lost", "score": 2, "controversiality": 0}
{"body": "This constitutes L O S T blue-balls. Damn it.", "gilded": 0, "created_utc": "1264282968", "subreddit": "lost", "score": 5, "controversiality": 0}
{"body": "neat idea, but the first initials of all us presidents beginning at jeffersion is \n\nT J J J A M W .......\n\nIt is so.. obviously... false...\n\n", "gilded": 0, "created_utc": "1264324759", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "__E X A C T L Y__", "gilded": 0, "created_utc": "1264364869", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "have you tried G O O G L E ?", "gilded": 0, "created_utc": "1264374545", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "*Inserts disk 5 ... presses any key.... bzzzzt bzzzzt bz bz s s s s s bzzzzzt ....*", "gilded": 0, "created_utc": "1264389030", "subreddit": "programming", "score": 35, "controversiality": 0}
{"body": "write, FUN A TP   then draw a teepee.  \n\nF U N A T P", "gilded": 0, "created_utc": "1264405980", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "&gt;Let this be the final word.\n\n*P l e a s e*", "gilded": 0, "created_utc": "1264426209", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "*R i c h a r d....?*", "gilded": 0, "created_utc": "1264438376", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Actually from the OP, I stated that I like women of ALL ethnics asians included ;)\n\n\nMetaphorically speaking, i'm wondering if the feelings are mutual :)\nBut thank you for your insight. R E S P E C T is key!", "gilded": 0, "created_utc": "1264495747", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "↑ ↑ ↓ ↓ ← → ← → ... Sorry, [Alt-SysRq-[R E I S U B]](http://en.wikipedia.org/wiki/Reisub).", "gilded": 0, "created_utc": "1264501022", "subreddit": "linux", "score": 1, "controversiality": 0}
{"body": "Out here, a calendar week shows S M T W R F S as opposed to M T W R F S S in the rest of the world.  Good thing you can change it on some electronics devices (BlackBerry) and websites (Google Calendar).", "gilded": 0, "created_utc": "1264505373", "subreddit": "geek", "score": 6, "controversiality": 0}
{"body": "I quite like S M T W R F S system, despite not living in the US.\n\ndd/mm/yy ftw though", "gilded": 0, "created_utc": "1264511920", "subreddit": "geek", "score": 6, "controversiality": 0}
{"body": "d i r n p a n a s", "gilded": 0, "created_utc": "1264557546", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Suck it Cold Stone Creamery, and your nonsense size names.  I want a L A R G E.  I'll decide if I like it.", "gilded": 0, "created_utc": "1264601011", "subreddit": "reddit.com", "score": 4, "controversiality": 0}
{"body": "For bringing this back into my life... \n\n..U P V O T E !", "gilded": 0, "created_utc": "1264604448", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "**c r e e p y**", "gilded": 0, "created_utc": "1264636546", "subreddit": "entertainment", "score": 51, "controversiality": 0}
{"body": "h h h h h h h h gregg\n\nMaybe not a slogan but a campaign?", "gilded": 0, "created_utc": "1264641072", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "A A A A A A A A A A A A A A A A A *mash A like a motherfucker*\n\n...yes, I was on ritalin. How did you know?", "gilded": 0, "created_utc": "1264644485", "subreddit": "gaming", "score": 6, "controversiality": 0}
{"body": "Wow. Nice Reddiquette. \n\nHEY JACKASS. FUCK YOUR FUCKING FACE, UNCLEFUCKER. YOU CUNT LIPPED ASS LICKER. YOU GANGRAPED CUMBUCKET. YOU SHIT STAINED WASTE OF 75Mb OF GENETIC CODE. \n\nF U C K  Y O U  A N D   Y O U R  W H O R E   O F   A   M O T H E R.\n\nYOU FUCKING TWAT TWIZZLER.", "gilded": 0, "created_utc": "1264648830", "subreddit": "space", "score": 1, "controversiality": 0}
{"body": "p r e g n a n t", "gilded": 0, "created_utc": "1264697380", "subreddit": "AskReddit", "score": 172, "controversiality": 0}
{"body": "W I K I P E D I A", "gilded": 0, "created_utc": "1264707873", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "PREMIERE MONDIALE: LE SUICIDE ENFIN VAINCU ! ! ! http://stop-suicide.com\n\nINFORMATION DE LA PART DE EMMANUEL MOTE\nCHAMPION DE FRANCE DE KARATE SHUKOKAÏ\nACTEUR\nPRESIDENT DE L'ASSOCIATION HUMANITAIRE EKKLESIA FRANCE\n\nUn ex-suicidant multi-récidiviste miraculeusement\nrevenu de 3 semaines de coma ...\ndécouvre et inscrit dans un livre intitulé : AUTOPSIE DU SUICIDE\n\nles secrets pour vaincre definitivement le s u i c i d e !\n\n\" un livre original choc brillant - captivant -\némouvant - pratique et... libérateur !...\n\nPartez avec l'auteur dans un voyage palpitant au coeur du\ns u i c i d e, et découvrez l'origine véritable du\nplus grand prédateur de l'être humain !...\n\nSa nature profonde encore jamais mise au jour\nauparavant... Son mode opératoire universel et\nsurtout: Comment le Vaincre:\n\nDu jamais vu !\nAUTOPSIE DU SUICIDE:\n\nLe plus beau livre produit a ce jour pour le numerique !\n\ne-book readers committee\n\nune seule adresse: http://stop-suicide.com\n\nEmmanuel Mote\npresident d'association humanitaire\nacteur\nchampion de france de karate SHUKOKAî\n\nTEl: 01 70 13 55 34", "gilded": 0, "created_utc": "1264755095", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "No, but your 'reasoning' is all thats over those liberal media sources as to why she lost. It was bad campaigning, blah blah blah. Again, for the third time. D E N I A L", "gilded": 0, "created_utc": "1264783050", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "I am not alone.  I do this with clocks, my car odometer, phone numbers, addresses, prices, and I also do this weird thing with words...\n\nExample:  The word 'Breathe'\n-A is the pivot letter as it is in the center --cancel/remove it\n-On either side of the pivot letter we have the letter e --cancel/remove it\n-Whats left is B R T H - or \"brth\" read:  birth\n-Then I have to make a correlation between birth and breathe.  In this case it would be \"What is the first thing you do at birth?  Breathe.\"\n\nIts not just a username, its a lifestyle.", "gilded": 0, "created_utc": "1264787152", "subreddit": "DoesAnybodyElse", "score": 1, "controversiality": 0}
{"body": "F I F T E E N   G I G S ? ! ? ! ?", "gilded": 0, "created_utc": "1264789638", "subreddit": "gaming", "score": 11, "controversiality": 0}
{"body": "This is easy even with a brute-force approach. Assume the numbers are A B C D and E. Based on the problem statement, we have:\n\nC + E = 14\n\nD = B + 1\n\nA = 2B - 1\n\nB + C = 10\n\nA + B + C + D + E = 30\n\nThen go down the list of equations, creating a table of all possible integer values that fit (I started with the B + C line and then moved on from top down).\n\n    B\tC\tA\tE\tD\tSum\n    0\t10\t-1\t4\t1\t14\n    1\t9\t1\t5\t2\t18\n    2\t8\t3\t6\t3\t22\n    3\t7\t5\t7\t4\t26\n    4\t6\t7\t8\t5\t30\n    5\t5\t9\t9\t6\t34\n    6\t4\t11\t10\t7\t38\n    7\t3\t13\t11\t8\t42\n    8\t2\t15\t12\t9\t46\n    9\t1\t17\t13\t10\t50\n    10\t0\t19\t14\t11\t54\n\nThe one line that adds up to 30 is the right one.", "gilded": 0, "created_utc": "1264791079", "subreddit": "engineering", "score": 1, "controversiality": 0}
{"body": "Interesting fact. If you take all the alphabet, and if you put a number 1-9 under each letter, FOX spells 666.\n\n    1 2 3 4 5 6 7 8 9 1 2 3 4 5 6 7 8 9 1 2 3 4 5 6 7 8\n    A B C D E F G H I J K L M N O P Q R S T U V W X Y Z \n\n    F:6\n    O:6\n    X:6", "gilded": 0, "created_utc": "1264792272", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Interesting fact. If you take all the alphabet, and if you put a number 1-9 under each letter, FOX spells 666.\n\n    1 2 3 4 5 6 7 8 9 1 2 3 4 5 6 7 8 9 1 2 3 4 5 6 7 8\n    A B C D E F G H I J K L M N O P Q R S T U V W X Y Z \n\n    F:6\n    O:6\n    X:6", "gilded": 0, "created_utc": "1264792380", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "THE SHIT IS BANANAS B A N A N A S. kill me now so I don't have to hear it later", "gilded": 0, "created_utc": "1264807796", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "I just realized the other day that I can remember a time before the R S T L N E rule on Wheel of Fortune.  It used to be just five consonants and a vowel.  Yup.", "gilded": 0, "created_utc": "1264815459", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Okay. There are 12 notes in an octave. These notes in succession are called \"chromatic.\" Playing a full octave chromatic scale on a keyboard would be hitting every possible note moving up or down, all the black and white keys.\n\nA \"half-step\" is one note to the next possible one chromatically. A whole step is to the second possible one chromatically.\n\nA major scale has 7 (8 if you count the octave) notes in it. First the root, then the next one is a whole step up, then another whole step, then a half, then a whole, whole, whole, and finally a half to reach the root again in the next octave.\n\nPicture a keyboard.\nhttp://images.encarta.msn.com/xrefmedia/aencmed/targets/illus/ilt/245dd834.gif\nLook at the note C. If you were to play C D E F G A B C(the next one) that is a major scale. Now remember what I said about steps. Between C and D is a whole step and D and E is a whole step. E to F is a half step and so on and so forth. Stay with me, I promise this is important.\n\nIf you were to start on C#(# = sharp) (which is the same as Db (b = flat)) and follow the same pattern of W W H W W W H (w=whole step, h= half step) it would sound, essentially, the same. In fact, you can start on any of those 12 notes and play a major scale just by knowing the WWHWWWH pattern. Neat! What this means is there are 12 keys that you can play any type of scale on and have it sound practically the same.\n\nNow check this out. You can do the same thing with a minor scale. The pattern of steps in between the notes will be WHWWHWW. Look at that picture of a keyboard from earlier and see how if you start on A and go up on the white keys it follows that pattern. Hopefully things are starting to come together now.\n\n~~~\n\nOkay, Key Signatures. Now playing a major scale where C is the root uses no black keys, right? Playing a minor where A is the root uses no black keys as well, right? Let's imagine that you want to play a major scale starting on G. Now you use the same pattern (WWHWWWH) but when you play the scale you see that you can't use all white keys. You should use exactly one black key. F#. So in the key of G major, there is one sharp and it is F#. Let's go on.\n\nLet's imagine that you want to play a major scale starting on a D. You'll find using the same pattern that there are 2 sharps, F# and C#.\n\nI went C to G to D for a reason. In a C major scale (WWHWWWH starting on C) the fifth note you hit is G. Then, on a G major scale, The fifth note you hit is a D. Going on you'll find that the fifth note of a D major scale is A and then the fifth of that is B. For every fifth you go up, the key signature (the thing that says what black keys to play, or sharped or flated notes) is adding a sharp every time.\n\nThis is called the \"Circle of Fifths.\" Here's a picture of it:\nhttp://www.themetalsessions.com/img/Co5.gif\n\nLike any good circle, it can be followed both ways. So imagine if you went the other way? The \"flat direction\" you might say. Rather than going up a fifth, go down a fifth (or rather, up a fourth, you'll find they're the exact same thing). You add a flat each time.\n\nThe order of Sharps is:\nF# C# G# D# E# A# B#\n\nThe order of Flats is:\nBb Eb Ab Db Gb Cb Fb.\n\nAs you probably see it's the one is just the letters of the other backwards.\n\n~~~\n\nI can go on or elaborate on anything. After you get this down, I would start to teach you about intervals and harmonies and I guess then chord progressions. Also, modes are important to learn about, just so you don't have any gaps in understanding.", "gilded": 0, "created_utc": "1264817017", "subreddit": "Learnmusic", "score": 28, "controversiality": 0}
{"body": "P P P P P P P P POKER FACE P P P POKER FAAAAAACE\n\nPAPA PAPA PAPARRAZIIIIIIII", "gilded": 0, "created_utc": "1264825146", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "nope. that was u u d d something too", "gilded": 0, "created_utc": "1264826186", "subreddit": "comics", "score": 1, "controversiality": 0}
{"body": "Wait a minute.. zoom in.. enhance...\n\nthose letters at the bottom.. K r i v s t u.... *what's the rest of that?*\n\n[I bet.. it's Krivstudios since it's a photographer.. photography studio..](http://images.google.com/images?hl=en&amp;source=hp&amp;q=krivstudios&amp;oq=&amp;um=1&amp;ie=UTF-8&amp;sa=N&amp;tab=wi)\n\nI guess you flexed your muscles on that one!\n\n(puts on sunglasses)\n\n\nhttp://www.krivsstudio.com/\n\nunfortunately they try to make you have a login to see the vids. :-(\n\nhttp://www.youtube.com/user/KrivStudiosBlog#p/u\n\nyoutube is free though.", "gilded": 0, "created_utc": "1264828478", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I made a virtual piano also.  There are over 200 songs to play on it.  See it here  ButtonBeats.com  Here are some examples of sheet music for the piano.\n\nMozart -A Little Night Music - L HL HLHL WR E QE QEQ # Q H\n\nBEETHOVENN 9° Symphony  jjkllkjhgghjjhh jjkllkjhgghjhgg hhjghjkjghjkjhghc jjkllkjhgghjhgg\n\nBella's Lullaby by Carter Burwell - )iutruwq weqw )iutruwq ##ee**io yui rreewwqjjllwwrr rreewwqjjllwwtt*\n\nIndiana Jones Theme JKLE HJK  LQWY QWERT  JKLE RTY LLTR RTR RTR RYT RYT RYTR\n\nBeethoven - Moonlight Sonata (,)sg@ [4x] (5)sg@ [4x] (4)9g@ [2x] (v)9!K [2x] (b)sfk (b)sg@ (b)sgh (b)sfh\n\nPink Floyd - high hopes uu))&amp;amp;&amp;amp; uu))&amp;amp;&amp;amp; uu))&amp;amp;&amp;amp; uu))&amp;amp;&amp;amp; bb5522 bb5522 bb5522\n\nBlink 182 - Damnit G G H H J S S H H J D D H H J A A J J H\n\nColdplay - Lost (quick motion) ljs (4x) ljg (2x) fhk (2x) fh/ (2x) h#l (2x) \n\nTchaikovsky - Dance of the Sugar Plum Fairy     utu*&amp;amp;trrr ¨ee eee wtetw\n\nStar Wars: ...s h gfdl h gfdl h gfgd ...s h gfdl h gfdl h gfgd .../ /gfdssdfd/8 .../ /gfdhdd .../ /gfdssdfd/8\n\nBrian adams - heaven l lkjjjj jhh dghhhjd dghhhjh l lkjjjj jhh dghhhgg gjjhh dghhhgh ggghhjj jklllkjg dggghhj\n", "gilded": 0, "created_utc": "1264833024", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "The skill you are looking to develop is called limb independence. A master of this in the professional world is a drummer by the name of Thomas Lang. He has a couple dvd sets out that cover this in great detail. Creative Control - Advanced Foot Technique is the one that I am thinking of. \n\n\nApart from that (as it is pretty intense) I would suggest practicing some rudiments but not in a traditional manner. An example, take a paradiddle which is usually thought of as R L R R L R L L. That would on the hands only. First off try doing that with your feet. Go very slow at first, and I mean slow! Then speed up gradually making sure that the execution is still proper. Next, lets look at doing them with hand and foot combinations. So the right side first which would be: \n\nRH RF RH RH RF RH RF RF \n\n(RH = right hand and RF = right foot). \n\nNow try that with your left which would be:\n\nLH LF LH LH LF LH LF LF\n\nAgain, take it slowly. Get it right, then get it fast.\n\nNow the hard ones:\n\nRH LF RH RH LF RH LF LF and LH RF LH LH RF LH RF RF.\n\nThese will help build the muscle memory required to gain independence. If you do these each for about 1 min per day with all your concentration you will see major improvements in a week or less.\n\nHope that helps you out and I hope I didn't confuse you any. I may make a video this weekend about this exact subject and post the link here for you.", "gilded": 0, "created_utc": "1264833486", "subreddit": "Learnmusic", "score": 6, "controversiality": 0}
{"body": "salvation is only for those who dont get an epilleptic seizure after that intro. geez its fast, with... with... C O L O R S", "gilded": 0, "created_utc": "1264864138", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "u u d d l r l r B A start", "gilded": 0, "created_utc": "1264865338", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "What a great show.  And the marketing crew really set the bar high for creating a show that caters to the internet.  There are easter eggs for L O S T like that all over the net.", "gilded": 0, "created_utc": "1264870441", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "hahaha that's so cool.\n\nedit:\n\n&gt;u y t\ny u e u y\nt y u\np o u t y\nu p s\na s d s p\no p a s a p o p\n\nI'm going to cry :*)\n\n", "gilded": 0, "created_utc": "1264876599", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "Thx. Ll kp n y n t nw.  Whrs my vwls?", "gilded": 0, "created_utc": "1264929232", "subreddit": "Austin", "score": 3, "controversiality": 0}
{"body": "Linux has my favorite:\n\n&gt;Press Alt-SysRq on an i386, followed by one of the keys r 0 k e i s u b", "gilded": 0, "created_utc": "1264936987", "subreddit": "funny", "score": 7, "controversiality": 0}
