{"body": "I'm not really a smug bastard. Consider it more along the lines of being sick of being asked to justify ourselves, or explain things slowly, to people with little to no interest in changing the world for the benefit of all.\n\nWhen it comes to Anarcho-Capitalists, they particularly piss me off, because you know well and truly before they open their mouths that they have no intention of actually hearing you out, they just want to see what you're made of - ah, sweet academia/intellectualism.\n\nIt has much more to do with the utter bullshitery of austrian economists and thinkers than it does with my \"dogmatism.\"\n\nI mean, for crying out loud, these are people whose every waking breath for nearly 100 years was putting down all strains of Socialist thought.\n\nA n y w a y ~\n\nI'm sorry if I don't sit well with the common-place crowd of wanting to discuss everything. I'm much more orientated toward achieving something of value - not talking with Anarcho-Capitalists or spoon-feeding them answers that at all previous turns they've deliberately had to disregard or completely ignore.", "gilded": 0, "created_utc": "1241152327", "subreddit": "socialism", "score": 5, "controversiality": 0}
{"body": "z z z z z z z z z ", "gilded": 0, "created_utc": "1241206808", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "- Song written and sung by Elaine Kolb presented in a karaoke style \n\nThe lyrics are timeless.\n\nMy most popular video on YOU TUBE (now in HD format)\n\nElaine Kolb  - guitar\nRobin Mckidd - fiddle\n\nRecorded at Pathway Studios, Islington, London\n\nOther YOU TUBE Videos with Elaine Kolb\n\nDoin' the Best We Can\nhttp://www.youtube.com/watch?v=eLtrok-BOmE\n\nElaine Kolb: Do'in the Best We Can - exploring version\nhttp://www.youtube.com/watch?v=YoAbTUqECic\n\nE t e r n i t y - Serious Karaoke (Original version)\nhttp://www.youtube.com/watch?v=WXL82Sov8_E", "gilded": 0, "created_utc": "1241221423", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Thank you. \n\nI'll try and stay off the uber-evil-troll posts with links to nimp . org. Just the occasional m e a t s p i n for the deserving idiot.", "gilded": 0, "created_utc": "1241308234", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Agreed 100%, also happy at someone from Chicago speaking their mind.\n\nOff topic - what do you think of the Olympics, Stroger, Daley, Parking privatization - in that order?\n\nOne word answer, such as R A G E is allowed :-)", "gilded": 0, "created_utc": "1241322453", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "They get a taste of the truth, and think he's always telling it without bias.  He does all he can to ignore the critical testimony of these 13 people, who saw something very interesting back in Sept 01.  As critical as WTC7 falling in on itself.\n\nw w w . t h e p e n t a c o n . c o m ", "gilded": 0, "created_utc": "1241325568", "subreddit": "conspiracy", "score": 2, "controversiality": 0}
{"body": "L A W S U I T.", "gilded": 0, "created_utc": "1241438768", "subreddit": "government", "score": 0, "controversiality": 0}
{"body": "S P A C E  -  G H O S T ", "gilded": 0, "created_utc": "1241457267", "subreddit": "Military", "score": 1, "controversiality": 0}
{"body": "I totally agree.  I love Linux, but I work about 50x faster in a Windows / DOS environment and I wouldn't trust 99.9997% of my friends and family to understand anything other than Windows.  I already to enough family tech support as it is without having to explain every last feature of Linux for the rest of my life. :)\n\nThat being said, Bart's is definitely the way to clean out an infected system. I used to do this for a living and have successfully cleaned out hundreds upon hundreds of machines, with only one machine ever needing to be fully restored.  A few repair installs, but once you know what you're doing this is pretty easy.  Time consuming, though, so you have to weigh whether it's worth the effort to do it this way or if it's just easier to wipe it and start fresh.\n\nI have shown a few people how to do this, but this is the first time I'm documenting it online.  The hardest part for newbies is tracking down all of the infected files in the first place.\n\nAnyway, here's what you do:\n\n1) Use the standard tools (HijackThis, Autoruns, a2, etc...) to figure out the names of the infected files.  Don't bother trying to delete them, they'll just come back.  Don't worry about the actual registry keys either, as you'll clean them up afterward.\n\n90% of the infected files will be named some random crap and in the system32 directory.  kjdfhkhf.dll etc... Look for other stuff that runs from inside the temp folders or the application data folders on the different profiles.  \n\n2) Write down the full name and path of as many infected files as you can find.  The more, the better.\n\n3) Make a plain, boring old Bart's disk. You don't even need any plugins if you don't feel like setting them up.  You're basically just using Bart's to go to the command line.\n\n4) Boot to Bart's and go to the command prompt. Use the following DOS commands to go to the C drive and the windows\\system32 folder.\n\nc:\n\ncd\\windows\\system32\n\nObviously if the bad files are in a different directory, cd\\ to wherever they are.  You'll probably have to go to a few directories anyway.\n\n5) You should now be able to delete the bad files.  I'm using the fake name I made up before, so obviously substitute the name of the file you are trying to get rid of.\n\ndel kjdfhkhf.dll\n\nIf that doesn't work, do the following:\n\nattrib kjdfhkhf.dll\n\nThere are four attributes A H S R - if anything other than A is showing, it won't delete without turning the other attributes off.\n\nattrib -s -h -r kjdfhkhf.dll\n\nThat would get rid of all three possible attributes that would let you delete the file.\n\nNow that it's done, delete the file for real, as above:\n\ndel kjdfhkhf.dll\n\nThe file is gone! \n\n6) That's just the first part - to really clean it out, you need to get rid of the hidden infection that's calling the kjdfhkhf.dll file to work in the first place.  Since you're booted to Bart's, it's not running, but as soon as you boot to normal Windows it will try to start kjdfhkhf.dll again and the infection starts all over.  Here's the trick:\n\nReplace kjdfhkhf.dll with a junk copy and set it to act as a system file so that the virus craps out.\n\nWhile you are still in the windows\\system32 folder, and after you have deleted the bad file, create a new file in its place.\n\ncopy con kjdfhkhf.dll\n\nType any random crap and then hit Control-Z to create the file.  You now have a file called kjdfhkhf.dll that doesn't do crap.  Make it hard to delete by:\n\nattrib +s +h +r kjdfhkhf.dll\n\nNow the crap file is hidden, read only, and a system file, so the virus won't be able to delete.\n\n7) Repeat steps 4-6 for **every infected file**.\n\nYou can create a simple batch file to do everything for you in one step.\n\ncopy con fixit.bat\nattrib -s -h -r %1\ndel %1\necho whatever &gt;&gt;%1\nattrib +s +h +r %1\n\nHit Control-Z to save it, and now you have a new command called fixit that will delete and create a new file of whatever name you tell it.\n\nfixit kjdfhkhf.dll\n\ndoes everything from steps 4-6 on that one file.  Repeat as needed.\n\n8) If you want to look for other potential virus files while at the command prompt, use the attrib command to list the attributes of all of the files in the directory.  Attrib on its own lists everything, but I usually break it down by letter to make it easier.\n\nattrib a*\nattrib b*\n\nLook for any files tagged as S H or R.  Not all of them are bad, but they'll stand out.  Once you get the hang of this you'll recognize good from bad pretty easily.\n\n9) Once you have done this to all of the infected files, boot back to regular Windows.  You'll probably see an error message or two when it first starts up, and the command prompt box may pop up once or twice when it tries to run the infected (but now just junk) files.  That's totally normal, and actually a good sign.\n\nOnce you are in, the main infection in the background is no longer running.  Install and run whatever scans you want, SpyBot, AVG, Avira, AdAware, whatever.  They'll find all of the actual infections now and clear them out.\n\n10) Run CCleaner or some other registry cleaner when they are done to get rid of any registry keys that are pointing to old dead virus files.\n\nThat's it.  Enjoy your computer.  The beauty of this method is that you don't need to really look for much beyond the obvious files. If Windows has an infection coming in as a driver or even rootkit infections still usually have one or two easily identifiable files that are not as hidden that they rely on to start up.  Replacing them with the locked junk files makes the main infection crap out and easy to scan for / delete.\n", "gilded": 0, "created_utc": "1241532053", "subreddit": "software", "score": 4, "controversiality": 0}
{"body": "Totaly False - Money BUYS happiness - i know i have lived both ways several times over - NOW i am Very Happy and debt free - No Worries - YES MONEY B U Y S Happiness.", "gilded": 0, "created_utc": "1241532097", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Since you're too lazy to search for them yourself, I'm going to make you do some work for this video:\n\n\nh t t p : / / w w  w .g  a m e t r a i  l e r  s . c o m / p l a y e r / 4 5 2 2 8 . h t m l ? t y  p e = f l v\n", "gilded": 0, "created_utc": "1241540128", "subreddit": "gaming", "score": 6, "controversiality": 0}
{"body": "*Unless they want to make up their own ideas about God*\n\nB I N G O !!!!!!\n\nThank you.", "gilded": 0, "created_utc": "1241630364", "subreddit": "religion", "score": 2, "controversiality": 0}
{"body": "&gt;I believe you're asking if it's common for people to pass on the right/left when approaching oncoming foot traffic.\n\nYeah, I realized too late that my wording was a bit ambiguous, but that is what I meant: does foot-traffic seem follow the same rules for passing as road traffic?\n\n&gt;I must say after working in an office for a year, that the majority of office drones don't have any etiquette when it comes to walking.\n\nIt probably varies by office.  Most people in my office are fine, but you're right, every now and then you get the \"we're going to walk four-abreast -- v e r y  s l o w l y -- because we're too self-absorbed to care\" people.  Fortunately, I'm a fast walker, so I just dart around them the first chance I get and leave them behind.", "gilded": 0, "created_utc": "1241646660", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I can throw some cello on this... if I like it.  Let me listen...\nEDIT: ... ergh. That piano was the definition of meandering... umm... is there any way we/someone could come up with parts and then block them out like A B A B C A or whatever... just meandering about in C major pentatonic is... gross.", "gilded": 0, "created_utc": "1241650717", "subreddit": "musiccoop", "score": 1, "controversiality": 0}
{"body": "*f p f p f p*", "gilded": 0, "created_utc": "1241653169", "subreddit": "Art", "score": 3, "controversiality": 0}
{"body": "L A W S U I T.", "gilded": 0, "created_utc": "1241663994", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "you should leave your P in the V and blow it inside the V so you can have a B A B Y and be a normal person", "gilded": 0, "created_utc": "1241664427", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "L A W S U I T.", "gilded": 0, "created_utc": "1241788515", "subreddit": "Libertarian", "score": 2, "controversiality": 0}
{"body": "U U D D L R L R B A Enter", "gilded": 0, "created_utc": "1241798675", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "H A P P Y B I R T H D A Y ! !! !!! !", "gilded": 0, "created_utc": "1241811125", "subreddit": "Marijuana", "score": 3, "controversiality": 0}
{"body": "S i n g u l a r i t y.", "gilded": 0, "created_utc": "1241811823", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I'm a computer scientist now but I used to be professional typesetter.  And while there are huge places where the TeX family (such as LaTeX) could be improved, there really isn't much of a substitute for it right now.  \n\nThe biggest problem with LaTeX is that it's used by people who don't want to be bothered to understand its intricacies: they just want to get that dang conference paper out the door.  These people have simple needs: a float here or there, squeeze a little bit more room for text, do some math.    They're not concerned about things like the fact that they're using Computer Modern, a thoroughly unprofessional typeface (sorry Don); or that when you say $myfunction$ it comes out unkerned as m y f u n c t i o n because they don't understand really how math mode works; or (heaven forbid) that if you use the latex -&gt; ps route, you have to make sure the fonts generated aren't bitmaps.  Little stuff like that winds up making LaTeX look BAD when actually it's a fairly impressive tool.\n\nIn contrast to such workaday awfulness, consider [the following book.](http://books.google.com/books?id=KvQr9l0wgf8C&amp;dq=proofs+from+the+book&amp;printsec=frontcover&amp;source=bn&amp;hl=en&amp;ei=SpgFSomREZW7twfkpeGZBw&amp;sa=X&amp;oi=book_result&amp;ct=result&amp;resnum=4#PPA3,M1)  This beautiful text is typeset using a LaTeX style file from Springer, and holy cow does it look great.  (For those who don't know, this book is a celebration of Paul Erdos's belief that the mathematician's purpose in life is to rediscover The Book: God's book of beautiful proofs).  This is the kind of thing that LaTeX was made for.  And Framemaker or InDesign are a lot of work compared to LaTeX in making such beasts -- long documents -- for exactly one reason:\n\nMacros.  By which I mean, *real* macros.\n\nLaTeX is a programming language.  Framemaker is not.    This makes possible long document style customization on a level Framemaker could never dream.  And it is where LaTeX shines. \n\nNow could LaTeX be improved?  Oh man, could it ever.  Orphan control is terrible -- rather than scrunch up text when needed, LaTeX either leaves orphans or pushes them to the next page.  Floats are always rectangles, including wrapped figures.  Wrapped figures have very poor support (try adding whitespace to the left of a wrapfig sometime). Margin notes have lots of problems.  Very few font options are available.  Unicode is practically nil (TeX family fonts may not have more than 256 glyphs).  Lots of mathematical symbols look unprofessional.  Tons of places \\\\( won't work but $ will, even though that's *never supposed to happen*.  There shouldn't even *be* such a thing as a \"fragile\" command.  And tables have lots and lots of flaws.\n\nI'd still use LaTeX anyway, and not just because it's free.", "gilded": 0, "created_utc": "1241881655", "subreddit": "programming", "score": 68, "controversiality": 0}
{"body": "\"or that when you say $myfunction$ it comes out unkerned as m y f u n c t i o n because they don't understand really how math mode works;\"\n\nOut of interest what is the appropriate solution to this? In days past I did my CS programming language theory coursework in LaTeX. I used to just bundle any hard text like a function name into a hbox. This worked as such but felt like the hack of all hacks.", "gilded": 0, "created_utc": "1241890060", "subreddit": "programming", "score": 4, "controversiality": 0}
{"body": "e es e es e b d c a", "gilded": 0, "created_utc": "1242076958", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "It appears some here still believe the Debeers propaganda. So here you are:\n\n\n\"...a multibillion-dollar industry has risen up upon an object that is essentially quite useless.\"\n\n\n-- Matthew Hart, author of Diamond: A Journey to the Heart of an Obsession.\n\n\n-- BusinessWeek Online:Why Are Diamonds Forever? Interview of Matthew Hart by Karin Pekarchik, Edited by Patricia O'Connell; DECEMBER 5, 2001\n\n\n-- Ten Reasons Why You Should Never Accept a Diamond Ring from Anyone, Under Any Circumstances, Even If They Really Want to Give You One By Liz Stanton, CPE Staff Economist; (2/14/02)\n\n\n-- \"CRACKS IN THE DIAMOND TRADE\" and \"INDIA'S DIAMOND-STUDDED DILEMMA\", Businessweek (on or about 2-19-98); There was also \"Wear-resistant Diamond Coating Created By Sandia Scientists: Superhard Material Thickly Coats Metals, Plastics, Also Stands Alone\", Sandia National Laboratories, April 9 1998\n\n\n-- \"Man-made gems fool diamond dealers, pawnbrokers\" By TESSIE BORDEN, June 14, 1999, Nando Media/Associated Press\n\n\n-- \"Simply brilliant: UF/Russian team makes gem-quality diamonds\", EurekAlert! Contact: Reza Abbaschian, rabba@mse.ufl.edu, 352-392-6609, University of Florida, 18 AUGUST 1999\n\n\n-- Have You Ever Tried To Sell A Diamond? - 82.02 by Edward Jay Epstein; F E B R U A R Y 1 9 8 2; theatlantic.com\n\n\n\"Companies...are now creating lab-grown diamonds...virtually indistinguishable from their mined counterparts...They are chemically and physically true diamonds.\"\n\n\n-- Chemistry puts new sparkle in diamonds; eurekalert.org; 10-Feb-2004; Contact: Allison Byrum; a_byrum@acs.org; 202-872-4400; American Chemical Society\n\n\n\"Not only were the diamonds so hard that they broke the measuring equipment, we were able to grow gem-sized crystals in about a day\"\n\n\n-- Large diamonds made from gas are the hardest yet; eurekalert.org; 25-Feb-2004; Contact: Dr. Russell J. Hemley; Hemley@gl.ciw.edu; 202- 478-8951; Carnegie Institution\n\n\n-- Yahoo! News - Diamonds Made from Gas Harder Than the Real Thing; Feb 26, 2004; Reuters; story.news.yahoo.com\n\n\n-- A `Crystallized Fart' Lasts Forever; August 20, 2003; ncbuy.com\n\n\n-- Diamondoids Can Be Refined From Crude Oil by Charles Choi; May 07, 2004; spacedaily.com\n\n\n-- De Beers Pleads Guilty to Price Fixing\n\n\n-- citations excerpted from compilation at [The Signposts Perspectives 2051 AD-2100 AD](http://www.jrmooneyham.com/spprs1.html)", "gilded": 0, "created_utc": "1242140821", "subreddit": "business", "score": 19, "controversiality": 0}
{"body": "Mortal Combat *D O U B L E Q U O T E*", "gilded": 0, "created_utc": "1242217954", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "Megashark vs Giant Octopus\n\nMEGASHARK VERSUS GIANT OCTOPUS\n\n---M E G A\tS H A R K---V E R S U S---G I A N T---O C T O P U S---\n\nThe title alone will change cinema forever", "gilded": 0, "created_utc": "1242222008", "subreddit": "humor", "score": 20, "controversiality": 0}
{"body": "V E T E R A N  ie no longer in the Army, so after 7 years i have my Constitutional rights,EEO, and all the other stuff a lot of people take for granted back.", "gilded": 0, "created_utc": "1242233254", "subreddit": "atheism", "score": 7, "controversiality": 0}
{"body": "but... the village people are saying Y Y Y Y Y Y - what kind of song is that? ", "gilded": 0, "created_utc": "1242239613", "subreddit": "geek", "score": 10, "controversiality": 0}
{"body": "Did something change between the \"old\" consoles and the \"new\" ones? I seem to recall it being up up down down left right left right b a b a **select** start. But whenever I see it lately it doesn't have the \"select\" part in it.\n\n?\n\n*(Oh yeah, and get off my lawn and all that jazz, I'm busy blowing into my game cartridges and I don't have the breath to do that and yell at you whippersnappers and such...)* :-)", "gilded": 0, "created_utc": "1242244416", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Hey, you are missing a key point.\n\nIt says \"unless they have a verifiable alternate means to pay\", as in a J O B or Trust Fund or whatever.  Letter of employment is required to take out a loan, do any number of things, this makes sense and is no big deal.\n\nThis makes total sense.", "gilded": 0, "created_utc": "1242244828", "subreddit": "business", "score": 5, "controversiality": 0}
{"body": " i  just  wanted  to  hey  i'm  she's  out  of  you  and  eight  eight  it's  a  class  truck  eric  wallace  well  \n\n**ASPLUND A S P L U N D 8  It's a clu... truck, here in Columbus.**", "gilded": 0, "created_utc": "1242252526", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Come on y'all work the Lol\n\nEveryone knows how to do the Rick Roll!\n\n\nBracket the word, then parenthesis\n\naround the link that starts http\n\n\nYou start to think, \n\nnow *what's that link*?\n\n\nHold on son, not so fast.  \n\nDon't forget the colon slash slash.\n\n\nNow your grinning, your hands start to rub\n\nFingers clicking, dub dub dub\n\n\n\"They'll never see it coming, they're such a newb.\"\n\nthe link you're using says youtube.\n\n\nNow make sure you don't get the extension wrong,\n\nEverybody knows it's at .com\n\n\nThey gonna be ROFLing, OMG!\n\nNext part of the link, forwardslash question mark v KEEPITUP KEEPITUP equals sign o h g\n\n\nYou don't remember what comes next you say?\n\nfive s j y r h a\n\n\nSoon you'll be a Reddit hero\n\nJust don't leave off that last zero.\n\n\nClose the bracket, the deed is done.\n\nNow watch your comment Karma start to run.\n\n\n\n[Hopefully, the above rap will help you with your future rickrolling efforts.  Think of it as a mnemonic device.  I used text-to-speech software, so ignore the shit voice on it - it might almost add to the effect a bit](http://www.youtube.com/watch?v=oHg5SJYRHA0)", "gilded": 0, "created_utc": "1242310481", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "No no.  That's W.C.W.\n\nee would be more like\n\n* i know in spring\n* a writer grows\n*                 up\n* from the grassgreenglass\n* i knew i knew him once he was\n* famous\n* \n* fornot\n* \n* famous maybe infamous he was\n* he didnt use pun.c.t.u.a.t.i.o.n. in an\n* y standard way\n* \n* and he p L a Y e D with typo\n* \n* graphy\n* \n* but i cant rem\n* \n* ember\n* \n* his name isnt burned into me but \n* yet\n* you know it\n\n* (edit: h8s reddit formatting)", "gilded": 0, "created_utc": "1242319063", "subreddit": "writing", "score": 6, "controversiality": 0}
{"body": "P U L L  T H E  T R I G G E R ", "gilded": 0, "created_utc": "1242340475", "subreddit": "worldnews", "score": 5, "controversiality": 0}
{"body": "resorting to perl so easily?  you're not even trying..\n\ndu -sk * | sort -n | while read size fname; do for unit in k M G T P E Z Y; do if [ $size -lt 1024 ]; then echo -e \"${size}${unit}\\t${fname}\"; break; fi; size=$((size/1024)); done; done\n\nI bet somebody else can do that in just sh and not bash", "gilded": 0, "created_utc": "1242370383", "subreddit": "programming", "score": 5, "controversiality": 0}
{"body": "I spell jackass troll H a n s G r u e n", "gilded": 0, "created_utc": "1242429141", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "D A M N I T I **A**\n\nL W A Y **S** **F** **I** **N**\n\nD T **H** E W **O** R **D**\n\nS E **A** R **C** H **W** **O**\n\nR D **S** Y O **U** R E\n\nN O T S U P **P** **O**\n\nS E D T O F **I** N\n\nD M R A L **L** E N\n", "gilded": 0, "created_utc": "1242499530", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": " m m m m m m", "gilded": 0, "created_utc": "1242533312", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "_ I G G E R S\n\nWhat are \"people who annoy you?\"", "gilded": 0, "created_utc": "1242761962", "subreddit": "reddit.com", "score": 7, "controversiality": 0}
{"body": "N I G G E R S !", "gilded": 0, "created_utc": "1242771624", "subreddit": "reddit.com", "score": -6, "controversiality": 0}
{"body": "I am for this option. I am going to go all Jonathan Swift on their asses, and see where the line is. \n\nMy nick shall be: b l e s s e d i n t e x a s .\n\nThink that will fly?", "gilded": 0, "created_utc": "1242843844", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Don't say I didn't warn you.\n\n    Awwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww* g o a t s e x * g o a t s e x * g o a t s e x *\n                                                                                                                                                                                                                                        g                                               g  \n                                                                                                                                                                                                                                        o /     \\             \\            /    \\       o\n                                                                                                                                                                                                                                        a|       |             \\          |      |      a\n                                                                                                                                                                                                                                        t|       `.             |         |       :     t\n                                                                                                                                                                                                                                        s`        |             |        \\|       |     s\n                                                                                                                                                                                                                                        e \\       | /       /  \\\\\\   --__ \\\\       :    e\n                                                                                                                                                                                                                                        x  \\      \\/   _--~~          ~--__| \\     |    x  \n                                                                                                                                                                                                                                        *   \\      \\_-~                    ~-_\\    |    *\n                                                                                                                                                                                                                                        g    \\_     \\        _.--------.______\\|   |    g\n                                                                                                                                                                                                                                        o      \\     \\______// _ ___ _ (_(__&gt;  \\   |    o\n                                                                                                                                                                                                                                        a       \\   .  C ___)  ______ (_(____&gt;  |  /    a\n                                                                                                                                                                                                                                        t       /\\ |   C ____)/      \\ (_____&gt;  |_/     t\n                                                                                                                                                                                                                                        s      / /\\|   C_____)       |  (___&gt;   /  \\    s\n                                                                                                                                                                                                                                        e     |   (   _C_____)\\______/  // _/ /     \\   e\n                                                                                                                                                                                                                                        x     |    \\  |__   \\\\_________// (__/       |  x\n                                                                                                                                                                                                                                        *    | \\    \\____)   `----   --'             |  *\n                                                                                                                                                                                                                                        g    |  \\_          ___\\       /_          _/ | g\n                                                                                                                                                                                                                                        o   |              /    |     |  \\            | o\n                                                                                                                                                                                                                                        a   |             |    /       \\  \\           | a\n                                                                                                                                                                                                                                        t   |          / /    |         |  \\           |t\n                                                                                                                                                                                                                                        s   |         / /      \\__/\\___/    |          |s\n                                                                                                                                                                                                                                        e  |           /        |    |       |         |e\n                                                                                                                                                                                                                                        x  |          |         |    |       |         |x\n                                                                                                                                                                                                                                        * g o a t s e x * g o a t s e x * g o a t s e x *\n\n", "gilded": 0, "created_utc": "1242929977", "subreddit": "AskReddit", "score": 32, "controversiality": 0}
{"body": "let me spell it out for you.\n\nE M P A T H Y", "gilded": 0, "created_utc": "1243048748", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "You sir, are a fucking idiot.\n\nThe author? Also an idiot.\n\nOr perhaps I'm the idiot, because nothing that this person said held any weight or sense to me.\n\nAnd so, how does what this person said amount to \"Marxist Social Philosophy?\"\n\n... I d i o t .\n\nEDIT: If anyone wants to reply with some intellectual superiority complex: you should know I'm pretty well drunk right now - so, really, you'd only be dicking yourself around.", "gilded": 0, "created_utc": "1243070249", "subreddit": "socialism", "score": 3, "controversiality": 0}
{"body": "B A L O N E Y. This really isn't worth a response, but here goes.\nWash your raw food. Observe proper handling precautions for meat and other proteins and make sure you cook them to the proper temperatures. \nGerms are everywhere, but have not developed special new abilities because of cloth bags. There is nothing to fear from re-useable bags,  and they can be washed with your regular laundry, thus negating the baloney this guy is serving up. ", "gilded": 0, "created_utc": "1243084975", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Is it? A C E G B D#, that's an Am9#11, isn't it?", "gilded": 0, "created_utc": "1243114956", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "GOP - I D I O T S .. amazing they would sell out the entire nation to further drag us into the ground for special interest .. i am sick of the right wing religious nut cases - i used to be right wing - not any more. ", "gilded": 0, "created_utc": "1243126526", "subreddit": "energy", "score": -1, "controversiality": 0}
{"body": "**B L O G S P A M**\nDownvote and report.", "gilded": 0, "created_utc": "1243178492", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "Heres your award. You earned it, Scout.\r\n\r\nYours,\r\nGeneral Mayhem, \r\nTroll Unit 6\r\n\r\n\r\n\r\n|@@@@|  x  |####|\r\n\r\n|@@@@|  x  |####|\r\n\r\n|@@@@|  x  |####|\r\n\r\n\\@@@@|  x  |####/\r\n\r\n--\\@@@|  x  |###/\r\n\r\n---`@@|__x__|##'\r\n\r\n--------(O)\r\n\r\n----.-' ' \" ' '-.\r\n\r\n--.'* .*_* ._. -*`.\r\n\r\n-: -o,o o,o o, :\r\n\r\n:  ~ B R I C K ~ :\r\n\r\n: ~  SHITTIN' ~ :\r\n\r\n:~ A W A R D ~:\r\n\r\n-:- \\ * o O* /o  :\r\n\r\n----`.  **-__-**  .'\r\n\r\n-----`-......-'\r\n", "gilded": 0, "created_utc": "1243223778", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "z z z z z z z z z z z z z z z z", "gilded": 0, "created_utc": "1243258320", "subreddit": "programming", "score": 3, "controversiality": 0}
{"body": "&gt;To get around URL filters on Facebook, spammers have turned to using TinyURLs with “.” changed to “dot”, spaces inserted and other ways to represent the domain names. The URLs, which you should not visit, include n u d z . ru, tinyurl[dot]com/pofb3m/  and tinyurl . com/o5kb/. ", "gilded": 0, "created_utc": "1243283273", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "No More DRIVING To/From Lessons\nNo More WAITING During Lessons!\nF I N A L L Y . . . Private Music Lessons in YOUR Home!\nSara's Music Lessons is THE ULTIMATE solution for busy families\nthat would like to take music lessons.\nMaybe you have young ones that make commuting difficult.\nPerhaps your day is filled with so many activities that blocking out an \nextra hour and a half is near impossible for your schedule.\nIf that is the case, Sara's Music Lessons is JUST what you need!\nAll our instructors are background checked and insured!\n* 1-on-1 Private Lessons for Children &amp; Adults *\n* Qualified Music Instructors that Travel Directly to You *\n* Reasonable Rates - with Family Discounts *\n* Flexible Hours to Fit Your Schedule *\n\nSign Up NOW to Start Your Music Lessons!!\n951.354.5232\nPiano * Violin * Guitar * Bass * Drums * Voice\n\n", "gilded": 0, "created_utc": "1243321602", "subreddit": "programming", "score": -1, "controversiality": 0}
{"body": "Yes... straw man my argument.  That makes you smarter.\n\nWould you like more examples of words having more meaning than just the sum?\n\nTake \"Bloody Hell\" Compare American reaction to British reaction.  And maybe C A T doesn't spell dog, but H U N D does.\n\n(before you attack my spelling of what you assume to be hound, learn to read german)", "gilded": 0, "created_utc": "1243378813", "subreddit": "atheism", "score": -1, "controversiality": 0}
{"body": "Yep scorpions any day. That's because they're not...... A... S P I D E R ! ! ! ! ! \n\nBut seriously, are the scorpions openly belligerent, actively pursuing underground tests, and able to lob crude missiles at our friends in Japan? Or, are the spiders behaving in a bellicose way and threatening the region while expanding their installed base of centrifuges? In either case, I'd wait to see which one the Isrealis blow to smithereens and then go that direction.", "gilded": 0, "created_utc": "1243518028", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "&gt; if (a) { return b; } else if (c) { return d; } else { return e; }\n\n&gt; (if a b c d e)\n\nYes, much easier to understand.", "gilded": 0, "created_utc": "1243519334", "subreddit": "programming", "score": 9, "controversiality": 0}
{"body": "fuck.... d u d e......... that's i n t e n s e.....\n\n....i'm baked as SHIT right now...!", "gilded": 0, "created_utc": "1243563956", "subreddit": "AskReddit", "score": -3, "controversiality": 0}
{"body": "Is it just me, or did I just see the alphabets F U C K in all of them!?", "gilded": 0, "created_utc": "1243590092", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "My wife lost on Engineer, I N G I N E E R.  She was young, but her parents always tease her for it.", "gilded": 0, "created_utc": "1243601359", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "[**v e g e m i t e**](http://dontplaywithyourfood.net/vegemite-toast/)", "gilded": 0, "created_utc": "1243772336", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
