{"body": "C R E T E S T O Y M O A N S", "gilded": 0, "created_utc": "1204337424", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "-yawn-\r\n\r\nHow many people are going to do this, thinking they're original and hilarious? Seriously, stop wasting your time. We've seen this done over and over, and it's massively inaccurate due to how exaggerated it is.\r\n\r\n**B O R I N G**", "gilded": 0, "created_utc": "1204400894", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "Is it that hard to type Q W E R T Y on qwerty keyboard?", "gilded": 0, "created_utc": "1204958740", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "C L A R I T Y  \n   \n*have some*", "gilded": 0, "created_utc": "1205105768", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "[inserting a C C C COMBO BREAKER, getting downmodded]", "gilded": 0, "created_utc": "1205114572", "subreddit": "reddit.com", "score": 9, "controversiality": 0}
{"body": "Yes, USA is the closest to God we have here on earth! The ultimate judge, the ultimate decider, the ultimate! Think about it... a little while more ... some more ... yes ... the **U l t i m a t e**!", "gilded": 0, "created_utc": "1205193568", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Drunk driver told to recite the alphabet on an episode of COPS:\r\n\r\n*A B C D F G E .. J? no wait K, look, I know the alphabet, I just don't know it in alphabetical order*", "gilded": 0, "created_utc": "1205320917", "subreddit": "reddit.com", "score": 69, "controversiality": 0}
{"body": "T T T T T T T TACO BREAKER!!!!", "gilded": 0, "created_utc": "1205386004", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "That article is bogus.\n\n&gt; The Forth code A B C D could be analogous to any of these Lisp expressions,\n\nIn Joy, the code A B C D is always analogous to (D (C (B (A)))). What makes Joy nice is that functions can easily consume and produce multiple values. Note that Scheme lets you return multiple values too (although using them is much uglier), so you can't necessarily tell how many values (D (C (B (A)))) returns in Scheme either. Regardless, in either case, you can't tell the types involved nor a host of other critical bits of information that you need to know unless you already know what the functions do.\n\n&gt; Forth has a stack notation which is a convention for annotating a function definition to show how it transforms the stack. The problem is you have to go to the definition to see it; it's not apparent at the point of a word's use.\n\nYes, you have to go to the definition to see the comment of the stack effect so you know how to pass it arguments. This is exactly the same as having to go to the definition in Scheme to see what order the arguments need to be in. \n\nThis should all be a non-issue anyway. Languages like Factor and Cat allow you to write code that uses lexically scoped variables. (Factor also allows dynamically scoped variables). If the code is clearer with variables, then use them. What languages like Factor *also* do is allow you to write pointfree code in a clear manner due to the stack and easy production and consumption of multiple values. The fact that most code written in Factor doesn't bother with variables would indicate that this is a very productive and clean way to write code once you're used to it.\n\nI think the resistance to languages like Factor is simple: Functions in such languages can easily produce and consume multiple values. This is a huge advantage in terms of expressivity once you get used to it, but it's understandable that it's scary if you're used to languages that don't offer such functionality.", "gilded": 0, "created_utc": "1205416937", "subreddit": "programming", "score": 9, "controversiality": 0}
{"body": "s t u p i d", "gilded": 0, "created_utc": "1205703813", "subreddit": "reddit.com", "score": -2, "controversiality": 0}
{"body": "Hey The_Yeti, \n\nIf you can't get the album online, I will send you a copy on CDR. Just email me personally. d a n r e e t z (at) gmail dot com. In all, I've gotten about 50$ in donations now, so it's no skin off my back.\n\nI saw this thread in my referrer log today, and I just wanted to drop by to personally thank everyone here for downloading the album, and for these comments. I can't tell you how awesome it is to have people enjoying the music and reading the book. Cheers.", "gilded": 0, "created_utc": "1206324387", "subreddit": "Music", "score": 6, "controversiality": 0}
{"body": "Italian by a W I D E margin Look in the phone book of any major city and Italian restaurants will be the largest listing. ", "gilded": 0, "created_utc": "1206415488", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "S O C I A L I S M ! ! !\n\nAmerica has jumped the shark.\n", "gilded": 0, "created_utc": "1206450617", "subreddit": "business", "score": 0, "controversiality": 0}
{"body": "&amp; \n\nR E P U B L I C A N\n\n\n(a subset of stupid, yes I know, but it bears mentioning)", "gilded": 0, "created_utc": "1206478686", "subreddit": "entertainment", "score": 6, "controversiality": 0}
{"body": "    W c r f b w w i p.\n    e o e a y r o n a\n      u a s   i r   r\n      l d t   t d   r\n      d   e   i s   a\n          r   n     l\n              g     l\n                    e\n                    l\n\nThe old serial way of writing just slows things down.\n", "gilded": 0, "created_utc": "1206702240", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "\"Open-Source\" means \"freedom\", \"f r e e d o m\". Freedom to look and modify software and release it back to the community.\n\nThere are plenty of Open-Source applications and libraries where you can pay to get support, Qt comes to mind, and you can bitch with the support staff all you want. Hell you can say nasty things to them over the telephone just like any other commercial closed source product.\n\nTrue there are many *free* open-source software where authors don't look too kindly on people \"bitching\" about their product. But that doesn't necessarily mean you can't bitch about *any* open-source software. Putting all OSS software in the same bracket is wrong.\n\nThe author doesn't understand the meaning of Open-Source. The heading of his post should have been \"My PHP shopping cart sucks\".", "gilded": 0, "created_utc": "1206997627", "subreddit": "programming", "score": 1, "controversiality": 0}
