{"body": "Do you think its a good idea to register your \"kid\" with N O R A D ?\r\n", "gilded": 0, "created_utc": "1196499503", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "C O N S P I R A C Y! I am lovin' this already! For your info: I am NOT, I repeat, NOT an anti-conspiracist! Some theories are just marvellous versions of stories. So bring the theories forward.", "gilded": 0, "created_utc": "1196523420", "subreddit": "politics", "score": 7, "controversiality": 0}
{"body": "Ok, I will spell this out...\n\nT h e   p o i n t   t h a t   I   w a s   m a k i n g ,   i s   t h a t   j u d g i n g   a   \" p a s s w o r d   c r a c k e r \"   b a s ed s o l e l y   u p o n   i t s   a b i l i t y   t o   c r a c k   a   s i n g l e   p a s s w o r d   p r o v e s   n o t h i n g   o t h e r   t h a n   t h a t   i t   i s   e f f i c i e n t   a t   c r a c k   T H A T   s p e c i f i c   p a s s w o r d .   T h e   e n t i r e   p o i n t   o f   m y   a r g u m e n t   r e l i e s   o n   m y   \" s n i p p i t   o f   c o d e \"   d o i n g   n o t h i n g   b e y o n d   c h e c k i n g   t h e   p r o v i d e d   h a s h   a g a i n s t   t h a t   s p e c i f i c   p a s s w o r d .   M y   c o d e   i s   t h e n   f a r   b e t t e r   a t   c r a c k i n g   T H A T   s p e c i f i c   p a s s w o r d   t h a n   a n y   f u l l   f e a t u r e d   r e a l   w o r l d   b r u t e   f o r c e / d i c t i o n a r y / r a i n b o w   t a b l e   b a s e d   t o o l   a n d   t h e r e f o r e   s c o r e s   b e t t e r   o n   t h i s   t e s t .   H o w e v e r   i t   i s   o n l y   m o r e   e f f i c i e n t   i n   t h e   s i n g l e   c a s e   i n   w h i c h   t h e   t e s t   i s   c o n d u c t e d .   T h i s   l e a d s   t o   m y   p o i n t ,   w h i c h   a p p a r e n t l y   e v e r y o n e   o t h e r   t h a n   y o u   w a s   b r i g h t   e n o u g h   t o   p i c k   u p   o n ,   c o n  d u c t i n g   a   t e s t   o f   a   s i n g l e   u s e   c a s e   i s   i r r e l e v a n t   a n d   t h e   t i t l e   o f   t h i s   a r t i c l e   i s   r e t a r d e d .\n\nWas that slow enough for you or should i double space it?  ", "gilded": 0, "created_utc": "1196990895", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "T H A T S I L L Y", "gilded": 0, "created_utc": "1197004946", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "\"the evolutionary biology work he was hired for\"\n\nHe is a biology researcher, you f**king moron.  B I O L O G Y.  You can't possibly think critically about the field when you are a creationist.\n\nI can imagine the weekly meetings:\n\n\"Ok, we are hear to discuss the differences between pig and human anatomy.\n\nCreationist Bob: clearly the human body was the product of god molded out of clay\n\nOthers: Clearly, Creationist Bob is a f**king whack job and won't be allowed to future meetings\"\n\nMe personally, I don't think ANY scientist can think critically about his or her field and be religious.  It is like, you don't see many professional marathon runners that are chain smokers and heavy drinkers.", "gilded": 0, "created_utc": "1197064631", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "B O R I N G", "gilded": 0, "created_utc": "1197222002", "subreddit": "reddit.com", "score": -2, "controversiality": 0}
{"body": "*CHEERS*\r\n\r\nS E C U L A R\r\n\r\nHaven't they ever heard the word? Jesus Christ!", "gilded": 0, "created_utc": "1197592507", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "E U G E N I C S\r\n", "gilded": 0, "created_utc": "1197677225", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Z O M G i like chewing gum!", "gilded": 0, "created_utc": "1197785981", "subreddit": "reddit.com", "score": -4, "controversiality": 0}
{"body": "q r s t u v w x y z!", "gilded": 0, "created_utc": "1197940104", "subreddit": "programming", "score": 2, "controversiality": 0}
{"body": "wow you just made my day..\r\nthis is so great!\r\na w e s o m e\r\n\r\nthis is what reddit is for", "gilded": 0, "created_utc": "1197946975", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "**STOP**\n\nRead the next sentence c a r e f u l l y.\n\nIf it was possible to get the **same level of care** for cheaper under a nationalized system, would you vote for it and help it get passed?", "gilded": 0, "created_utc": "1197995902", "subreddit": "politics", "score": 8, "controversiality": 0}
{"body": "&gt;H O L L T W O O D ", "gilded": 0, "created_utc": "1197997644", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "N O F U C K I N G S H I T", "gilded": 0, "created_utc": "1198092384", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "H E L L F U C K I N G Y E A!\r\n\r\nfinally some good news.\r\n\r\n(why the fuck am i being downvotted for supporting the EFF? you people are fucking retarded.)", "gilded": 0, "created_utc": "1198126562", "subreddit": "reddit.com", "score": -6, "controversiality": 0}
{"body": "The last time I visited Digg, (about a week ago), nearly every link on the first two pages was something to do with a gaming console. B O R I N G.", "gilded": 0, "created_utc": "1198144069", "subreddit": "reddit.com", "score": 14, "controversiality": 0}
{"body": "D o w n m o d d e d   f o r   s p a c i n g   t h i n g s   o u t   i n   o r d e r   t o   d o d g e  f i l t e r s .\n\nWhen you're using the same tactics as email spammers in order to further your cause, you've crossed the Zealot Line.", "gilded": 0, "created_utc": "1198193424", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "downmodded for E M A I L S P A M M E R T A C T I C S", "gilded": 0, "created_utc": "1198193578", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "I went there and I agree. R E T A R D E D.", "gilded": 0, "created_utc": "1198249528", "subreddit": "programming", "score": 0, "controversiality": 0}
{"body": "&gt;do you honestly believe the USD can devalue in a vacuum?\n\nNot at all. Neither does China, which is why they're diversifying their currency holdings s l o w l y.", "gilded": 0, "created_utc": "1198252496", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "F U C K I N G  R A D!", "gilded": 0, "created_utc": "1198261726", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "Sing with me\r\n\r\nU N I - I really hate America\r\n\r\nO N S - Sure is fun to get paid for nothing\r\n\r\nS U C K S - Sorry your car is overpriced, I need more benefits!", "gilded": 0, "created_utc": "1198501623", "subreddit": "science", "score": -1, "controversiality": 0}
{"body": "S A N T A  !!!!!", "gilded": 0, "created_utc": "1198633846", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "E v i d e n c e;\n\n?", "gilded": 0, "created_utc": "1198735675", "subreddit": "reddit.com", "score": -2, "controversiality": 0}
{"body": "He's **B O R I N G.**", "gilded": 0, "created_utc": "1198961315", "subreddit": "reddit.com", "score": 5, "controversiality": 0}
{"body": "a b x a c d t ew h", "gilded": 0, "created_utc": "1199129488", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
