{"body": "\"Shemale vids,\" A W E S O M E", "gilded": 0, "created_utc": "1264983334", "subreddit": "reddit.com", "score": 13, "controversiality": 0}
{"body": "Modes - Scales based off of the major scale, basically all the different variations of T T S T T T S, ie the Dorian mode starts a tone up for would be T S T T T S T. \n\nQuartal Voicings - Chords based on 'staking 4ths', not very useful really, was the fashion in the 60s/70s mainly for texturing and intros. \n\n The IVT - Is a software he had created to voice chords on guitar in different ways, that's why it's $159. \n\nThe harmony stuff isn't that advanced really, there is plenty of free stuff online. \n\n:) ", "gilded": 0, "created_utc": "1264985055", "subreddit": "musictheory", "score": 4, "controversiality": 0}
{"body": "Perhaps revulsion to the characters C U I L in sequence?", "gilded": 0, "created_utc": "1265011812", "subreddit": "happy", "score": 2, "controversiality": 0}
{"body": "I never knew this until I heard my daughter singing the Alphabet song and twinkle-twinkle little star at the same time. She was 2.  It kinda went like this \"A B C D E F G-How I wonder what you are.\" My mind was blown. My 2 year old made me look a fool. ", "gilded": 0, "created_utc": "1265056115", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "Good job, man. I'm in a league and bowled my [first 200 game](http://imgur.com/wFdmS.jpg) two weeks ago. I was excited and had to take a picture of it. In fact, since tonight is bowling night I might be able to break it again tonight, since last week I bowled a 209.\n\nIt's hard to read, but it's X X 9/- 9/- X 7/2 (split, ouch) X X X X X 9", "gilded": 0, "created_utc": "1265145197", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Zero Seven is perfect. And I mean     p e r f e c t.", "gilded": 0, "created_utc": "1265146308", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "A MILLI A MILLI A MILLI A A A A MILLI MILLI A MILLI MILLI", "gilded": 0, "created_utc": "1265148203", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "Legend of Zelda - Hyrule Market theme  l l l k j k l l q w e l  l l l k j k l k j k j h g  l l l k j k l l q w e l\n\nBeetoven - Fur elise t&amp; t&amp; twreq gjqw j$we t t twreq gjqw jewq wert lytr ktre jrew jjttjj\n\n", "gilded": 0, "created_utc": "1265159470", "subreddit": "Music", "score": 1, "controversiality": 0}
{"body": "M U F F  D I V I N G", "gilded": 0, "created_utc": "1265173858", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "&gt; What is the best/worst misunderstanding of a computer you have ever witnessed?\n\nMy own, of course. [In 1977 I bought an Apple II](http://www.atariarchives.org/deli/cottage_computer_programming.php), a *very early* Apple II, with the infamous \"Red Manual\" as its only documentation. I had never owned a computer before (for a reason that should be obvious -- almost no one did). When it arrived I was beside myself with excitement -- I could solve a huge backlog of math problems I had accumulated over the years, without any practical means to solve them.\n\nI unpacked the computer and set it up. Then I tried to get into BASIC (hey -- it was the only \"high-level\" language available). The manual said \"type 'control-b' and press Enter\". Sooo ... never having been near a computer before, I spent an absurd amount of time typing 'control-b'.\n\nYes, there I was, in my little Oregon cabin, illuminated by kerosene lamps, typing 'c o n t r o l - b' over and over again, saying, \"Why won't this work? Is it broken?\"\n\nTrue story.\n", "gilded": 0, "created_utc": "1265221652", "subreddit": "AskReddit", "score": 173, "controversiality": 0}
{"body": "It was \"what your parents do\" day at school one day....\nThe teacher asked everyone to come up, say what their father did for work, spell their fathers profession, then say what their father would do if they were here today.. \nBetsy came up \"my father is a baker ... B A K E R... and if he was here today he'd give everyone a fresh cookie\"\nJerome came up... \" my father is a mechanic... M M E K...CAK...MM.......\"\nthe teacher interrupted Jerome and told him he could wait til the rest of the class went and try again\nthen Tony came up... He said \"my father is a bookie... B O O K I E.... and I he was here today he'd give everyoe 100 to 1 that ni***r isn't gonna spell mechanic eight\"", "gilded": 0, "created_utc": "1265242705", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Thanks!\n\nBackstory:\nWe have those magnetic letters/numbers on our fridge, and my 3 year old has managed to lose most of the letters. I was rearranging letters the other day and found we still had R O F L B 5 3 4 D and = ... needless to say, I spelled ROFL...\n\nThe next day I was standing near the fridge microwaving something and put the B in front, saw BROFL and thought of this joke out of nowhere... and knowing reddit HAD to have a /jokes, I decided to share. So glad you liked it :)", "gilded": 0, "created_utc": "1265248835", "subreddit": "Jokes", "score": 2, "controversiality": 0}
{"body": "I gave it a b c d and got:\n&gt;a\nc\nd\nb\ns\ne\nm\nf\ng\nh\nl\nr\np\nt\ni\n\nso yes, it includes an 'e', but it's in some scrambled order", "gilded": 0, "created_utc": "1265249553", "subreddit": "gadgets", "score": 1, "controversiality": 0}
{"body": "He didn't answer my question but I'll answer his:\n\nP R O P O R T I O N A L \n\nR E P R E S E N T A T I O N\n\nGet rid of safe seats and the rest will naturally follow. If every MP has to fight, and fight hard, for their seat then politics will represent us better.\n\nA further tip to Mr. Clegg: Good politicians court public opinion; great politicians change it.\n\nDrugs policy is simply wrong. Liberal philosophy naturally fits the idea that the state has no business telling us what we can and can not put in to our own bodies. That is a natural right of man. It's right there in Jean Jacques Rousseau. \n\nYou won on the Gurkers because you defended not what was easy but what was _right_. The war on drugs needs to be ended, and it needs to be ended now. \n\nThank you Mr. Clegg for a great response. I enjoyed that immensely. Can we send him a Reddit t-shirt? ", "gilded": 0, "created_utc": "1265252265", "subreddit": "unitedkingdom", "score": 10, "controversiality": 0}
{"body": "My name is Jason and I flipped out when I discovered this. I was real young, sitting on the toilet looking at a newspaper that had a graph of the months abbreviated M J J A S O N D... and so the J is July, the month I was born, which made it a great coincidence!", "gilded": 0, "created_utc": "1265259824", "subreddit": "DoesAnybodyElse", "score": 1, "controversiality": 0}
{"body": "I wasn't even thinking of Haiku in my post here.\n\nI spend much of my time online and like to think I know the trends and \"memes\".. but this one just flew by my radar. More of a w t f ? (spaces deliberate)", "gilded": 0, "created_utc": "1265296923", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "IL R I P S K I N IL\n\nSuper awesome would never let you die monk! :D", "gilded": 0, "created_utc": "1265305487", "subreddit": "redditgw", "score": 2, "controversiality": 0}
{"body": "I encountered that one when I was about 6. My aunts and uncles were all laughing at this little piece of paper that was supposed to be a conversation between two Newfies. It went as such:\n\nM R DUCKS\n\nM R NOT DUCKS\n\nM R SO DUCKS\n\nC D E D B D WINGS?\n\nWHALE OIL BEEF HOOKED, M R DUCKS!\n\nMy family was strange.\n", "gilded": 0, "created_utc": "1265305725", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "  \r\nS U P E R B U T C H", "gilded": 0, "created_utc": "1265308458", "subreddit": "DoesAnybodyElse", "score": 5, "controversiality": 0}
{"body": "Well, I don't mean for you to lose your respect of JWs; I believe they are kind, decent and well meaning people. Is just that I think they haven't *really* thought what it would feel like to live in a world full of dead bodies. \n\nThe post you point to doesn't actually disagree; here, I'll make some keywords bold:\n\n&gt;Also after Armageddon we don't believe that only Jehovah's Witnesses will **survive**.\n\nWhat he means by \"survive\" is that they will resurrect. \n\n&gt; In Acts 24:15 it says \"and I have hope toward God, which hope these [men] themselves also entertain, that there is going to be a resurrection of both the righteous and the unrighteous.\" There are countless cultures, nationalities, etc that weren't even around when Christianity was around. How is it fair to judge them? It wouldn't be and that's why they too would be **resurrected.**\n\nThere you go, resurrection. They still get to die first. It remains: everyone who is not a JW will positively die in Judgment Day. E v e r y o n e. Is just that some will resurrect later due to not having had a chance to embrace the faith -due to having never heard of it. \n\nAgain, the JWs have good intentions. But like most religions, the bronze age mythology they are forced to accept as fact is rather brutal, and I think they haven't really thought all of the implications.", "gilded": 0, "created_utc": "1265324422", "subreddit": "IAmA", "score": 8, "controversiality": 0}
{"body": "O R G A S M ,", "gilded": 0, "created_utc": "1265335075", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "This is wrong. The Men at Work flute riff and Kookaburra fragment are totally different intervallically. \n\nThe Men at Work phrase moves up one half step and then down by a major third. (F# F# F# F# G - G G F# D F# D).\nKookaburra moves up one whole step and then down by a minor third (A A A A B - B B A F# A F#). They are just about the same rhythmically, but I don't think a rhythm can be copyrighted. Was there no musical expert witness in the case?", "gilded": 0, "created_utc": "1265338154", "subreddit": "Music", "score": 10, "controversiality": 0}
{"body": "We have a few people in our group like this. Trust me, E V E R Y O N E knows you to be 'that' guy that is constantly lying.", "gilded": 0, "created_utc": "1265345043", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "use the steps.\ncut out the soda pop/sweet tea/diet soft drinks.\nchew your food S L O W E R.\nsmaller bites.\nPut your utensils down while chewing.\n", "gilded": 0, "created_utc": "1265389075", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "From your own source (http://www.gpuss.co.uk/english_usage/a_or_an.htm)\n\n&gt;By this rule, if the abbreviation starts with a vowel-sounding letter, the article used is \"an\"; if it starts with a consonant-sounding letter, it takes an \"a\".\n&gt;consonant-sounding letters (take \"a\"):B C D G J K P Q T **U** V W Y Z\n\nThus, it is **a** USB device.\n\nAdditionally, your Google search for \"an USB\" returned about 550,000 hits. \"a USB\" returns over 8 million.", "gilded": 0, "created_utc": "1265393388", "subreddit": "reddit.com", "score": 10, "controversiality": 0}
{"body": "King B E O W U L F \nThanks!", "gilded": 0, "created_utc": "1265417979", "subreddit": "redditgw", "score": 2, "controversiality": 0}
{"body": "a b c d e x?", "gilded": 0, "created_utc": "1265442497", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "My dad would watch M A S H quite often when I was growing up. I wasn't fond of the show, but I loved the theme song.", "gilded": 0, "created_utc": "1265500075", "subreddit": "television", "score": 1, "controversiality": 0}
{"body": "I have perfect pitch. When I hear music, the notes call out their names in my head: \"f g G f f Ab G f eb Eb db db Db c\".", "gilded": 0, "created_utc": "1265564952", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "I think that's B R I L I A N T", "gilded": 0, "created_utc": "1265579308", "subreddit": "AskReddit", "score": 8, "controversiality": 0}
{"body": "Cool, much obliged.  Game on.  Same topic, new answer:\n\n       __________\n       |         |\n       |         |\n       O         |\n                 |\n                 |\n                 |\n                 |\n       __________|________\n\n\n\nCorrect: E, S, T, A, I, H, O, L, N, G, F, W, R, V\n\nIncorrect: P (head)\n\n\nM A S K I N G\n\nS E L F\n\nL O A T H I N G \n\nW I T H\n\nI N T E R N E T\n\nV I G I L A N T E \n\nJ U S T I C E\n\n*Winner: coheedcollapse\n\n**Just my own amateur psychoanalysis.\n\n***Probably should have done something with less letters since long answers make it too easy to guess letters correctly.  My bad, haven't played hangman in a while.\n\n****Thanks for playing.  Good night.  Happy [Superb Owl](http://www.reddit.com/r/pics/comments/az7ke/did_someone_say_superb_owl) day.", "gilded": 0, "created_utc": "1265592698", "subreddit": "politics", "score": 11, "controversiality": 0}
{"body": "U U D D L R L R B A [Start] yay free $30!", "gilded": 0, "created_utc": "1265646932", "subreddit": "Economics", "score": 8, "controversiality": 0}
{"body": "Um, no.  Not even close.\n\nThey put him up front and center because he writes about what they tell him to write about.\n\nP r o p a g a n d a.", "gilded": 0, "created_utc": "1265655804", "subreddit": "worldnews", "score": -1, "controversiality": 0}
{"body": "r e d u c t i v e", "gilded": 0, "created_utc": "1265659770", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "grow up and think what I think!\nYou are narrow while I am w i d e !\nMedia entities are created spontaniously from the vast swirling pool of human curiousity.\nYou Dolts! /s \n\nppfftt.", "gilded": 0, "created_utc": "1265676175", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "##F R A M E   T E X T    \nThis picture has it.", "gilded": 0, "created_utc": "1265678730", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "H O L Y S H I T T T T T", "gilded": 0, "created_utc": "1265729936", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "I learned typing.  Put your fingers on the home keys.  Each finger has 3 keys to deal with, except the index fingers, which have 6 [edit: left pink is AQZ, left ring is WSX, right index is YHNUJM and so on] Spacebar is thumbs.  Shift keys are pinky - left shift for right hand letter, vice versas.\n\nTo start with, only 1 finger should ever be raised from the home keys - all 7 others should remain in place (unless using shift).\n\nStart by learning each key from left to right.  A A A A A - with your pinky.  Then S S S S S with your ring finger, and so on.  Do this across the whole center row.  Then move on to the top row.  Then the bottom row.  Just type page after page after page of letters.\n\nThen do the alphabet without looking, using the correct fingers.  It really doesn't take long.", "gilded": 0, "created_utc": "1265755774", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "H I J K E F G", "gilded": 0, "created_utc": "1265757952", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "F U C K E D \nis what you are!", "gilded": 0, "created_utc": "1265769242", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Props to everyone who came with us:\n\n- Tevoul Soulreaper\n- X Water\n- Alana Yl Vanya\n- Miss Nemu Asakura\n- King B E O W U L F\n- Water Emblem\n- Marina Ee\n- Ghelgath Torin\n\nAlso props to Rosencrantz for being there in spirit (as well as advice)!\n\nNext event is going to be at 7 pm Thursday, never too late to sign up for the guild and join in the fun!", "gilded": 0, "created_utc": "1265772052", "subreddit": "redditgw", "score": 5, "controversiality": 0}
{"body": "I always lose a few seconds staring at the touch screen keyboard when I have to type in the name of the item. It's not a qwerty and I just can't make my eyes look in the correct places.\n\nA B C D E F G H I \n\nJ K L M N O P Q R\n\nS T U V W X Y Z\n\nwtf?", "gilded": 0, "created_utc": "1265787597", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "and of course we can thank the E U S S R and lib lab con for this  massive  overpopulation   and these hypocrites talk about green issues  when its all down to mass overpopulation that is destroying  the earth and in this case the British people, for  this level of population is a result of  the larger birth rate of existing immigrants  and the never ending massive influx of immigrants (500,000 a year?)  and those  earmarked  for the Uk  by the  E U  pace 50 million Africans via African Job centres, millions more Africans with AIDs S (c/o David Cameron) and the 80 million Turks thanks to the E U and encouraged by Labour lib and lab  Ukip", "gilded": 0, "created_utc": "1265808679", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "**L I N K B A I T**\n\nNon-issue.  No fury.  Pass.  Downvote.", "gilded": 0, "created_utc": "1265846199", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "Why you killin babbies in my neighborhood? J E N O C I D E", "gilded": 0, "created_utc": "1265866749", "subreddit": "science", "score": 3, "controversiality": 0}
{"body": "Opportunità di guadagno\r\n Banner paga click - Subito all'iscrizione 5 $  Accredito su conto Paypal ogni settimana  Offerta TeleTu   \r\n Inserisci il testo e spingi il carrello\r\n    \r\n \r\n\r\n        \r\n\r\n                 www.  \r\n \r\n .it .com .net .org .biz .info \r\n \r\n \r\n       \r\nGratis Links\r\n Affiliati.org\r\nUsernamePasswordRicordami\r\n\r\n           Categorie\r\nblog life\r\ntecnologia\r\nUltimi blog aggiornati\r\nMaria Luisa FSP\r\nPallone\r\nDieta gratis, ricette e diete...\r\nCosa cucino oggi\r\nCome mi trucco? Con Rimmel la...\r\n06 Puntalelle alla Romana\r\nCentro studi ”Edith Stein”\r\njuveincampo\r\naitqeqzsz\r\nSimilar bars\r\n  \r\nTag più cercati\r\nabassoprezzo guadagnare online assicurazione trova prezzi offerte online auto shopping online adsl sconto vacanze gratis prestito carta di credito blog altrecose annunci gratis opportunità di guadagno internet shopping annunci \r\n Inserisci un annuncio\r\n  \r\n  Risparmia e Guadagna con Buyon  Spargi la voce e guadagni di più   Webmasters, guadagnate soldi visualizzando dei banner contestuali\r\n          \r\n                    \r\nScambio Banner &amp; Popunder -&gt;Scambio Doppio&lt;- Banner &amp; Popunder exchange\r\nSégnalo\r\n\r\nNewsletter\r\n\r\nIscriviti\r\nCancella la tua iscrizione\r\n\r\nPost recenti\r\nPrendi il tuo set da viaggi naj-oleari compreso...\r\nRisparmia sulla tua assicurazione\r\nPrendi 10 € con Shoppeo\r\nIn regalo sito web\r\nLa tua polizza con Dialogo conviene\r\nSito Pronto e Gratis\r\nA San valentino dimostra il tuo amore con...\r\nVola a poco prezzo con TUIfly\r\nSnapfish e vinci ricariche telefoniche\r\nAbbonati a Tiscali e navighi e parli gratis\r\nFebbraio 2010\r\nD L M M G V S \r\n 1 2 3 4 5 6 \r\n7 8 9 10 11 12 13 \r\n14 15 16 17 18 19 20 \r\n21 22 23 24 25 26 27 \r\n28       \r\n\r\nCommenti recenti\r\nFrancesco Martino su Guadagnare con internet\r\nmiki su Mr. Webmaster Top 100\r\nArchivi\r\n2010-02\r\n2010-01\r\n2009-12\r\n2009-11\r\n2009-10\r\n2009-09\r\n2009-08\r\n2009-07\r\nTutti gli archivi\r\nTraduttore\r\n  Traduci questa paginaترجمة هذه الصفحةПревод на тази страницаPřeložit tuto stránku翻译此页翻譯此網頁번역 보기Oversæt denne sideתרגם דף זהKäännä tämä sivuTraduire cette pageこのページを翻訳しますΜετάφραση αυτής της σελίδαςTradui paj sa aTranslate this pageTraduci questa paginaDeze pagina vertalenPrzetłumacz tę stronęTraduzir esta páginaПеревести эту страницуTraducir esta páginaÖversätt den här sidanแปลเพจนี้Diese Seite übersetzen\r\n RSS   Atom\r\n \r\n\r\nAggiungi mimimi61 alla mia lista contatti\r\n\r\n mimimi61\r\n\r\n« Risparmia sulla tua assicurazione | Homepage \r\n\r\n11/02/2010\r\nPrendi il tuo set da viaggi naj-oleari compreso nei prodotti Bottega Verde\r\nBottega Verde, leader nel mercato dei prodotti di bellezza con una catena di negozi monomarca, ti fa guadagnare l'8% sulle vendite e 0,30€ per ogni iscritto alla community!\r\n\r\nChi è Bottega Verde?\r\n\r\nBottega Verde nasce nel 1972, come erboristeria, in una splendida cittadina toscana in provincia di Siena, Pienza, diventando in breve tempo la prima azienda italiana nel campo della vendita tramite catalogo.\r\n\r\nDa circa dieci anni Bottega Verde è anche leader nel mercato dei prodotti di bellezza grazie ad una catena di negozi monomarca vicina a milioni di donne con consigli e utili informazioni.\r\n\r\nInoltre, dal 2000 Bottega Verde ha un proprio sito dove è possibile anche acquistare on line!\r\n\r\nL’aver saputo coniugare differenti canali di vendita ha decretato un successo che l’ha portata ad essere conosciuta dall’85% delle donne italiane.\r\n\r\nBottega Verde ha fatto della propria passione per la natura il suo grande punto di forza e, oggi come allora, produce e commercializza direttamente prodotti a base di principi attivi vegetali.\r\n\r\nPerché scegliere Bottega Verde? Scopri i vantaggi! ,\r\n\r\nBottega Verde promuove la vendita dei suoi prodotti online offrendo i vantaggi di un catalogo interamente online e di facile consultazione, che consente di acquistare con pochi click i prodotti desiderati e riceverli direttamente a casa!\r\n\r\n \r\n\r\nVisita il nostro negozio online!\r\n\r\nScopri la Linea Corpo Bottega Verde!\r\n\r\nNaturalmente Bella con Bottega Verde: Scopri la Linea Make Up!\r\n\r\nUnisciti alla community Bottega Verde e scopri tutte le offerte per la tua bellezza!\r\n", "gilded": 0, "created_utc": "1265871921", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "C O R R U P T  ", "gilded": 0, "created_utc": "1265902098", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I S\n\nR E T A R D E D", "gilded": 0, "created_utc": "1265927302", "subreddit": "circlejerk", "score": 3, "controversiality": 0}
{"body": "Way to add to your pain by doing what is driving you I N S A N E .... FUUUUUUUUUUUUUU", "gilded": 0, "created_utc": "1265934644", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "P L I A R S", "gilded": 0, "created_utc": "1265934848", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "C = C E G\n\nF = F A C\n\nG = G B D\n\nAm = A C E\n\nFiller notes can come from the C maj scale C D E F G A B.  But if you want to melody to imply the chord changes, don't stray too far from hitting those first notes I mentioned while the corresponding chord is being played.", "gilded": 0, "created_utc": "1265953264", "subreddit": "Learnmusic", "score": 1, "controversiality": 0}
{"body": "My number one hatred of music is when artists have to sing their name in there\n\nJASON DERULLLLLLLLLLLLLLLOOOOOOOOOOoooooooooooooooooo \n\nAnd then the producers get in there with JJ JJ JJ J J J J J J J Rrrrrrrr\n\nIf I wanted to know who you were I'd work that one out for myself, the radio dj will tell me after you're done ruining my day. \n\nTrying hard not to sound racist but it is almost entirely in r n b music", "gilded": 0, "created_utc": "1265963752", "subreddit": "fffffffuuuuuuuuuuuu", "score": 4, "controversiality": 0}
{"body": "i would like to get his peeper personally in my petite pussy pronto\r\n\r\n n o w  i m  p o o i n g\r\n\r\nI dance like an angel devine\r\n\r\ni dance like an angel devine", "gilded": 0, "created_utc": "1265998155", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Make a fist with both hands and place them beside each other, with the thumbs together. Starting with the left pinky knuckle, see whether there is a peak (knuckle) or valley. January is the knuckle, so it's 31. February is lower (and wierd), so there's 28 (or 29, whatever). And on and on...\n\nRight ^ - ^ - ^ - ^ Left ^ - ^ - ^ \n          J F M A M J Ju       A S O N D\n\nDone and done.", "gilded": 0, "created_utc": "1266135542", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Well many MPs Didn't vote for  Transparent UK Parliament after all why should they  they are pro - E U S S R ", "gilded": 0, "created_utc": "1266144075", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Just some novice thoughts and musings, I'd love to hear your thoughts, but try to keep it simple for me, k? :)\n\nI propose that math is 100% tautology.  Take 1 + 1 = 2. This can be translated I &amp; I is II. (Do it with your fingers....)  2 + 2 = 4 just means II &amp; II is IIII.  Simple, pure, tautology.  Subtraction is the reverse:  IIII - II = II.\n\nTake 6 x 7 = 42.  This just means that if you add 6 together 7 times, you get 42 - count 'em:\n\nx x x x x x\n\nx x x x x x\n\nx x x x x x\n\nx x x x x x\n\nx x x x x x\n\nx x x x x x\n\nx x x x x x\n\nDivision reverses that.  And on and on.  With more and more tricks and short-hands and clever methods that help us wrap our minds around things and do work and figure things out and make predictions.  And then we get really deep, to levels that our brains can barely grasp, and we see reflections and symmetries back through the smoke and mirrors we've created and are amazed.  We can no longer see that its tautology. But that tells us more about the nature of our minds then about the external reality of math or the real world. \n\nThere is no external reality to math, because math is all tautology.  Math is a useful tool and concepts for OUR BRAINS to think about and map things,  but has no existence in external reality because it is all tautology.\n\nDoes that make any sense at all!?  :)", "gilded": 0, "created_utc": "1266199745", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "Yes, I do, Reddit.\n\npic: http://xeno.com/hosted/tattoo.jpg\n\nI've been using the xeno name online since 92 and when I DJed for years. In fact, a lot of ppl on my websites only know me as Xeno. Tattooed it on my arm.\n\nAlso, after years and years of sending emails to various people asking if I could buy xeno.com, I finally own it. It seriously was one of my life goals.\n\nThe tattoo itself is pretty crappy. I designed it and apparently my tattoo artist was a shaky crackhead who doesnt understand what \"fill it in\" means. I went to a different tattoo shop 2 years later to get it filled in for real, and I didnt realize it until after that tattoo was \"filled in\", but it was the same fucking guy.\n\nEither way, a lot of people think its a dumb idea for a tattoo... so I'm getting it covered. by a giant X E N O that starts with the X at my shoulder, the stalk of the E covering the old tat, and the O ending at my elbow. :)", "gilded": 0, "created_utc": "1266205125", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "    * g o a t s e x * g o a t s e x * g o a t s e x *\n    g                                               g\n    o /     \\             \\            /    \\       o\n    a|       |             \\          |      |      a\n    t|       `.             |         |       :     t\n    s`        |             |        \\|       |     s\n    e \\       | /       /  \\\\\\   --__ \\\\       :    e\n    x  \\      \\/   _--~~          ~--__| \\     |    x\n    *   \\      \\_-~                    ~-_\\    |    *\n    g    \\_     \\        _.--------.______\\|   |    g\n    o      \\     \\______// _ ___ _ (_(__&gt;  \\   |    o\n    a       \\   .  C ___)  ______ (_(____&gt;  |  /    a\n    t       /\\ |   C ____)/      \\ (_____&gt;  |_/     t\n    s      / /\\|   C_____)       |  (___&gt;   /  \\    s\n    e     |   (   _C_____)\\______/  // _/ /     \\   e\n    x     |    \\  |__   \\\\_________// (__/       |  x\n    *    | \\    \\____)   `----   --'             |  *\n    g    |  \\_          ___\\       /_          _/ | g\n    o   |              /    |     |  \\            | o\n    a   |             |    /       \\  \\           | a\n    t   |          / /    |         |  \\           |t\n    s   |         / /      \\__/\\___/    |          |s\n    e  |           /        |    |       |         |e\n    x  |          |         |    |       |         |x\n    * g o a t s e x * g o a t s e x * g o a t s e x *", "gilded": 0, "created_utc": "1266227801", "subreddit": "AskReddit", "score": 53, "controversiality": 0}
{"body": "Eat A Doughnut Good Breakfast Eating.\n\nedit: For those I've confused, it is a mnemonic device for remembering how to tune a guitar  (E A D G B E)", "gilded": 0, "created_utc": "1266238602", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "It's spelled w E I r d. I before E doesn't apply in this situation. ", "gilded": 0, "created_utc": "1266272518", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "*P L E A S E * stop posting crap about this retarded attention-whore.", "gilded": 0, "created_utc": "1266337278", "subreddit": "politics", "score": 7, "controversiality": 0}
{"body": "                                    ▲\n                                   ▲ ▲\n                                  ▲   ▲\n                                 ▲     ▲\n                                ▲       ▲ \n                               ▲         ▲ \n                              ▲           ▲\n                             ▲             ▲\n                            ▲               ▲\n                           ▲                 ▲\n                          ▲                   ▲\n                         ▲                     ▲\n                        ▲                       ▲\n                       ▲                         ▲\n                      ▲                           ▲\n                     ▲                             ▲\n                    ▲                               ▲\n                   ▲                                 ▲\n                  ▲                                   ▲\n                 ▲                                     ▲\n                ▲ F F F F F F F U U U U U U U U U U U U ▲\n               ▲                                         ▲\n              ▲                                           ▲\n             ▲                                             ▲\n            ▲                                               ▲\n           ▲                                                 ▲\n          ▲                                                   ▲\n         ▲                                                     ▲\n        ▲                                                       ▲\n       ▲                                                         ▲\n      ▲                                                           ▲\n     ▲                                                             ▲ \n    ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲ ▲", "gilded": 0, "created_utc": "1266359399", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I N S E C T S =\r\n\r\nI N C E S T + S in the bushes", "gilded": 0, "created_utc": "1266387380", "subreddit": "funny", "score": 7, "controversiality": 0}
{"body": "It's not going to change until the airlines' lobbyists change it. The only thing those lobbyists understand is the next quarterly financial report.\r\n\r\nS T O P   F L Y I N G.", "gilded": 0, "created_utc": "1266415915", "subreddit": "conspiracy", "score": 4, "controversiality": 0}
{"body": "I do appreciate you posting the other side to this but! Which is more uncomfortable: catching a glance of someone's boob or listening to her baby S C R E A M the entire time in line at Target?", "gilded": 0, "created_utc": "1266427324", "subreddit": "TwoXChromosomes", "score": 7, "controversiality": 0}
{"body": "there should NOT be a 3rd party that is responsible for ALL OF OUR CURRENCY... the federal reserve needs to be audited.. but that wont happen since it is a 3rd party enterprise that doesnt have to show its books to anyone. \n\nIt would be easy to find out who gets how much money and what the USA is really paying for if there was accountability for each and every dollar printed... we could track every single dollar... and find out that the government actively supports terrorism in almost every country out there... the CIA would be F U C K E D... \n\noh and Kennedy and Lincoln both were assasinated because they wanted to do away with the FED... this bill will not get far..", "gilded": 0, "created_utc": "1266511521", "subreddit": "Economics", "score": 1, "controversiality": 0}
{"body": " Suplex is not a real wrestling throw, it is a bastardization of the Greco Roman/Freestyle suplay. Spelled S U P L A Y", "gilded": 0, "created_utc": "1266522776", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Don't fucking call people kiddo on your dumbass whims. It's offensive. I'm not on reddit to be talked down to by some fuckwad who barely made it through their state university with their 70% acceptance rate and learned all they know about history from the history channel. How the fuck did you learn anything about Rome and Alexander (let alone Roman military haircuts and shaving) by watching ice road truckers? \r\n\r\n*You're* talking about the Roman Empire, and you're doing it *by mistake because you're ignorant*. The real conversation is abour Rome *in general* versus the influence of Alexander the great. You see that guy you replied to? He said \"Roman hair cuts\". You brought up the Roman empire. He didn't, you did. You did it because you're *I G N O R A N T* as to history. Congrats. Are we on the same page thus far? \r\n\r\nYou claimed that Romans had been influenced by Alexander the Great, at least in grooming techniques (god this a stupid argument anyway), which is fucking flat out wrong. ~100 years after his passing, he's in modern Pakistan/India at the end of his campaigns and you're claiming that he influenced Roman soliders, which he didn't. They took clues from their general which never lost. Alexander wasn't even on the same continent when this supposed influence took place. You want to say he influenced people East of Macedonia? Fine. I'll buy that (because at least that is true). This shit? This is nothing short of bullshit you're putting together in your head. \r\n\r\nNot only are you an ass, but you're blantantly ignorant as to history and trying to prove that you're right despite this massive ignorance. Just because it's on a fucking timeline doesn't mean he's the cause. Rome existed *before* Alexander, which is the *opposite* of your claim that you made . Roman soliders had short hair *before* Alexander, which is the opposite of your claim. And Roman soliders and citizens were influenced *be their own general* to shave which is *completely opposite of your claim*. How wrong do you need to be before you give up? ", "gilded": 0, "created_utc": "1266525458", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "My speak n spell skills are impeccable. \n\nI M A O D S N T T", "gilded": 0, "created_utc": "1266534008", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "In honor of Black history month and to show you respect (chortle), you are all a bunch of gold chain, big t-shirt, malt liquor drinking loud, nappy headed hoes/niggers (take your pick). As has been our tradition for hundreds of years, we, the normal people of Douchebagga Gamma Cool, would like to openly mock you for all of your unpalatable differences by pointing and laughing like epileptic baboons.\n\nThe truth is, we don't like you, the way you talk, look, or act.  You make us uncomfortable because you have chosen not to act like us, your betters, you know, white people.  We are the example of normalcy in this country, and your constant deviations from our approved behavior make us cringe collectively.  In fact, it is safe to say we live in fear of you.  \n\nWe would like to take this opportunity to hide behind the thinnest veneer of humor, in order to gleefully bash what our narrow world view considers your entire culture to be.  Remember, it isn't racism, it's humor....get it?\n\nNow, before you go calling us racist, remember, you have one of your big chain wearing nappy headed compatriots (hommies) in the White House now (notice, it's still the White House).  So quit your complaining because that obviously hailed the end of any latent discrimination that may have existed (most likely in your inferior minds). \n\nIn conclusion, we are happy about one thing, if they had to give you guys a month to celebrate your (chortle) history, at least they made it the shortest month of the year.  Still, we just can't pass up this opportunity to fill the void in our empty lives by pretending to be that which we obviously hate, you know, in order to show respect.  \n\nComment:  Also, blacks don't refer to it as a cookout, don't you know it's called a B B B B Bah Ba Q?\n ", "gilded": 0, "created_utc": "1266552322", "subreddit": "WTF", "score": 0, "controversiality": 0}
{"body": "Wonderful! Let me give this a whirl for you. I will over simplify the concepts for easy digestion.\n\n**C A R B O N  D A T I N G** : You know how if you leave a bowl of water out for too long, it evaporates? It doesn't truly disappear though.. it leaves a film on the side of the bowl correct? If you knew how much film was contained in a normal bowl of water before evaporation, you could measure this film and take a very good guess at how much water was there to begin with. This is similar to carbon dating. Over time atoms break down, in fact they dissolve in half. By measuring the half's, we can estimate the age of the atoms. So if you look at an atom, and it is 1/32nd in size of what it should be and I then tell you that it takes 7 years to divide in half, how old is it? Well, 1 divided by half is half, and it makes it 7 years old. Half divided by half is 1/4, and its 14 years old... until we see that it's 35 years old to get to 1/32nd. Guess what? You just carbon dated an atom, it's that simple!\n\n**T H E  B I G  B A N G** : We don't know!!!!! and guess what? That's ok! We don't know all of the answers right now, and we maybe never will, but the Earth is still very young, and the human race is still young as well. This very day there are scientists working on this, trying to figure it out. What we do know is that all of the galaxies and stars we can see.. are all traveling away from us! Then contained in each galaxy at the very center is probably a black hole.. which is a very massive ball of matter. Think about how the Earth uses gravity to pull you down onto it. Think if the Earth were squeezed smaller.. it would still have the same amount of matter, so it would have the same amount of gravity. But if you make the space it uses smaller, that means the gravity isn't spread out as much... so its more powerful. It would eventually get so powerful it would \"eat\" everything around it. It would smash you down to the ground, you would die, and you would become a part of it. That forms a black hole. Remember that atoms are made mostly of empty space, so if an electron were the size of a golf ball, then a proton would be in the next state over! They are that far apart! What we think is the universe might have started with a black hole... eating everything around it until it could not possibly hold anything else, then it burst.... forming what we see now. From that initial bang, things are still traveling at light speed. We think.... after awhile, it might collapse again...and the whole process starts again! The most important aspect of this, is to realize how insignificant we are. If you look up in the night sky, EVERY single place you can possibly look at.. contains a planet or star or galaxy. The reason the entire night sky is not lit up like a Christmas tree is because the light hasn't gotten to us yet. Light can only travel so fast.. it's the speed limit of the galaxy. Eventually though.. it will! If all the grains of sand in the world were a planet exactly like the Earth..... it still would not be equal to how many planets and stars there are. In 2003, astronomers picked an area of the sky that was black as black about the size of a thumbnail if you held your hand up. For 4 months they let the Hubble soak in all the available light it could... then they looked at the images, guess what they saw? There were hundreds of thousands of galaxies... not stars.. galaxies in that little small area! Unbelievable! (Hubble Deep Field)[http://en.wikipedia.org/wiki/Hubble_Ultra_Deep_Field]\n\n**L I F E**: Life slowly evolved because of the amazing elements we have around us. If you think of the life cycle of the Earth as a keyboard on a piano, humans have only been on the keyboard for the very last small part of the last white key. Life isn't anything crazy except the mixture of a few key elements and acids. The craziest thing is we have actually found the building blocks to life in meteors that have landed on Earth! [Meteorite contains complex compounds](http://www.cosmosmagazine.com/news/3313/extraterrestrial-organic-molecules-more-complex-earth)\n\n**E V O L U T I O N** : You know how you look like your mom and your dad or might have your \"grandfather's ears\"? Those things are passed down from generation to generation, these traits or characteristics are what evolution is derived from. When children of animals are born they contain characteristics of their parents. In the harsh world of the Animal Kingdom the parents that survive the longest have the most children. So, if you were a horse but all the food was high up in the trees, only your children that had long necks would be able to survive. Then of their children, whoever had the longest necks would have the best chance to survive. Unfortunately, if one of their children had a short neck, he probably wouldn't survive long enough to have children of his own. Eventually, short neck horses would disappear. Then eventually, you get a long necked horse... or what we call a Giraffe! Evolution is nothing more than life trying to survive. The animals that have the best traits will carry on and have children, that's why its called Survival of the Fittest. It's important to remember that species now... are much different than they used to be. Species don't \"jump\" from one to another, as much as just branch out to different types of the same \"father and mother.\" These are called common ancestors. They are the genetic turning of the roads, when one animal went one way.. and another went another way. Then each animal found the best way to survive. Then they passed on those traits to their children. Eventually... after thousands and thousands of generations, you have two very different animals.. but guess what? They have the same family history! This is how Darwin discovered Evolution. He went to a set of islands... and on these islands he found birds that were different from each other, but very similar. Then, after looking even closer .. he found that each bird was different based on the island it was on. One bird had a long beak, so it could reach inside of a plant further to eat, but the plant was only on that island. After studying them more, he understood... that at one point, a single type of bird went to each island.. and stayed there. After thousands of generations, it adapted to the place it landed so it could survive better. Nothing more. Have you ever seen a dog breeder mix two types of dog to get one that has traits from both, same concept. The thing is, you need to be very similar on the animal tree to have babies, so only certain dogs can breed with each other. The common housefly is the most evolved insect we think. Why? Because it only lives for about 24 hours, so it has hundreds of babies, evolves and dies, and has reached the best it can be in the shortest amount of time. If you examine a housefly, there is absolutely nothing on it that does not have a purpose. Everything it has is used to help it survive. Humans live for 50-100 years, so it's taking us quite a bit longer but we will get there.\n\n**M A N vs A P E** : The argument always comes up, \"I didn't evolve from some monkey!\" Of course you didn't! Don't be silly! Humans and apes are both creatures that exist at the same time. How could one evolve and the other not? It's not possible! Apes are very evolved creatures, and so are humans. Each of us evolved from the same ancestor though! While we went out looking for food in the plains, Apes were happy to hang out in the jungle. They evolved bigger muscles and bigger stomachs than us. The muscles because they need to hide in trees and stomachs because they eat plants every day and that requires them to eat much more than us to get the same amount of vitamins. Gorillas can eat up to 50 lbs of plants and insects a day! The easiest way for you to see evolution on your own body is to think of all of the \"extras\" on your body. Have you had your wisdom teeth removed? Have you had your appendix taken out? Well, eventually humans will not have these parts of the body.. because they are unneeded to survive and if we didn't have medicine those parts could lead the people to death. Then they would have no children, so eventually the \"appendix\" organ would disappear. But guess what? Gorillas do have an appendix.. and you know what they are for? They process all the chlorophyll of those 50lbs of plants!! We don't need wisdom teeth anymore either, all of our food is processed and easy to eat. The wisdom teeth are perfect for crushing bone though, and its what our ancestors came from long ago used them for. The important thing to remember is that we didn't come from Apes. Apes and Humans came from the same creature thousands and thousands of years ago. I bet if you asked a Gorilla where he came from, I bet he would say \"I didn't come from those dirty humans!, that's for sure.\" Have you ever seen a housefly that needs an appendix operation? No, because if their appendix burst, it would kill them, so they would never have babies. Eventually that bad \"gene\" would be gone forever. There isn't much use for evolution nowadays because humans have evolved so we can protect each other, heal each other, and take medicines to prevent diseases. Guess what though? Have you heard about the person that is immune to AIDs? Yes, they exist... and if the entire world was killed by the AIDs virus, he would survive and he would probably pass that immunity on to his children so they could survive, and their children and so on, and .... life would evolve and continue! That is all evolution is .. each creature trying to survive. [some are naturally immune to aids](http://www.cosmosmagazine.com/news/2389/why-some-people-are-immune-aids)", "gilded": 0, "created_utc": "1266557419", "subreddit": "science", "score": 4, "controversiality": 0}
{"body": "B A D A S S", "gilded": 0, "created_utc": "1266563260", "subreddit": "worldnews", "score": 2, "controversiality": 0}
{"body": "Ya, he was writing a book... Sounds like the therapist was planning on making some cash off of this poor guy. Type out: L O W L I F E.", "gilded": 0, "created_utc": "1266696602", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "\"The diamond that was stolen held the code that melted water into letters spelling where it had been taken to in fact I had a vision of the number corresponding with the letters T H E D I A M O N D\"", "gilded": 0, "created_utc": "1266697307", "subreddit": "Music", "score": 2, "controversiality": 0}
{"body": "Missing link: ** G O O G L E **", "gilded": 0, "created_utc": "1266756109", "subreddit": "programming", "score": 2, "controversiality": 0}
{"body": "GEE-AY-EM-EE-OH-OOOH-EE-ARR -- G A M E O OOH E R - GAME OOH GAME OOH GAME. ", "gilded": 0, "created_utc": "1266772828", "subreddit": "gaming", "score": 6, "controversiality": 0}
{"body": "Im a fool? Y O U  C A N N OT  F U C K I N G  R E A D.", "gilded": 0, "created_utc": "1266780668", "subreddit": "worldnews", "score": -1, "controversiality": 0}
{"body": " E u g e n i c s is the solution.\n\n", "gilded": 0, "created_utc": "1266784280", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "C O C A I N E", "gilded": 0, "created_utc": "1266803608", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt;I'd up up down down left right left right B A B Y it.\n\nFTFY.", "gilded": 0, "created_utc": "1266807681", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "I was fixing someone's computer and I needed his password for something. He's like, \"It's shotgun sixty three\", so I type in shotgun63, and it doesn't work. I try shotgunsixtythree, Shotgun63, etc etc etc until I guess really frustrated. I ask him exactly how he types it; \"S H O O T G U N 6 3\"", "gilded": 0, "created_utc": "1266812428", "subreddit": "AskReddit", "score": 18, "controversiality": 0}
{"body": "BLAME IT ON THE A A A A A ALCOHOL\n\nBLAME IT ON THE A A A A A A ALCOHOL\n\n...\n\nAnd to think, we have to pick wives from this cultural cesspool.", "gilded": 0, "created_utc": "1266814455", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "Fox really does mean the devil.\n\nIf you take numerology and spell out the alphabet from 1-9, you arrive at the name FOX and 666.\n\n    1 2 3 4 5 6 7 8 9 1 2 3 4 5 6 7 8 9 1 2 3 4 5 6 7 8 9\n    A B C D E F G H I J K L M N O P Q R S T U V W X Y Z\n  ", "gilded": 0, "created_utc": "1266847575", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "oh no.. he doesn't believe in E V O L U T I O N!!!!!!! I bet if he did everything.. i mean EVERYTHING WOULD CHANGE AND AMERICA WOULD BE GREAT AGAIN... WHY CAN'T EVERYONE BELIEVE IN EVOLUTION??? ", "gilded": 0, "created_utc": "1266856554", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "Have some of these for free from my side. Use them carefully.\n\nM M M m m m m m m m m m m m m\n\nP.S. - Let me know if you run out. I don't want to give away too many of these in public here for fear of misuse, but I can send some as an email attachment if you need it.", "gilded": 0, "created_utc": "1266863055", "subreddit": "circlejerk", "score": 11, "controversiality": 0}
{"body": "__T O O   F U C K I N G   L O N G !!__", "gilded": 0, "created_utc": "1266863288", "subreddit": "WTF", "score": -11, "controversiality": 0}
{"body": "A L L E G E D - Sodomizing Cop.   There is a difference. ", "gilded": 0, "created_utc": "1266864611", "subreddit": "reddit.com", "score": 10, "controversiality": 0}
{"body": "I did the a similar thing to myself at work. \n\nUsing keys from a couple old keyboards, my middle row spells \n\nr o b b y k i n g", "gilded": 0, "created_utc": "1266932010", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I have tried repeatedly to watch it, but literally every single time i switched to NBC's broadcast coverage, it has been a commercial break. I think that the MSNBC and CNBC has been marginally better with less commercials, but still S U C K S.", "gilded": 0, "created_utc": "1266948289", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "F R E A K Y", "gilded": 0, "created_utc": "1266976099", "subreddit": "relationship_advice", "score": 0, "controversiality": 0}
{"body": "NOT a unsurprising answer given the Agenda of the Communist Inspired E U S S R ", "gilded": 0, "created_utc": "1266999590", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "T H E   R E V O L U T I O N  W I L L  N O T  B E  T E L E V I S E D.", "gilded": 0, "created_utc": "1267023321", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "When people say \"defiantly\" instead of \"definitely.\"  I'm usually not anal about things like that, but I just can't ignore this one for some reason.  I mean, just sound it out.  D e f i n i t e l y.", "gilded": 0, "created_utc": "1267068472", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "See the [RSA Problem](http://en.wikipedia.org/wiki/RSA_problem). \n\nThe fourth paragraph gives some insight in to my original claim.\n\nMany people (including me) suspect that the RSA problem reduces to factoring. For example, there is a variant of RSA where n= q x q x p where we do have such a proof. Equally, computing square roots mod n reduces to factoring.\n\nIt does feel like there should be a proof but nobody has yet discovered it.", "gilded": 0, "created_utc": "1267086984", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "&gt;Seems like they worked pretty well to me. They may have not necessarily increased tax revenue but they were greatly positive for the economy in a myriad of other ways.\n\nThe first Reagan was structured in a way that forced 9 tax bills increasing taxes between '81 and the end of G H W B in '93.  The second big Reagan tax cut started what would become an avalanche of the top tax bracket tax rate, starting a cycle that became a nightmare to the lower and middle classes.\n\nIt also &lt;sarcasm&gt;greatly simplified&lt;/sarcasm&gt; the tax system.\nhttp://en.wikipedia.org/wiki/File:President_Reagan_meets_with_the_Press_1981.jpg", "gilded": 0, "created_utc": "1267104254", "subreddit": "Libertarian", "score": 0, "controversiality": 0}
{"body": "Start with a phrase:\n\nThe String class represents character strings. All string literals in Java programs, such as \"abc\", are implemented as instances of this class. \n\nPick a secret word: Furnaces\n\nPut it under headings (Lose the spaces):\n\n    F U R N A C E S\n    T h e S t r i n\n    g c l a s s r e\n    p r e s e n t s\n    c h a r a c t e\n    r s t r i n g s\n    A l l s t r i n\n    g l i t e r a l\n    s i n J a v a p\n    r o g r a m s s\n    u c h a s a b c\n    a r e i m p l e\n    m e n t e d a s\n    i n s t a n c e\n    s o f t h i s c\n    l a s s a s d f\n  \nNow alphabetize the cipher word to: \n\n    A C E F N R S U\n    t r i T s e n h\n    s s r g a l e c\n    e n t p s e s r\n    a c t c r a e h\n    i n g r r t s s\n    t r i a s l n l\n    e r a g t i l l\n    a v a s j n p i\n    a m s r r g s o\n    s a b u a h c c\n    m p l a i e e r\n    e d a m t n s e\n    a n c i t s e n\n    h i s s t f c o\n    a s d l s s f a\n\nNow take out the letters:\n\n    TRIT SENH\n    SSRG ALEC\n    ENTP SESR\n    ACTC RAEH\n    INGR RTSS\n    TRIA SLNL\n    ERAG TILL\n    AVAS JNPI\n    AMSR RGSO\n    SABU AHCC\n    MPLA IEER\n    EDAM TNSE\n    HISS TFCO\n    ASDL SSFA\n\nThe russians used to do this twice (with two different words) to encrypt messages. In the days before computers.", "gilded": 0, "created_utc": "1267118987", "subreddit": "programming", "score": 7, "controversiality": 0}
{"body": "I L O V E boobs.", "gilded": 0, "created_utc": "1267123170", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "So, what's the trick to get from Treasure to F U R N A C E S ?", "gilded": 0, "created_utc": "1267127891", "subreddit": "programming", "score": 2, "controversiality": 0}
{"body": "    T R E A S U R E\n    S A U T E R N E (R -&gt; N)\n    C E N T A U R S (E -&gt; C)\n    F U R N A C E S (T -&gt; F)\n\nDone!", "gilded": 0, "created_utc": "1267140388", "subreddit": "programming", "score": 2, "controversiality": 0}
{"body": "&gt; Both...strongly.\n\nDon't use u n n e c e s s a r y spaces.\n\nAlso, I bet you're rethinking your answer. :)", "gilded": 0, "created_utc": "1267156932", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "The W a s h i n g t o n  T i m e s\n\nI would trust my reputation on it.\n\n*this redditad sponsored by Sun Myung Moon and the worldwide Unification Church†.*", "gilded": 0, "created_utc": "1267157802", "subreddit": "conspiracies", "score": 1, "controversiality": 0}
{"body": "Volume of a pizza where the radius is 'z' and depth is 'a' = Pi x z x z x a . ", "gilded": 0, "created_utc": "1267199951", "subreddit": "science", "score": 4, "controversiality": 0}
{"body": "I can't wait for the closing ceremony. . .the water balloon fight is going to be A W E S O M E!", "gilded": 0, "created_utc": "1267204393", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "You are again thinking of the individual best case. It's like me telling you play the lotto. At $1 a day for 30 years you'll spend what ~$12,000. But if you win you'll win millions. You have to look at the probability of winning/losing.\n\nThere are 4 variables, p, n, c and C where p is the probability of you falling ill, n is the total population, c is the cost of screening and C the cost of treatment (surgery or whatever). So if n x c &lt;= p x n x C it makes sense otherwise it doesn't. From the link I provided it seems this equation only works for a few cases where prevention involves not smoking or eating less. ", "gilded": 0, "created_utc": "1267243771", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "    Trying 38.119.115.95...\n    Connected to rod.org.\n    Escape character is '^]'.\n                   W  E  L  C  O  M  E      T  O      T  H  E\n                                               _   __,----'~~~~~~~~~`-----.__\n                                        .  .    `//====-_             ___,-' `\n                        -.            \\_|// .   /||\\\\  `~~~~`---.___./\n                  ______-==.       _-~o~  \\/    |||  \\\\           _,'`\n            __,--'   ,=='||\\=_    /_--~/_-'|-   |`\\   \\\\        ,'\n         _-'      ,='    |  \\\\`.   '-'~7  /-   /  ||   `\\.     /\n       .'       ,'       |   \\\\ \\_    /  /-   /   ||      \\   /\n      / _____  /         |     \\\\.`-_/  /|- _/   ,||       \\ /\n     ,-'     `-|--'~~`--_ \\     `==-/  `| \\'--===-'       _/`\n               '         `-|      /|    )-'\\~'      _,--~'\n                           '-~~\\_/ |    |   `\\_   ,~             /\\\n                                /  \\     \\__   \\/~               `\\__\n                            _,-' _/'\\ ,-'~____-'`-/                 ``===\\\n                           ((-&gt;/'    \\|||' `.     ~`-/ ,                _||\n                                      \\_     ~\\      `^---|__i__i__\\--~'_/\n                                     __-^-_    `)  \\-.______________,-~'\n                                    //,-'~~`__--^-  |-------~~~~~'\n                                           //,--~~`-\\\n                    R E A L M S   O F    T H E     D R A G O N\n", "gilded": 0, "created_utc": "1267247842", "subreddit": "gaming", "score": 12, "controversiality": 0}
{"body": "From Richard Dawkins \"The God Delusion\":\n\n\"I'll end the chapter with a particular case study, which tellingly\nilluminates society's exaggerated respect for religion, over and\nabove ordinary human respect. The case flared up in February 2006\n- a ludicrous episode, which veered wildly between the extremes of\ncomedy and tragedy. The previous September, the Danish newspaper\nJyllands-Posten published twelve cartoons depicting the\nprophet Muhammad. Over the next three months, indignation was\ncarefully and systematically nurtured throughout the Islamic world\nby a small group of Muslims living in Denmark, led by two imams\nwho had been granted sanctuary there.12 In late 2005 these malevolent exiles travelled from Denmark to Egypt bearing a dossier,\nwhich was copied and circulated from there to the whole Islamic\nworld, including, importantly, Indonesia. The dossier contained\nfalsehoods about alleged maltreatment of Muslims in Denmark,\nand the tendentious lie that Jyllands-Posten was a government-run\nnewspaper. It also contained the twelve cartoons which, crucially,\nthe imams had supplemented with three additional images whose\norigin was mysterious but which certainly had no connection with\nDenmark. Unlike the original twelve, these three add-ons were\ngenuinely offensive - or would have been if they had, as the zealous\npropagandists alleged, depicted Muhammad. A particularly\ndamaging one of these three was not a cartoon at all but a faxed\nphotograph of a bearded man wearing a fake pig's snout held on\nwith elastic. It has subsequently turned out that this was an\nAssociated Press photograph of a Frenchman entered for a pigsquealing\ncontest at a country fair in France.13 The photograph had\nno connection whatsoever with the prophet Muhammad, no connection\nwith Islam, and no connection with Denmark. But the\nMuslim activists, on their mischief-stirring hike to Cairo, implied\nall three connections .. . with predictable results.\nThe carefully cultivated 'hurt' and 'offence' was brought to an\nexplosive head five months after the twelve cartoons were\noriginally published. Demonstrators in Pakistan and Indonesia\nburned Danish flags (where did they get them from?) and hysterical demands were made for the Danish government to apologize.\n(Apologize for what? They didn't draw the cartoons, or publish\nthem. Danes just live in a country with a free press, something that\npeople in many Islamic countries might have a hard time understanding.)\n\nNewspapers in Norway, Germany, France and even\nthe United States (but, conspicuously, not Britain) reprinted the\ncartoons in gestures of solidarity with Jyllands-Posten, which\nadded fuel to the flames. Embassies and consulates were trashed,\nDanish goods were boycotted, Danish citizens and, indeed,\nWesterners generally, were physically threatened; Christian\nchurches in Pakistan, with no Danish or European connections at\nall, were burned. Nine people were killed when Libyan rioters\nattacked and burned the Italian consulate in Benghazi. As\nGermaine Greer wrote, what these people really love and do best is\npandemonium.\n\nA bounty of $1 million was placed on the head of 'the Danish\ncartoonist' by a Pakistani imam - who was apparently unaware\nthat there were twelve different Danish cartoonists, and almost\ncertainly unaware that the three most offensive pictures had never\nappeared in Denmark at all (and, by the way, where was that\nmillion going to come from?). In Nigeria, Muslim protesters against\nthe Danish cartoons burned down several Christian churches, and\nused machetes to attack and kill (black Nigerian) Christians in the\nstreets. One Christian was put inside a rubber tyre, doused with\npetrol and set alight. Demonstrators were photographed in Britain\nbearing banners saying 'Slay those who insult Islam', 'Butcher those\nwho mock Islam', 'Europe you will pay: Demolition is on its way'\nand, apparently without irony, 'Behead those who say Islam is a\nviolent religion'.\n\nIn the aftermath of all this, the journalist Andrew Mueller interviewed\nBritain's leading 'moderate' Muslim, Sir Iqbal Sacranie.15\nModerate he may be by today's Islamic standards, but in Andrew\nMueller's account he still stands by the remark he made when\nSalman Rushdie was condemned to death for writing a novel:\n'Death is perhaps too easy for him' - a remark that sets him in ignominious contrast to his courageous predecessor as Britain's most\ninfluential Muslim, the late Dr Zaki Badawi, who offered Salman\nRushdie sanctuary in his own home. Sacranie told Mueller how concerned he was about the Danish cartoons. Mueller was concerned\ntoo, but for a different reason: 'I am concerned that the\nridiculous, disproportionate reaction to some unfunny sketches in an\nobscure Scandinavian newspaper may confirm t h a t . . . Islam and the\nwest are fundamentally irreconcilable.' Sacranie, on the other hand,\npraised British newspapers for not reprinting the cartoons, to which\nMueller voiced the suspicion of most of the nation that 'the restraint\nof British newspapers derived less from sensitivity to Muslim discontent\nthan it did from a desire not to have their windows broken'.\nSacranie explained that 'The person of the Prophet, peace be\nupon him, is revered so profoundly in the Muslim world, with a\nlove and affection that cannot be explained in words. It goes\nbeyond your parents, your loved ones, your children. That is part\nof the faith. There is also an Islamic teaching that one does not\ndepict the Prophet.' This rather assumes, as Mueller observed,\n\n*that the values of Islam trump anyone else's - which is\nwhat any follower of Islam does assume, just as any\nfollower of any religion believes that theirs is the sole way,\ntruth and light. If people wish to love a 7th century\npreacher more than their own families, that's up to them,\nbut nobody else is obliged to take it seriously . ..*\n\n\nExcept that if you don't take it seriously and accord it proper\nrespect you are physically threatened, on a scale that no other\nreligion has aspired to since the Middle Ages. One can't help\nwondering why such violence is necessary, given that, as Mueller\nnotes: 'If any of you clowns are right about anything, the\ncartoonists are going to hell anyway - won't that do? In the meantime,\nif you want to get excited about affronts to Muslims, read the\nAmnesty International reports on Syria and Saudi Arabia.'\nMany people have noted the contrast between the hysterical\n'hurt' professed by Muslims and the readiness with which Arab\nmedia publish stereotypical anti-Jewish cartoons. At a demonstration\nin Pakistan against the Danish cartoons, a woman in a\nblack burka was photographed carrying a banner reading 'God\nBless Hitler'.\n\nIn response to all this frenzied pandemonium, decent liberal newspapers deplored the violence and made token noises about free\nspeech. But at the same time they expressed 'respect' and\n'sympathy' for the deep 'offence' and 'hurt' that Muslims had\n'suffered'. The 'hurt' and 'suffering' consisted, remember, not in\nany person enduring violence or real pain of any kind: nothing\nmore than a few daubs of printing ink in a newspaper that nobody\noutside Denmark would ever have heard of but for a deliberate\ncampaign of incitement to mayhem.\n\nI am not in favour of offending or hurting anyone just for the\nsake of it. But I am intrigued and mystified by the disproportionate\nprivileging of religion in our otherwise secular societies. All\npoliticians must get used to disrespectful cartoons of their faces,\nand nobody riots in their defence. What is so special about religion\nthat we grant it such uniquely privileged respect? As H. L. Mencken\nsaid: 'We must respect the other fellow's religion, but only in the\nsense and to the extent that we respect his theory that his wife is\nbeautiful and his children smart.'", "gilded": 0, "created_utc": "1267268020", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "That to calculate the volume of a rectangular prism, you have to multiply L x W x H. If you reorder the numbers you will not get the same answer.\n\n!!!", "gilded": 0, "created_utc": "1267281371", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Back away from the TV.  It is VEEERRRRRYYYYYYYYYYY unlikely that any activity in CA is in anyway related to large ones that far away.  Sure as shit, they are not related to anything in NJ, as mentioned below. \nc o i n c i d e n c e", "gilded": 0, "created_utc": "1267286713", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "A B C D E F G H I K L M N O P Q R S T V X Y Z\r\n\r\n20th actually...\r\n\r\nV doubles and triples as U and W, I stands in place of J", "gilded": 0, "created_utc": "1267299986", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "L i N K B A i T", "gilded": 0, "created_utc": "1267301389", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "might seem trivial in my mid 30's but my firstgrade teacher was teaching us the vowels she had a story ....\n\nA daughter and mother were making some cookies one day and they needed soem sugar so they bowered a cup from the neighbor. The next day the little girl who had trouble talking right cause of her braces returned the sugar. She rang the door bell when the lady answered she said \"Ladie I owe you some sugar\", unfortunetly because of her braces it came ou A E I O U sugar. Mrs. Hazlewood told me I would never forget that story she was right.\n", "gilded": 0, "created_utc": "1267306482", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "During a physics exam at high school a classmate of mine asked the teacher what were the answers from the multiple choice exam (he was joking of course). \nThe teacher with a joker face replied: É DA CABEÇA DE CADA (portuguese, which means in English, IT'S FROM EACH ONE'S HEAD (THE ANSWERS). \n\nNo one Im my class realized that the answers from the exam were: \nE D A C A B E C A D E C A D A \n\nHe really got us that day....... ", "gilded": 0, "created_utc": "1267317378", "subreddit": "AskReddit", "score": 157, "controversiality": 0}
{"body": "Got copy of final, completed test at home, copied answers to a 4x6 note sheet (allowed for actual notes), test was different but I was able to used it to win.\n\nBack in High School, the \"final\" for science class was 3 days away and we were told we would be allowed a 4x6 one sided index card of notes to assist us during the test.\n\nA chick I knew a few grads up was a teachers assist at the time, she gave me a copy of the test. That night I completed the test using the textbook for reference. The following night I took the sheet of notes I had previously prepared and adjusted it so that I had 136 or so lines, which was equal to the number of questions on the test. Since the test was multiple choice, at the end of each line I put either a ! ^ * , or . corresponding to a b c d e.\n\nThe day of the test, the teacher and the principle made an announcement that it was believe several students broke into the teachers office and stole a copy of the test. They were not caught, but because of this, the test was changed. Of course I panicked initially, then thanks to gossip in the room found out the actual thieves were in a class that morning.\n\nWhen i got the test, I found that they made 2 changes, they took the last 15 or so questions and moved them to the front of the test, and they changed the order of the multiple choice by offsetting each one 2 spaces (a was now c, b was now d, etc.) I recognized this because I actually completed the test a few nights ago.\n\nIn the end, I only needed my notes for a handful of questions I couldn't remember the answer to (go go short term memory) and with those, I was able to figure out the correct answer off of my \"notes\". I think I purposely missed 3 or 4 just to not get the 100%.\n\nA few days later, the 3 kids that stole the test were caught and suspended, I got an A.", "gilded": 0, "created_utc": "1267321594", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "No. Harmonic rhythm is how long you stay on specific chords, and the exact time you change those chords. If you change the chord every half note, that's the harmonic rhythm. (It doesn't matter whether you're playing eighth notes or sixteenth notes on top of the chord; it's all about when the actual chord changes)\n\nPlay these two chord progressions over and over again. If you have to, transpose one of these progressions with a capo (if you play guitar) or with your keyboard's transpose function (if you have a decent midi keyboard), so your head can readjust to a new key. Play each chord once per beat:\n\nC C C C D D G G\n\nG G G G C C D D\n\nThe chords are the same, but the first one feels like it's in the key of C, and the second one feels like it's in the key of G. Why? Harmonic rhythm. Harmonic rhythm is the most important factor in establishing a key.", "gilded": 0, "created_utc": "1267329517", "subreddit": "Learnmusic", "score": 2, "controversiality": 0}
