{"body": " Look closely, closer L O S E R.\n\nToo bad Reddit allows uneducated teenagers to sign up.", "gilded": 0, "created_utc": "1192639901", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "What's next, letterspacing the caps?\nN O   I   R E A L L Y   M E A N   I T ! ! !", "gilded": 0, "created_utc": "1193179183", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "I've always wondered if having (){}[]&lt;&gt; on the home row as a \"chordic\" combination with a keyboard specific function key would be of any advantage for programmers. \n \nAlso I would lay those out like\n\n&lt; { ( [  ] ) } &gt;  \"under\" the home row keys A S D F  J K L :  ( in QWERTY)  ", "gilded": 0, "created_utc": "1193233097", "subreddit": "programming", "score": 9, "controversiality": 0}
{"body": "1)  Not all Christians are doing this.  In fact, a small but vocal proportion of them are.  Go to many churches and ask someone and you'll hear a lot of differing opinions.  You're stereotyping in a very big way.\n\n2) Again, only a large vocal majority.  Most catholics I talk to who are devout to their faith detest the clergy's decision to condemn birth control.  \n\n3) And yet again, you're stereotyping.  The \"true\" christians get into shouting matches and sometimes fights with the cross wielding fag shouting assholes on the street.  If Dawkins ran off and started to condemn Asia for whatever reason(Mad cow strikes again), that wouldn't(or shouldn't) affect what atheism is, only what kind of a person Dawkins is.\n\n4) Read above\n\n5) Here's an interesting one.  I don't know how you tied that into a religious problem, because it certainly isn't.  That's mostly a D v R issue, not a religiously centric one.  \n\n6) Only the good ones with a lot of time, just like atheists.  \n\nYou're justification for treating Christianity like you do is exactly like people's justifications for hating Islam, Muslims, and brown people.  There are several hundred bad ones who you hear about all the time, so by that logic(availability heuristic ), everyone like them is the same way.  It's a bunk argument, and it doesn't matter what it's being applied toward - it's still bad.", "gilded": 0, "created_utc": "1193859632", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
