{"body": "F#: A type system horribly misunderstood\n\nIt all boils down to this: there are no conversions in the ML-languages. If you want a coercion you must write a function mediating the embedding *and* you must use that function explicitly.\n\nAlso, `'a option` is not `null`. The first function can be factored as:\n\n    let maybe f e = function None -&gt; e | Some x -&gt; f x\n\n    let together f e m n = maybe (fun x -&gt; maybe (f x) e m) e n\n\n    let foo = together (+) 0\n\nso there is more algebraic structure to an `option` that a simple `null`able value provides.\n\n*Edit:* If `together` looks ungainly, it is because it is the result of unrolling `foldr` for lists of length at most 2:\n\n    let join m n = match m, n with\n    | None, None -&gt; []\n    | Some x, None\n    | None, Some x -&gt; [x]\n    | Some x, Some y -&gt; [x; y]\n\n    let foo m n = fold_right (+) (join m n) 0", "gilded": 0, "created_utc": "1244143850", "subreddit": "programming", "score": 2, "controversiality": 0}
{"body": "aaaa b d ee g h iiiii l m n o r ss tt w z", "gilded": 0, "created_utc": "1244213018", "subreddit": "programming", "score": 3, "controversiality": 0}
{"body": "L A W S U I T.", "gilded": 0, "created_utc": "1244337056", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "L A W S U I T.", "gilded": 0, "created_utc": "1244337084", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "W H Y . A R E . W E . S H O U T I N G,  S L O W L Y ?", "gilded": 0, "created_utc": "1244337775", "subreddit": "WTF", "score": 15, "controversiality": 0}
{"body": "hiragana/katakana symbols are syllables, either a vowel by itself or a consonant plus a vowel. The only consonant that stands on its own is n.  There are only 5 vowels similar to the spanish a i u e o.  The consonants that can start each hiragana character are: k, s (or sh with i as in \"shi\"), t (or ch or ts as in \"chi\" and \"tsu\"), n, h (or f as in \"fu\"), m, y (but only with a, u, or o), r (which is actually not an r), w (more or less only with a as in \"wa\"), g, z (or j as in \"ji\"), d, b, p, and optionally v for foreign words.  There are also combinations of the characters that give you sounds such as changing \"ki\" to \"kya\" \"kyu\" and \"kyo.\" That same think gets you \"ja\" \"ju\" and \"jo\" from \"ji\" so I'll add that to the list of consonants.\n\nSo, if Japanese used a version of our alphabet, (which they don't really) it would probably be: a b d e g h i j k m n o p r s t u v w z\n\nSo, it actually has fewer letter (equivalents) to start with, but then it doesn't have as many variations of those sounds (we use the same letters for lots of different sounds in English, especially vowels) no to mention all the sounds we get when we combine letters from the alphabet (like \"th\" for one).\n\nThen you have the ways that Japanese can actually use those letters, only in the listed ways... k only with a i u e o after it, or kya, kyu, or kyo.\n\nFor this reason, when Japanese borrow words from other languages (e.g. English) it usually has to be drastically modified to become Japanese.  A word ending in a 'k' sound for example has to be changed to 'ku' for instance.  New York is nyu- yo-ku. (the dash indicates a vowel held for a longer period of time than usual).  Not sure why they went with nyu- instead of nu-. Also they left out the \"r\" sound in yo-ku. Maybe they were copying a native New Yorker.", "gilded": 0, "created_utc": "1244346421", "subreddit": "reddit.com", "score": 15, "controversiality": 0}
{"body": "U N B E L I E V A B L E", "gilded": 0, "created_utc": "1244362458", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Now - please stay A W A Y from what is love - just leave it... coooome on buuuudddy ... u can do it....", "gilded": 0, "created_utc": "1244414421", "subreddit": "WeAreTheMusicMakers", "score": 0, "controversiality": 0}
{"body": "No idea, sorry. \n\nMercurial man mentioned \"DrunkenAsshole\" the other day. Not sure if he got totally banned.\n\nGetting totally banned was very difficult. On a positive side, Reddit now looks for and filters tinyurl links that redirect to h t t p : / / n i g g e r s. o n . n i m p . o r g / \n\nThis is a good thing.\n\nPlus I think they also fixed up that multiple-post bug which innocent people could accidentally do if they clicked on the \"comment\" button too many times.\n", "gilded": 0, "created_utc": "1244442657", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Hails to my brothers and sisters of the United Atheist League, on our quest of the destruction of religion through the non-violent means of ridicule and contempt for the poison that infects our world.\n\nThe United Atheist Alliance, on /r/atheism/, feels that we are too extreme. Where they use logic to uplift those out of their religious dogma, our goal is quite different: to ridicule and marginalize those who are unable to relieve themselves of a position by logic that they did not get themselves into by logic.\n\nThe UAL will prevail! Our plan is quite simple:\n\nStep 1: Wait for hardcore religious people to die out...\n\nStep 2: ????\n\nStep 3: PROFIT!\n\nThrough simple generation replacement, and a staunch look at those who destroy our world, we will rub their disgust into their faces and laugh at their demise, for we are the\n\nU N I T E D\nA T H E I S T\nL E A G U E\n\n(and yes this is satire)", "gilded": 0, "created_utc": "1244543061", "subreddit": "antitheist", "score": 1, "controversiality": 0}
{"body": "Hails to my brothers and sisters of the Unifed Atheist League, on our quest of the destruction of religion through the non-violent means of ridicule and contempt for the poison that infects our world.\n\nThe United Atheist Alliance, on /r/atheism/, feels that we are too extreme. Where they use logic to uplift those out of their religious dogma, our goal is quite different: to ridicule and marginalize those who are unable to relieve themselves of a position by logic that they did not get themselves into by logic.  The UAL will prevail! Our plan is quite simple:\n\nStep 1: Wait for hardcore religious people to die out...\n\nStep 2: ????\n\nStep 3: PROFIT!\n\nThrough simple generation replacement, and a staunch look at those who destroy our world, we will rub their disgust into their faces and laugh at their demise, for we are the\n\nU N I F E D\n\nA T H E I S T\n\nL E A G U E\n\n(and yes this is satire)", "gilded": 0, "created_utc": "1244543815", "subreddit": "antitheist", "score": 1, "controversiality": 0}
{"body": "Why ? Is t h e r e something wr on g with that ??", "gilded": 0, "created_utc": "1244572460", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "The only thing that could have been better (maybe) was N OO N N o O OOO O", "gilded": 0, "created_utc": "1244582920", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "P O L I C E  S T A T E ", "gilded": 0, "created_utc": "1244661224", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Ahem, right, honey - do you mind if I call you \"honey\" ? Ok, first question... umm, let me see...[ clicks a firefox tab on his laptop ]... umm, right, first question [ flashes a lame smile at the g i r l ] is : Do you know any good pick up lines ?", "gilded": 0, "created_utc": "1244665430", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "She spells it correctly. B A N A N A", "gilded": 0, "created_utc": "1244743650", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Well if they'd quit typing F U N D all the time...", "gilded": 0, "created_utc": "1244840519", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Wow. Would you like a tissue to wipe away that tear little girl?\n\nYou're an ignorant twit spreading ignorance. I was trying to nicely point that out but you clearly don't understand it unless it's spelled out for you.\n\nY O U A R E A N I D I O T\n\nClear?", "gilded": 0, "created_utc": "1244847851", "subreddit": "science", "score": 3, "controversiality": 0}
{"body": "I actually liked the comment from the vocal cords guy, because he goes on to say \"She dodged every question and brought up the same points over and over again.\" which is what Bill did. The whole time. In fact the only one that showed any zealotry WAS bill. I can only assume that guy got the two mixed up and therefore means he wishes Bill's vocal cords would be ripped out and burned in front of him, which would be A W E S O M E. Put that on youtube see how many hits it gets. Right after Ann Coulter.", "gilded": 0, "created_utc": "1244865262", "subreddit": "politics", "score": 14, "controversiality": 0}
{"body": "S P A A A A M\n\nIt's all ads\n", "gilded": 0, "created_utc": "1244884441", "subreddit": "Amateur", "score": 1, "controversiality": 0}
{"body": "Awww ya.\n\njailbait_on_reddit and karmanaut sitting in a tree.\n\nK I S S I N Me.\n\nFirst come doves. Then comes the carriage.  Then comes the horsemen to destroy your marriage!", "gilded": 0, "created_utc": "1244951853", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "**P R O P A G A N D A**\n\nsmells like this", "gilded": 0, "created_utc": "1244960886", "subreddit": "worldnews", "score": -4, "controversiality": 0}
{"body": "In alphabetical order: A A A F F F P P P ", "gilded": 0, "created_utc": "1245106732", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "My jibe was aimed at the line of argument \"I know one paradigm, I don't quite know how or whether the other paradigm helps, therefor the latter is awkward.\" by reversing the common situation and using FP as the known paradigm and using C as the other one.\n\nSo, whether they do in fact have warts or not was not strictly part of my argument. (Though I do have a strong preference there, otherwise I would have agreed with the OP.)\n\nFor completeness, though, here the corresponding code in Haskell\n\n    convolute xs = zipWith3 f xs (drop 1 xs) (drop 2 xs) \n        where f a b c = 1/4 * (a+2*b+c)\n\nBoth the issue of using new values where old ones are required and the off-by-one error are absent by default.", "gilded": 0, "created_utc": "1245158614", "subreddit": "programming", "score": 12, "controversiality": 0}
{"body": "D A I L Y  F A I L", "gilded": 0, "created_utc": "1245160025", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "the E N R O N equations always end in your power bill increasing in size in direct relation to the size of Ken Lay's contributions to W. Bush (his biggest donor) ", "gilded": 0, "created_utc": "1245166699", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "So maybe they can just keep typing F U N D S until they are out of debt?", "gilded": 0, "created_utc": "1245172347", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "What about on Orange Map?\n\nI've gotten kicked from Orange Map for jumping in to spawn and blasting their teleporters.\n\nOh, and then hiding in the corner and killing people as they come in to play ... so maybe that was the bad thing ... but I was only an ickle scout ... how bad could it be ...\n\n\"Orange map\" is the one with the big tower in the middle that lasts f o r e v e r . . .", "gilded": 0, "created_utc": "1245259346", "subreddit": "tf2", "score": 1, "controversiality": 0}
{"body": "Really if you think about (in the limited way that I manage to think about things), if your body dies and your sentience lives on, you didn't really die did you? You don't die if you lose your hand. You don't even die if you lose both your legs. So if your entire body dies and lets say you manage to somehow transfer your conscience into a computer or some other type of technological miracle, I would say that you haven't died. Especially if you transfer it to some type of robot/computer with giant chainsaw hands and rocket boosters. That's l i v i n g.", "gilded": 0, "created_utc": "1245260203", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Health care in this country went down the toilet in the 70s after that fucker Nixon and  Edgar Kaiser conspired to impose health insurance on the country by making health care and hospital care \"for profit.\"\n\nThe insurance industry has infested health care  and the result is a bloated, over costly system that simply fails to deliver quality health care to those who need it.  Obscenely high premiums, rescissions of policies issued to those who become ill;  denials of coverage for necessary treatments;  constant intervention between doctor and patient--all of these factors have contributed to the obscenely high profits of \"health\" insurers;  bloated executive salaries; the proliferation of low/mid level clerical paper pushing jobs designed to thwart the provision of medical care, bla bla bla.  The net result is we have the most costly, but not the best health care in the world and a huge proportion of American citizens simply haven't got the means to survive, should they fall ill.\n\nThe bankruptcy laws have been perverted to thwart the ability of the average person to seek relief as originally was intended by them and the first Bush administration saw the abolition of laws against usury, one of the oldest prohibitions on the book. \n\nWages have stagnated for the last forty 40!!! years and have been \"supplemented\" with easily available, but usurious credit.\n\nThe creation of a so-called \"global\" economy without a global labor structure has served to propel workers throughout the world toward slavery.\n\nThe result of all of this has been the indenturing of the American worker.  Paid barely enough to survive, if that;  frozen out of adequate housing by inadequate remuneration;  denied even basic health care because of cost. . .\n\nAs Americans careen toward complete disenfranchisement, homelessness, bankruptcy, starvation and ultimately, confinement in any of the Rex-84 \"interment\" camps or those being build on military bases as we speak (confining American civilians in camps located on military bases removes those pesky constitutional protections we all thought we enjoyed -- you're subject to military law whilst on military grounds) banks, insurance companies and defense contractors continue to enjoy bloated profits and stupidly high executive salaries.\n\nSoon, Americans will join the rest of humanity who live in impoverished, fourth world conditions, while a tiny oligarchy continues to own 99.99% of everything on the face of the earth.\n\nSo why provide health care to slaves?  There's no need.  Soon all of us will be grateful for room and board to \"compensate\" us for our toils.  Should one become ill, oh well.\n\nOnce it is understood that the insurance industry's stranglehold on health care is deliberate and all part of an overall pattern of turning the entire world and everything in it over to the 15 international banking families on Earth, the \"health for profit\" motive becomes quite clear.\n\nMoreover, President Stepnfetchit is never going to succeed in enacting even a second cousin once removed of a \"public option\" much less, the single payer model (taxpayer money administrated by a government agency) -- a model that has served all civilized nations who do use tax contributions to provide health care for its citizens.  Instead, Americans will be treated to legislation that REQUIRES them to purchase health insurance from private insurers.  Of course, that legislation will impose NO restraints on premiums, coverage conditions, elimination of pre-existing condition exclusions;  rescissions, and the result will be that people who currently cannot afford health insurance will be forced to buy it anyway, or run afoul of the law.\n\nNext up:  the return of debtors prisons.\n\nUnless the American people expel EVERY SINGLE PERSON presently in government (all branches) and start again;  proscribe CONSECUTIVE terms of office;  and outlaw lobbying, legislation that draws a bright line between actual \"speech\" and \"monetary contributions,\"  repeal the Patriot Act, the Bankruptcy Act of 2001;  FISA, restore the constitution and the rule of law, everyone whose bank account doesn't end in \"illion\" will become a S L A V E.\n\nFor those interested, here is a transcript of the Nixon/Kaiser business...there is much more information available)\n\nThis is a transcript of the 1971 conversation between President Richard Nixon and John D. Ehrlichman that led to the HMO act of 1973:\n\nJohn D. Ehrlichman: “On the … on the health business …”\n\nPresident Nixon: “Yeah.”\n\nEhrlichman: “… we have now narrowed down the vice president’s problems on this thing to one issue and that is whether we should include these health maintenance organizations like Edgar Kaiser’s Permanente thing. The vice president just cannot see it. We tried 15 ways from Friday to explain it to him and then help him to understand it. He finally says, ‘Well, I don’t think they’ll work, but if the President thinks it’s a good idea, I’ll support him a hundred percent.’”\n\nPresident Nixon: “Well, what’s … what’s the judgment?”\n\nEhrlichman: “Well, everybody else’s judgment very strongly is that we go with it.”\n\nPresident Nixon: “All right.”\n\nEhrlichman: “And, uh, uh, he’s the one holdout that we have in the whole office.”\n\nPresident Nixon: “Say that I … I … I’d tell him I have doubts about it, but I think that it’s, uh, now let me ask you, now you give me your judgment. You know I’m not to keen on any of these damn medical programs.”\n\nEhrlichman: “This, uh, let me, let me tell you how I am …”\n\nPresident Nixon: [Unclear.]\n\nEhrlichman: “This … this is a …”\n\nPresident Nixon: “I don’t [unclear] …”\n\nEhrlichman: “… private enterprise one.”\n\nPresident Nixon: “Well, that appeals to me.”\n\nEhrlichman: “Edgar Kaiser is running his Permanente deal for profit. And the reason that he can … the reason he can do it … I had Edgar Kaiser come in … talk to me about this and I went into it in some depth. All the incentives are toward less medical care, because …”\n\nPresident Nixon: [Unclear.]\n\nEhrlichman: “… the less care they give them, the more money they make.”\n\nPresident Nixon: “Fine.” [Unclear.]\n\nEhrlichman: [Unclear] “… and the incentives run the right way.”\n\nPresident Nixon: “Not bad.”\nposted by: ", "gilded": 0, "created_utc": "1245267728", "subreddit": "politics", "score": 38, "controversiality": 0}
{"body": "L O S E R S !", "gilded": 0, "created_utc": "1245270284", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Linux doesn't freeze/hard-lock often, but you can usually do a clean reboot even when Ctrl+Alt+Backspace doesn't work by holding Alt Gr + Sys Rq and typing R E I S U B.", "gilded": 0, "created_utc": "1245319308", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "G A T T A C A\n\nhttp://www.youtube.com/watch?v=o7OYCmynrRU\n\nEDIT: The trailer is misleading, so heres the entire film: http://www.youtube.com/watch?v=N6zvCmQAHQc&amp;feature=PlayList&amp;p=2CE35AE525F31EF4&amp;index=0", "gilded": 0, "created_utc": "1245336845", "subreddit": "AskReddit", "score": 69, "controversiality": 0}
{"body": "SHE ... IS .... A W E S O M E !", "gilded": 0, "created_utc": "1245411323", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "I guess that is funnier than trying to cash in on small prizes he offered for problem solutions by plagiarising a solution but being first to present... but r d r r either way", "gilded": 0, "created_utc": "1245417837", "subreddit": "math", "score": 4, "controversiality": 0}
{"body": "ohhh F I L E S, i kept looking at the images saying, i don't see any flies anywhere", "gilded": 0, "created_utc": "1245450630", "subreddit": "programming", "score": 0, "controversiality": 0}
{"body": "HEY GUYS...I'M *S A M A R A.. \r\n\r\nI have a great personality that you will appreciate \r\n\r\nI make sure my gentlemen are *Comfortable and *Relaxed &amp;&amp;...... \r\n\r\n★ SATISFACTION IS A MUST WITH ME★ \r\n\r\nDON'T YOU JUST LOVE GOOD PARTY GIRL THAT DOES A BODY GOOD\r\n\r\nS A M A R A 347..658..4775**(incalls and outcalls available) \r\n\r\n100 15min**\r\n150 30min**\r\n200 1hour**\r\n\r\nYou are NEVER RUSHED and there will be NO DRAMA!!! ", "gilded": 0, "created_utc": "1245543067", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "K I L L  Y O U R S E L F", "gilded": 0, "created_utc": "1245595104", "subreddit": "AskReddit", "score": -5, "controversiality": 0}
{"body": "Yeah, this isn't a hack. It's just doing what the client is doing except much faster... \nI'd call it \"gaming\" the app.\n\nI guess that you could just move all the letters \"off the screen\" by shifting them to `(10000,10000)` (I'm presuming there's no bounds checking), then shift `R E D D I T` to some appropriate coördinates.\n", "gilded": 0, "created_utc": "1245629549", "subreddit": "AskReddit", "score": 11, "controversiality": 0}
{"body": "&gt; I've wasted three days that I was supposed to be studying. \n\n&gt; What do you think would be better for me to concentrate on, AskReddit? \n\nS T U D Y I N G ", "gilded": 0, "created_utc": "1245670609", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "p h o t o s h o p", "gilded": 0, "created_utc": "1245673692", "subreddit": "NSFW_nospam", "score": 2, "controversiality": 0}
{"body": "ZOMG if the government provides health care then that means, cue evil music, T A X I N C R E A S E S ! ! ! ! ! !\n\nUh, well won't that just mean I won't have to pay a private health care company the exact amount or more that I would pay inversely to a public health care plan?", "gilded": 0, "created_utc": "1245699526", "subreddit": "business", "score": 0, "controversiality": 0}
{"body": "    * g o a t s e x * g o a t s e x * g o a t s e x *\n    g                                               g  \n    o /     \\             \\            /    \\       o\n    a|       |             \\          |      |      a\n    t|       `.             |         |       :     t\n    s`        |             |        \\|       |     s\n    e \\       | /       /  \\\\\\   --__ \\\\       :    e\n    x  \\      \\/   _--~~          ~--__| \\     |    x  \n    *   \\      \\_-~                    ~-_\\    |    *\n    g    \\_     \\        _.--------.______\\|   |    g\n    o      \\     \\______// _ ___ _ (_(__&gt;  \\   |    o\n    a       \\   .  C ___)  ______ (_(____&gt;  |  /    a\n    t       /\\ |   C ____)/      \\ (_____&gt;  |_/     t\n    s      / /\\|   C_____)       |  (___&gt;   /  \\    s\n    e     |   (   _C_____)\\______/  // _/ /     \\   e\n    x     |    \\  |__   \\\\_________// (__/       |  x\n    *    | \\    \\____)   `----   --'             |  *\n    g    |  \\_          ___\\       /_          _/ | g\n    o   |              /    |     |  \\            | o\n    a   |             |    /       \\  \\           | a\n    t   |          / /    |         |  \\           |t\n    s   |         / /      \\__/\\___/    |          |s\n    e  |           /        |    |       |         |e\n    x  |          |         |    |       |         |x\n    * g o a t s e x * g o a t s e x * g o a t s e x *", "gilded": 0, "created_utc": "1245800897", "subreddit": "pics", "score": 30, "controversiality": 0}
{"body": "F A T A L I T Y", "gilded": 0, "created_utc": "1245821655", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "[R E P T I L E W I N S](http://www.youtube.com/watch?v=wdzzahupPh8&amp;feature=related)", "gilded": 0, "created_utc": "1245831273", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "F R A C A S A R", "gilded": 0, "created_utc": "1245835795", "subreddit": "WTF", "score": 6, "controversiality": 0}
{"body": "E P Ä O N N I S T U M I N E N", "gilded": 0, "created_utc": "1245837092", "subreddit": "WTF", "score": 8, "controversiality": 0}
{"body": "blame it on the a a a a a a alcohol\n\ng'night", "gilded": 0, "created_utc": "1245845360", "subreddit": "WTF", "score": 4, "controversiality": 0}
{"body": "it would be great for you to post a video of your next trip to a protest to keep those cops in line. we are all dying to see you defend innocent 1st amendment wielding ladies when the cops man handle them. yeah.... i didn't think you had it in you p u s s y", "gilded": 0, "created_utc": "1245884295", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Realize chords are produced from the scale in which they reside, for example...\n\n    C scale: C, D, E, F, G, A, B\n\n    C major             :  x32010  ::  xCEGCE\n    C 5 (barred chord)  :  x355xx  ::  xCGCxx\n    C major barred      :  x35553  ::  xCGCEG\n\nHere you can see the bar chord you've been playing as C is actually not a C major, but a C5 (assuming you're playing the 3 note x355xx bar chords).  This is because the C5 does not have an E, which is the third in the C scale.  A major chord is a (1,3,5), meaning...\n\n\n    C major scale:  C D E F G A B\n    Positions:      1 2 3 4 5 6 7\n\n    C major (1,3,5): C E G\n\nNow the 1,3,5 is the structure for every major chord.  It works out well in the C scale because there are no sharps/flats.  You can just count up from C to make the chord without accounting for them.  We'll continue to use C as an example of chord building.  To make a chord a minor you flat the 3rd.  Meaning, move the 3rd note a half step down.\n\n    C major (1,3,5) :  C E G\n    C minor (1,b3,5):  C D# G\n    C minor (bar chord):  x35543  ::  x C G C D# G\n\nSo when you play the bar chord and add a finger to the 2nd fret, you're changing the D to a D#.  Including the D# like this makes it a minor.  Don't pay too much attention to connecting the idea of moving a half step down and thinking one of your strings/notes needs to move down in pitch.  It's about adding or subtracting notes.  So if you're sitting there with a C major and you want to play a minor you need to think...  I'm playing a major (1,3,5) and want a minor, I should flat the 3rd, the third is E, moving down a step is D#, where on the fretboard can I either add a D# (if you aren't playing an E as with the bar chord) or where is the E that I can move down to D#.\n\nLet's say you want to play a new chord, a 7th.  It sounds exactly as it is, take your major chord (if you haven't noticed, starting from the major 1,3,5 makes chord building very easy) and add a 7th to it.  In the case of C it means you need to add a..... B.\n\n    C major (1,3,5):  C E G   ::  x32010 (xCEGCE)  ::  x35553 (xCGCEG)\n    C 7    (1,3,5,7):  C E G B :   x32310 (xCEBCE)  ::  x35353 (xCGBEG)\n\nOk, I can get into this a lot more if you would like, but I would really advise learning the formulas for the different chord types.  It makes it really easy to understand how to build chords and how to get the sound you want out of the chord no matter what key you're in.  Hope this helps some...\n                            ", "gilded": 0, "created_utc": "1245963744", "subreddit": "WeAreTheMusicMakers", "score": 3, "controversiality": 0}
{"body": "CRITICIZING ATHEISM IS NOT THE SAME AS CRITICIZNG ATHEISTS.  IF YOU FEEL LIEK A SMUG, ARROGANT PIECE OF SHT WHEN SOMEBODY AKS U Y U R SO SPECIAL, THAT'S A PROBLEM WITH YOUR RELIGION.", "gilded": 0, "created_utc": "1245989091", "subreddit": "atheism", "score": -7, "controversiality": 0}
{"body": "R E S T E C P  What does that spell?", "gilded": 0, "created_utc": "1246022594", "subreddit": "entertainment", "score": 15, "controversiality": 0}
{"body": "I had one!  I had forgotten about it til this showed up.  A W E S O M E.", "gilded": 0, "created_utc": "1246042451", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Sure, blame it on the a a a a a a a alcohol", "gilded": 0, "created_utc": "1246042616", "subreddit": "Health", "score": 0, "controversiality": 0}
{"body": "scotch on my boots, nuts feelin lose, i like juice... and so does a moose! \n\nblame it on tha a a a a a a a alcohol", "gilded": 0, "created_utc": "1246046796", "subreddit": "Health", "score": 1, "controversiality": 0}
{"body": "Not when you spell it l i m e y.", "gilded": 0, "created_utc": "1246131162", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "N O T H I N G", "gilded": 0, "created_utc": "1246200580", "subreddit": "AskReddit", "score": -7, "controversiality": 0}
{"body": "I was J O K I N G... ", "gilded": 0, "created_utc": "1246207084", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "I'm trying to find the chords/lyrics (and possibly a youtube video) of a couple of songs.  The first is called (I think) *The Sleeper* and is an older punk rock song.  The chords are just Em A (mostly) I believe and the lyrics contain these lines: \"Come on baby let's ride the bus.  No one else in here but us.  And if they question us, don't you mind 'cause I'm the Sleeper.\"\n\nThe second song is from (maybe) Billy Childish (or one of his bands) and has the chord changes E C G A with the chorus going to B A E with the line \"I'm Your Man\" (not the Richard Hell or Leonard Cohen versions).  Any help would be appreciated.", "gilded": 0, "created_utc": "1246213371", "subreddit": "WeAreTheMusicMakers", "score": 1, "controversiality": 0}
{"body": "guys and gals .. its just the President of Honduras wants to be Chavez Jr and a Little Castro .. and he wants to be President for L I F E - they told him to forget about it .. ) ", "gilded": 0, "created_utc": "1246238271", "subreddit": "reddit.com", "score": 5, "controversiality": 0}
{"body": "Infinite upmods for the above 2 posts.\n\nRule #1: *a l w a y s* make sure to keep yourself in a position of strength.\n\nTo do this:\n\n * practice (visualize, whatever...) your interview skills\n * keep your resume up to date and continuously seek out new opportunities\n * build and maintain a \"warchest\" of about 3 to 6 months salary, and stay away from debt\n \nIn short, live like a contractor even if you are an employee.  If you are an employee and you have been paying for some form of employment insurance, then it might not be necessary to maintain a massive warchest, but it sure the heck helps if you do.", "gilded": 0, "created_utc": "1246376952", "subreddit": "programming", "score": 18, "controversiality": 0}
{"body": "R E P E S T E C T, \n\nFind out what it means to me , \n\nR E P E C T,\n\nTake care, TCB ", "gilded": 0, "created_utc": "1246400917", "subreddit": "funny", "score": 3, "controversiality": 0}
