{"body": "That will just print:\n\n    ab ac ad ae af bc bd be bf cd ce cf de df ef\n\nfor an input of\n\n    a b c d e f\n\nwhich is not what I want.", "gilded": 0, "created_utc": "1194490746", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "cleopatra North America multi-genre multi-talented world famous mega superstar Cleopatra has produced a sizzling new masterpiece album, that guarantees satisfaction to all music lovers. Cleopatra is known to be the queen of milti-genre. This album is so hot. Once you play it, you can't stop.Her voice and talent is so unusual, that you will be inspired and worship the goddess diva. Her music is very catchy with lots of great hooks and drama. This power house is sure to be a collector's item. To book Cleopatra for a unforgetable show email:isisrecord@hotmail.com.\n\tCleopatra repertoire consists of all kinds of rock n'roll/funk /R'n'B /pop / soul /gospel /Christian /reggae /power ballads/top 40 /dance / country /classical / blues / jazz,etc.. \"Said to be one of the greatest live performers of all times\" said Billboard. Cleopatra is a gifted artist with no musical bounderies said Chart hitter. Vogue Magazine said she is a sizzler showgirl that appeals to all. Cleopatra has received many prestigious world music awards.\n\tFor Cleopatra products visit: www.isiset.com/cleopatrastore. To receive Cleopatra promotional products:CDs,T-shirts, posters etc.Send $4 for shipping/handling Postage. We accept all  kinds of checks. Make checks payable to ISIS Entartainment 2 days delivery.100% satisfaction. mail to:72 Percival, Mtl, Qc, H4X 1T5, Fan mail: cleopatrasinger@hotmail.com\n\n\nCleopatra: Multi-genre, multi-talented musicien \nperformer, entertainer, singing artist ,composer\n\nB I O G R A P H Y\n\nCleopatra has had the blessing of god and the great sounds of music. Cleopatra very first encounter with music was at the young age of four. It happened one day when little Cleopatra was watching a variety show called The Jackson Five as Cleopatra recalls it was the very first time she had ever seen people dancing, singing and having so much fun and it was very magical while growing up, Cleopatra had no real musical background, just her grand mum the singing house-wife even so Cleopatra considered herself a pioneer with a mission to conquer the unconquered and to become the very best in everything she does.\n\nCleopatra was not the typical high school student, she had a flair for fashion and stood out on her own quite a trendsetter Cleopatra was never a follower but a creative leader, a compelling performer. Cleopatra is what rolling the entertainment carpet out is all about. She got the look, the style and has amazing dance routine that would enchant anyone from the king of pop Michael Jackson to mark Anthony not just a helpless romantic but a visionary humanitarian activists as well. Cleopatra produces, arranges, composes director, engineers, remixes and know to be the queen of many voices. Cleopatra also works with some local D.J.s and engineers in many different genres. All works are directed and produced by Cleopatra. This spectacular singer, songwriter, music composer is said to be one of the Canada greatest live performers of our times (said billboard). Cleopatra is a gifted artist with no musical boundaries(said chart Hitters). Vogue Magazine said Cleopatra is a sizzler showgirl that appeals to all.\n\n\tContact Tracy/Suzane tel/ 514-999-2872\n\t72 Percival Ave, Montréal, QC, Canada, H4X1T5\n\tEmail.courriel isisrecord@hotmail.com\n¨      \twww.isiset.com/cleopatrastore/\n¨      \twww.isiset.com/cleopatramegastar\n¨      \twww.isiset.com/divaradio/\n¨      \twww.isiset.com/cleopatradownloads.com\n\nattention to all of CLEOPATRA fans world wide this is some of the concerts and live events that cleopatra is performing every year these are annual performances. the christmas feed the kids and homeless/poor on christmas day in montreal,,,the tv show telethone of star live show fundraser,,,, the canada day parade and festivals,the french parade and events,in montreal and different citys and countries carefete-island music parades/events in montreal,toronto,ottawa,vancouver,barbados,trinidad,boston,new york,washinton/DC,the windy city,miami,LA,las vegas, brasil,and 20 other countries world wide. the gay/lesbeian parade-events,,,cleopatra perform in all the same citys and countries for the island parades and gays anf lesbiean parades annualy to get more info on show dates and tour in your city/town/village,etc... please send your questions to cleopatratrademark@hotmail.com\n\n\nhello they my greatest fan members this is CLEOPATRA NOW YOU CAN SEE AND HEAR ME MORE THAN EVER PLEASE SEND YOUR REQUEST TO ALL YOUR LOCAL AND INTERNATIONAL RADIO AND VIDEO STATIONS YOU SEND YOUR REQUESTS NOW TO SEE MY NEW VIDEOS LIKE ELECTRIC SONIC BOOM PART 3 AND 4 on great video and radio stations send to requests@bpmtv and ask for electric sonic boom disco on the show call back@ya and they will play it each and every time and you would win prizes from me every time the video is air on tv now", "gilded": 0, "created_utc": "1194528028", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Here is an actual car that is starting price $300 less than smart car and made by Toyota. Toyota last F O R E V E R, are safe, and you don't look like a total pussy driving it.\nhttp://www.toyota.com/yaris/index.html", "gilded": 0, "created_utc": "1194569466", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "modded down for irrelevance.\n\ni r r e l e v a n c e \n\nirrelevance.", "gilded": 0, "created_utc": "1194750071", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "His email server is down (probably because his CPU seems to have melted...).\n\nIn the interest of full disclosure, I'd like to post an email I was going to send him.  I found some bugs in his application.\n\n&gt; Hey,\n\n&gt; I found a few bugs in this thing...\n\n&gt; len=`ls -l $uri | ( read x x x x len x; echo $len)`\n&gt;\n&gt; \\# $ECHO \"Content-Length: $len\\r\"\n\n&gt; You obviously realized that that length command will not get the correct length, since the line is commented. But why spend the CPU time figuring out that data if you aren't going to use it? Comment out the len line as well! In a large enterprise environment, you don't want to tax the CPU like that.\n\n&gt; But more importantly, where in the hell does the in.httpd.sh file call shspc.sh? It doesn't!\n\n&gt; *.shit)\n&gt;\n&gt;   mime=\"text/html\"\n&gt;\n&gt;   cmd='/usr/bin/sh $uri'\n&gt;\n&gt;   ;;\n\n&gt; How is that going to render \"&lt;``&gt;\", \"&lt;$$&gt;\", or \"&lt;^^&gt;\"? It's not! It just calls /usr/bin/sh! ", "gilded": 0, "created_utc": "1195701885", "subreddit": "programming", "score": -2, "controversiality": 0}
{"body": "I have my handgun right here! So you better show my ignorant ass some R E S P E C T! \n\n", "gilded": 0, "created_utc": "1195949633", "subreddit": "politics", "score": -9, "controversiality": 0}
{"body": "H H H H H OLY SHIT", "gilded": 0, "created_utc": "1196116491", "subreddit": "reddit.com", "score": 10, "controversiality": 0}
{"body": "Ah, yes, the Office 12 Ribbon argument. It's nice that my grandmother would intuitively type in \"next Friday\" (after trying to talk into the mouse of course). But once she tries \"next Friday 10am\" and get \"Snafu...\" as response, she will turn to that other application with the nifty little calendar. Because *this* she knows, she got one of these in her kitchen.\n\n//Edit: \nDon't get me wrong. It's a nice piece of code. I really enjoyed looking through it. But its far from ready for prime time. No matter how gigantic and all knowing (or implying) the parser is, you simply can't solve the problems that I mentioned above.\n\nIn most cases an ordinary calendar(+clock?) widget will do way better than a text field. That way it only takes 3 or 4 mouse clicks instead of \"n e x t  f r o d a *oh wait...backspace backspace backspace* i d a y  1 0 a m\" ;)", "gilded": 0, "created_utc": "1196278885", "subreddit": "programming", "score": 7, "controversiality": 0}
{"body": "D E S P E R A T E", "gilded": 0, "created_utc": "1196283754", "subreddit": "politics", "score": 4, "controversiality": 0}
