{"body": "&gt;when we are talking about something that cannot be tested\n\nYou can't test my \"Nessie is a space alien\" theory - are you arrogant for calling me wrong?  There are plenty of untestable theories, either in principal or practice that most people are fine with dismissing.\n\n&gt;But come on, man, you're honestly going to sit there and say \"I'm right about God, your position is wrong...\" like you have all the answers about the universe and existence, and then tell me you're not acting like an arrogant ass?\n\nI'm saying I don't *have* to have *all* the answers to say a position is most likely wrong.  I believe that given the current evidence (none), that the correct position on the existance of God is *exactly the same* as the correct position for the existance of Vampires, unicorns and all the rest we have zero evidence for - ie. that it doens't exist.\n\n&gt;You think you are the only one seeking the truth about reality?\n\nNote the word \"If\".  I was responding to your question \"And what's wrong with believing that God could exist just as much as it could NOT exist?\" - explaining why some beliefs are better than others.\n\n&gt;which is why why I hold the position that I cannot rule out existence or nonexistence. ...But do you hear me calling your beliefs as inferior to mine?\n\nYou just did.  \"Which is why\" implies that the reasons you hold that belief are because you think it is the best one for revealing the truth - ie. superior to mine.  If you didn't think my belief was inferior to yours, and *still* held it, that would be very odd indeed.\n\n&gt;You choose to be atheist because you don't believe god exists.\n\nThats an odd way of putting it.  I don't believe God exists because of the reasons given above.  That places me in the category of \"atheist\".  If you don't believe in God, there is no further *choice* not to be an atheist.\n\n&gt;Now, I could sit here and tell you that you are just WRONG (like you are to me), but that would only make me look like the arrogant ass. Why? Because you know damn well that I cannot absolutely prove you to be wrong.\n\nAnd?  If you want absolute proof for *anything*, you'll be waiting a long time.  Here in the real world, we have to make judgements based on incomplete information.  The choice must be what we think is *most likely*.\n\n&gt;And if you do think that this question is somehow proven without a doubt, then you're not just arrogant, but stupid.\n\n\"proven without a doubt\" is a complete misrepresentation of what I've been saying.  I think lying about my viewpoint is a lot more likely to make you look like an ass than just calling me wrong.  Here's what I posted above.  Read it again.\n\n&gt;&gt;The words \"belief\" or \"disbelief\" do not require \"no possibility\" of being wrong - if they did, they would be pretty useless words, as you can't say anything with literally no possibility of being wrong.  A belief is simply something you currently consider to be true. a disbelief is something you currently consider to be false.", "gilded": 0, "created_utc": "1220295288", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt;That is exactly what christians do to non-christians, and I hear atheists bitching about it non-stop.\n\nReally?  I've never seen anyone object to actual act of stating their position.  I've seen disagreement on the position itself (obviously), and to the venue of expression (proseletizing in a non religious context is objected to for the same reasons as spam, or intrusive adverts), but never to the actual fact of giving their viewpoint and stating what they feel is correct.  I certainly never have, and have no objection to it whatsoever.  Disagreement and argument is one of the most important tools for testing and determinining the truth of our beliefs.\n\n&gt;Most of your post is jibberish, but I will respond to your final sentence\n\nI would prefer you tell me what you find to be gibberish, and more importantly, give an answer to the question I've been asking throughout.  I even bolded it above, but here it is again:\n\nWhat is the difference between the existance of God (a hypothesis with no evidence you say you keep an open position on), and the existance of an alien Loch Ness monster (A different hypothesis with zero evidence that you say you do feel it is acceptable to dismiss).  ", "gilded": 0, "created_utc": "1220295900", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "1)  You say I can't test your \"nessie is an alien\" theory - but this has no evidence, whereas I hold that the fact that there is something instead of nothing is evidence that there might be a creator.  Get real, man.  Like I said before - there are billions of hypothetical what if's (like the lochness monster, leprechauns, etc) but this has nothing to do with our debate.\n\n2)  You say that I just called you wrong.  I didn't.  Just because I hold a position different from yours does not mean that I think you are wrong.  I think you could be 100% right, but I also think that theists could also be right.  Furthermore, there is a difference between holding a differing viewpoint and telling somebody that theirs is wrong.\n\n3)  You say:  \"If you want absolute proof for anything, you'll be waiting a long time.\"\n\n--You're right.  And I see nothing wrong with waiting, rather than jumping to conclusions.  Just like in ancient times when people saw the world as flat.  All they could see was flat, and so they jumped to the conclusion that the entire world was flat.  Now, if somebody back then had said \"I don't know\", there would have been a bunch of pricks claiming that he should use his brain and come to the logical conclusion that the world is flat because that is what the evidence suggested.  Can you see what I am getting at here?  There is NOTHING WRONG WITH AN \"I DON'T KNOW\" POSITION!  Troll...\n\n4)  I completely understand your statement of \"A belief is simply something you currently consider to be true. a disbelief is something you currently consider to be false.\"\n\n--Right, but there are still people who stay with \"I don't know\"  rather than choosing to believe that something is true or false.  Can you not recognize that there are more options than just believing something is true or false?  I feel as if I have stated the same thing about 15 times over and over again...  ", "gilded": 0, "created_utc": "1220385485", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt;but this has no evidence\n\nOh yeah?  You explain why Nessie is so hard to find then!  I can't see how you can claim \"there is something\" is any more evidence for a creator God than \"there were some sighting, but no-ones spotted it conclusively\" is evidence for the \"Nessie is a space alien\" theory.\n\nBoth theorys perfectly explain the facts, but there is *nothing* about the facts to indicate that \"Intelligent Creator\" or \"Space Alien\" is any more likely than *absolutely anything else*.\n\n&gt;Just because I hold a position different from yours does not mean that I think you are wrong.\n\nSo your \"I don't know\" stance also applies recursively?  You think \"I don't know\" might be the wrong position to take about God, but you don't know?  I don't agree with that.  There is room to judge between these beliefs - one system makes testable predictions that are likely to be true, the other makes no predictions at all.  I find the testable one a much more useful (and hence, by my goals, better) system, and think that since it gives such good results in things we can test, it makes sense to apply the same rules for things we can't (induction again) - eg. Russell's teapot, the FSM, God etc.\n\n&gt;Furthermore, there is a difference between holding a differing viewpoint and telling somebody that theirs is wrong.\n\nYeah - actually revealing that you disagree is honest, subjects your belief to the rigours of argument and makes you more likely to find flaws in your own beliefs when put to that test.  Hiding the fact that you disagree means you aren't even willing to honestly put your beliefs to the test.  Give me the person who plainly states their disagreement anyday.\n\nFortunately, as far as I can see you're *not* doing this - and I don't see why you're claiming that you are.  Just look below where you flatly contradict my belief in ALL CAPS for instance.  Is there anything wrong with a 'There is something wrong with an \"I don't know\" position' position?\n\n&gt;There is NOTHING WRONG WITH AN \"I DON'T KNOW\" POSITION!\n\nGuess what - I think that THERE IS SOMETHING WRONG WITH AN \"I DON'T KNOW\" POSITION (for entitys we have no evidence for - including God).  This is the point we are disagreeing on, remember? (though for some reason you keep telling me that you *aren't* claiming I'm wrong.)\n\nSpecifically, what is wrong with it is that it is:\n\n   - Impossible to do wrt all entities (eg. evidence confounding entities)\n\n   - Inconsistent with what we actually do with hypothesised entities (crack-vampires, a murderer hiding behind the next door etc.)\n\n   - Has lots of empirical evidence that this is a good system.  Most of the things we assume don't exist, don't in fact exist.  Black swan events are very rare, so this system does well in predicting things.\n\n   - I then hold that it is consistent to apply this claim to things we can't test.  What reason is there to make an exception?  Hence invisible vampires, Russell's teapot, God etc fall into the same category.\n\nNow, at this point I'm not sure whether you agree or disagree with the above or not.  Do you:\n\n  - Hold that we *should* hold an open position wrt zero-evidence hypothesis (In which case: why do you not do so for the various hypotheses I've listed in posts above, but do for some)\n\n  - Hold that we shouldn't, but that there *is* evidence for God that elevates it to the \"I don't know\" level above this default disbelief state.  (If so, please answer the above about how exactly the existance of \"something\" provides this evidence\n\n&gt;Can you not recognize that there are more options than just believing something is true or false\n\nYes I can.  Just as I [said](http://www.reddit.com/r/atheism/comments/6xx5g/the_best_response_to_the_atheists_are_arrogant/c057xyd) I could the last time you asked this question.  I also stated that I believe this is the **wrong** position for entities such as God.  Perhaps you should stop stating the same things over and over and instead read the answers?", "gilded": 0, "created_utc": "1220388595", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "You don't consider the existence of the universe as evidence that it might have been created.  I (and millions of others) do.  So, I understand why you think that your conclusion is the most logical.  I however disagree, though I see nothing wrong with your viewpoint.  I also see nothing wrong with the theist viewpoint - they could be right as well.\n\nI agree with how you approach things with zero evidence (leprechauns, nessie, etc.)  It makes sense to assume they are false since there is zero evidence.  Our only disagreement is that I consider the fact that 'there is something instead of nothing' as evidence that there just might be a creator.  I think we have more in common than you think.\n\nEnd of discussion, I'm not replying anymore, best wishes to you and your family.", "gilded": 0, "created_utc": "1220399903", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "1)  I said 'supreme being' from the beginning, in my original post, where I was responding to you calling the \"I don't know\" position as a 'cop out'.\n\n2)  No, I don't need to spell out God's attributes.  Why?  Because I don't know - nobody does - simple as that.\n\n3)  You say:  \"Oh come on! You're not even going to define what you're talking about?\"\n\n--No.  How could I define a supreme being?  \n\n4)  You say:  \"God\" doesn't answer \"why\" either, and \"who\" is back to presupposing a sentient entity. \"A lump of exploding matter\" fits your definition of \"something\" just as well as anything fitting the concept of \"a God\". If you are refining your defintion about what a \"God\" is to exclude this, you'll need to spell out what those attributes are, and why you feel there is evidence for a being with those attributes, but not one with the attributes \"Giant Space Cow\".\"\n\n--\"who\" doesn't mean it has to be sentient.  It could have been a tree dropping a seed into the wind, which happened to be our universe.  I am not refining my definition of what god is.  I have clearly stated that I don't know.  I have not given any attributes to God, either.  ALL I am saying is that I hold the possibility that a supreme being exists.  Be it red, sentient, caring, not caring - whatever - I don't know.  But, I also hold *with equal validity* that a supreme being might *not* exist.\n\n5)  You say:  \"I just mean millions of people don't hold your definition of \"God\" - pretty much all conceptions are of some kind of purposeful, intelligent entity.\"\n\n--That's great.  That could very well be the truth.  But it could very well *not* be the truth, there are millions of \"what if God is...\" theories.  I have stated from the beginning that I simply don't know.\n\n6)  As soon as you mentioned crack vampires, I stated that it might not be relevant to our discussion, because they could be tested by stepping on a crack, whereas a supreme being's existence could not be tested in any way that we know of.  I guess I should have not gone along with your crack-vampire tangent, since this has gotten you beyond distracted.  I did however, mention before that NONE of the bigfoot/crack vampire/nessie crap had anything to do with our discussion, because the universe existing might be evidence that it was created.  I have not redefined my position on the supreme being issue.\n\n7)  No progress has been made in this discussion.  I understand completely where you are coming from, and I at least *hope* that you are starting to understand where I am coming from.  You can think that I am wrong, no problem there.  Just don't force shit on my position, like saying that I have to assign attributes to a possible supreme being, that I have to define what the supreme being might be (lump of exploding matter, sentient caring entity, space cow, etc), or whatever, this would be impossible with my position that \"I don't know\".\n\n8)  It does come off as arrogant when an atheist says \"you are wrong\" when somebody holds a position about God, which cannot be tested, proven, or disproven.  There's just no way to *know* that it's wrong, and someone stating that \"yes, in fact, this is wrong\" like they have absolute truth is just arrogance.  I still find it funny that we are in a thread about atheists not wanting to be called arrogant.  \n\n9)  Can we leave it at that?  Or are you going to try to keep poking holes in my position?  One thing about my position though, is that you can't poke holes in it.  Saying \"I don't know\" means that you do not have enough information.  I see it as more scientific.  If science does not have information on a subject, the default position is \"I don't know\", rather than believing or disbelieving.  We've been at this over a week now, are we cool?  I don't know why I have to explain so much when my only position is that \"I don't know\" - that should be self-explanatory.", "gilded": 0, "created_utc": "1220477974", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "So Bigfoot is pregnant with the Loch Ness Monster's lovechild?! Awesome. ", "gilded": 0, "created_utc": "1220756686", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "And it was about that time I realized he was 8 stories tall and it was that damned loch ness monster again.  I still ain't givin' you no tree fity.", "gilded": 0, "created_utc": "1220955191", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Just like Bigfoot, Nessie and chupacabres.", "gilded": 0, "created_utc": "1221127546", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "Back to the Loch with you Nessie!", "gilded": 0, "created_utc": "1221267217", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "And #9 for Nessie.", "gilded": 0, "created_utc": "1221424431", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "I thought it was about tree fiddy?", "gilded": 0, "created_utc": "1221497363", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I wanted to find the Loch Ness Monster when I was growing up and now I'm... not.\n\nDoes that count?", "gilded": 0, "created_utc": "1221628429", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I gave them tree fitty", "gilded": 0, "created_utc": "1221794893", "subreddit": "business", "score": 1, "controversiality": 0}
{"body": "dat'll be Tree Fiddy.", "gilded": 0, "created_utc": "1222042673", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "I'm guessing Loch Ness, Scotland, but that's only because I think It's supposed to be the Loch Ness Monster...", "gilded": 0, "created_utc": "1222158041", "subreddit": "offbeat", "score": 4, "controversiality": 0}
{"body": "It was about that time I realized; that's not Jesus thats the Loch Ness Monster!", "gilded": 0, "created_utc": "1222178934", "subreddit": "atheism", "score": 2, "controversiality": 0}
