{"body": "sex in the back seat + tree fiddy", "gilded": 0, "created_utc": "1230030237", "subreddit": "Economics", "score": 2, "controversiality": 0}
{"body": "Thanks, I really don't understand people who post articles like that without a picture!  It's like if I posted \"Loch Ness monster now in zoo!\"  without a photo", "gilded": 0, "created_utc": "1230132151", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "\"Saying there is little evidence of his existence is as far as an honest person can go.\"\n\nSaying there is little evidence of *unicorns* is as far as an honest person can go.\n\nSaying there is little evidence of *the loch ness monster* is as far as an honest person can go.\n\nSaying there is little evidence of *faeries* is as far as an honest person can go.\n\n\nSaying there is little evidence of *big foot* is as far as an honest person can go.", "gilded": 0, "created_utc": "1230248825", "subreddit": "atheism", "score": 11, "controversiality": 0}
{"body": "Actually, I'm going to revise what I said earlier:\n\nThe difference between these examples and Jesus is significant. The Loch Ness Monster is the easiest one to examine, because the Loch Ness is a fairly limited realm. Just as I can objectively prove a negative with limited scope (that there are no pennies in my left pocket) I can \"prove\" in any but the strictest sense of the word that the Loch Ness Monster doesn't exist. Unicorns, Big Foot, and faeries are progressively harder, given the possible scope limitations we could impose (or lack thereof).\n\nOn the other hand, we can't examine 2000 years ago. Even though the scope is fairly limited - say, within 100 years - we don't have access to it in the way that we have access to the Loch Ness.\n\nSo they're different. I'd say you can prove (again, in most senses) that there is no Loch Ness Monster *far more strongly* than you can prove that there are no faeries. And Jesus is further down the line.", "gilded": 0, "created_utc": "1230347862", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I guess I'm just nitpicking but you can't really claim to be \"atheist\" regarding \"Loch ness monster, Santa, Easter bunny, Bigfoot, etc\" since none of those are *deities*, and the term is reserved for the non-belief in deities (that whole 'theist' part).\n\nBut, basically, if you don't believe in any god, you're an atheist, regardless of whether it is because you \"can't\" know or if you believe in the opposite alternative. \n\nThe lack of anything justifies the \"a\" prefix of *absence* in front of it, so it's the *lack of a belief* in a god that gives you that label, not that you don't claim to know it. \n\nYeah, we can try and label every possible philosophical distinction in the spectrum between \"full certainty\" in a proposition, \"no certainty at all\", and even \"full certainty in the opposite proposition\", but, honestly — what does it matter? Just focus on the arguments and champion reason and intellectual honesty in whatever position you take.", "gilded": 0, "created_utc": "1230383080", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I could replace \"loch ness monster\" with Krishna, Buddha, or invisible pink unicorns. I was just showing what his argument was. Yes, you could say all you want \"you can't disprove the loch ness monster (or Jesus)\", and you would be right.\n\nBut, I want to get across that *reasonable* assumptions are not bad, and even necessary. For example, if a friend came to my house and said \"A guy named Bob lives down the street\". I would believe him, because it is not unreasonable. If he continued to claim that Bob was a cult leader, I would ask for evidence because that is much more unreasonable. \n\nSo let's take a more important question, how do you know you exist? How can you know that this not a computer simulation, or a dream? Well, I haven't seen anyone answer this question without any uncertainty, so the most you can say is, \"we don't know\". But that doesn't really work in the world, and acts are often made on the assumption that world is real, that you exist. It isn't crazy to have an unfounded assumption, but it is important to realize whether it is reasonable or not. \n\nSo when we apply this philosophy to historical figures, I believe they do not exist, unless evidence is there to support it. I do not believe that Romulus existed, just because there are stories. But, I believe Julius Caesar existed, because there are extensive documents and a large bibliography about him. While this could be a large fake conspiracy, it is more reasonable to believe that Caesar existed than a grand conspiracy. \n\nSo, when you tell me Jesus existed, when no other evidence exists other than the religious texts, and no historian even mentioned him, despite the large number of historians living around the Mediterranean during the time of Jesus. Although, in fairness there are four historians that are cited by modern Christian defenders. The major historian that is frequently cited is Josephus, but that is considered a fake, even by people in the Catholic church. The other three, like Tactitus, only mention the Christ, Christus, or Chrestus, which is a title and not a name, which was held by many people. But even if they were talking about Jesus, it is only mentioned in passing. You would think a major historical figure like Jesus would take up more than a passsing comment. Plus you take into account that the story of Horus is almost exactly like Jesus, and it seems reasonable to believe that Jesus did not exist.\n\nEDIT: You gave a very though provoking comment nevertheless, so I hope there is no animosity between us even though I disagree with you (it is the internet afterall)", "gilded": 0, "created_utc": "1230399285", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "what have you done to ol' nessie!?", "gilded": 0, "created_utc": "1230469190", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Okay.  14 miniature quakes over 2 days.\n\nAnd, the article gives absolutely nothing in the way of perspective, as in, this kind of \"swarm\" happens about (whatever the frequency is)... let's say 150 times per year for now.\n\nIn other \"news\", someone has seen a floating log that they believe to be the \"Loch Ness Monster\".", "gilded": 0, "created_utc": "1230481691", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "Before the contest is settled, takes many years, I guess the best solution is Whirlpool. It's standard (NESSIE), based on AES cipher and designed by same guys. No known weaknesses.  ", "gilded": 0, "created_utc": "1230689548", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1228109463", "subreddit": "WTF", "score": 7, "controversiality": 0}
{"body": "Hopefully the Loch Ness Monster has rights to be appointed a public defender.", "gilded": 0, "created_utc": "1228306408", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "This has irked me for some time now.\n\nI think the language should be altered to whether or not you *accept* the Theory of Evolution rather than \"believe in\" it, because the latter equates (in my mind) with the belief in Father Christmas, the Tooth Fairy, ghosts, the Loch Ness Monster or other pseudo-scientific beliefs.", "gilded": 0, "created_utc": "1229001413", "subreddit": "atheism", "score": 28, "controversiality": 0}
{"body": "So I guess unicorn == dragon? Giant == fairy? Nessie == Big foot?\n\nIt's irrelevant that these things are not real when the point is stating what they are [in a fictional world]. Of course it is accepted that zombies are fictional, but that doesn't mean they are the same as any other fictional character.\n\nUsing cars and trucks was an *example* to help equate things to the real world. They usually help people to understand things when they aren't too stubborn to see past their view in spite of all the evidence to the contrary.", "gilded": 0, "created_utc": "1229099654", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Like, I dunno, [the code from our earlier conversation](http://www.reddit.com/r/programming/comments/5ywhh/ask_reddit_from_a_c_programmer_which_of_these/c02asgu)?  In Lua, I don't think there are any alternatives.  I ended up scrapping LuaSQL and writing my own mysql binding, in fact, because I needed to execute queries asynchronously.  It's not open source, but I suppose it could conceivably be open sourced.\n\nIt is pretty hilarious that the \"Abstractions for LuaSQL\" only sort of provide parameterized queries, in that it seems to do it if you only want vanilla select/insert/update/delete statements.\n\nSQL support in Lua is still pretty pathetic, although for some reason the [lua-sqlite3](http://www.nessie.de/mroth/lua-sqlite3/index.html) binding works well and supports parameterized queries (if you use the non-LuaSQL interface, that is).  I used it for a quick and dirty holiday/birthday wishlist for gift coordination among my family.", "gilded": 0, "created_utc": "1229359686", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "Okay, this is one of the things that annoys me about mainstream atheism. God is not equivalent to Santa Claus, because Santa Claus is mythology/superstition while God is construct of mind.\n\nThe God concept is the belief that the universe derives from absolute principles that determine its existence, morality, its meaning, etc. The end of one's God concept (\"God is dead\") is an existential crisis that removes the apparent rationality of ones' being.\n\nSanta Claus, on the other hand, is like a unicorn, palm-reading, or the loch ness monster. One might be sad to find out that he's bullshit, but he was just misinformation rather than the focal point of one's existence.\n\nMainstream atheism is confused by theism because they see God as a type two myth. It's not. \"God\" comes from the same pattern of thought that gave birth to Newtonian physics: the absolute rationality of the universe based on principles. Most people who call themselves atheists have a God concept, but express it with different symbols. The reason most people who call themselves atheists and theists have trouble getting along is usually that each believes the opposite is attacking their core beliefs (ultimate rationality), rather than the symbols that express it (ie evolution, creation).\n\nTLDR: I can't say for certain, you might be a nihilist, but you probably believe in God. The God concept itself is not the mythology, but a paradigm; biblical passages and religious fables are the mythology. Keep symbols and core concepts in separate boats. Awaiting downvotes.", "gilded": 0, "created_utc": "1229384728", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "I'd recommend The Loch to any Nessie fans. It was surprising to see the bloop on that Cracked list.", "gilded": 0, "created_utc": "1229411729", "subreddit": "wikipedia", "score": 1, "controversiality": 0}
{"body": "A drug is a chemical substance used to produce an effect.  It is a drug both pharmacologically, and legally.  The fact that it occurs naturally in the brain does not make it less of a drug.  Its just a drug that is already in your brain.  Taking a dose of it to induce a psychedelic episode just makes it an illegal drug.  \n\nYou do not need evidence to prove something does NOT exist.  The burden of proof is on the party claiming it does exist.  By your logic, bigfoot exists, the Loch Ness Monster exists, faries exist, Zeus exists, the flying spaghetti monster exists, etc.  \n\nIf your hypothesis is \"There is a supernatural realm\", you must support your hypothesis with facts and evidence.  You can't simply look at me and say \"PROVE ME WRONG!\"  This may seem unfair to you, but that is how logic works.  \n\nIf I told you I was God, typing this right now.  You would not believe me (or you shouldn't if you are a rational person).  I would need to do something to prove it to you somehow.  I can't just say, \"Well, I guess you can't prove I'm not God, so I must be God\"\n\n\nAlso, you are thinking of the unscientific definition of a theory that we non-scientists use to describe things, a proposed explanation whose status is still conjectural.  Example: I have a theory who took the cookies.\n\n\nThe scientific definition of a theory is somewhat different.  A theory is a a coherent group of general propositions used as principles of explanation for a class of phenomena.  Examples you may be familiar with are gravitational theory and germ theory.  \n\n\nA general misunderstanding of scientific terms is that a theory is scientific conjecture that eventually becomes a law when it's supported by evidence.  A theory is not a \"baby law\".\n\n\nA theory remains valid until a competing theory offers a better explanation that fits the evidence more precisely.  \n\nThe big bang is a theory.  But there WAS an explosion.  All of the evidence points to there being a \"big bang\".  The causes and consequences of this incident are still not fully understood.  Until there is a better explanation for all of the evidence for the big bang (redshift, expansion of the universe, cosmic background radiation, etc.) the big bang will remain the scientifically accepted fact.\n\n\nThis misunderstanding is most popularly used to discredit the theory of evolution as mere conjecture, when a great deal of evidence exists to prove the theory.", "gilded": 0, "created_utc": "1229454897", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Exactly, and this tendency for people to call themselves agnostic just because it's possible for a god to exist is really a cop out.\r\n\r\nAtheists don't generally claim that it's impossible for a god to exist. They simply assert that the case for god's existence has not been adequately made. As a hypothesis, it is utterly unsupported and worthy of being dismissed until further evidence is presented. It's exactly how I feel about the Loch Ness Monster, Big Foot, alien abductions, etc. I don't think it's in the same category as the Easter Bunny, Santa Claus, or the Tooth Fairy because as an adult who has actively perpetuated those specific myths, I think I know enough to claim their nonexistence.", "gilded": 0, "created_utc": "1229456701", "subreddit": "atheism", "score": 4, "controversiality": 0}
