{"body": "I thought it only cost tree fiddy.", "gilded": 0, "created_utc": "1265047493", "subreddit": "politics", "score": 7, "controversiality": 0}
{"body": "then I said get out of here you damn loch ness monster", "gilded": 0, "created_utc": "1265053583", "subreddit": "politics", "score": 7, "controversiality": 0}
{"body": "about Tree fiffdy is about how much it costs to support the loch ness monster.......", "gilded": 0, "created_utc": "1265064576", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Tree fiddy? You could at least start with something low like a buck two five or sommit. ", "gilded": 0, "created_utc": "1265072968", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "You gave it tree fiddy? Dammit, why do you think it keeps comin back?", "gilded": 0, "created_utc": "1265089929", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "No not really.  I would rather hear an awesome drinking story with exaggerated amounts of alcohol listed than hear about someone's boring day/night in front of the computer.  I'm just being honest.  Oh and your buddy who's never affected by alcohol?  If I had a dollar each time I heard that, and after I get them hammered, they tell me about the most amazing night of their life... I would have 'bout tree fitty.\n\nTo clarify things a bit; I really don't want to hear about how much alcohol you drank last night during an unprompted, socially unacceptable moment (in the library, in class, while im busy at work, etc).  But if I say, \"Hey man! What have you been up to?\" By all means, go to fucking town on your alcohol stories.", "gilded": 0, "created_utc": "1265095459", "subreddit": "DoesAnybodyElse", "score": 36, "controversiality": 0}
{"body": "Oh yeah? Well you're not from the paleolithic era either! That'd make you like a billion-cajillion years old... The oldest person to ever live was only like 900 yo!", "gilded": 0, "created_utc": "1265151853", "subreddit": "worldnews", "score": 0, "controversiality": 0}
{"body": "It's the Loch Ness Monster. \n\n/on vacation.", "gilded": 0, "created_utc": "1265154602", "subreddit": "technology", "score": 0, "controversiality": 0}
{"body": "&gt; What other supernatural things do you believe exist?  \n\nThere isn't much really.  I can't say that I believe in ghosts, unicorns, vampires, Big Foot, Nessie, or mermaids (though the existence of some of them would be kinda awesome).  I can no more prove their existence than I can that of God; but I can say that I've felt and seen things that I attribute to God and the miraculous.  \n\nHow would I describe that feeling?  All-encompassing.  Warm.  Certain.  Comforting.  \n\n&gt; It's not believing that concerns me, really, it's more that maintaining that belief after admitting that it doesn't really make sense that I have trouble understanding.  \n\nThat's the crazy part.", "gilded": 0, "created_utc": "1265156302", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I have one nobody else is going to remember (actually if anyone else out there has seen this please let me know I've never experienced this since)\n\nAlright in Ultima IX: Ascension (I know who played THAT?) I was playing with my friend.  We were switching off trying to swim off the main continent early in the quest (trying to get to pirate cove before we should); so basically we were swimming down the coastline for a place where we could actually swim across (it would prevent you going too deep).\n\nNow day turned to night, and the weather grew stormy, and still we swam out in the sea looking for a way across to a distant land.  Lightning flashed periodically, and it was in one of these flashes that my friend (in control at the time) found himself floating above the largest fucking creature I had ever seen in a video game (topped now only by Shadow of Colossus and god of war); this nasty looking nessie, illuminated only for a second by a flash of lightning, quickly reached and devoured us.\n\nMy friend was so traumatized he couldn't play the rest of the night, and just recently this got brought up and he mentioned that it was the scariest moment he'd ever experienced in video games.\n\nFreaked me out too.  Anyone else seen this creature?  I cant find confirmation online cuz no one gives a shit about ascension.", "gilded": 0, "created_utc": "1265166196", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Wikipedia has an entry on the loch ness monster too. ", "gilded": 0, "created_utc": "1265309334", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "Ever seen the loch ness monster?", "gilded": 0, "created_utc": "1265309883", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "[loch ness monster?](http://www.teamfortress.com/images/posts/runners-up/loch_ness.jpg)", "gilded": 0, "created_utc": "1265323536", "subreddit": "tf2", "score": 1, "controversiality": 0}
{"body": "I've thought that Jacob was the \"bad\" guy for a while now.  In the Incident, he made every character's life that he touched worse (this list will be over simplified).\n\n* Jack: He [Jacob] facilitated the downfall of his relationship with Christian.\n+ Kate: He encouraged her to continue stealing.\n- Sawyer: He allowed Sawyer to write the letter.\n- Sayid: He essentially killed Nadia.\n- Locke: He revived him which let Locke live the worst four or so years of his life.\n- Sun and Jin: At their wedding, someone asked about when they would have children.  Immediately following this, Jacob touched both of them.  While this is quite long shot, this could be the reason Jin couldn't have children before reaching the island.\n\nWe don't know about Ilana yet and Hurley seems to be the only exception.\n\nJacob is manipulating these people for his own benefit.  As badger mentioned, Jacob has a goal, and he doesn't care how many people have to be harmed in order to reach it.\nEven though Smokey has killed a few people (the pilot, Eko), he wants the suffering on the island to end.\n\nThere is no clear good/bad guy, but I'm pretty sure it's a lot more complicated.\n\nTake [this quote](http://www.tvguide.com/News/Getting-Lost-Locke-1014245.aspx) from Terry O'Quin:\n&gt; \"It's possible to mistake God for the Devil, and the Devil for God.\"\n\nEdit: Added Sun and Jin.\n\nEdit 2: Clarified Sun and Jin, thanks Nessie.", "gilded": 0, "created_utc": "1265482521", "subreddit": "lost", "score": 16, "controversiality": 0}
{"body": "No, I'm not saying that at all.  What I am saying is that these stories about giant floating islands or rafts of plastic garbage are nothing more than an urban myth.\n\nI'm not saying that mankind doesn't both overly depend on, and improperly dispose of, plastic waste; there's no argument there.  There's plenty of good, quality evidence of that.  There's just no need to invent or endlessly repeat these stories about mythical giant rafts of plastic waste to make the problem seem worse than it is, because it's bad enough already and it only hurts your argument.  It's the equivalent of saying there's too many species going extinct, and then using the Loch Ness monster as your example. \n\nThere have been lots (and *lots*) of 'stories' on reddit and elsewhere, a wikipedia article of questionable provenance (as all wikipedia articles are), even a TED talk by a supposed environmental 'expert', all purporting that these islands exist, yet none of them, not one, has provided even the tiniest shred of actual physical evidence.   With all the technology we have at our disposal today, if these islands did indeed exist, you would think that someone would have gotten at least a good photo of one, at a minimum, yet no such credible photos exist.\n\nI'm sorry, but until you people come up with some credible evidence, I will remain unconvinced. ", "gilded": 0, "created_utc": "1265486094", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "I always just respond jokingly with \"about tree fitty\" and then change the topic.", "gilded": 0, "created_utc": "1265495469", "subreddit": "AskReddit", "score": 40, "controversiality": 0}
{"body": "YOU GAVE HIM TREE FIDDY!? I said, MONSTAH... ! ", "gilded": 0, "created_utc": "1265496794", "subreddit": "AskReddit", "score": 18, "controversiality": 0}
{"body": "Jus'bout tree fiddy. Oh, I was beat to it by sooo long.", "gilded": 0, "created_utc": "1265511902", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt;Also, I'm still waiting for the news that Atlantis exists.\r\n\r\nDon't forget Nessie. I think we should do our project on a bog in Scotland, but that's just my opinion. ;]", "gilded": 0, "created_utc": "1265515844", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "NOOOOOOOO Haiti owes me tree fiddy!", "gilded": 0, "created_utc": "1265517547", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "I hear the Loch Ness Monster jerky is much better. ", "gilded": 0, "created_utc": "1265564350", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I have been told that \"real feminists\", \"true feminists\" believe in equality between the sexes, but they are like the Loch Ness monster, because I am still yet to meet one. Every other feminist that I have met, or read about, or read from save for Alan Alda and Chuch D don't believe in equality, they believe that women should get to pay men back for thousands of years of disenfranchisement.", "gilded": 0, "created_utc": "1265594073", "subreddit": "MensRights", "score": 2, "controversiality": 0}
{"body": "One step too far Nessie, one step too far.", "gilded": 0, "created_utc": "1265598339", "subreddit": "offbeat", "score": 12, "controversiality": 0}
{"body": "tree fitty", "gilded": 0, "created_utc": "1265598957", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "Are you familiar with the NSSE survey (Pronounce Nessie)? ", "gilded": 0, "created_utc": "1265611928", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "no no it's the river that flows through Stranglethorn Vale right before it flows in to westfall near Nessie's camp.", "gilded": 0, "created_utc": "1265630455", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "That's not reductionist, Nessie.  It's true.  Reductionist is a term that's meant to apply to statements that have been broken down beyond the point of truth, not just to simplified statements.  No one, at least in the last five hundred years, has declared war on a country or empire for any reason other than greed or self defense in the face of greed.  You either pull out a history book and show me an example of war that doesn't include greed at the heart, or you admit that human greed is the cause of all war.  Even the crusades were about greed, the", "gilded": 0, "created_utc": "1265635644", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "This article should be part of a series of \"Ten ways to find the loch ness monster\" and \"Five easy tips for getting gold from a leprechaun\"", "gilded": 0, "created_utc": "1265654558", "subreddit": "technology", "score": 8, "controversiality": 0}
{"body": "TREE FIDDY? I AIN'T GOT NO TREE FIDDY!", "gilded": 0, "created_utc": "1265681418", "subreddit": "fffffffuuuuuuuuuuuu", "score": 8, "controversiality": 0}
{"body": "That god damned loch ness monster.", "gilded": 0, "created_utc": "1265695183", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "Well I gave him tree fiddy, but I didn't know he would come back!", "gilded": 0, "created_utc": "1265710528", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "What is it Lassie? Is Nessie lost? Show me where he is boy ... show me where .... ewwwwww!", "gilded": 0, "created_utc": "1265727515", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "    ChefD:I AIN'T GIVING YOU TREE FIDDY YA GOD DANM LOCH NESS MONSTER -\n    GET YOU GOT DANM OWN MONEY\n    ChefM:I gave IT a Dollar. \n    CHefD:SHE GAVE IT A DOLLAR\n    ChefM: I thought it would go away if I gave it a dollar\n    ChefD: BUT OF COURSE IT AINT GONNA GO AWAY, YOU GAVE IT A DOLLAR HE'S GONNA ASSUME YOU GOT\n    MORE!!\n\nPriceless! ", "gilded": 0, "created_utc": "1265748074", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "Nessie this isn't a Harvard lecture, it's reddit.  We have to rely on synopsis.  You can't tell me France and England wanting to control natural resources in the world at large wasn't the main cause of the war of 1812.  There's just no ground to stand on.  National pride, please.  That was PR, not a real reason.", "gilded": 0, "created_utc": "1265779538", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt;Nessie this isn't a Harvard lecture, it's reddit. We have to rely on synopsis. \r\n\r\nYou didn't give a synopsis. You attributed a position to me that I never expressed. I have never denied that greed is an important factor. I take issue with your repeated claim that greed is \"*the* cause\".\r\n\r\nIn the War of 1812, it was one cause among many. Kosovo is another example where other factors were very important, if not more important. Saying \"Human greed is the cause of all war\" is incorrect and reductionist. ", "gilded": 0, "created_utc": "1265780700", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "millions of peaches.\n\n**PEACHES FOR THE LOW LOW PRICE OF TREE FIDDY AND THAT'S CUTTING MY OWN THROAT**", "gilded": 0, "created_utc": "1265786627", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Does that rubber ducky/loch ness monster have a chub going on?", "gilded": 0, "created_utc": "1265809144", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "I need about tree fitty.", "gilded": 0, "created_utc": "1265825150", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "and they're currently havibg a tea party with sasquatch, the loch ness monster and a couple of unicorns.", "gilded": 0, "created_utc": "1265832203", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I could build it for you, but I'm gonna need about *tree fiddy*.", "gilded": 0, "created_utc": "1265920164", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Don't give no PlutoNash no *tree fiddy*!", "gilded": 0, "created_utc": "1265947993", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "I read \"The Doll House,\" but that's not what you were thinking of? Whatever, it doesn't seem to have given you a lot of useful information to work with. All you're saying is \"I don't know.\" I guess that would qualify you as an agnostic.\n\nI admit this is my own definition, but it works well for me: If it makes claims about supernatural stuff, including karma, rebirth or a soul, or invisible sentient agents, then it's religion. Without the supernatural, it's philosophy. Can you give me an example of a belief system you'd call religion that doesn't include claims of anything supernatural?\n\nBy \"substantiated,\" I'm talking about in the scientific sense. Nobody has ever seen God, nor measured his height or width, or even knows his mailing address. It is not possible to find even the slightest indirect evidence for his existence that isn't attributable to random chance. That's unsubstantiated for me. Again, if you have any tangible evidence for the Loch Ness monster, unicorns or Santa Claus, I'm happy to have a look.\n\nWhat you're saying is, \"any group can construct its own ideas about what's real and natural.\" I don't disagree: But the only group that was able to double human life expectancy, eradicate a bunch of diseases, fly to the moon and feed 6 billion people are scientists. The way they work, the knowledge they arrive at... it gets **results!** Judging by those, they have a better grip on reality than any other group of truth mongers, so that's where I put my trust.", "gilded": 0, "created_utc": "1266091772", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Where else can I go hunting for Nessie?", "gilded": 0, "created_utc": "1266192954", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "the dinosaur looked down and attempted to smile\n\na glimpse of its teeth made me feel all giddy\n\nit shuffled its feet (clutching its hat all the while)\n\nand abashed, inquired: \"you got tree fiddy?\"\n\n\n", "gilded": 0, "created_utc": "1266211794", "subreddit": "DoesAnybodyElse", "score": 2, "controversiality": 0}
{"body": "It was about that time that I noticed the little girl scout was about 8 stories tall and was a crustacean from the Paleozoic era-- I said dammit monstah get off my lawn. I aint givin' you no tree fitty", "gilded": 0, "created_utc": "1266368930", "subreddit": "fffffffuuuuuuuuuuuu", "score": 28, "controversiality": 0}
{"body": "Tree Fitty should be like...an ounce of dank.", "gilded": 0, "created_utc": "1266390308", "subreddit": "fffffffuuuuuuuuuuuu", "score": 0, "controversiality": 0}
{"body": "DAT MONSTER WANTED TREE FITTY", "gilded": 0, "created_utc": "1266398817", "subreddit": "fffffffuuuuuuuuuuuu", "score": 7, "controversiality": 0}
{"body": "All fake.\n\nAll started by either lies or people who didn't know what they were looking at. exaggerated and added to over time and these days the loch ness monster is now humongous (was probably originally a big fish)\n\nAlso see: mermaids. They were actually manatees.", "gilded": 0, "created_utc": "1266519881", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "I think Loch Ness Monster is a pretty cool guy. eh is ancient dinosaur in a lake and doesnt afraid of anything. ", "gilded": 0, "created_utc": "1266519990", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I live next to the Great Glen (where Loch Ness is about 15 miles up the Loch..I'm at Loch Lochy the first part of the Great Glen) and I think the Loch Ness Monster is a cunt!\n\nHe/she never calls, visits, sends cards, facebook messages nothing!  Never have I observed He/She when in my front yard.  Of course He/She is great at parting Americans and Japanese from their money so in that aspect I suppose He/She is vastly successful....but still a cunt.", "gilded": 0, "created_utc": "1266537097", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1266538435", "subreddit": "AskReddit", "score": 12, "controversiality": 0}
{"body": "It was about that time that I noticed the little girl scout was about 8 stories tall and was a crustacean from the Paleozoic era -- I said dammit monstah get off my lawn. I aint givin' you no tree fitty.", "gilded": 0, "created_utc": "1266541391", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "It's from the paleolithic era.", "gilded": 0, "created_utc": "1266592623", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "You people are downplaying just how perturbed she was by the situation.  The fact that a pretty white girl looked up and made eye contact on public transportation is like seeing Bigfoot riding the Loch Ness Monster.", "gilded": 0, "created_utc": "1266597685", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "It's that damn loch ness monster again!", "gilded": 0, "created_utc": "1266681361", "subreddit": "fffffffuuuuuuuuuuuu", "score": 3, "controversiality": 0}
{"body": "Atheists don't want to counter-argue, they just want to shut down any mention of Christianism or God. \n\nFunny that I don't see these atheists with foam at the mouth denying the tooth fairy, Santa Claus, the Yeti and the Loch Ness monster with so much anger as they deny Christianity.", "gilded": 0, "created_utc": "1266691688", "subreddit": "Christianity", "score": -3, "controversiality": 0}
{"body": "Welfare queens are like UFOs*. A lot of people believe they exist and there are countless sitings, but there isn't really a lot of hard evidence that they do exist. \n\nEdit:\n* If you're overly concerned about the semantics of the term \"UFO\" then replace it with \"extra-terrestrial aliens\", \"ghosts\", \"the Yeti\", \"The Loch Ness Monster\", etc.", "gilded": 0, "created_utc": "1266784055", "subreddit": "AskReddit", "score": 21, "controversiality": 0}
{"body": "I'm pretty sure that Nessie was joking, or else the tone would be quite a bit different.  You will find some people who disagree with you, but in most cases if you ease the conversation outward, you will find that these people are generally anti-*all* foreigners.  Try mentioning China(?) as a trade partner to the U.S. or something.  If it isn't the case, I'd be more curious about their reasoning than anything.\n\nHonestly, I think that Saudi problems are similar and different than ours.  Humanitarian vs. Educational, maybe?  This isn't the thread to put a lot for thought into this.. but I might do so during my coffee tomorrow.  I think it would be easier to revolutionize Saudi Arabia in a lot of ways that the U.S. can't right now, and vice versa.  Certainly not a reason to consider reducing relations.", "gilded": 0, "created_utc": "1266847123", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "That goddamn monster came to the fence, and I say, what you want monsta?  And he said tree fitty... Ooh that damn monsta, I ain't gonna give you no tree fitty", "gilded": 0, "created_utc": "1266868386", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I came up with this joke when i thought I was going to give a presentation at a network security conference.  The idea was to put it on the title page so people would be wondering what in the hell the punchline was while they were waiting for me to start.  Here goes.\n\nQ:  What did the Loch Ness Monster say when when asked to build a very redundant network?\n\nA:  I need about three FDDI.\n\nI've pulled that one out a couple of times around network geeks and it gets a very high level of groans from the people that get it.  ", "gilded": 0, "created_utc": "1266886155", "subreddit": "AskReddit", "score": 29, "controversiality": 0}
{"body": "The coolest mythical creatures. Nessie aint got shit on narwhals!", "gilded": 0, "created_utc": "1266892185", "subreddit": "circlejerk", "score": 1, "controversiality": 0}
{"body": "Not Joke_explainer but...  To get it you need to not only be a network nerd  but also a South Park fan.  FDDI stand for Fiber Distributed Data Interface and is a networking topology and having three of them would be overkill for most applications.  It is also widely pronounced \"fiddy\".  South park has a running joke about the Loch Ness Monster asking for \"about $3.50\" in an urban accent.  It ends up sounding like \"three fiddy\" (actually it ends up sounding like \"tree fiddy\" but that doesn't help you understand this joke.)", "gilded": 0, "created_utc": "1266896380", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "Its a South Park reference. The Loch Ness monster is known to request \"tree fiddy\" ($3.50) from Chief's parents.\n\nFDDI (rhyming with \"fiddy\") is networking interface standard using fiber optics. ", "gilded": 0, "created_utc": "1266896443", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "Three dollars and fifty cents \"tree fiddy\" it's a southpark joke about the time chefs parents met the loch ness monster.\n\n[youtube](http://www.youtube.com/watch?v=9cn7xfBpZ3M)", "gilded": 0, "created_utc": "1266896989", "subreddit": "AskReddit", "score": 9, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1266978800", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "TREE FIDDY? YOU NO GORILLA, YOU DAH GODDAM LOCH NESS MONSTA!", "gilded": 0, "created_utc": "1266979014", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "You're the Loch Ness monster?", "gilded": 0, "created_utc": "1267039808", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "If you had given him $170 then you would've had the best looking number back, [tree fiddy](http://www.southparkstudios.com/clips/103567/?tag=Chef's+Mom) (0:55, about half way).", "gilded": 0, "created_utc": "1267050103", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I haven't been to the supermarket since about 2001 sometime. \n\nThey deliver to your front door for like £tree fiddy. ", "gilded": 0, "created_utc": "1267195982", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
