{"body": "OCH! Back to the Loch with you, Nessie!", "gilded": 0, "created_utc": "1257209776", "subreddit": "WTF", "score": -2, "controversiality": 0}
{"body": "It's a shame that his Nessie photos are [hoaxes](http://www.lochnessinvestigation.org/flipper.html).", "gilded": 0, "created_utc": "1257241528", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "It has been proved that whisky improves your chances of sighting the loch Ness monster, the more you drink the bigger the monster gets. The exceptions are if you own a hotel or tourist shop in the area, to them the monster is very real.", "gilded": 0, "created_utc": "1257242184", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "The only place I've been where it's normal to hear \"I'm going down for more nessies\"", "gilded": 0, "created_utc": "1257319791", "subreddit": "ILiveIn", "score": 1, "controversiality": 0}
{"body": "oh, he's gonna make you eat those words, nessie!", "gilded": 0, "created_utc": "1257352702", "subreddit": "entertainment", "score": 2, "controversiality": 0}
{"body": "I once read that the was the cause of the Loch Ness Monster sightings. People see something moving in the water, and alot of the time it's dead sunken trees leaking gas which can get caught, causing them to float upwards, sometimes suddenly.\n\nTrue or not? Iunno.", "gilded": 0, "created_utc": "1257354314", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "&gt;Women past menopause have no sexual fitness, for instance, yet evolution does not kill them off the moment they can no longer reproduce, as it does in many other species.  \n  \nLife expectancy in the paleolithic era was 33 years, compared to the world average now of 65.  So without technological advances I don't imagine there would be many women past menopause.  \n  \nIt depends on whether or not you consider advancement of technology as evolution.", "gilded": 0, "created_utc": "1257383031", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Holy shit, this Nessie kid is the king of assholes.", "gilded": 0, "created_utc": "1257399077", "subreddit": "reddit.com", "score": 5, "controversiality": 0}
{"body": "Good idea: tree fiddy?", "gilded": 0, "created_utc": "1257401703", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "You almost got it going! Although it's not a haiku that I had in mind...\r\n\r\n&gt;Chupacabra, unicorn, Loch Ness monster, dragon,  \r\nJersey Devil, Yeti, Cthulhu in disguise   \r\n*Santa Claus, Big Foot dreary, Easter Bunny, Tooth Fairy,  \r\nUFOs, Alien Life, Jesus Fucking Christ*  \r\n\r\n&gt;WE DIDN'T START RELIGION   \r\nIt's been always winning  \r\nSince the earth's been spinning  \r\nWE DIDN'T START RELIGION  \r\nNo, we're not believing,  \r\nWe're simply living on, and on, and on...  ", "gilded": 0, "created_utc": "1257621570", "subreddit": "atheism", "score": 36, "controversiality": 0}
{"body": "Santa, tooth fairy\r\n\r\ngnomes, elves, nessie, unicorns\r\n\r\nYahweh, Jesus Christ\r\n", "gilded": 0, "created_utc": "1257622686", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "You always have the option of acquiring an education. Having done so, you will discover why people need to believe these things, and what particular hunger these various sources feeds, and why scientists, despite frequent and careful appraisals, don't find anything there to study.\n\nThink! If a scientist found evidence for an an alien visitation, he would instantly win a Nobel Prize and become rich. Scientists are naturally anti-authoritarian and curious. Why don't any of them find what you seem to believe is present in these stories? Or, for that matter, the Loch Ness Monster, Bigfoot, Yeti, etc., etc.. Any of these would lead to instant riches and fame.\n\nThe problem is that there is no evidence for any of them.\n", "gilded": 0, "created_utc": "1257628732", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1257750764", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Where might I find this \"Loch Ness Monster\"?", "gilded": 0, "created_utc": "1257797094", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Nessie lives in a Loch, not the sea.", "gilded": 0, "created_utc": "1257805220", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "\"Champ is a picture of a log, Nessie is a toy submarine with a head made out of plastic wood, while Ogopogo is a Plesiosaur.\" --21", "gilded": 0, "created_utc": "1257825512", "subreddit": "reddit.com", "score": 6, "controversiality": 0}
{"body": "So what? If I look at internet porn my Loch Ness Monster surfacse for 1 minute &amp; then dives back under. ", "gilded": 0, "created_utc": "1257888739", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "Yo Mossad, \r\n\r\nI gots da plans to Iran's Death Sta'. Lookin' for a lovely leia'. \r\n\r\nYours,\r\n\r\nMr. Nessie", "gilded": 0, "created_utc": "1257900512", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Agnostic atheist.\n\nThat you acknowledge something might (or might not) exist doesn't make you a believer in it; that's what makes you an agnostic.\n\nSee also: Loch Ness Monster, or any number of things which *might* exist but youdon't actually believe in (until there's sufficient evidence).", "gilded": 0, "created_utc": "1257920774", "subreddit": "atheism", "score": 8, "controversiality": 0}
{"body": "plus, the poor loch ness monster died of heavy metal poisoning.", "gilded": 0, "created_utc": "1257925419", "subreddit": "offbeat", "score": 2, "controversiality": 0}
{"body": "I thought it was a transporter for the Loch Ness Monster.", "gilded": 0, "created_utc": "1257926479", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Loch Ness is notoriously muddy.  So muddy in fact that a movie crew lost a life-sized fake Loch Ness monster in it.  You're not going to be able to see more than half a golf ball at once on the bottom of Loch Ness.", "gilded": 0, "created_utc": "1257952758", "subreddit": "environment", "score": 16, "controversiality": 0}
{"body": "&gt; I found this paper which tries (I think persuasively) to vindicate Eddington of wrongdoing.\n\nI agree this story doesn't come to a clean resolution like a cop show or a stage play. We may never understand the situation very well -- I mean, apart from the raw data itself, which is still available.\n\nEDIT: Also, Eddington's status as \"expert\" may have played a part that Eddington might have objected to if he fully understood its implications, and about which he might have had no knowledge.\n\n&gt; The thing to realize is that when you get data from an experiment, the data doesn't tell you if it matches the theory -- that's a judgment call for the scientist to make.\n\nParticularly important in a case where there were no precautions taken against confirmation bias -- no double-blind, no controls at all really.\n\n&gt; ... the paper makes clear that many visible light eclipse observations throughout the century failed to match the predictions of GR within one standard deviation ...\n\nEveryone who reads about this experiment should understand this. The 1919 \"confirmation\" of GR wasn't really a confirmation. By the time this method could conclusively decide the question, many other, better confirmations were available.\n\nAll this means the timing of Einstein's rise to the status of public figure arose to a large extent through a combination of chance factors -- as it does in the life of any celebrity.\n\n&gt;&gt; \"good evidence\" is easier to fake than good theory.\n\n&gt; I think in pseudoscience it's a synergy, because a bad theory is not falsifiable, which means that it's really easy to find evidence that appears to support that theory.\n\nI agree. I was thinking of things like Bigfoot and the Loch Ness Monster -- it's easier to build support with a blurry photograph than with an explanation for how Nessie could (1) live there for decades or centuries and (2) escape all our efforts to find her.\n", "gilded": 0, "created_utc": "1258047368", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "14...  she's getting into photoshop, obviously.  This picture also contains the Loch Ness monster and Dracula's castle\n\nedit: correct age applied.  my daughter is not one.  ", "gilded": 0, "created_utc": "1258243147", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "'bout tree fiddy.", "gilded": 0, "created_utc": "1258311434", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Al-Qaeda doesn't exist. Never existed. \n\nThere's more proof to the existence of Bigfoot or Loch Ness monster than to Al-Qaeda.", "gilded": 0, "created_utc": "1258408507", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "metal mario is badass dude :) and didn't hazy maze cave have the loch ness monster lookalike? ", "gilded": 0, "created_utc": "1258538892", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "Helllo emkat &amp; Nessie: Please note that I did not use the word \"deny.\" I stopped bringing up the subject with Japanese many years ago when I realized it was a sensitive point. Rather than \"deny\" the correct phrase, say ten years ago, would be \"less than forthcoming.\" \n\nAfter the tremendous popularity in Japan of Bai Young Joon (various spellings) in *Fuyu no Sonata* (Winter Sonata) (six or eight years ago?), other Korean dramas and music, there has been a huge cultural shift. Japanese now know much more about Korean pop culture and their mutual history.  \n\nWhen I first came to Japan a Korean-Japanese woman gave a report to the class claiming that many popular Japanese entertainers, and she gave their names, were in fact Korean. It was a good report but the reaction of the class was either silence or according to one student, \"a lie.\"\n\nNow it really is common knowledge that the entertainers she mentioned and some of those popular now, are in fact Korean.\n\nAnd why must I use the word \"Korean\" to describe a person whose family may have lived in Japan for four generations? Because they have to carry the same foreign registration cards that we do as \"real\" foreigners. \n\nThings are changing for the better but there is still discrimination against Koreans who were born and/or live in Japan. Would you agree with that?\n\nI realize you already know much of the above but for those who have never lived in either country I gave some background.", "gilded": 0, "created_utc": "1258778161", "subreddit": "worldnews", "score": 0, "controversiality": 0}
{"body": "Yes!  I have 2 Volcanoes, and it makes a difference what I load them with.  More moist=more bags and more mellow.  Less=stronger bags and less of them.  The grind also makes a BiG difference!  You would think that you want it as fine as you can get to expose maximum surface area, but this makes it harsh unless turned down to about 250F, and then it does not seem to satisfy.  I like mine around 350F(like the Loch Ness Monster!) and a medium grind.  Delicious and effective!  For me at least.. ", "gilded": 0, "created_utc": "1258871657", "subreddit": "trees", "score": 7, "controversiality": 0}
{"body": "Cobra Triangle. Original RARE game on the NES that was like RC Pro Am but with boats with guns and at the end of every few races you fought the Loch Ness Monster or a Kraken.", "gilded": 0, "created_utc": "1258958777", "subreddit": "gaming", "score": 3, "controversiality": 0}
{"body": "No, he called muslims \"goatfuckers\".\n\nI don't understand Nessie's comment btw. Theo van Gogh did not disrespect free speech and women's equality, he was a champion of it.", "gilded": 0, "created_utc": "1259127816", "subreddit": "worldnews", "score": 5, "controversiality": 0}
{"body": "[Holy shit, I found the Loch Ness Monster](http://imgur.com/KOyJT)", "gilded": 0, "created_utc": "1259202317", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "I got hit twice, but I disagree with interpretations of both.\n\nFirst:\n&gt;The contradiction is that on the first ocassion (Loch Ness monster) you agreed that the absence of evidence or argument is enough to rationally justify belief in the non-existence of the Loch Ness monster, but on this occasion (God), you do not.  \n\nThe first questions dealt with falsifiable evidence(found false in this case, nessie was expected to exist, but didn't) and the second specifically states that WITHOUT evidence atheism is a belief, which it is... I don't see the contradiction there.\n\nSecond:\n&gt;You've just taken a direct hit! You say that God does not have the freedom and power to do impossible things such as create square circles, but in an earlier answer you said that any being which it is right to call God must be free and have the power to do anything. So, on your view, God is not free and does not have the power to do what is impossible. This requires that you accept - in common with most theologians, but contrary to your earlier answer - that God's freedom and power are not unbounded. He does not have the freedom and power to do literally anything.\n\nThink about it, the fucking guy is all powerful... you don't need to change rules (of the game you designed) because, obviously, doing so would invalidate the fact you are all powerful.  Circles aren't square for a reason, the reason is what I try to understand.", "gilded": 0, "created_utc": "1259394992", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I thought you were agreeing  with leachja's answer of \"It [atheism] is a belief\".\n\nTo make my position clear and open for target practice...  atheism (as an unqualified umbrella term) is most definitely not a belief.\n\nIt only counts as a belief if you take the strict or strong interpretation of it and define atheism to precisely be the positive assertion that there is no god.  [which is a ridiculously high bar for admittance]\n\nI think the questions of the quiz make it pretty clear they're using it in a sense of \"there is no god\" is being said with similar confidence to \"there are no pixies in my garden\" or \"there is no loch ness monster\".", "gilded": 0, "created_utc": "1259405169", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I admit that I prefer the strict interpretation, but in this case I think it does not matter.\n\nThe \"god\" question specifically asks to ignore the huge body of evidence that no god exists.  Given this request I can only say that I believe no god exists just like I say I believe pixies do not exist. In comparison the nessie question specifically asks to consider the body of evidence that no nessie exists and I can say that it is likely a fact that no giant monster haunts that loch.", "gilded": 0, "created_utc": "1259407869", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt; If you're bored, you can take the quiz as a basic deist\n\nIf you answered it this way, then how did you answer #1 as false?\n\nAnd why would you answer #2 as true?  We can create our own morality separate from any proposed God.  It's only certain groups of people (mainly theists) who make morality the unique domain of gods.  Many theists don't even make this claim.\n\nGod exists: false.  No god no morality: false.  God free to do anything: true.  must want little suffering in the world: false.  Power to do anything.  Evolution True.  \n\nI start to get iffy on #7 \"OK to believe based on firm inner conviction\"...  I'm assuming deists think that's true.\n\nKnow everything knowable: true.  Torture bad: true.  No nessie: True.  Necessary Pain: false.  God can flip morality: true.  Foolish to believe in God w/o conclusive evidence: false.  Atheism is faith: false.  \n\nQ15: The rapist one.  Have to answer true, since you can believe in Go without evidence.  [bite a bullet]\n\nQ16:  Square circle.  [direct hit because I don't believe those hold meaning, so it there's nothing to request god to do... the FAQ has a section for this one, basically OKing the answer if you define meaning carefully enough]\n\nQ17:  OK to believe in God: true.\n\n-\n\nNow, as a deist, I only took two hits (one bullet, one direct hit), and neither of them were contingent on any definition of God.\n\nQ15 is only bad if you also require that because the rapist is justified in himself that we have to excuse him as well, which is not embedded in the question...  it's a weak phrasing.\n\nQ16 already explained that it's not a limitation of God, it's a limitation of human language and ability to make requests.\n\nWhere am I answering different?  or where are you getting contingency on a god definition for your problems?", "gilded": 0, "created_utc": "1259433858", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "That still doesn't explain why the illuminati has been feeding Nessie with the disembodied heads of asian elephants...", "gilded": 0, "created_utc": "1259448148", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Number 4 is:\n\n&gt; 4) Someone says something about imaginary friends, or the easter bunny, or unicorns, or Santa Claus, or fairies, or the Loch Ness monster, or the fucking Flying Spaghetti monster, and thinks that he has not only made a very clever joke but also has actually made an argument.\n\nI don't think I've made a joke. I'm deadly serious.  I'm not saying I'm\nclever, I'm actually saying that people who believe in certain religious myths are actually idiots.  \n\nInsulting people for stupidity is something that every single culture does. It's because as humans we actually respect reason and rationality. \n\nBy formulating this respect into a \"cliche\", you're actually standing up for stupidity.  Good for you.  Now get out of the fucking way. We have actual issues in the world to resolve and important things to do.  Go watch TV or something.", "gilded": 0, "created_utc": "1259547964", "subreddit": "atheism", "score": 1, "controversiality": 0}
