{"body": "I told that goddamn Loch Ness Monster I ain't got no goddamn three fiddy!", "gilded": 0, "created_utc": "1267412063", "subreddit": "reddit.com", "score": 10, "controversiality": 0}
{"body": "oh gaw damned it woman! why didya give dat monster tree fitty; Now he gonna come back for mow.", "gilded": 0, "created_utc": "1267413680", "subreddit": "reddit.com", "score": 6, "controversiality": 0}
{"body": "&gt;tree fiddy!!\n\nFTFY", "gilded": 0, "created_utc": "1267422579", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "But first what are your thoughts? Granted, a belief in god is not the same as a belief in spirits/afterlife, but they are, IMO, closely related, considering the thought process involved. Indeed, it would be very comforting to believe that you never die, that though your body perishes your soul will live on, but it has just about as much evidence as an invisible man in the sky or the Loch Ness Monster.\r\n\r\nI don't think a belief in spirits can be as damaging as an organised religion, but it's just sad seeing the people who define their lives by thinking that there is something greater, when their present life is the greatest thing they have.", "gilded": 0, "created_utc": "1267438934", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "'bout tree fiddy", "gilded": 0, "created_utc": "1267494550", "subreddit": "shittyadvice", "score": 34, "controversiality": 0}
{"body": "God *damnit* monster. I ain't givin you no damn tree fiddy!", "gilded": 0, "created_utc": "1267498694", "subreddit": "shittyadvice", "score": 12, "controversiality": 0}
{"body": "Look out, secularists, they've got PRAYER on their side.\n\nYou just wait until they've Bigfoot and the Loch Ness Monster campaigning for them, then you'll *really* be sorry.", "gilded": 0, "created_utc": "1267546986", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "I wish...oh how I wish that I could just blindly BELIEVE that an invisible zombie guy in the sky is responsible for all of this. Unfortunately I was born with critical thinking which inhibits my ability to believe in ghosts, leprechauns, The Loch Ness Monster, Bigfoot, or a supreme being that created all of this. \n\nThat being said...I believe that our ability to appreciate the things this beautiful place has to offer is firmly planted in the biological function of the brain. Some people find the desert beautiful, some find it a vast space of emptiness. Our brains have evolved and developed over the span of time and continue to do so. The answer you seek I am afraid is as complicated at the function of the human brain itself. As it has been said \"Beauty in things exists merely in the mind which contemplates them.\"", "gilded": 0, "created_utc": "1267553704", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "I had one hit:\n\nI stated true to question 10:\nIf, despite years of trying, no strong evidence or argument has been presented to show that there is a Loch Ness monster, it is rational to believe that such a monster does not exist.\n\nI then stated true to question 14:\nAs long as there are no compelling arguments or evidence that show that God does not exist, atheism is a matter of faith, not rationality.\n\nThe test claimed the follow contradiction:\nThe contradiction is that on the first ocassion (Loch Ness monster) you agreed that the absence of evidence or argument is enough to rationally justify belief in the non-existence of the Loch Ness monster, but on this occasion (God), you do not.\n\nWhile I understand the contradiction they presented, that is not the reasoning I chose the answer to each question.\n\nI answer #10 true because in the specific case of the Loch Ness monster the level of non-evidence of existence is quite high when compared to areas where evidence could exist. Meanwhile the lack of evidence of God's existence I don't find to be near enough to that level.\n\nTo put it in other words the amount of non-evidence of the Loch Ness monster is enough for me to agree to the theory that it doesn't exist, the level of non-evidence of God is not enough for me to comfortably accept non-existence as a theory. As such both stances on God's existence (well God as I believe him to exist) are more based on faith than rationality.\n\nDoes this make sense or am I just making excuses for my current beliefs?", "gilded": 0, "created_utc": "1267556167", "subreddit": "reddit.com", "score": 4, "controversiality": 0}
{"body": "I took the same hit, and for similar reasons. The Loch Ness monster is claimed to have a physical presence in a specific location, and as such has been claimed to have been photographed on several occasions. God, on the other has, is a spiritual being (?), with no tangible corporal presence. Completely different cases.", "gilded": 0, "created_utc": "1267560471", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "or about 10 lake loch ness(es), ness's, nessies, fuckit.\r\n\r\nsame as one loch ness and nine more.", "gilded": 0, "created_utc": "1267561661", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "I ain't givin' that loch ness monster no tree fitty!!", "gilded": 0, "created_utc": "1267562982", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "What if the Loch Ness monster _does_ exist, but no one knows where it lives?\n", "gilded": 0, "created_utc": "1267565963", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "I knew these people existed but I didn't think they had ever been documented. It's like Bigfoot or Nessie. I'm so curious but I don't want to go near it.", "gilded": 0, "created_utc": "1267576546", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "tree fitty", "gilded": 0, "created_utc": "1267683498", "subreddit": "pics", "score": 25, "controversiality": 0}
{"body": "Bigfoot, unicorns, Santa Claus, the Tooth Fairy, the goddamn Loch Ness Monster.", "gilded": 0, "created_utc": "1267705794", "subreddit": "atheism", "score": 18, "controversiality": 0}
{"body": "So basically you replace \"In the name of the father, the son and the holy ghost\" with \"In the name of the bigfoot, the tooth fairy and the goddamn loch ness monster\"\n\nThat sounds awesome! Where do I sign up?", "gilded": 0, "created_utc": "1267711747", "subreddit": "atheism", "score": 9, "controversiality": 0}
{"body": "Well you could do what many people have done for ages.  Play the part of the Sunday Christian.  Go through the motions, go to church every Sunday.  Pray at every meal if that's your routine.  But consider that pretty much it.  You kids will go through a rebellious stage when they get older when they start questioning things.  If you play it cool, you may be the safe parent to talk with when that stage occurs.\n\nAlso, play up Santa, Johna &amp; the Whale, and just about every other Sunday school bullshit story that is obviously false.  Assuming your branch of Christianity are not creationist throw in Noah's Arc and Adam &amp; Eve.  Give them the tools &amp; educational experience to learn how to separate fact from fiction.\n\nSubscribe to a science magazine or two.  As your kids get older they will love reading them.\n\nBooks I would recommend (Get these for yourself &amp; leave them on a book shelf for your kids can get to as they get older):\n\n* The Complete Grimm's Fairy Tales (not for little kids, but a great read for teens)\n\n* Books on Dinosaurs.  Kids love this.\n\n* Books of Greek mythology (also try to find books on African, Norwegian &amp; Asiatic mythology)  All of this is great to compare &amp; contrast to what they are taught.\n\n* Books on Nature, Bugs identification, birds etc.\n\n* Kid books on Scientific experiments.\n\nAll around keep a healthy supply of books &amp; stories for kids to read as they grow up.  Even books like the Lion, The Witch &amp; the Wardrobe with it's Christian undertone is nothing more than a great fictional fantasy story for kids.\n\nTeach your kids how to spot hoaxes like palm readers, psychics, ghosts, people who \"talk\" to animals, no loch ness monster, no big foot.  Get them books on these subjects.  It's all still fascinating.  But still all bunk.", "gilded": 0, "created_utc": "1267767566", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "No, I ain't gonna give you tree fiddy, now go away!", "gilded": 0, "created_utc": "1267824589", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt; It's a shame it's going to use the Zune OS instead of W7.\n\nYeah, a finger-friendly OS basd on .NET is way worse than some creature form the paleolithic era that failed at tablets for 10 years.", "gilded": 0, "created_utc": "1267901219", "subreddit": "technology", "score": 5, "controversiality": 0}
{"body": "W did plenty of despicable things in office. Why don't you focus on those instead of the imaginary conspiracies? It's appropriate that I brought up bigfoot before, because you're like a cryptozoologist obsessed with finding the Loch Ness monster, when there are still amazing, REAL animals out there to discover.", "gilded": 0, "created_utc": "1267914799", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "If it was your claim that Russell's teapot doesn't exist, then yes, the burden of proof is on you, the claimant.  Good luck trying to prove a negative.  A better example would be if you claimed the Loch Ness monster was real.  My only response would be, that's a bold claim, can you prove it?", "gilded": 0, "created_utc": "1267939839", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "So much wrong in one paragraph.  So you're saying that if you claim something, let's take my Loch Ness monster example from below, that if I was interested in the veracity of your claim, it would be up to me to prove you right and not up to you to provide evidence for your claim?", "gilded": 0, "created_utc": "1267940827", "subreddit": "reddit.com", "score": 4, "controversiality": 0}
{"body": "Get a deep fried Mars bar.\n\nFind Nessie.\n\nFor fucks sake don't call them English.", "gilded": 0, "created_utc": "1267986054", "subreddit": "unitedkingdom", "score": 9, "controversiality": 0}
{"body": "The title makes sense in the original in that the \"zombies\" would have considered Neville, a guy rounding up and killing them, a monster. We often treat \"monsters\" as legends. From the Loch Ness Monster to Jack the Ripper, these are legends. Thus Neville is legendary.", "gilded": 0, "created_utc": "1268011118", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Loch Ness Monster Balls!\n-Randy", "gilded": 0, "created_utc": "1268109177", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I bought one off a hobo for tree fitty.", "gilded": 0, "created_utc": "1268195373", "subreddit": "fffffffuuuuuuuuuuuu", "score": 2, "controversiality": 0}
{"body": "They used to have around $8.50 per single black woman, but then the loch ness monster came.", "gilded": 0, "created_utc": "1268217550", "subreddit": "politics", "score": 91, "controversiality": 0}
{"body": "God damn loch ness monster...\n:)\n", "gilded": 0, "created_utc": "1268220047", "subreddit": "politics", "score": 11, "controversiality": 0}
{"body": "A cute girl scout came to the door selling cookies.  She went to buy some and was like \"how much?\". The girl scout said \"it'll be about tree fitty\". Well, it was right about then that she noticed the girl scout was 80 feet tall and was a giant crustacean from the Paleozoic era.\n\nMake more sense now?", "gilded": 0, "created_utc": "1268226310", "subreddit": "politics", "score": 41, "controversiality": 0}
{"body": "Median wealth for Loch Ness Monsters is about $Tree Fiddy.", "gilded": 0, "created_utc": "1268234248", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "No one can get a decent picture of Sasquatch, Loch Ness monster, or Aliens.  I think you found the biggest coolest cat creature.  Love the glowing eyes.  Could be the newest SCI FI or Discovery Channel star.  ", "gilded": 0, "created_utc": "1268266530", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Ok, so just curious as to what other things you believe in that aren't typical. Do you believe in Big Foot, ghosts or the Loch Ness Monster?", "gilded": 0, "created_utc": "1268300488", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Hey, Nessie\n\nHairyneanderthal here. Got into a couple of fights so changed my logon.\n\nI normally print [this](http://www.timeanddate.com/calendar/?country=26) and stick it somewhere in the office each year.\n\nI know it's not quite what you're asking for. If your excel skills are up to it to you should be be able to create what you want in 15-20 mins using my link though.\n\n", "gilded": 0, "created_utc": "1268314181", "subreddit": "japan", "score": 2, "controversiality": 0}
{"body": "Tree fiddy!", "gilded": 0, "created_utc": "1268323966", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I... I'd need about tree fiddy.", "gilded": 0, "created_utc": "1268398754", "subreddit": "web_design", "score": 2, "controversiality": 0}
{"body": "I came up with this [joke](http://www.reddit.com/r/AskReddit/comments/b56c6/reddit_what_are_your_favorite_jokes_that_only/c0l0r3i) and it appears that it is original.\n\nFor those that don't want to read the link:\n\nQ: What did the Loch Ness Monster say when when asked to build a very redundant network?\n\nA: I need about three FDDI.", "gilded": 0, "created_utc": "1268420453", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "How much was it worth without it?  About tree fiddy?", "gilded": 0, "created_utc": "1268645813", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "\"I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster!", "gilded": 0, "created_utc": "1268674607", "subreddit": "beer", "score": 2, "controversiality": 0}
{"body": "Loch Ness Monster here.\n\nGo, Nessie, go!", "gilded": 0, "created_utc": "1268685786", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "No, but I do believe in UFOs, astral projections, mental telepathy, ESP, clairvoyance, spirit photography, telekinetic movement, full trance mediums, the Loch Ness monster and the theory of Atlantis.", "gilded": 0, "created_utc": "1268832016", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I'm not gonna give no Loch Ness Monster 3 fiddy!", "gilded": 0, "created_utc": "1268842595", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "What if somebody told you there was a giant creature on the ocean floor that resists all attempts of empirical measures?  Photographs turn up blank, it cannot be touched, smelled, tasted, seen, or heard.  Does not have any measurable impact on any aspect of the environment.  The only way people even know to talk about it is either they heard a story told by another or they have to rely on sketchy modes of knowing and sharing such as subjective interpretation.  Do you not see this as nearly an ideal candidate for skepticism?\n\nIf the sea monster was treated like everything else, then it would be placed on the heap of mythical creatures, right next to the Loch Ness Monster.  \n", "gilded": 0, "created_utc": "1268850961", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "can i have tree fiddy?", "gilded": 0, "created_utc": "1268927867", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "How can tactics be justified if they're employed to fix something that has been shown to not be broken? What tactics would be justified for a group attempting to divert tax dollars to Big Foot or Loch Ness Monster defense?\n\nAny science that requires \"tactics\" such as dataset fabrication or destruction, the manipulation of the peer review process, and lying to the media and public isn't science. Any public policy that is based on such fraud will necessarily be bad.", "gilded": 0, "created_utc": "1268950360", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt;...we *might* all be speaking German right now.\n\nNessie, stop being a jerk. I covered my bases.", "gilded": 0, "created_utc": "1268974099", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Honestly, 'bout tree fiddy. ($3.50)", "gilded": 0, "created_utc": "1268984928", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Not to hijack this thread, but are you familiar with the firearm proficiency qualification requirements for LEO's? \n\nIt always amazes me to see how many people think all police officers are expert marksmen. I know many civilians that are better trained and better shots than police officers. \n\nI'm not disagreeing with the sentiment, gun owners should be trained and be proficient with their firearm. They should be able to hit the target they're aiming at, but you don't want to make the process ridiculously difficult either otherwise you'll run into a situation where ONLY the criminals and police(government) have them; thus defeating the spirit of the 2nd Amendment.\n\nLike the OP I also have my CCW(Nevada) the process is very straightforward. You have to go through a class and qualify with the weapon(s) you intend to carry. After that you take a trip to the police department and wait through a DMV like hell to get fingerprinted. Pay your fee($100.25, don't ask me what the quarter was for) and they mail you your Permit. Nevada is a \"shall issue\" state meaning if you're legally allowed to own a gun, they'll give you a permit to carry it. In other states, it's much more difficult/restricted. New York for instance is one of the WORST states for gun rights. There's typically a 6 month wait period while a judge \"reviews\" your application. You have to show a \"need\" to get a CCW(like carrying over $10,000 in cash a week or something). You can get a restricted license for home defense/target shooting/hunting but seeing a CCW on an everyday citizen is like capturing a Unicorn after seeing the Loch Ness Monster in Lake Erie. ", "gilded": 0, "created_utc": "1269144207", "subreddit": "IAmA", "score": 4, "controversiality": 0}
{"body": "Tree Fiddy.", "gilded": 0, "created_utc": "1269192831", "subreddit": "WTF", "score": 49, "controversiality": 0}
{"body": "Now dont give no ghost no tree fiddy, woman!", "gilded": 0, "created_utc": "1269194288", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "It was about that time that I noticed this stripper was a large crustacean from the Mezozoic era. So I says damnit monster! You get away from my chillin! Ain't nobody want to see that and it sure ain't worth no tree fiddy.", "gilded": 0, "created_utc": "1269195465", "subreddit": "WTF", "score": 35, "controversiality": 0}
{"body": "If you give that FanzOne tree fiddy I'll downvote you on general principle!", "gilded": 0, "created_utc": "1269276773", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "God dammit Loch Ness Monster.", "gilded": 0, "created_utc": "1269278383", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "The Loch Ness Monster", "gilded": 0, "created_utc": "1269281744", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "All:  \"Re-zero\" is actually labelled \"tare\" on most scales (just like in that picture of Nessie's scale), so look for that if you shop for a scale.", "gilded": 0, "created_utc": "1269282713", "subreddit": "Cooking", "score": 1, "controversiality": 0}
{"body": "Last week, Japanese scientists placed explosive detonators\nat the bottom of Lake Loch Ness to blow Nessie out of the water.\n                   \nSir Curt Godfrey\nof the Nessie Alliance summoned the help of\nScotland's local wizards to cast a protective spell over the lake\nand its local residents and all those who seek for the peaceful existence of our underwater ally.\n", "gilded": 0, "created_utc": "1269287136", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "***[OH NOES! Google, Fox, Republicans, Aliens and the Loch Ness Monster are in cahoots to stop me from voting in this poll!](http://i.imgur.com/ANbc3.png)***", "gilded": 0, "created_utc": "1269290187", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "&gt;Is there a difference between not believing in god and believing there is not a god?\n\nYes.\n\n&gt;If so, how do we distinguish the positions?\n\nOne makes a claim, the other is the absence of making a claim.\n\n&gt;My understanding has always been that there is a difference and that we use the word 'agnostic' to cover the 'not believing' case.\n\nThat is the colloquial usage, yes.  The OP's point is that that usage is incorrect. \"Atheist\" is the \"absence of belief\"; \"agnostic\" is the \"absence of knowledge\", which comes from the [gnostics](http://en.wikipedia.org/wiki/Gnosticism) who claimed *knowledge* of the existence of gods.\n\nLet's change the subject, and call those who believe in the existence of the Loch Ness monster \"theists\".  If someone claimed to *know* that Nessy existed, then they would be a gnostic theist; if one merely believed, but did not \"know\", then they would be an agnostic theist.  Likewise, if someone claimed they *knew* that Nessy did not exist, they would be a gnostic atheist; if one merely didn't believe that Nessy exists, they would be an agnostic atheist.\n\n&gt;In addition (as mentioned in another post somewhere), there's a political element here.\n\nOnly insofar as people have attached a stigma with \"atheist\" for so long that the \"agnostic\" label was used in its place, despite it being incorrect.", "gilded": 0, "created_utc": "1269295095", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Could be the Loch Ness Monster or the Abominable Snowman", "gilded": 0, "created_utc": "1269376483", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Damn, that's good.  I give ya tree fiddy fer it.", "gilded": 0, "created_utc": "1269474838", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "If you could do the Loch Ness monster, I would be thrilled.", "gilded": 0, "created_utc": "1269482733", "subreddit": "Favors", "score": 1, "controversiality": 0}
{"body": "Tree fitty?", "gilded": 0, "created_utc": "1269569390", "subreddit": "pics", "score": 10, "controversiality": 0}
{"body": "Don't go givin that spirit no tree fiddy!", "gilded": 0, "created_utc": "1269569947", "subreddit": "pics", "score": 8, "controversiality": 0}
{"body": "Priceless?\n\nMore like tree fiddy.", "gilded": 0, "created_utc": "1269598219", "subreddit": "fffffffuuuuuuuuuuuu", "score": 30, "controversiality": 0}
{"body": "I ain't got no tree fiddy!", "gilded": 0, "created_utc": "1269611271", "subreddit": "fffffffuuuuuuuuuuuu", "score": 3, "controversiality": 0}
{"body": "That is NOT a seal! The Loch Ness Monster has ESCAPED and is going after the Northwestern to plunder it's bounty of crab to feed it's babies so they can take over Alaska! - This is not going to be pretty...", "gilded": 0, "created_utc": "1269648786", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "It's the goddamn Loch Ness Monster!", "gilded": 0, "created_utc": "1269667223", "subreddit": "science", "score": 15, "controversiality": 0}
{"body": "i said i ain't givin' you no tree fitty, you god damn lochness monster!", "gilded": 0, "created_utc": "1269670357", "subreddit": "science", "score": 14, "controversiality": 0}
{"body": "damn you loch ness monster!", "gilded": 0, "created_utc": "1269752366", "subreddit": "pics", "score": 11, "controversiality": 0}
{"body": "MY GOD....IT ALL MAKES SENSE NOW. e=mc2, socks missing in the dryer, the loch ness monster, the Tunguska incident and now \"my cheese all gone. ", "gilded": 0, "created_utc": "1269753176", "subreddit": "IAmA", "score": 4, "controversiality": 0}
{"body": "'bout tree fiddy", "gilded": 0, "created_utc": "1269755282", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "and do you know what he said?.... I need about tree fiddy", "gilded": 0, "created_utc": "1269761048", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "You kids wanna hear about the time we saw the Loch Ness Monster?", "gilded": 0, "created_utc": "1269762493", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "god damn it woman don't give him no tree fiddy!", "gilded": 0, "created_utc": "1269804438", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Even if there weren't bigotry based on religious reasons, they'd still be following an incredibly stupid ideology and should only be shown the same attitude as anyone else who does the same, whether it applies to those who follow psychics, patrol for the loch ness monster, or sacrifice chickens to appease their goat god.\n\nEven more so, there's a number of evils perpetrated not just against non-believers, but followers of that many theistic beliefs.  Things like condemnation of birth control, oppression of women, and so on.", "gilded": 0, "created_utc": "1269836848", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "When I worked in an office with lots of middle age women, my husband changed my messege tone without me knowing. I was walking down the long office to make tea and all I could hear, super loud was \n\n\"I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!\"  I gave him a dollar. She gave him a dollar.  I thought he'd go away if I have him a dollar. \n\nI had to just keep walking with my head disband a really red face :( \n", "gilded": 0, "created_utc": "1269858195", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I'm holding out for legendary that are like, actually legendary animals.\n\nUnicorn, Bigfoot, Loch Ness Monster, Yeti, Werewolf, Dracula, Blackula, so on and so forth.", "gilded": 0, "created_utc": "1269912817", "subreddit": "comics", "score": 4, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1269923795", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "God damn Loch Ness Monster!", "gilded": 0, "created_utc": "1269924065", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "Unicorn - Rapidash\n\nYeti - Abomasnow\n\nLoch Ness Monster - Lapras\n", "gilded": 0, "created_utc": "1269933880", "subreddit": "comics", "score": 1, "controversiality": 0}
{"body": "I refuse to respect delusional nonsense when it takes the form of the Loch Ness monster, ghosts, alien abduction, perpetual motion machines, desktop cold-fusion, 2012 apocalism, or Atlantis. If you believe any of that shit, you're at best duped and at worst a crackpot.\n\nWhy should equally irrational convictions deserve any less derision simply because they're labeled \"religion\".", "gilded": 0, "created_utc": "1269941610", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "just checked back in now, as your coming from Boston it might be worth noting Japanese people love baseball, something along those lines would work too for presents.talking points. Nessie has some good points too on the pics from home.", "gilded": 0, "created_utc": "1269959646", "subreddit": "japan", "score": 1, "controversiality": 0}
{"body": "About tree fiddy. ", "gilded": 0, "created_utc": "1269996480", "subreddit": "pics", "score": 7, "controversiality": 0}
{"body": "tip #2: droid messes up some unicode fonts.  Thai displayed as rows of boxes after using it.  Arrhh, back to the lochs with you, Nessie.", "gilded": 0, "created_utc": "1270014359", "subreddit": "Ubuntu", "score": 1, "controversiality": 0}
{"body": "Bout tree fiddy?", "gilded": 0, "created_utc": "1270019220", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Tree fiddy?!!", "gilded": 0, "created_utc": "1270022151", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "damn loch ness monster", "gilded": 0, "created_utc": "1270039336", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Oh, it's a robotic Loch Ness Monster. I get it now.", "gilded": 0, "created_utc": "1270044759", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "\"I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!\" ", "gilded": 0, "created_utc": "1270046835", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Bout' tree fiddy. ", "gilded": 0, "created_utc": "1270050909", "subreddit": "pics", "score": 15, "controversiality": 0}
{"body": "god dam loch ness monster!", "gilded": 0, "created_utc": "1270052809", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Exactly or about tree fiddy?", "gilded": 0, "created_utc": "1270073035", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
