{"body": "\"Since cannabis was downgraded there has been widespread concern about the increased prevalence of stronger \"skunk\" varieties.\"\r\n\r\nBullshit.  There is no 'superweed' and skunk weed is no better than a lot of strains I can name.  Most of it is in the growing conditions and skunk weed is not any kind of super weed, nor does such a thing exist.  Jam that nonsense, unless you think the loch ness monster smokes it.\r\n\r\n\"Ms Smith said this now accounted for 80% of the cannabis seized on the streets and the drug was nearly three times stronger than in 1995.\"\r\n\r\nMore ridiculous tripe.  They said that back in 1995 and again back in 1980 and in 1970 and by 2010 pot will be 100% THC.\r\n\r\nWhat a shame to see the UK taking the same line of blatant lieing and ignorance like the US DEA.\r\n", "gilded": 0, "created_utc": "1210184436", "subreddit": "worldnews", "score": 13, "controversiality": 0}
{"body": "They're French, not Victorian Britons. Still hot, but it's unsurprising that a few French women got talked out of their clothes in front of an early camera.\n\nThe Victorian Era was not an era in the sense of occupying the global zeitgeist. Unlike the paleolithic era or the information age, the Victorian Era was the reign of Queen Victoria of England, characterized by a period of stodginess with regard to civil and sexual matters.", "gilded": 0, "created_utc": "1210367306", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "OK, \n\nYou asked a good question- how is it that I can call these claims to be obvious falsities if there's no way of testing them?\n\nWell, I think you'd agree that my statement about pixies is so absurd that it almost certainly would have to be false.\n\nIf you dispute that, then imagine I asked you to bet money on this proposition.  How much would you be willing to stake (given 10:1 odds) that I was telling the truth?\n\nNot very much I doubt.  You might philosophically agree that it's *possible* that my imaginary pixies exist, but when push comes to shove, you'll have to admit that it's very very improbable that they do.\n\nBut why?\n\nIt's because my claims are so far removed from your experience, that *if* they were true you would have to rethink your entire beliefs with respect to biology, zoology, space travel, etc. etc.  \n\nIt seems inconceivable that biologists who have documented millions of animals could have overlooked pixies.  It's also incredible that given how difficult it is for us to get to the Moon that these pixies manage to fly up there every night.\n\nWell, I don't want to bore you, and I'm sure you get the point, which is that some claims are so outlandish, that they require (and deservedly so) a decent amount of evidence if you want to get people to believe in them.\n\nIt's not enough to say that you've seen the Loch Ness Monster.  If you expect people to believe you, you will need to provide video footage (at the very least).\n\n---------------------\nOK, so we're now in the unfortunate position that the claim is i) difficult to believe, and ii) untestable.  Can we now say that it's false?\n\nWell, no.  All we have shown is that it would be unreasonable to expect other people to believe it because it seems so improbable and is in conflict with so much about what we already know about the world.\n\nAnd yet, and yet....\n\nIt still seems like we ought to be able to say without fear of contradiction that pixies *don't* exist.  We can never be sure, but maybe we can provisionally rule them out of our list of possibilities with the important caveat that *if* any evidence comes along in the future, we reserve the right to change our minds.\n\nThat seems to me to be a sensible compromise about all surprising claims which have no supporting evidence.  \n\nWe can never completely rule something out, but we can relegate some claims as to be so improbable, that for all intents and purposes, we can quite happily live our lives as if they were false.  And again, we reserve the right to change our minds at a later date if and only if new evidence comes along.\n\n(OK, I've basically said this twice, but it is important!)\n\n----------------------\n\nSo, is the afterlife true or false?  Well, I can't strictly say that it's false, but I can say that it's highly improbable to be true.\n\nEssentially, the claim is just so extraordinary that it beggars (my) belief.  It would be in opposition to everything I know about physics, and I'm not a biologist, but I'll wager that it's also in conflict with all of biology.\n\nTo give you some idea of how improbable the claim is, I can state with absolute certainty that were a scientist to find hard evidence of an afterlife, that person would be assured of winning the Nobel prize, and would be credited with making the most important scientific discovery in history.  \n\nBy comparison, documentary evidence of the Loch-Ness monster would be seen as a trifling affair, barely worth mentioning in the same breath.\n\nEven footage of pixies traveling to the Moon would be by comparison a humdrum discovery.\n\nIn short, on a scale of 1 to 10 of improbability, with the Loch-Ness monster and pixies being a 10, the afterlife would rank a billion.\n\nThe entirety of science is based on the assumption that the universe (including us) operates according to 'natural laws'.  The afterlife however would be a supernatural 'thing', which instead of being governed by physical law, would exist in the realm of souls and Gods.\n\nWe never found evidence of anything which doesn't operate according to natural law, and if we did, we would have to reject one of our foundational principles of science- in fact- the *central dogma* of science, that everything occurs by natural processes.\n\nSo yes, it's still *possible* that the afterlife exists, but to believe in it, is to reject science- or to say that the scientific methodology is fundamentally flawed and that its central dogma is wrong.\n\nOK- so what?  Why should science be right and religion be wrong?  Why not the other way around?\n\nWell, science has done things religion has not been able to do, and will never be able to do.  The scientific process has produced ideas which *work*.  One of those ideas is electricity.  Another is quantum mechanics.  Another is evolution.   etc. etc. etc. \n\nBy contrast, religion has produced no truths of any value.  Not even the holiest of monks who prayed all his life could produce something as useful as penicillin.  \n\nWell, I'll stop here.\n", "gilded": 0, "created_utc": "1210848481", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "Damn Loch Ness monster! I ain't gat no three-fiddy!", "gilded": 0, "created_utc": "1210876458", "subreddit": "pics", "score": 13, "controversiality": 0}
{"body": "I wouldn't pay more than tree fitty, woman...", "gilded": 0, "created_utc": "1210941619", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Ah said ah need about tree fiddy", "gilded": 0, "created_utc": "1211136414", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1211371653", "subreddit": "funny", "score": 36, "controversiality": 0}
{"body": "an dat dam near monstah said gimme tree fiddy (i gave him tree fiddy) YOU GAVE HIM TREE FIDDY??!", "gilded": 0, "created_utc": "1211380168", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "I'm not making these extraordinary claims that you and SH are, so why would I waste my time?\n\nBut if you want to be taken seriously, why don't you? \n\nEven SH admits he was talking shit in this case:\n\nhttp://nymag.com/nymetro/news/people/features/11719/\n\nIt seems no-one has ever seen these \"tapes\" - not even SH, perhaps - or ever corrobarated his story. So why are you so determined to accept these extraordinary claims on even less evidence than the Loch Ness Monster?", "gilded": 0, "created_utc": "1211415205", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "&gt; I'm not making these extraordinary claims that you and SH are, so why would I waste my time?\n\nFirst, I'll note that you are lying in the above sentence. I never made the child-rape claim. I claim that Hersh did not repudiate his child-rape claim.  Understand the difference?\n\n&gt; So why are you so determined to accept these extraordinary claims on even less evidence than the Loch Ness Monster?\n\nWhy are you so determined to lie about what I actually wrote? \n\n", "gilded": 0, "created_utc": "1211416719", "subreddit": "worldnews", "score": 2, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1211579302", "subreddit": "politics", "score": 7, "controversiality": 0}
{"body": "I don't want cookies if they cost tree fiddy", "gilded": 0, "created_utc": "1211580418", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Many atheists scream from the top of their lungs that God doesn't exist.\n\nAnd if someone doesn't believe in God, UFOs, Unicorns, Loch Ness Monster, whatever, why should he keep saying that ?  It's not like there are religious subjects in here. Why not posts about the nonexistence of leprechauns ?", "gilded": 0, "created_utc": "1211699635", "subreddit": "funny", "score": -1, "controversiality": 0}
{"body": "Look oot Nessie, they're comin fer yee.", "gilded": 0, "created_utc": "1211934668", "subreddit": "technology", "score": 5, "controversiality": 0}
