{"body": "\"best ever\" is such a slippery term when it comes to UFO's, Sasquatch, and the Loch Ness Monster...oh, and Britney Spears, too.", "gilded": 0, "created_utc": "1199307437", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Woah, there's a mod_ruby? I'd categorised it with Nessie.", "gilded": 0, "created_utc": "1199399560", "subreddit": "programming", "score": 5, "controversiality": 0}
{"body": "tree fitty", "gilded": 0, "created_utc": "1199759998", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Noticed that too...bigfoot, loch ness monster, all mythical things need antiquated grainy footage.", "gilded": 0, "created_utc": "1199934782", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Loch Ness Monster signs deal to appear in next Oliver Stone movie", "gilded": 0, "created_utc": "1200071960", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Loch Ness Monster!!", "gilded": 0, "created_utc": "1200159894", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "I'd guess, if the answer wasn't really Loch Ness Monster, dunes. ", "gilded": 0, "created_utc": "1200162016", "subreddit": "science", "score": 7, "controversiality": 0}
{"body": "&gt; If God isn't supernatural, then you don't need faith to recognize his existence.\n\nWhy not? I don't see this connection between the supernatural and faith. Does the Loch Ness Monster exist? Some people have faith that it does. Does that mean it must be supernatural?\n\nAnd if a god appeared, therefore destroying any need for faith in his existence, would it mean he couldn't possibly be supernatural?\n\n&gt;If he is an corporeal being like any other, reason and evidence are sufficient to establish a belief in God. \n\nA belief yes - that's what faith, in this sense, is.\n\n\n&gt;Furthermore, if God exists as a natural being, then the probable explanation that he is the result of some evolutionary process.\n\nProbable yes, but when does probability and logic come into religion. And what do you mean by \"supernatural\"? If you mean operating outside of the laws of our universe, then your scientist would fall into this category.\n\n&gt;You didn't answer the question of whether you held such a scientist to be God.\n\nOK. A god, yes. God with a capital letter, no as I assume you're referring to the Christian god. There are plenty of types of \"god\" and I'm comfortable that a sentient being existing outside of our universe, and who was the creator of our universe, would fall into at least one of these.\n\n&gt;So what distinguishes the scientist-creator from a super-powerful Pharaoh?\n\nHis existence outside our universe and the fact that he'd created it?", "gilded": 0, "created_utc": "1200431229", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "&gt; Does the Loch Ness Monster exist? Some people have faith that it does. Does that mean it must be supernatural?\n\nWhether or not something *has* been proven using reason and evidence, as long as it *can* be proven, it is a matter of the natural world and not supernatural. We could drain Loch Ness and settle for all time whether or not the Loch Ness Monster exists. Even though faith may allow some people to believe the LNM exists without evidence, faith is still not necessary to believe in the LNM. Draining Loch Ness and finding the LNM would be sufficient, even if you lacked faith.\n\n&gt; And if a god appeared, therefore destroying any need for faith in his existence, would it mean he couldn't possibly be supernatural?\n\nYes, because he would then have form, dimensions, position, mass, etc. He would necessarily have to operate according to the laws of the natural world, limiting him in a manner not befitting of a God. He would need a brain of some sort and other organs, which might theoretically be damaged beyond repair, killing him. A god who can die is no God.\n\n&gt;&gt; If he is an corporeal being like any other, reason and evidence are sufficient to establish a belief in God.\n\n&gt; A belief yes - that's what faith, in this sense, is.\n\nNo, it's not. If you're going to redefine faith to mean \"belief\" and thus be completely redundant and meaningless, at least invent a new word to replace it. We'll call it \"slartibartfast\", the ability to accept something as truth by conscious choice absent evidence and even despite evidence to the contrary.\n\n&gt; Probable yes, but when does probability and logic come into religion.\n\nGood thing I'm not talking about religion then. I'm talking about the nature of the universe and supposed things beyond. These are questions with answers, ones that we may not yet (or ever) know, but answers nonetheless. I think it's entirely appropriate to handicap possible explanations in such a case.\n\n&gt; And what do you mean by \"supernatural\"? If you mean operating outside of the laws of our universe, then your scientist would fall into this category.\n\nGood question. Personally, I view the very concept of the supernatural as nonsense. If something does not exist as part of the natural world, it simply does not exist. (When you consider that the only God I would accept as a true God is supernatural, it should be plain why I'm an atheist.)\n\nNow when I say \"natural world\", do I mean Earth? Obviously not. For most of human history, the word \"world\" meant everything that ever was and ever will be. Then we found other worlds and discovered that they were very different than ours. Should we discover that our universe is yet again one among many, it means only that nature is larger and more complex than we thought.\n\n&gt; There are plenty of types of \"god\" and I'm comfortable that a sentient being existing outside of our universe, and who was the creator of our universe, would fall into at least one of these.\n\nYet his power is limited to the simulation he created. When you consider his entire being, he's just some nerd mucking about at a computer terminal. He is at best *thought of as a god* by his subjects, no different than the Pharaoh. Perhaps he even lives in a society not unlike our own, where people debate the existence of a true, supernatural God. If *that* God exists, mightn't he be annoyed that you called some nerd at a computer terminal God?\n\nP.S. I use the capital-G God typically to refer to the ultimate, uniquely supreme God. The Abrahamaic God is more specific than that, one possible choice that fits the bill, but not necessarily the only one.", "gilded": 0, "created_utc": "1200440450", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "&gt; Whether or not something has been proven using reason and evidence, as long as it can be proven, it is a matter of the natural world and not supernatural. We could drain Loch Ness and settle for all time whether or not the Loch Ness Monster exists. Even though faith may allow some people to believe the LNM exists without evidence, faith is still not necessary to believe in the LNM. Draining Loch Ness and finding the LNM would be sufficient, even if you lacked faith.\n\nAnd if god appeared (as plenty of them have supposedly done in the past), you wouldn't need faith, in this sense, to believe in him.\n\n&gt;Yes, because he would then have form, dimensions, position, mass, etc. He would necessarily have to operate according to the laws of the natural world, limiting him in a manner not befitting of a God.\n\nSo the Greek gods weren't gods, as they regularly strolled around amongst mortals? The Jewish/Christian god made a few terrestrial appearances, so presumably he's not a god either in your view? In fact, I can't think of any religion where their god hasn't turned up on Earth at some point. Having a presence in this universe doesn't imply being bound by the laws of this universe. Back to your scientist - if he created a representation of himself in the universe he'd created, he could prove his existence while still existing outside that universe (and therefore being \"supernatural\" to anyone constrained within it) .\n\n\n&gt;No, it's not. If you're going to redefine faith to mean \"belief\" and thus be completely redundant and meaningless, at least invent a new word to replace it.\n\nIt's not redefining it. Faith has several dictionary meanings - one of which is \"[b]Belief[/b] that does not rest on logical proof or material evidence. \". Another is \"Loyalty to a person or thing; allegiance: \" and that is the one that I think religion always used to mean when it talked about the need to have faith in god.\n\n&gt; et his power is limited to the simulation he created. When you consider his entire being, he's just some nerd mucking about at a computer terminal. He is at best thought of as a god by his subjects, no different than the Pharaoh.\n\nWhat do you mean \"no different to the pharoah\"? Did the pharoahs create our universe? Did they have the power to destroy it?\n\n&gt;I use the capital-G God typically to refer to the ultimate, uniquely supreme God. \n\nSo how about the gods of polytheist religions? Are you saying that you aren't talking about them?\n", "gilded": 0, "created_utc": "1200518174", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I presume this is the quotation you're most concerned about:\n\n&gt; Religious faith must always rest on unfalsifiable assumptions, because if the underlying assumptions could be tested, they would no longer be talk about the supernatural, but the natural. In that case it wouldn’t be sensible to talk about gods; we’d have to switch to calling them extraterrestrials.\n\nFor one, he's clearly using the slartibartfast definition of faith, which is how I will use it for this post. He's not saying that faith, as a concept, is inherently based on unfalsifiable assumptions. I'm sure he would admit it's possible to have faith that the Loch Ness Monster exists. He's saying that *religious* faith, which he characterizes as faith in a *supernatural* God, necessitates the acceptance of unfalsifiable assumptions since the concept of the supernatural is itself unfalsifiable.\n\nObviously you've made the argument that a \"natural\" god is still God. I and the author disagree.\n\n&gt; An objective observer in which universe?\n\nWhichever would allow him to observe all aspects of the being in question.\n\n&gt; Ancient Greeks were quite happy that their gods lived in a universe/plane of existence/whatever that had its own constraints, but on Earth they were still gods.\n\nThe ancient Greeks were objectively wrong.\n\n&gt; And he wouldn't be a god in that universe. He would be a god in the universe he created.\n\nAnd the Pharaoh was a \"god\" in the kingdom he created. God is not a title like \"boss\", it is an aspect of being. Typically, God is described as omnipotent. If my omnipotence is limited to SimCity, in what sense am I actually *omni*potent? It's like the sweepstakes prize with two tickets to anywhere, where \"anywhere\" really means \"in the continental US\". It completely undermines the meaning of the word.\n\n&gt; The kind that Greek, Romans, Christians, Hindus etc have believed in - the ones that have supposedly turned up on Earth yet are still held to be gods by their followers.\n\nThose gods are still either natural or supernatural. Their followers can believe lots of things, even contradictory things, like their god is both a perfect, unlimited, omnipotent God and also a being in the natural world. It has nothing to do with me that they don't see the inconsistency.", "gilded": 0, "created_utc": "1200613945", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "&gt; This idea that \"religious faith\" must mean the acceptance of unfalsifiable assumptions is a modern interpretation and not the way that \"religious faith\" was used in the middle ages.\n\nYou're skipping a step. Religious faith implies faith in the supernatural. If your belief does not depend on the supernatural, then it's no more \"religious\" than faith in the Loch Ness Monster. It is undeniable that supernatural faith requires acceptance of unfalsifiable assumptions, because the very concept of the supernatural is unfalsifiable.\n\nThe people who based their belief in God on reason and evidence and not slartibartfast faith by and large became the atheists and agnostics today once the evidence overwhelmingly pointed to a better explanation for the origin of life.\n\n&gt; I've said that a god that can exist in this universe would still be a god (small g).\n\nFirst off, I don't like all the talk of \"this universe\". This universe is no more relevant to the discussion of godhood than \"this planet\". The natural world encompasses this planet, this universe, any possible multiverse, and potentially larger structures still.\n\n&gt;  Most religious people would agree with me. I see little point in defining a meaning of god that the people who believe in god would not agree with and then proving that this particular god could not exist.\n\nIf you told them \"your god is a small-g god,\" essentially the alien king of the universe ala Scientology's Xenu, *and they didn't mind*, I'd be amazed. These people want to have their cake and eat it too.\n\n&gt; He did not create the universe, he did not control the afterlife of any of his people, he did not exist - even partially - outside of the same physical laws as anyone else, etc.\n\nAgain, there is nothing particularly special about \"this universe\". Your extra-universal god exists outside of our physical laws in the same sense that the Mars rover exists outside the \"law\" that objects fall at a rate of 32 ft/s^2. Should we find that other universes exist, there will necessarily be a higher fabric of existence that binds them together.\n\nIf I create a SimCity clone with creatures that think I'm God because I created their universe and exist outside of it, and because I control their afterlife, I still wouldn't be God. My creatures running around in the simulation would simply be *wrong*.", "gilded": 0, "created_utc": "1200695231", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1201066946", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Looking through a telescope is an experiment that is able to be duplicated and confirmed by everyone with the sense of sight.  Feeling God's presence, has yet to freely duplicated by anyone with the sense of...God?  I've felt the presence of Big Foot and the Loch Ness Monster, this means you should trust me. \n\nWhile it may be true that you have in fact felt God's presence, until everyone else can experience it, we'll have to take your word on it.  Science does not purport that God does not exist, simply that we don't have evidence either way yet to reach a reasonable conclusion.", "gilded": 0, "created_utc": "1201162240", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "Atheists shouldn't have to prove God doesn't exist. Theists should have to prove he DOES exist. In the search for the Loch Ness monster, would you search everywhere trying to find where he wasn't, and then, after looking there, decide that he doesn't exist? No. You decide he doesn't exist until we have proof--his existence is proven by where he is, not where he isn't.", "gilded": 0, "created_utc": "1201214927", "subreddit": "reddit.com", "score": 18, "controversiality": 0}
{"body": "Except a search for a Loch Ness monster would be a finite search. We assume the Loch Ness monster is larger than, say, a breadbox (or otherwise it wouldn't be a monster), and and the search area for it is finite and manageable (in and around Loch Ness; otherwise, it wouldn't be a \"Loch Ness\" monster). So, the search of all possible places it could be is a finite search, and actually has been done up to a point (reasonably thorough sonar searches have been done recently).\n\nAn exhaustive search for a god however would likely be infinite or not doable (esp. if it exists outside of our spacetime in some way).", "gilded": 0, "created_utc": "1201239564", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Europe fought off a pretty startling un-provoked attack caused by the growth of technology that fuelled the powertrip of Adolph (many popular early US radio shows were still broadcast on actual German radio transmitters taken during the war, as US tried to play catch up with the nazi technology).\n\nWe were certainly going to resolve it one way or another, until Japan decided that fighting Russia was no fun, let's try those yanks!\n\nSo, the US realised there was a war on, and it was about that time that I realised the war was actually an 8 story high land grab, and a chance to spend more on military and set us up some bases.\n\n**Chef's Dad**: And that was the third time we saw the Loch Ness monster. Then one time, I believe it was July\n\n**Chef's Mom**: August.\n\n**Chef's Dad**: August. There's a knock on the door. I open it, and there's this cute little girl scout\n\n**Chef's Mom**: And she was so adorable, with the little pig tails and all.\n\n**Chef's Dad**: And she says to me, \"How would you like to buy some cookies?\" And I said \"Well, what kind do you have?\" She had thin mints, graham crunchy things\n\n**Chef's Mom**: Raisin oatmeal.\n\n**Chef's Dad**: Raisin oatmeal, and I said \"We'll take a graham crunch. How much will that be?\" And she looks at me and she says, \"…Uh I need about treefiddy.\"\n\n**Chef's Mom**: Treefiddy.\n\n**Chef's Dad**: Well, it was about that time that I notice that girl scout was about eight stories tall and was a crustacean from the protozoic era.\n\n**Chef's Mom**: The Loch Ness monster.\n\n**Chef's Dad**: I said, \"Dammit monster! Get off my lawn! I ain't giving you no treefiddy!\" It said, \"how about just twofiddy?\" I said, \"Oh, now it's only twofiddy!! What?! Is there a sale on Loch Ness munchies or something?!\"\n\n**Chef's Mom**: Lord, he was angry.\n\n**Chef's Dad**: Damn right, I was angry!\n\n**Chef's Mom**: Not you, the monster. He was about to kick your ass.\n\n**Chef's Dad**: Aah, shut your mouth, woman! \n\nNow we see the middle east invaded, unprovoked, and the signature saluting propaganda spun by the dictator*, Bush.\n\nI would like to draw a parallel between how German citizens were treated in the rise of nazism, to how US citizens are treated now.\n\n*: Dictator: Was Bush ever elected Predident? No.", "gilded": 0, "created_utc": "1201285392", "subreddit": "politics", "score": -5, "controversiality": 0}
