{"body": "I'm sure that god does not exist. Just as I am sure there is no loch ness monster, or bigfoot. Mythology will remain mythology, until evidence is brought foreward. I will change my mind if I see some real evidence, but until then I have no reason to believe in any supernatural nonsense.", "gilded": 0, "created_utc": "1222964507", "subreddit": "atheism", "score": 78, "controversiality": 0}
{"body": "I didn't said you had to believe in any of it. I just was pointing out the fact that YOU DO NOT KNOW. There COULD be a Loch Ness Monster (although there probably isnt) just as their could be a God (although there probably isnt).\n\nYou cannot be \"sure that god does not exist\", but you can believe one doesn't.", "gilded": 0, "created_utc": "1222965074", "subreddit": "atheism", "score": 23, "controversiality": 0}
{"body": "Can you loan me some money? Pleeeeease?\n\nI need about tree fitty! ", "gilded": 0, "created_utc": "1222969626", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I am not 100% sure that God does not exist, but I have the same level of certainty in the non-existence of God as I hold in the existence of gravity, electricity and many other proven theories, that is to say; as much as is humanly possible based on the evidence or lack thereof.\nI pose that no-one can ever be 100% sure of any theory because at any point in the future, despite continuous testing and despite accepting a theory as absolute fact and absolute truth, there is a chance however slim that that theory could be disproven due to one anomaly that doesn't follow with the theory. When this happens, we must question the authenticity of our theory, try and incorporate the newfound evidence, and if the theory cannot adapt, then it's back to the drawing board and back to square one.\nOf course, the chance of a theory being disproven gets smaller and smaller as more tests are done, and the longer the theory upholds itself, and the more new evidence is found that matches with the theory, but the important thing is that we can never be 'finished' with testing, because time is infinite. We can simply do the best we can with what holds up under testing; there is never a 100% (by the mathematical value of 100/100) chance that anyone knows anything to be the truth. However, when dealing with human knowledge, it seems fair to disassociate 100% human certainty with 100% factual truth because the two are quite disparate, and in doing so to appoint a condition that someone can have 100% certainty in an idea if all evidence and testing points to this theory being absolute fact.\nThrough this reasoning, i have 100% certainty that witches, magic, luck, ghosts, centaurs, unicorns, dragons, krakens, Loch Ness monsters, fairies, vampires, Santa Claus, elves, souls, thetans, heaven, purgatory, hell, Satan and Gods of any and all forms have never ever existed and never will, because all evidence points to the contrary of their existence. I am 17, and have complete confidence that this is the position I will hold for the rest of my days.\nNeedless to say, I am happy to be proven wrong.", "gilded": 0, "created_utc": "1222969915", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Maybe there are some things you can be sure do not exist, but we don't know about any of them so we can assume that there are not until proven otherwise. Just like god or the loch ness monster. We are sure enough to assume, but not 100% positive.", "gilded": 0, "created_utc": "1222975033", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "That is true, however while there could be a Loch Ness monster the chances of that could be said to be negligible (due to a lack of credible evidence over a large period of time say), thus making statements like \"The Loch Ness monster doesn't exist\" sensible. Bertrand's teapot argument contends that while we can't prove there is no such thing as God or the teapot orbiting Mars, not believing in the existence of either, due to a lack of evidence, is entirely reasonable.", "gilded": 0, "created_utc": "1223029619", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "You were saying, or at least implying, \"why don't we just observe homeopathy\". I'll explain why that's a mistake.\n\nHow likely is homeopathy? Given what we know, hugely unlikely. Far more unlikely than a lot of well-known implausibilities. Unicorns and the Loch Ness monster are more likely than homeopathy. Every silly conspiracy theory you've ever heard is hugely more likely, because they propose no fundamental rewrite of physics.\n\nWhat theories should we observe? If we're being sensible, we should start with the most likely (of which there are few) and work towards the least likely (of which there are nearly infinitely many).\n\nWhen should we examine homeopathy?\n\n*After* we have finished exhaustively examining unicorns, the Loch Ness monster, and so on.\n\nSomeone who wants to examine homeopathy *now*, to \"jump the queue\", either knows a huge lump of evidence I don't, or they are being wildly irrational.", "gilded": 0, "created_utc": "1223086499", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Let's all go Loch Ness Monster fishing.\n", "gilded": 0, "created_utc": "1223226725", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! ...", "gilded": 0, "created_utc": "1223396578", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "That wasn't Dick, I'm afraid. It was the god damn Loch Ness Monster! The bastard's tried it with me, disguised as a sales assistant at my newsagents. Went to buy a magazine and an energy drink but when I reached the counter, the \"assistant\" looked me in the eye, laid out \"her\" hand and said.... Three fiddy.", "gilded": 0, "created_utc": "1223465789", "subreddit": "reddit.com", "score": 11, "controversiality": 0}
{"body": "Assuming this question is serious here - we can't really do this because oil is [fungible](http://en.wikipedia.org/wiki/Fungible).  That is, oil from the US isn't qualitatively different from oil extracted anywhere else.  The result is that the price is set on a global exchange, not just on supply and demand from one area.  We could theoretically limit exporting of oil drilled here but it would make no impact on market price.  Here's why:\n\nBecause we do not produce enough oil to meet our demand, we would still have to import oil to fill excess demand. That oil would still be based on the global market price as that's where it's purchased.  Domestically produced oil could be priced at any value you want but it won't vary from the global price for long.  \n\nWhy?  Let's say you decide you are going to sell domestically produced oil for [tree fiddy](http://www.google.com/url?sa=U&amp;start=3&amp;q=http://www.youtube.com/watch%3Fv%3DplShzNaq9wk&amp;usg=AFQjCNFuWbDW-BEqCHdM-zwwMYsEoE1I7A) a barrel.  The entire supply would be bought up in minutes, then we would be left buying oil at the global market price again within minutes.  Good deal for whomever could snap up that limited supply, but the reality is that when demand far over strips supply at that price, the price would immediately be driven up.  Why?  Because if they could sell it at $4.00, they will.  \n\nIf you made it more expensive than the global market price, nobody would buy it at all.  This should be self explanatory.\n\nThese two things then result in an equilibrium around the global market price.  The only thing that could change this equation would be jacking up import tariffs, which would only result in the domestic price settling around the global price + tariff, making it even more expensive for us.\n\nThe only thing increased domestic production can do to impact the global market price is to produce enough to make an impact on global supply, such that it reduces price.  Due to our limited oil reserves, this isn't likely to happen.", "gilded": 0, "created_utc": "1223489208", "subreddit": "self", "score": 18, "controversiality": 0}
{"body": "What part of the Republican platform could you possibly subscribe to if you're voting for Obama.\n\nI agree that McCain doesn't have it.  He scared me when I was watching that last debate, in addition to trying to hand the election to Obama on a silver platter there.  \n\nI'm going with either Bob Barr or the Bigfoot/Nessie ticket ;)", "gilded": 0, "created_utc": "1223525327", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "God damn it woman, I told you not to give that loch ness monster three fifty!", "gilded": 0, "created_utc": "1223558197", "subreddit": "pics", "score": 13, "controversiality": 0}
{"body": "One of these times a crazy lady will be right and we really will have an alien invasion or the real Nessie or Jersey Devil or whatever. Vindication will be had for the world's crazy ladies.", "gilded": 0, "created_utc": "1224001414", "subreddit": "offbeat", "score": 3, "controversiality": 0}
{"body": "What was removed from the upper right corner? Nessie, is that you?", "gilded": 0, "created_utc": "1224024828", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Well, it was about that time that I noticed that girl was about eight stories tall and was a crustacean from the protozoic era!\n\nThe Loch Ness Monster.", "gilded": 0, "created_utc": "1224596765", "subreddit": "WTF", "score": 39, "controversiality": 0}
{"body": "DAMN IT WOMAN, I TOLD YOU NOT TO GIVE THAT LOCH NESS MONSTER NO TREE-FITTY", "gilded": 0, "created_utc": "1224604729", "subreddit": "WTF", "score": 25, "controversiality": 0}
{"body": "\"I contend we are both atheists, I just believe in one fewer god than you do. When you understand why you dismiss all the other possible gods, you will understand why I dismiss yours.\" - Stephen Roberts\n\n\nAlso good to read up on concerning the \"You can't prove god doesn't exist!\", which is a logical fallacy, and an illegitimate shift of burden of proof:\n\nhttp://en.wikipedia.org/wiki/Epistemology\n\n\nhttp://wiki.ironchariots.org/index.php?title=You_can%27t_prove_God_doesn%27t_exist\n\nhttp://wiki.ironchariots.org/index.php?title=Atheism_is_based_on_faith\n\n\n\nCliff's notes, the best valid response for a statement like that is to illustrate the illegitimacy of such an argument. \"Hold on, that's faulty logic. The burden of proof for the non-concretely obvious (and I don't see god here, do you?) always lies on the one making the assertion, not the skeptic. I'm not making a claim that god doesn't exist, (within the realm of absolute knowledge) I'm rejecting your claim that he does exist. (in the realm of practical knowledge)\"\n\n\n\nIllustration: Ask them if they believe in Bigfoot, leprechauns, the Loch Ness monster. No? Why not? Prove they don't. \n\n\n\nIn any assertion, the burden of proof lies on the person making the claim, not the one hearing the claim. ", "gilded": 0, "created_utc": "1224726074", "subreddit": "atheism", "score": 7, "controversiality": 0}
{"body": "&gt; It just makes you feel weird\n\nI've heard this a couple times.  Might I ask when you did acid?  Real LSD has been difficult to find, in my experience, since 2001 or so.\n\nMy LSD trips were the most staggering experiences I've ever had.  Just to give a few snapshots:\n\n * I saw the Loch Ness Monster in the Braes Bayou outside Houston.  \n * I saw all the stars in the night sky turn into mechanical models of atoms complete with revolving electrons.  \n * I saw the entire world split into three -- red, green, and blue.  \n * When I tried to piss, my dick frosted over and turned blue.\n * I saw tiny gnomish ninjas cavorting in bushes.\n * A water treatment plant, admittedly large, stretched out until it went over the horizon.\n * Every cloud in the sky turned into trilobites and nautili and shit and swam through the ocean.\n\nThat's just the striking singular illusions, leaving out the constant visual effects -- that everything was gyrating and flowing, that everything organic was geometric, that whenever I saw wood grain, I could read (and copy) Hebrew.  That sort of stuff.\n\nSeriously, it might sound like I'm just making shit up, but LSD is completely unlike reality.  I haven't done it since 2000, and I still remember a staggering amount of what it was like.", "gilded": 0, "created_utc": "1225071007", "subreddit": "pics", "score": 2, "controversiality": 0}
