{"body": "Save for the guns nothing has changed since the paleolithic era? ", "gilded": 0, "created_utc": "1296521066", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1296549983", "subreddit": "funny", "score": 8, "controversiality": 0}
{"body": "Reagan was (for all intents and purposes) the puppet of Bush Sr. (just formerly the Director of the CIA):\n\nhttp://www.bogritz.com/lookingglass.html\n\nhttp://www.transbay.net/~nessie/Pages/assassination.html", "gilded": 0, "created_utc": "1296634488", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "It looks like a pterodactyl mated with the loch ness monster", "gilded": 0, "created_utc": "1296641006", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I'd say about tree fiddy", "gilded": 0, "created_utc": "1296676776", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Nessie is under there.", "gilded": 0, "created_utc": "1296679376", "subreddit": "offbeat", "score": 0, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1296681119", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "*Anthony955*: It's like buying a brand new car, and being disappointed when it breaks down on you.\n\n*Nessie*: A new car is unlikely to break down on you. You contradict yourself.\n\n---\n\n*Anthony955*: It's like meeting Dracula and being surprised to discover he's a really nice guy.\n\n*Nessie*: Dracula isn't nice and he isn't real. Most people would understand Dracula to be an evil, fictional character.\n\nಠ_ಠ", "gilded": 0, "created_utc": "1296709622", "subreddit": "offbeat", "score": 22, "controversiality": 0}
{"body": "I think next thing nessie will come up with is that since only 25 people might compete for the job that it's nothing like the lotto since thousands usually compete in one.\n\nAlso I agree with you, I'm just a high school grad (brain fart, said dropout on accident)  and make good money but we're pretty much the exceptions to my analogy.", "gilded": 0, "created_utc": "1296715746", "subreddit": "offbeat", "score": 3, "controversiality": 0}
{"body": "I've seen the unemployment lines look like that. (Yes, that's an exaggeration just in case nessie follows me to this comment as well).", "gilded": 0, "created_utc": "1296716523", "subreddit": "offbeat", "score": 3, "controversiality": 0}
{"body": "Illuminating...\n\nBut how much is **my** pride worth?\n\n... About tree fiddy.", "gilded": 0, "created_utc": "1296742167", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Bout tree fiddy.", "gilded": 0, "created_utc": "1296744931", "subreddit": "IAmA", "score": 40, "controversiality": 0}
{"body": "Goddamn Loch Ness Monster! I ain't givin you no tree fitty. Get your own goddam money!", "gilded": 0, "created_utc": "1296746388", "subreddit": "IAmA", "score": 31, "controversiality": 0}
{"body": "I gave him tree fiddy once.", "gilded": 0, "created_utc": "1296753321", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "It was about that time I realized that he was about 8 stories tall and was a crustacean from the Paleozoic era.  I AIN'T GIVIN YOU NO TREE FIDDY.", "gilded": 0, "created_utc": "1296754139", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Two eyes, \ntwo ears,\na chin,\na mouth,\nten fingers,\ntwo nipples,\na butt,\ntwo kneecaps,\na penis.\nI have just described to you the Loch Ness Monster.", "gilded": 0, "created_utc": "1296754438", "subreddit": "trees", "score": 26, "controversiality": 0}
{"body": "You know if you give em tree fiddy he's gonna assume you got more!", "gilded": 0, "created_utc": "1296763267", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "[Nessie](http://www.google.com/imgres?imgurl=http://didyouknow.org/graphics/animals/nessie.jpg&amp;imgrefurl=http://didyouknow.org/animals/nessie/&amp;usg=__lgRWpOePw8q0PYcuUn9QGvzUdZE=&amp;h=250&amp;w=400&amp;sz=25&amp;hl=en&amp;start=0&amp;zoom=1&amp;tbnid=lPKgEKwZR4fefM:&amp;tbnh=136&amp;tbnw=217&amp;ei=JY1LTYSQC4G8lQeolYT6Dw&amp;prev=/images%3Fq%3Dnessie%26um%3D1%26hl%3Den%26safe%3Doff%26sa%3DX%26biw%3D1280%26bih%3D685%26tbs%3Disch:1&amp;um=1&amp;itbs=1&amp;iact=hc&amp;vpx=963&amp;vpy=328&amp;dur=216&amp;hovh=169&amp;hovw=271&amp;tx=140&amp;ty=109&amp;oei=JY1LTYSQC4G8lQeolYT6Dw&amp;esq=1&amp;page=1&amp;ndsp=15&amp;ved=1t:429,r:9,s:0)", "gilded": 0, "created_utc": "1296797011", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "I am a modern man. I have an MS in CS. I'm an analytical individual. The cold hard axe of logic and science is how I navigate this reality. \n\nI mean, otherwise we are just taking things on faith. Last time I checked that was the domain of religion and I'm just not looking for a new one.\n\nSo for now I'm filing the \"ancient aliens\" type theories in the cognitive folder that is right next to the Sasquatch, the Loch Ness Monster and the Chupacabra.\n\nThough if they do come up with some convincing evidence that the alien visitations were real, I will happily eat my own words and hang out a welcome banner for our stone cutting, temple building, anal-probing overlords. :)", "gilded": 0, "created_utc": "1296802757", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "about tree fiddy.  In all seriousness, my life is worth about 30$ an hour apparently.  To spend that time in prison with all the risk and shame associated with that experience I would expect at least 1 mil a year.", "gilded": 0, "created_utc": "1296826962", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "tree fiddy.", "gilded": 0, "created_utc": "1296839525", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Is that Nessie? He and the turtle are about the coolest thing ever. Nice job!", "gilded": 0, "created_utc": "1296840632", "subreddit": "Minecraft", "score": 3, "controversiality": 0}
{"body": "Nice try loch ness monster.", "gilded": 0, "created_utc": "1296843441", "subreddit": "offbeat", "score": 23, "controversiality": 0}
{"body": "His landlord is the Loch Ness monster?", "gilded": 0, "created_utc": "1296856425", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "My brother gets to shit on my grave unless i rail anne hathaway while riding the loch ness monster.  Challenge accepted", "gilded": 0, "created_utc": "1296934627", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "TREE FIDDY", "gilded": 0, "created_utc": "1296944966", "subreddit": "guns", "score": 10, "controversiality": 0}
{"body": "At one point when Marshall is writing a letter to himself from the future he says if time travel is possible come back at  {the time it was at that moment}\nhe doesn't come back but Lily comes over with free hot wings someone had sent back because they were too spicy. Then the next scene shows a waitress apologizing to an old man Marshall about the wings and he says it wasn't the wings i just had an old promise to keep (or something like that) That's the only reference to time travel i can recall. \n( I haven't seen this episode it quite awhile so i am paraphrasing a lot so sorry if I'm off on the details)\n\nThere are other scifi elements the cockamouse being one and of course marshals obsession with Ghosts and Nessie but it is definitely not a scifi show. \n", "gilded": 0, "created_utc": "1296958832", "subreddit": "scifi", "score": 3, "controversiality": 0}
{"body": "There also isn't any evidence that Unicorns, Fairies, Thor, Zeus, Ishtar, Neptune, Nessie, and an invisible magic sandwich that cures cancer exist. I would have a hard time living my life as if everything we cannot actively disprove exists. Is it possible? Sure. When I see evidence, then I'll believe it. Until then, nope.\n\nAs for your second comment, I think you're the one in ignorance of what it means to be a Christian, no offense intended. You may want to actually read your holy texts, not just the parts they teach in Sunday School. Here are some highlights:\n\n---\n\n[Psalms 137:7-9](http://www.biblegateway.com/passage/?search=psalms%20137:7-9&amp;version=NIV)\n\n[Leviticus 20 (Or pretty much all of Leviticus, Numbers, and Deuteronomy)](http://www.biblegateway.com/passage/?search=Leviticus%2020&amp;version=NIV)\n\n[Exodus 21](http://www.biblegateway.com/passage/?search=Exodus%2021&amp;version=NIV)\n\nI could go on for pages and pages. And don't give me that \"But that's the Old Testament\" bullshit, have some of Jesus's own words.\n\n[Matthew 5:17-20](http://www.biblegateway.com/passage/?search=Matthew%205:17-20&amp;version=NIV) [A note: To Jesus, a Jew, \"The Law\" refers to Leviticus, Numbers, etc. and the Ten Commandments]\n\n[Ephesians 6:5-8](http://www.biblegateway.com/passage/?search=Ephesians%206:5-8&amp;version=NIV)\n\n[Matthew 10:34-39](http://www.biblegateway.com/passage/?search=Matthew%2010:34-39&amp;version=NIV)\n\n---\n\nEDIT: And as Hitchens [and the other guy that replied] said: *\"Forgotten were the elementary rules of logic, that extraordinary claims require extraordinary evidence and that what can be asserted without evidence can also be dismissed without evidence.\"*\n\nEDIT 2: If you want a nice concise compilation of all of the horrors, absurdities, injustices, cruelties, sexism, and contradictions in the Old Testament, New Testament, Book of Mormon, and the Qu'aran, [here you go](http://skepticsannotatedbible.com/).", "gilded": 0, "created_utc": "1296964035", "subreddit": "atheism", "score": 9, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1297052350", "subreddit": "Libertarian", "score": 2, "controversiality": 0}
{"body": "Thanks for your response portmanteau. \n\nJust so we're on the same page, I have read the FAQ, and I understand that the purpose of the Paleo diet is not to eat exactly like a 'caveman', and is instead to avoid foots that are detrimental to our body's functioning and needs as determined by our evolutionary history. However, I also think it's an exaggeration to say that the fact that the diet resembles what our ancestors may have eaten is purely coincidence, considering this is the premise upon which the entire diet is based (Hence the term \"Paleolithic\"). I only used the term caveman as one of endearment (and because the logo for this subreddit is, well, a caveman).\n\nWhen you say, \"it doesn't matter whether a caveman had it or not. Just eat it if you want it,\" does that not undermine the entire idea behind the Paleo diet? The reason it eschews grains, legumes, etc. is that our ancestors of the paleolithic era (whether they are called cavemen or not) did not eat these foods and therefore the body reacts negatively to them today. If it's possible that our ancestors had no dietary source of salt, then, according to the Paleo 'philosophy' (although I myself am skeptical), we might do well to avoid it as well.\n\nThat being said, I appreciate your outlook, and it seems as though, according to your analysis and as I've suspected, there's no real point to the \"Paleo diet\": it's really just a small part of what should be basic nutrition - we should avoid things that our bodies do not like. Why everyone here is so gung-ho about eating exactly as our Paleolithic ancestors may have eaten is what I'm trying to discover. The reason I asked the question about salt in the first place was because I couldn't understand why advocates of the Paleo diet would want to cut out something as basic as salt (and trust me, after some research I've found that there are a lot that do).\n\nAgain, thanks for your response, and I hope you reply again.\n\nEdit: After reading some of your comment history, I have a question for you. As someone who claims to be a strict Paleo eater, how could you suggest to me that I should just eat salt if I want it? Do you have a reason for thinking salt is \"fine\"? If so, please fill me in. I am not being confrontational but am just legitimately interested in your reasoning.", "gilded": 0, "created_utc": "1297055025", "subreddit": "Paleo", "score": 5, "controversiality": 0}
{"body": "&gt; the purpose of the Paleo diet is not to eat exactly like a 'caveman', and is instead to avoid foots that are detrimental to our body's functioning and needs as determined by our evolutionary history\n\nI'm with you here.\n\n&gt; However, I also think it's an exaggeration to say that the fact that the diet resembles what our ancestors may have eaten is purely coincidence, considering this is the premise upon which the entire diet is based (Hence the term \"Paleolithic\").\n\nYou just contradicted yourself.  The \"premise\" of the diet is the removal of foods that are harmful, as you said (and as we agreed upon).  The premise is not to base the diet around what prehistoric man ate.  There are plenty of things in the modern diet that caveman didn't have, but we would be fools to exclude.  Supplementing with fish oil extract, for example, is a great idea to further reduce inflammation from the imbalance of a low omega-3/omega-6 ratio in the modern diet.  I doubt that cavemen had access to eggs in the quantity that I eat them in.  Athletes whose sports involve bursts of high-intensity speed and power would be silly to not take at least creatine monohydrate as a supplement.  And, for recovery, even whey protein isn't completely out of the question, even though it's technically dairy (casein is the protein in dairy that causes inflammation in some people, and milk tends to excessively spike insulin, even moreso than its lactose content would ordinarily indicate).\n\n&gt; The reason it eschews grains, legumes, etc. is that our ancestors of the paleolithic era (whether they are called cavemen or not) did not eat these foods and therefore the body reacts negatively to them today.\n\nThis is backwards.  It doesn't matter whether prehistoric man ate legumes or not.  Whether they did or they didn't, legumes are still inflammatory to humans.  It's not *because* prehistoric humans didn't eat it.  Prehistoric man didn't have whey protein, either, but damned if it doesn't help me recover faster and stronger after a bout of heavy deadlifts.\n\n&gt; there's no real point to the \"Paleo diet\"\n\nThe point of the diet is to fuel us to an optimal level of performance, whether that performance be general living, athletic activity, or whatever.  I eat Paleo because I CrossFit (I like to perform well in it), and because I like looking good.  :)\n\n&gt; Why everyone here is so gung-ho about eating exactly as our Paleolithic ancestors may have eaten is what I'm trying to discover.\n\nTell me why this is when you figure it out.  I find this idea to be a stupid, silly, foolish notion.  Eat something (or don't eat something) because you perform and live well when you do, not just because cavemen do it.  It just so happens that humans tend to perform the best when we exclude those foods that aren't on the Paleo diet.\n\nDon't eat grains, legumes, things with added sugar, processed foods.  Don't eat dairy if it makes you feel bad (go off of it for a month and add it back in.  This is the best way to figure out if you can handle it or not).  Don't eat starchy foods if you're trying to lose weight.  Keep a ratio of omega-3/omega-6 intake to as close to 1:1 as possible.  That's all the Paleo diet has to be.  Trying to live like a caveman would is needlessly complicating matters.\n\nOr, if you prefer something that's prescriptive instead of prohibitive, let me quote Greg Glassman's \"100 Words On Fitness.\"\n\n&gt; Eat meat and vegetables, nuts and seeds, some fruit, little starch and no sugar. Keep intake to levels that will support exercise but not body fat. Practice and train major lifts: Deadlift, clean, squat, presses, C&amp;J, and snatch. Similarly, master the basics of gymnastics: pull-ups, dips, rope climb, push-ups, sit-ups, presses to handstand, pirouettes, flips, splits, and holds. Bike, run, swim, row, etc, hard and fast. Five or six days per week mix these elements in as many combinations and patterns as creativity will allow. Routine is the enemy. Keep workouts short and intense. Regularly learn and play new sports. \n\nEDIT: you edited your post after I answered.\n\n&gt; As someone who claims to be a strict Paleo eater, how could you suggest to me that I should just eat salt if I want it? Do you have a reason for thinking salt is \"fine\"? If so, please fill me in. I am not being confrontational but am just legitimately interested in your reasoning.\n\nI checked my own comment history.  I'm pretty sure I never claimed to be strict Paleo at all.  I do eat dairy from time to time (which I even say in my comment history).  Other than that, yeah, I'm strict about it.  That being said, what's wrong with salt?  Is it inflammatory?  No.  Is it insulinogenic?  Not at all.  Will it harm you in stupidly large amounts?  Sure.  So will bananas.  What's your point?\n\nFor the last time, \"Paleo\" doesn't mean, \"only foods that cavemen eat.\"  It means, \"**not** foods that are bad for you.\"  The Paleo diet is a restrictive diet, not a prescriptive one, and it restricts foods (as in, it defines \"foods that are bad for you\") that are inflammatory and insulinogenic.\n\nSo is it neither inflammatory nor insulinogenic?  If so, enjoy it (in moderation, as with all things, including moderation).", "gilded": 0, "created_utc": "1297056425", "subreddit": "Paleo", "score": 3, "controversiality": 0}
{"body": "Holy fuck yes I love animation. The pop n loch ness monster. What is that guy up to these days?", "gilded": 0, "created_utc": "1297058156", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "&gt;those who believe caliphates run by zombie Islamists, the Illuminati, and the Loch Ness Monster are coming to steal your car.\n\nI wouldn't give him no tree fiddy so he took my car! Goddammit Loch Ness Monster, get a job!", "gilded": 0, "created_utc": "1297179842", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "That's right. I said \"I ain't giving you no tree-fitty you goddamn Loch Ness monster! Get your own goddamn money!\"", "gilded": 0, "created_utc": "1297180527", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "At least Larry the Cable Guy is real. The last time I saw that channel it had something about whether the Nazis could have won WWII if only they had managed to capture the Loch Ness Monster and exploit its secrets of invisibility.", "gilded": 0, "created_utc": "1297185124", "subreddit": "entertainment", "score": -3, "controversiality": 0}
{"body": "Jesus is a fictional character. There are no references to his existence outside the bible and documents directly pertaining to/referencing the bible. There are no independent sources to confirm his existence and there is not a single artifact that exists that proves Jesus ever lived. He is a cultural construct like Zeus, Mithra, Dionysus, the Loch Ness Monster and the theory of Atlantis. It's all make believe. \n\nConsidering the millions of people who have died in the name of an imaginary friend I don't see any reason not to consider religious people mentally unstable.", "gilded": 0, "created_utc": "1297188769", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "Well, that was obviously shit programming. The Loch Ness Monster doesn't have secret powers of invisibility.  Every school age child knows that the Loch Ness Monsters powers are all variants of telekinesis. ", "gilded": 0, "created_utc": "1297189238", "subreddit": "entertainment", "score": 1, "controversiality": 0}
{"body": "I swear anytime in my life I notice I'm holding 3.50 in my hand I gotta say it \"I got bout tree fitty\" and nobody around me gets it", "gilded": 0, "created_utc": "1297208612", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "'bout tree fiddy.", "gilded": 0, "created_utc": "1297213670", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "I need about tree fiddy...", "gilded": 0, "created_utc": "1297268308", "subreddit": "AskReddit", "score": 33, "controversiality": 0}
{"body": "I ain't givin' you no tree-fiddy, you goddamn Loch Ness Monster! Get your own goddamn money!", "gilded": 0, "created_utc": "1297270383", "subreddit": "AskReddit", "score": 21, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1297273026", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I very badly want to believe the Loch Ness Monster is real. I did a report on it in sixth grade that got me a coveted \"Double A Plus\" grade from my teacher. \n\nWith every little thing that comes up that refutes some sort of claim about the Loch Ness Monster a little piece of me dies. For example, [check this picture out of Nessie's head](http://www.cryptomundo.com/wp-content/uploads/rines1975a.jpg). Yeah, the water is murky but you could say \"yeah, that looks like it's head\". \n\n[Here's what it turned out to be](http://www.lochnessinvestigation.org/Stumps%27r%27us02.jpg). The stumps on the left and right are what the middle picture actually is. \n\n", "gilded": 0, "created_utc": "1297279419", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I promise you're not... [here's the page](http://www.lochnessinvestigation.org/gust_at_sea.html) where I found that picture. It also talks abput some other alleged Loch Ness Monster pictures. ", "gilded": 0, "created_utc": "1297293107", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Piff, I woulda lied for...about tree fiddy.", "gilded": 0, "created_utc": "1297297491", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "god damn Loch Ness Monster on the Reddit now!", "gilded": 0, "created_utc": "1297297809", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Sure, the logical, rational part of me knows that there's no such thing as the Loch Ness Monster. \n\nThe sixth grader in me that spent alot of time researching his report on the Loch Ness Monster still isn't ready to give up the hope that some day Nessie will be proven to be real. :) ", "gilded": 0, "created_utc": "1297300600", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "If they wanted to be really cruel they'd make people find a female dwarf rogue. Those don't exist. No one has ever seen one. They're like the Loch Ness monster.", "gilded": 0, "created_utc": "1297306938", "subreddit": "wow", "score": 1, "controversiality": 0}
{"body": "But there are photos of the Loch Ness monster.", "gilded": 0, "created_utc": "1297308127", "subreddit": "wow", "score": 1, "controversiality": 0}
{"body": "I am ALL about the Loch Ness Monster!  Don't drain the loch though - I'd rather not be 100% sure than 100% wrong.", "gilded": 0, "created_utc": "1297325368", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Watch the movie \"The Man from Earth.\" It's on this topic and a really intriguing flick. This man has lived since the Paleolithic era as a caveman and never died, moving through the ages. Sweet with a sort-of twist. ", "gilded": 0, "created_utc": "1297327304", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "Bigfoot, Loch Ness Monster, etc--take your pic of that lot then?", "gilded": 0, "created_utc": "1297362493", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "If I had any dollars, I'd pay up without complaint. Of course I have no intention of looking at it. I already know that leprechauns, ghosts, the Fountain of Youth, the Loch Ness Monster, the sword Excalibur, mermaids, faeries, banshees, Manchester United supporters who do not have ASBOs and little green men in flying saucers *do not exist.*", "gilded": 0, "created_utc": "1297364453", "subreddit": "space", "score": 2, "controversiality": 0}
{"body": "Bare Necessities. You can call him Nessie for short.", "gilded": 0, "created_utc": "1297365267", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Probably around tree fiddy.", "gilded": 0, "created_utc": "1297369998", "subreddit": "entertainment", "score": 8, "controversiality": 0}
{"body": "Or more accurately, granted there aren't any loch ness monsters involved, the price of admission.", "gilded": 0, "created_utc": "1297398564", "subreddit": "entertainment", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1297486554", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "/r/unitedkingdom might also be a good place to try.\n\nWhile London is a great place for foreigners to visit, there is a lot outside. As a general flavour, depending on how long you have and the time of year:\n\n* The Lake District, Northern England's equivalent to Lakes Como and Garda\n\n* Edinburgh, the Scottish equivalent of London\n\n* The Highlands and Islands distilleries.\n\n* Fort William, home of the Loch Ness monster\n\n* York, ancient viking city and the most haunted place in England\n\n* Leeds. Fantastic modern city, about 2-3 hours from London.\n\n* Manchester. Modernising city and home of the industrial revolution. Good Science museum, probably the best place to go for St. Patrick's day.\n\n* The Cotswolds. A beautiful area of the mid west of England. If you've ever seen film of a quintessentially English village, chances are it was here.\n\n* Oxford. Dreamy spires, students and tons of history. Bonus points for watching or reading Inspector Morse when you visit. Don't forget the River Pitt Museum.\n\n* Bristol. Heaving city with it's own flavour and vibe. Brilliant music scene, check out the Arnolfini, waterfront and Clifton.\n\n* North/South Devon and Cornwall. Beautiful beaches (check out the English Riviera if it's warm) and a very laid back vibe. Plus you get to travel through farming country on the way back east, and scrumpy.\n\n* Anywhere between Bournemouth and Brighton. Speaking of Which, Brighton is a day trip out of London and is often referred to as 'London by the sea'. It also has the biggest LGBT community outside of London and has massive parties in the summer.\n\nAs well as all that, you can take your pick from Ben Nevis, Snowdonia or Scarfell Pike for mountains, go to the valleys in Wales or to Conway or Llandudno in the North of Wales, and if it's the Craic you're after, Belfast is quite good (with Dublin just a train ride away).", "gilded": 0, "created_utc": "1297512154", "subreddit": "england", "score": 5, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1297523851", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt;he human mind is easily fooled, and our evolutionary history has biased our view of the world so that we are more likely to mistake a non-intelligent thing for an intelligent one.\n\nYes, the human mind is easily fooled, but you need to narrow that statement a bit. No one hallucinates chairs, space ships, planets, salsa, bears, or other random things into existence. Yet, people see full-body apparitions. I'm asking if you know of any specific mechanic in the brain that produces these hallucinations.\n\n&gt;When we experience a phenomenon without sufficient information to determine what it is, our brain fills in the gaps.\n\nYou're going to have to apply this to a paranormal experience for me. When people see a ghost, their brain fills in a...ghost?\n\n&gt;Add in stories we may have heard about ghosts and a little imagination, and we may easily be convinced that what we experienced was in fact a ghost. \n\nSo you're saying that an explanation for the millions of sightings of full body apparitions are people hearing stories and hallucinating the apparitions into existence? Why does only work with human beings, why don't people hallucinate werewolves and vampires and velociraptors into existence? You never hear of anyone alone in their home, looking down the hallway and seeing the loch ness monster.  I think a better conclusion would be to specify your statement that our \"brain fills in the gaps\" a bit more, and attribute the ghost phenomenal to a specific mechanic of the brain, whether it has a use, or whether it's a malfunction of some kind. Is this a difficult compromise to make?\n\n&gt;Anecdotal \"evidence\" cannot be trusted for this reason, as well as the fact that we are given no more facts about the phenomenon than the person making the claim observed.\n\nAnecdotal evidence can not be used to PROVE a theory, because whatever you're proving needs to be tested, repeatedly. However, if I hear screaming outside and my daughter runs in and says she saw a bear in our wooded backyard, I would grab my gun, despite not seeing it myself, and run outside to shoo it away. There are factors that can interfere with alleged ghost experiences, lighting, for example, pattern recognition, the subconscious and peripheral vision, etc, but that isn't enough to discredit a full sized see-through human floating in front of you, let alone millions of people saying they have seen a full sized-human floating in front of them. Let alone all the people who have seen the *same* ghost, let alone all the people who have seen a ghost together *at the same time.*", "gilded": 0, "created_utc": "1297560999", "subreddit": "atheism", "score": -2, "controversiality": 0}
{"body": "I say, that's about tree fiddy right there.", "gilded": 0, "created_utc": "1297579840", "subreddit": "fffffffuuuuuuuuuuuu", "score": 2, "controversiality": 0}
{"body": "Actually, lactose tolerance has largely only come about [more recently than the paleolithic era](http://en.wikipedia.org/wiki/Lactose_intolerance#History_of_genetic_prevalence).  Just because they didn't eat something doesn't mean it's bad for us.\n\nVegetarianism is only healthy so long as a good deal of care is given to making up for the nutrients typically found in meat.  Giving up other random food groups doesn't make the paleo diet healthy.", "gilded": 0, "created_utc": "1297604106", "subreddit": "askscience", "score": 2, "controversiality": 0}
{"body": "This whole thing smacks of the underground cavern level in Mario 64, you know, where you meet the giant Loch Ness Monster thing that wants to be your friend.  I hope whatever we find in Vostok is as cuddly.", "gilded": 0, "created_utc": "1297628129", "subreddit": "science", "score": 16, "controversiality": 0}
{"body": "I'll give you Tree Fiddy for it", "gilded": 0, "created_utc": "1297629715", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Trainspotting... was such a dark film, but there is always the single malts, golf, and Nessie...\n\nI like wearing a kilt.", "gilded": 0, "created_utc": "1297630777", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Tree fiddy. \n", "gilded": 0, "created_utc": "1297643449", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "THAT GODDAMN MONSTER STILL OWES ME TREE FIDDY! ", "gilded": 0, "created_utc": "1297643919", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "I'd sell it for about tree fitty.", "gilded": 0, "created_utc": "1297662160", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "&gt; However, in order to find the evidence, we need to take a leap of faith, and that's a difficult thing.\r\n\r\nIn other words, you need to start off with the assumption that Christianity is true and start looking for evidence that supports that? Do you think that's a good path to truth? It seems to not only *not* account for confirmation bias, but actively *depend* on it! If you start with the assumption that *anything* is true and go looking for every little bit of evidence you can to support it, you'll probably find lots of evidence. Let me demonstrate...\r\n\r\nLet's take a leap of faith, just for a few minutes, that aliens really exist, that they come to planet Earth and visit us frequently, occasionally abducting people and probing them. Now let's go look for evidence to support our assumption. It turns out that if we go looking for evidence to support this, we find absolutely *loads* of it! There are countless photographs and videos of what look like alien space craft and flying saucers; we have unexplained crop circles that look like alien landing sites; we have *thousands* of people claiming to have been abducted by aliens and probed, all able to describe the same large, black eyed, thin alien figures; we have mutilated animals which appear to have been dissected by aliens; we have many, many eye witness accounts of alien spacecraft close up; we have entire books on the government conspiracies that make a very convincing case that the government is covering up these alien visits; we have all of the evidence surrounding Area 51 and the Roswell incident. There's far more evidence for alien abductions than there is for Christianity!\r\n\r\nOr what about ghosts? Let's take a leap of faith and assume for a minute that ghosts are real. Now let's go looking for the evidence. Once again, we find absolutely loads of it! Thousands and thousands of pictures showing ghostly figures, glowing orbs, strange shapes and auras; we have video of these same ghostly figures and glowing orbs; we have thousands of accounts and even video evidence of poltergeist activity; there are probably *millions* of personal accounts of people seeing and experiencing ghosts; we have many accounts of possession and exorcism, with strong evidence of the possessed demonstrating supernatural strength and demonstrating knowledge that the person couldn't have had; we have lots of evidence of people who are able to accurately communicate with the ghosts of the dead. I could go on. Once again, there's *far* more evidence for ghosts than there is for Christianity.\r\n\r\nDo I need to continue? I could do astrology, tarot card reading, faith healing, phrenology, mind reading, telekinesis, lucky charms, the loch Ness monster, big foot... take your pick. If we start off with the assumption that *any* of these things are actually *true* then look for evidence supporting them, we *will* find that evidence, and usually *lots* of it! In almost every case, far more evidence than there even is for Christianity.\r\n\r\nAnd of course, I haven't even started on religion yet. If I start with the assumption that almost *any* modern religion is true then go looking for evidence supporting it, I *will* find that evidence: Islam, Buddhism, Sikhism, Hinduism, Mormonism... once again, take your pick.\r\n\r\nA *better* way of finding out truth, which counteracts our confirmation bias, is to start out with the assumption that what we want to believe is *false* then try to *prove* that it's false while at the same time looking for evidence either way. That's how the scientific method works: we start with a hypothesis and devise tests which try to prove that the hypothesis is false. If the hypothesis passes enough tests, has enough supporting evidence, and accurately makes predictions (which usually means passing these tests that we devise), then it becomes a theory and we use it to explain the world. At no point do we ever say a theory is absolutely true, only that we are confident in it.\r\n\r\n&gt; I've seen plenty of evidence of God's existence in my own life, but how is that evidence to you?\r\n\r\nProbably extremely shaky. What's the best you have? Let me guess... personal experience?\r\n\r\n&gt; Will you believe because of my proof?\r\n\r\nIf your proof demonstrably and necessarily leads to the conclusion that the Christian God of the Bible exists and that everything in the Bible is true, yes.\r\n\r\n&gt; Or is there something in your own heart that prevents you from taking that first step towards belief?\r\n\r\nMy heart is a pump. It is my *brain* you should be worrying about, and that property is skepticism and the desire to know what's *true*, if by \"first step\", you mean making that assumption we talked about above.", "gilded": 0, "created_utc": "1297676838", "subreddit": "DebateAChristian", "score": 3, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1297711905", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "WOE Nessie!\r\n", "gilded": 0, "created_utc": "1297744991", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "About tree fiddy. ", "gilded": 0, "created_utc": "1297784042", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "The Loch Ness Monster", "gilded": 0, "created_utc": "1297813901", "subreddit": "AskReddit", "score": 24, "controversiality": 0}
{"body": "Aliens. As in the type that come and visit earth and leave crop circles. Also, the Loch Ness Monster. ", "gilded": 0, "created_utc": "1297824322", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "**Bambi Is Frankenstein in Disguise**\n\nIn the jungles of Asia there exists a deer called Muntiacus.  Muntiacus is a barking saber-toothed deer.  Like an ice-age prehistoric saber-toothed tiger, its canine teeth are very long.  Like a dog, it barks.  Yet it is a deer.  The Chinese Water Deer Hydropotes is another saber-toothed deer. 7  Unlike most deer, these deer do not travel in herds or harems.  Rather, they are solitary.  This is akin to the social behavior, or rather anti-social behavior, of saber-toothed tigers and other cats. \n\nThese deer are not crypto-beasts like the Loch Ness monster.  On the contrary, my deer Watson, these deer are known to science.  The question is, why do these deer, these non-predators, bark and have saber-like teeth as predators do? \n\n", "gilded": 0, "created_utc": "1297826261", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "And he asked me...for about tree fiddy", "gilded": 0, "created_utc": "1297848680", "subreddit": "AskReddit", "score": 9, "controversiality": 0}
{"body": "WHAT?  That monster wanted tree fitty from you too?  I haven't seen that crazy ol' monster in about 7, 8 years.\n\n", "gilded": 0, "created_utc": "1297853862", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Last time I saw the Gaw Dayum Loch Ness Monster musta been about 7, 8 years ago, you see.  Me and da lil lady was all alone on this boat one night.\n\nDefinitely don't give him a dollar!  He'll expect you got more!", "gilded": 0, "created_utc": "1297853990", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Tree fiddy?!", "gilded": 0, "created_utc": "1297902661", "subreddit": "pics", "score": 26, "controversiality": 0}
{"body": "I ordered one of those fancy converter plugs one time and they said it would be delivered in a couple a' days.  Couple a' days went by and I got a knock on the door.  It was the postman he say he have my converter plug COD.  I say COD i already paid in the computer.  He said thats too bad you gotta pay COD or you can't have it.  I asked him how much it was. He said \"uhhh...I need about tree fiddy\".  \nNow it was about that time I noticed our mailman was a 50 foot tall plesiosaur from the Mesozoic era.  It was that god dang loch ness monster tryin' a steal my god dang tree fiddy!\n", "gilded": 0, "created_utc": "1297906918", "subreddit": "pics", "score": 50, "controversiality": 0}
{"body": "If they were charging $3.50, I'd be suspicious it was another plot by the Loch Ness Monster.", "gilded": 0, "created_utc": "1297956244", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "That ain't no Obama, it's that god damn loch ness monster again. ", "gilded": 0, "created_utc": "1297960738", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "So I was goin' across tha borda to do some shoppin. Do you know who was at tha customs?  The damn loch ness monster.  He aksed me fo figh fitty.", "gilded": 0, "created_utc": "1297961692", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I was traveling to america the other day when I get to the border and an man in a suit tells me to stop and asks for $5.50. Then I realize it's not a border agent at all, but a 20 story tall loch ness monster from the paleolithic era. I said monster get out of my way god dammit, I'm trying to get to america. SHE GAVE HIM A DOLLAR!!!", "gilded": 0, "created_utc": "1297972294", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "Well, observations in the wild of the species femallia under these so called intimidation conditions have resulted in a few distinct coping mechanisms manifest in the species; the breakdown of these mechanisms being as such:\n\n* Encouragement (e.g. on \"tits or gtfo\" they post a picture from the suicidegirls website, or on \"sharpie in your pooperz\", they post a dark, blurry 320x200 of what is either the loch ness monster, or bigfoot.)\n\n* confrontation (e.g. on intimidation they reply \"up yours you lame ass jizz vacuum\")\n\n* live and let live (on intimidation they either ignore, or respond neutrally)\n\n* ignore (they ignore the assholes)\n\n* camoflage (They attempt not to be seen.  Either by hiding among the foliage, or adopting a gender neutral, or even masculine username or handle, such as \"meat sword: + 2 ch\"\n\n* drama queen (they make up the intimidation, take the banal subject which has been a problem since before Vesuvius, and make a post about it that focuses on themselves)\n\nConclusion: The species femallia has evolved and adapted many defense mechanisms over the thousands of years in which they have been \"trolled\" by the species that guyyus such that it's become a pretty boring topic.", "gilded": 0, "created_utc": "1297988902", "subreddit": "TwoXChromosomes", "score": -3, "controversiality": 0}
{"body": "Anyone see the Loch Ness monster at 2:25?", "gilded": 0, "created_utc": "1297995044", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "how's about tree fiddy?", "gilded": 0, "created_utc": "1298003545", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1298077981", "subreddit": "fffffffuuuuuuuuuuuu", "score": 3, "controversiality": 0}
{"body": "I mean, we had to put the Loch Ness monster *somewhere*.", "gilded": 0, "created_utc": "1298078562", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "loch ness monster, how could you forget", "gilded": 0, "created_utc": "1298086633", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Nah, Nessie is real.", "gilded": 0, "created_utc": "1298100292", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "That's no dolphin, that's the LOCH NESS MONSTER!", "gilded": 0, "created_utc": "1298143408", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Loch Ness Monster, Jesus. What's the dif?", "gilded": 0, "created_utc": "1298145249", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Closer to about tree fitty.", "gilded": 0, "created_utc": "1298149423", "subreddit": "politics", "score": 21, "controversiality": 0}
{"body": "&gt;So my sister says that the christian god is proven by the miracles he does in a hundreds of churches around the world. They are called word of faith and consist of people laying hands on others and them being miracously \"healed\".\n\n[citation needed]\n\n&gt;She claimed it was all over the internet, and happened all the time.\n\nIf it's on the internet, it must be true.  Search youtube for 'video evidence for' and insert your favorite conspiracy theory.  Bigfoot, lizard overlords, aliens, time travelers, the Loch Ness Monster.  According to your sister, all of those things must be equally true, since they're documented so well on the internet.", "gilded": 0, "created_utc": "1298152914", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I a funny about the Loch Ness Monster.   ಠ_ಠ ", "gilded": 0, "created_utc": "1298162997", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "GOT DAMN LOCK NESS MONSTAH ALWAYS TRYING TO STEAL TREE FIDDY FROM MEH!", "gilded": 0, "created_utc": "1298180778", "subreddit": "pics", "score": 27, "controversiality": 0}
{"body": "Congratulations. You just met the Loch Ness monster.", "gilded": 0, "created_utc": "1298213259", "subreddit": "offmychest", "score": 10, "controversiality": 0}
{"body": "&gt;Didn’t they know that Lake Windermere is reputedly the home of the British version of the Loch Ness monster\n\nErr, no. Loch Ness would be the home of the British version of the Loch Ness monster.", "gilded": 0, "created_utc": "1298213516", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "&gt; British version of the Loch Ness monster\r\n\r\nSurely the Loch Ness Monster is the  British version of the Loch Ness monster?", "gilded": 0, "created_utc": "1298221256", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Interesting pic.  At least you didn't put 'British version of the Loch Ness Monster' like the author did.", "gilded": 0, "created_utc": "1298228953", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Troll fiddy cal I can understand, but what's so troll about the SKS?  The whole \"INNA WOODS\" bs?\n\n\nAlso, why no Moist Nugget?  It's like tree fiddy.", "gilded": 0, "created_utc": "1298236894", "subreddit": "guns", "score": 0, "controversiality": 0}
{"body": "bout tree fiddy", "gilded": 0, "created_utc": "1298244465", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I wouldn't call it paleo.. not sure I like that term as some of the science doesn't back this diet being exactly from the paleolithic era.\n\nAnyway.... I'm low carb.\n\nI try to do simple sugars, honey, oatmeal.\n\nFor my shorter rides, usually less than an hour, I find that as long as I get in my rest days, I don' t have a problem with glycogen or energy or performance.  \n\nI think that what's happening is that the normal amount of sugar + carbs I get from my diet (20%) is enough to keep me going.\n\nI've experimented with adding more carbs but it causes me to retain LOTS of water.  Like 10 lbs.... which is no fun.  \n\nAnything less than 1 hour per day and I start to have problems.  Today I did 1:45 and I'm really lagging right now.  \n\n", "gilded": 0, "created_utc": "1298250245", "subreddit": "bicycling", "score": 1, "controversiality": 0}
{"body": "Shit, it's the loch ness monster.", "gilded": 0, "created_utc": "1298270169", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "This exchange just sent me into one mean-ass tail spin of contradictions from which I'm never gunna recover. If Nessie hadn't viewed the content, the resulting argument against the title would have been stronger. But, then Nessie couldn't have made an argument at all, which presumably would have carried less weight than any argument that was made. But, the argument made, is inherently contradictory and hence makes no sense, so it's worse and better all at the same time! God lord, you two are Kirk and Mudd and I'm Norman!(http://www.youtube.com/watch?v=wlMegqgGORY) ", "gilded": 0, "created_utc": "1298272745", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Shhhh... dinna be tellin them about the 'foresters secret'!\n\nThe re-bottling of 'the magic cream' into 250ml tartan bottles is one of the few industries left to us! \n\nYeh might as well be telling them that Nessie is just a bunch o tractor tyres stuck thegither wie bungy ropes... or that Haggis' legs are all the same length!!!\n\nBut aye... fukin' midges... the REAL reason the Romans never conquered Alba.\n\nApril they'll no be too bad though.", "gilded": 0, "created_utc": "1298292014", "subreddit": "Scotland", "score": 4, "controversiality": 0}
{"body": "Oops, wrong post - *this* is how to score points with people who agree with you while simultaneously making the ignorant even more certain of their rightness and wasting your time to boot.  You must have left your intended post in the drawer with the photo of the unicorn riding Nessie faster than the speed of light.", "gilded": 0, "created_utc": "1298315952", "subreddit": "pics", "score": 54, "controversiality": 0}
{"body": "I'm pretty much sick of this crap about demolition charges on the Twin Towers and Building 7. It's crackpot nonsense. It doesn't make any sense! You need to be completely divorced from reality to buy into this theory. Give it a rest. Devote your time to something more plausible, like Bigfoot or the Loch Ness monster.", "gilded": 0, "created_utc": "1298317660", "subreddit": "conspiracy", "score": 1, "controversiality": 0}
{"body": "Loch Ness monster", "gilded": 0, "created_utc": "1298319950", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I can only assume you think UFOs, Sasquatch, and the Loch Ness Monster are scientific phenomena as well?\n\nWhy do you believe in ghosts but not gods?  The evidence for them seems about equal.  Some people believe in them and claim to have seen them or their works, but no one has ever been able to conclusively document either one.\n\nEdit: Let me clarify that I think all so-called UFO sightings are explainable by science lacking an extraterrestrial component.  I think they are tricks of the eye, atmospheric phenomena, psychological phenomena, and hoaxes.", "gilded": 0, "created_utc": "1298321882", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "My ex-Gf asked me what was under a Kilt. My response was:  two scots mysteries, what's under the kilt and where the loch ness monster is. Coincidence?  ", "gilded": 0, "created_utc": "1298329143", "subreddit": "funny", "score": 34, "controversiality": 0}
{"body": "Taylor-Swift typed this but deleted it before I could comment.  &gt;:-(\n\n*Bella has a deep connection with Edward. Edward who is vampire who can read minds has always been bored with life because he always knows whats gonna happen by reading peoples thoughts. But one day he finds Bella he finds he cannot read her mind he is quite confused why this is happening, then she becomes his science partner and while siting next to her, her sent overpowers him and makes him want too kill her. He does not know why he wants too and is confused by his actions, he does not however kill her for the sake of how angry his father Carlise would be. He avoids being near her and leaves for a few weeks. He comes back and finds her to be this fascinating person. She is smart, funny, and everything he has been waiting for hundreds of years. He is mostly attracted to her because of her wonderful smell and because he cant read her mind he finds her actions always surprising and he enjoys being with her. Through the books Edward and Bella become more and love with each other and find their love inseparable and in Breaking Dawn Bella and Edward marry and have their first child Renesme's name derives from an amalgamation of the names of Bella's mother, Renée, and her mother-in-law, Esme. Her middle name, Carlie, is a portmanteau of Bella's father-in-law, Carlisle, and Charlie, Bella's biological father. Her full name is Renesmee Carlie Cullen, and later nicknamed \"Nessie\".*", "gilded": 0, "created_utc": "1298352004", "subreddit": "shittyadvice", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1298394306", "subreddit": "politics", "score": 7, "controversiality": 0}
{"body": "They'll fit it in between shows about UFOs and the Loch Ness Monster. You know... other science.", "gilded": 0, "created_utc": "1298401433", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "Can I have about tree fitty?", "gilded": 0, "created_utc": "1298438340", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "It did... like a week ago... which is like happening in the paleolithic era in internet time.", "gilded": 0, "created_utc": "1298467057", "subreddit": "fffffffuuuuuuuuuuuu", "score": 8, "controversiality": 0}
{"body": "&gt;tree fiddy", "gilded": 0, "created_utc": "1298477049", "subreddit": "WTF", "score": 6, "controversiality": 0}
{"body": "nigga you got tree fiddy? I need it to take the bus back to Oakland.", "gilded": 0, "created_utc": "1298477990", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "Agreed.  Sometimes I think the arguing about canon with Doctor Who is a fool's errand.  I mean, they've given 2 different explanations behind Atlantis sinking and a few for the Loch Ness Monster as well.", "gilded": 0, "created_utc": "1298515438", "subreddit": "doctorwho", "score": 1, "controversiality": 0}
{"body": "Looks like the Loch Ness monster.", "gilded": 0, "created_utc": "1298524144", "subreddit": "MCNSA", "score": 2, "controversiality": 0}
{"body": "Eating them in quantity isn't in keeping with the average macronutrient ratio that paleolithic man ate, for sure. However, I feel like I have more energy and better recovery on a higher carb, starchier diet, plus it makes the diet cheaper (even eating organic potatoes it's still cheaper per calorie than grain-fed meat), easier to cook in bulk, and I really like mashed potatoes ... so I'm pretty happy eating them in quantity.\n\nThey are a vegetable though, so at it's most basic, potatoes are paleo. Wild strains of potatoes can be traced back to about 10,000 years ago, so this may actually push consumption of this vegetable into the paleolithic era, something that not too many modern fruits and vegetables we eat today can claim.\n\nCordain cautions against them because of their saponin content and glycoalkaloids, but there are traditional cultures and controlled feeding studies where high potato consumption doesn't show problems.\n\nSission warns against the \"insidious weight gain\" after 150 grams carbs per day, but damn potatoes are really satiating. I usually load them up with a tonne of coconut oil or butter in order to try and reach my daily calorie count when eating a lot of potatoes - I don't see any fat storage problems from consuming them in bulk.\n", "gilded": 0, "created_utc": "1298533027", "subreddit": "Paleo", "score": 4, "controversiality": 0}
{"body": "\"And then he says 'about treeFTFY' and I says 'GODDAMN! GET OUTTA' HEA' LOCH NESS MONSTER!'\"", "gilded": 0, "created_utc": "1298539850", "subreddit": "worldnews", "score": 0, "controversiality": 0}
{"body": "I think that \"problem\" is easily solved by the fact that those making a positive claim hold the burden of proof. \n\nIf I say that the loch ness monster is real the burden of proof is on me to demonstrate that fact and not on those who disagree to somehow prove it doesn't exist.", "gilded": 0, "created_utc": "1298560210", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I would argue that 30-40 minutes of uncensored air time does far more in advertising than a single funeral picket. \r\n\r\nDo you know the sheer number of pickets they attend? Its a logical swap, at the same time providing air time is \"legitimizing\" their claims further fanning the flames. \r\n\r\nThey are a complete and utter fraud - no, they do not believe what they are saying. Oh, some do, the same that ALREADY believe these things, the same people who think the moon landing was a myth, the loch ness monster is real and Bigfoot keeps ordering pizzas delivered to my house. \r\n\r\nThey are a business in the truest sense of the word, their product hate. As long as they can keep sueing and getting attention - they will keep selling their products. ", "gilded": 0, "created_utc": "1298570510", "subreddit": "reddit.com", "score": 18, "controversiality": 0}
{"body": "[tree fiddy](http://www.urbandictionary.com/define.php?term=tree%20fiddy) ", "gilded": 0, "created_utc": "1298577425", "subreddit": "web_design", "score": -1, "controversiality": 0}
{"body": "tree fitty", "gilded": 0, "created_utc": "1298614591", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "bout tree fiddy", "gilded": 0, "created_utc": "1298629563", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "That sucks, but I think I may have it beat.\n\nA friend of mine set me up with one of her girlfriends, with the warning that this girl could be a little crazy (as in, partying crazy and crazy crazy). Me, being a dumbass 22-year old with no real interest in anything but some sex, saw these things as perfectly cool (and in fact, somewhat positive).\n\nSo, I agree to meet this girl. We actually talked before, and she seemed pretty cool; we decided to meet at a bar downtown for a few drinks and some pool, just to keep things low-key.\n\nWell, she gets there, and she's pretty damn good-looking. Not model-hot, mind you, but clearly takes care of herself and has absolutely beautiful eyes. She walks up, smiles, and introduces herself (we'll say \"Mary\" for this story). I grab her a drink, and we immediately hit it off.\n\nSo, we're playing pool, and \"Mary\" is just pounding drinks. She asked for a jack and coke for her first drink, and just pounded it like a shot. \"Alright,\" I'm thinking to myself, \"this girl is nuts, I am definitely getting laid tonight.\"\n\nSo, night goes on, and we're both pretty ripped. We decide to go for a walk, and she asked where I parked. I was in a garage near the bar, and she asked to see my car. Needless to say, I obliged.\n\nWe get out there, and just start going to town on each other. She tears (and literally tears, I had buttons pop off) my shirt off, and undoes my pants within about 30 seconds of getting into the car, and just starts going wild on me downstairs.\n\nNow, this girl was a pro. She was after me like she was hungry for it, and I was more than willing to take care of her. So, embarrassingly, I realize that I'm about to cum after just a few minutes of her going down on me. I say fuck it and just go with it, and riiiiight as I'm about to cum, she stops abruptly.\n\nI look down and say, \"What is it?\"\n\nShe looks up at me with those gorgeous blue eyes, and just says, \"I need about tree fitty.\"\n\nWellll it was right about this point that I noticed this bar skank was actually an eight-foot tall monster from the late cretaceous.\n", "gilded": 0, "created_utc": "1298660544", "subreddit": "sex", "score": 128, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1298672631", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1298701735", "subreddit": "IAmA", "score": 4, "controversiality": 0}
{"body": "I know who Debito is; what you just spelled out was my point. Earlier you said that Nessie was discriminated against because he's not Japanese, not because of his skin colour. Yet with Debito it's because he's \"Caucasian\" and *despite* his being Japanese? You don't see that as a contradiction?", "gilded": 0, "created_utc": "1298703538", "subreddit": "japan", "score": 2, "controversiality": 0}
{"body": "Malls were dead even just 5 years ago.  We were only in there to go to a theater that they had which cost about tree fitty.", "gilded": 0, "created_utc": "1298710754", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "The reasoning is easy to find – just look for the downvoted comments ;-)\n\n\nThe opposition to UBB is based on a sense of *entitlement* and *ignorance* of how the telecom industry works. The prevailing opinion is that 'bandwidth is 'free'. I've seen posts, in this thread and others, that since bits don't cost anything, moving them around is free as well. **Nothing could be further from the truth**. Everything about telecom is expensive. Materials is expensive, equipment is expensive and labour is expensive. The ISP's have been running the network-upgrade treadmill for the past 10 years and demand is always increasing. Once you're done upgrading a network segment, you *immediately* start planning the next. That is the **reality** of telecom.\n\n\nThis ignorance is perpetuated by the public statements made by the president of Tek Savvy saying that bandwidth is 'virtually free'. *That is a baldfaced lie*; he knows it (at least he should) I know it and everyone who has more than a passing knowledge of telecom knows it. He also knows that a thousand frothing shouts can easily drown out a single informed voice, so he has accomplished his goal.\n\n\nThe other fact that is lost in the screaming is that of usage patterns. Ever heard of the 80-20 rule? Residential Internet follows the 80-3 rule – 3% of your users use 80% of the bandwidth and therefore drive 80% of your network upgrade costs (not free – see above). Does it not make sense that these users pay more than the others? To me, it does.\n\n\nIM(informed, yet)HO, UBB makes sense because it establishes a link between usage and contribution. With UBB, the justification for traffic management policies like capping, throttling and shaping disappear. With UBB, the power is in the hands of the user. If you want to torrent the entire Buffy collection in a day, go right ahead. You can't make that decision if your connection is capped. If you want the latest Ubuntu ISO in five minutes, you can, that is if your connection isn't throttled. UBB turns high-volume “abusers” (industry term, not mine) into an ISP's best customers.\n\n\nNow, I'll be the first to say that telecom executives seem to have originated in the Paleolithic era and I don't think that traffic management is going to disappear overnight. But even the most shortsighted MBA will eventually realize that with UBB, more traffic = more revenue, and it makes sense to &amp;*remove all barriers* that stand in the way of that traffic being generated.", "gilded": 0, "created_utc": "1298747671", "subreddit": "canada", "score": 0, "controversiality": 0}
{"body": "the best description I can bring is the ending sound of the scottish word 'Loch' ... like Loch Ness Monster.  \nI think the sound should be called - 'wannahackaloogie' ... just keep making that noise and pretty soon you can pronounce the swiss password 'chuchichäschtli' perfectly.", "gilded": 0, "created_utc": "1298762071", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "The Loch Ness Monster would like a word :-).", "gilded": 0, "created_utc": "1298767710", "subreddit": "politics", "score": 25, "controversiality": 0}
{"body": "I need about tree fiddy. ", "gilded": 0, "created_utc": "1298789599", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "It's what you want it to be.  I don't consider the books to be canon, but you can unless they're directly refuted onscreen (as that is always going to tbe the final word). \n\nThat said, there have certainly been huge contradictions in the new and old series.  Some big ones that come to mind are that they've given multiple explanations behind the Loch Ness Monster and the Destruction of Atlantis.  Also, seeing as how the episode Dalek takes place AFTER the events in Journey's End there is no reason that everyone shouldn't have been aware of the Daleks.\n\nIn short....wibbly wobbly timey wimey.", "gilded": 0, "created_utc": "1298799448", "subreddit": "doctorwho", "score": 3, "controversiality": 0}
{"body": "Everyone knows you don't fuck with Nessie.", "gilded": 0, "created_utc": "1298830933", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1298862249", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy.", "gilded": 0, "created_utc": "1298862316", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1298863297", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "I *am* a skeptic in general.  And that includes God, the Easter bunny, Father Christmas, and Nessie - they all don't get free rides for any reason.\n\nThere are no reasons to believe *anything* without evidence.  Doing so is **delusional**.\n\nYou seem to have a very poor understanding of the English language, especially the terms we covered above.  A great synonym of \"skeptic\" is **scientist**.  Think about that for a second, read what you just wrote, finish blushing, then come back and continue the discussion.", "gilded": 0, "created_utc": "1298919118", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "Nessie\n\ndouble chambered, had a cute seal like creature in the middle chamber.\nR.I.P :(", "gilded": 0, "created_utc": "1298920516", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "it will be about tree fiddy!", "gilded": 0, "created_utc": "1298925510", "subreddit": "pics", "score": 50, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1298928577", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": ".. and I said \"Lion, and why do you need tree fiddy? \"", "gilded": 0, "created_utc": "1298934929", "subreddit": "pics", "score": 26, "controversiality": 0}
{"body": "tree fiddy!", "gilded": 0, "created_utc": "1298934998", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "I propose we spend a billion dollars and make sure there's no Loch Ness monster. If all goes poorly, we have at least cleaned up lake Loch Ness.", "gilded": 0, "created_utc": "1298935684", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1298936016", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Christianity isn't the only religion, if you're going to place your bets on Christianity why would you choose that religion over the thousands of others? They all have to be believed by faith alone. When something is believed based upon faith it requires zero evidence and no religion has evidence of their god existing.\n\n&gt;Probably the part where you suffer for all eternity.\n\nWhich proves my point, why would this god care whether I believed him or not? Why would he not prevent all suffering? Why would he not stop children dying of aids and hunger? If he did exist, which I don't believe he does, he would be directly responsible for the pain and suffering of billions of humans and creatures. The Christian god is a dick. \n\nWhen you see god in a peaceful serene picturesque vista, do you also see god in a child who has been raped and left with AIDs? If not, why not? The Christian god is supposed to have all this power, if he's created everything that's good in the world he is responsible for everything that is bad. \n\nThere is no evidence to say the Christian god exists any more than any other god, or leprechauns or the Loch Ness monster.", "gilded": 0, "created_utc": "1298936649", "subreddit": "Metal", "score": 4, "controversiality": 0}
{"body": "http://www.leagueoflegends.com/board/attachment.php?attachmentid=126135&amp;d=1298932193\n\nHave you ever been so smug that you turn your back to the Loch Ness Monster and an opposing turret, then just stand there?", "gilded": 0, "created_utc": "1298937381", "subreddit": "leagueoflegends", "score": 3, "controversiality": 0}
