{"body": "You better not give that lion no tree fiddy.", "gilded": 0, "created_utc": "1298942171", "subreddit": "pics", "score": 21, "controversiality": 0}
{"body": "Jarvan has. Cause Jarvan slays rather large beasts. And the Loch Ness monster is a rather large beast.", "gilded": 0, "created_utc": "1298945854", "subreddit": "leagueoflegends", "score": 1, "controversiality": 0}
{"body": "'bout tree fitty", "gilded": 0, "created_utc": "1298950005", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "And I said \"GOD DAMNIT, LOCHNESS MONSTER! I AIN'T GIVIN' YOU NO TREE FIDDY! We work hard for our money.\"", "gilded": 0, "created_utc": "1298954897", "subreddit": "pics", "score": 10, "controversiality": 0}
{"body": "Tree fitty.", "gilded": 0, "created_utc": "1298959708", "subreddit": "shittyadvice", "score": 2, "controversiality": 0}
{"body": "Screw two dollars - Gimme tree fiddy!", "gilded": 0, "created_utc": "1298977052", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Dontchu go aroun and be payin Bloaf tree fiddy! Ufcourse he ain gonna be goin away when you give Bloaf tree fiddy. Damn, woman!", "gilded": 0, "created_utc": "1298977547", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "Thats when the squirrel said, \"Hey man, can you give me tree fiddy?\" And it was around that time that I started to get suspicious. \"Now what does a squirrel want with tree fiddy?\"", "gilded": 0, "created_utc": "1298995880", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "My grandmother believed for a long time that all dinosaur bones were planted on planet earth by Satan to confuse people. Eventually, though, the creationist community adopted the view that they did exist, and were destroyed during the flood. Then they started humoring the idea that some of them survived, and could therefore serve as indication of the young earth hypothesis (i.e. nessie). ", "gilded": 0, "created_utc": "1299009971", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Yeah, like Bigfoot and Nessie.", "gilded": 0, "created_utc": "1299013547", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "i'll let you touch Nessie ", "gilded": 0, "created_utc": "1299057693", "subreddit": "tf2", "score": 1, "controversiality": 0}
{"body": "I weigh about tree fiddy, they're both mine. ", "gilded": 0, "created_utc": "1299093882", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "I ain't giving you no tree fiddy you god damn loch ness monster!", "gilded": 0, "created_utc": "1299111554", "subreddit": "pics", "score": 14, "controversiality": 0}
{"body": "Considering they were trying to pitch the game as being different, I care. I was excited for this game before the trailer, when i read the descriptions of their ambitions. They made it sound like they were making a game out of 28 Days Later. A \"realistic\" zombie scenario. Yes, I know itsounds ridiculous to talk about realism in this scenario. But what I mean is if you take current reality, make a change to that reality, in this case, zombies, and retain some level of realism surrounding that change. How would we escape? It wouldn't be from finding crests to open doors. There wouldn't be a crazy killer loch ness monster or superhuman who can warp around a room at the  speed of sound. It's just zombies and survivors trying to escape and survive. That's the impression I got from the interviews and descriptions I read before the trailer, and that's why I care that it sounds exactly like Dead Rising 2, whihh didn't compell me. ", "gilded": 0, "created_utc": "1299123112", "subreddit": "gaming", "score": 10, "controversiality": 0}
{"body": "I gave him the tree fiddy...", "gilded": 0, "created_utc": "1299123144", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "\"Well no wonder the monster keeps comin' around if you keep givin' him the damn tree fiddy\"! Hilarious.", "gilded": 0, "created_utc": "1299124178", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Damnit woman! I told you not to give that damn loch ness monster no tree fiddy!", "gilded": 0, "created_utc": "1299131364", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "DAMN YOU LOCH NESS MONSTER", "gilded": 0, "created_utc": "1299134507", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I'd pay 'bout tree fiddy.", "gilded": 0, "created_utc": "1299137476", "subreddit": "gaming", "score": 7, "controversiality": 0}
{"body": "It wasn't no alien, it was that goddamn Loch Ness monster again, trying to trick me into giving him tree fiddy by dressing up like an alien!", "gilded": 0, "created_utc": "1299148096", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Oh shit, you Killed Nessie!!!1\n... Wait. That's just a stuffed dinosaur.", "gilded": 0, "created_utc": "1299170845", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": " Well it was about goddamn time I started getting suspicious! I said \"CHEF?! Why do YOU need tree fiddy?\" He said \"My imaginary friend BooBoo the Dinosaur wants it\" I went to my sons room and sure enough... there was the loch ness monster...", "gilded": 0, "created_utc": "1299178022", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I don't know there is no god any more than I know that at this very moment thousands of light years away a bright pink unicorn is shitting leprechauns and launching jelly beans out of his nose. Is it possible that a bright pink unicorn is shitting leprechauns and launching jelly beans out of his nose? Of course! There certainly could be! But how do I know it's there? What evidence is there of this unicorn? Does it affect me? If I can neither observe and measure it or the effects of its existence, what's the point?\r\n\r\nNo, I cannot disprove the existence of God anymore than I can disprove Bigfoot, aliens, the Loch Ness monster, or Chupacabra. However, there is a fundamental difference between believing there is no God, and not believing in God. I do not hold any beliefs about the existence of supernatural creatures/gods/demi-gods. There is no belief. Lack of belief in existence is not a belief in lack of existence.", "gilded": 0, "created_utc": "1299188809", "subreddit": "DebateAChristian", "score": 14, "controversiality": 0}
{"body": "so it was you who hunted the loch ness monster, i knew it existed", "gilded": 0, "created_utc": "1299197563", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Your first tip off should have been when she asked for tree fiddy.", "gilded": 0, "created_utc": "1299242185", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Go ahead and laugh, but I saw a ghost.\n\nIt happened when I was nine years old, in broad daylight. My brothers and I were playing catch when the ball got away from us and rolled into the other room and under the bed. I crawled under the bed to fetch it. As I stretched my hand out to grab the ball a glowing face suddenly appeared on the wall. It was a woman and I could see her lips move as she tried to talk to me but no sound was coming out. She had hair floating around her face like the rays of the sun. I was so terrified that I couldn't move and couldn't speak. After a few seconds the image vanished, and like a snap the fear dissappeared. I grabbed the ball and ran like hell.\n\nFast forward ten years, to college. I was having a drunken philosophy discussion with my brother and some friends about whether God exists or not. I mentioned that I was an atheist, but that there might be some sort of spirit world because I thought I saw a ghost in the house I grew \nup in. My brother got real quiet, then he said, \"Was it a lady?\" I replied,\"Yes...\" Then he said, \"Did she appear on the wall, and it was glowing and moving her lips and her hair was floating all around her face?\" Dumbfounded, I said, \"Yes!\" Then he said, \"Holy crap! I saw the same thing in that house! I never told anyone about that before!\" \n\nTo this day, I am a skeptic and an agnostic. I don't believe in Bigfoot, the Loch Ness Monster, UFOs or any other similar bullshit. I do, however, believe in ghosts.\n\ntl,dr: A ghost scared the shit out of me.", "gilded": 0, "created_utc": "1299253647", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "&gt; 1) Paleo is not about eating all the fat you want. The philosophy is not to be afraid of fat. Fat has been and is an incredible source of energy and evolving humans would not have thrown it away. Even ruminants rely on fat. They have abundance of enzymes that breakdown cellulose into free fatty acids. Humans have a small amount of this cellulase.\n\n\nNobody ever said to be scared of fat, but massive amounts of fat can be dangerous.  Eating an entire package of bacon and 12 egg yolks everyday is going to heart disease as well as major weight gain. \n\nYou must also consider the lifestyle of somebody in the Paleolithic era compared to today. We do not have the same lifestyle.  Hunter gatherers and nomads would walk tens of miles on a hunt to find food, everything they had needed to be worked for.  So it is almost certain that a massive amount of physical activity was exerted.  We don't do that today.  So again your premise is flawed.  Eating all you want when you have a 8000 calorie caloric deficit due to physical activity and not RMR is fine and dandy.  Doing such with almost no physical activity will likely lead to problems.  \n\n&gt; 2) Paleo is not about eating 5000 calories a day. The philosophy is not worrying about counting calories. Animals do not count calories. Humans did not count calories until very recently and now we are fatter than ever. Most humans still don't count calories. Animals and humans eat to satiety and no more. The problem is when modern highly processed foods damage our metabolism.\n\nThat works for people who have completely healthy metabolisms.  Even Taubes pretexts this in all of his lectures.  If you suffer from metabolic syndrome you need to count calories or else you will over eat.  Eating 5000 calories of fat will make you fat, plain and simple.  \n\n&gt; 4) Paleo is about thinking outside of the box. Most people on this subreddit have come to Paleo because the conventional health management models have seriously failed them. Coming here and offering advice that basically mirrors the conventional wisdom that has already failed all of us won't win you any upvotes.\n\nPeople tend to be easily impressionable.  Such is the reason diets in America are so popular.  You tell them one thing and it sounds easy so they try it.  They don't consider the consequences of their actions nor do they think it out.  I have encountered numerous people on other paleo boards who are eating massive amounts of fat and very high caloric intake.  \n\nThese people have been told they don't need to count calories, they suffer from metabolic syndrome and thus what people like you are telling them is irresponsible.\n\nNo nutritionist or doctor on the planet would tell somebody with metabolic syndrome to eat all they want.  Lustig makes this clear in his sugar video.\n\nAlso I am not looking for upvotes, lol.  Downvote me all you like.  \n\n\n&gt; 5) For all the nitpicking about saturated fats and cholesterol critics overlook a huge constantly running Paleo theme. Eat real minimally processed while foods. Avoid sugary overly processed crap.\n\nOne can eat no sugar,no processed foods and no cereal based carbohydrates and they will still suffer the consequences of over eating.  if your BMR is 2500 and you eat 4000 calories you will gain weight with metabolic syndrome.  It's a guarantee.  Some people have very healthy and inefficient metabolisms and will not, but these are exceptions amount dieters.\n\n\n&gt; If you want to come here and tell me that I'm going to die because I eat too much saturated fat or I'm going to have a heart attack because I eat too many eggs you might have a better time telling redditors at r/atheism to believe in Jesus.\n\nNot believing scientific research is intellectually dishonest.  You can live in your bubble if you want, but I actually care about people.\n\n\n&gt; One more thing. Don't come around acting like we haven't done our research just because we conclude something different from you. The AHA and ADA dietary recommendations as well as the US dietary standards are contentious at best, especially with new research coming about as well a meta-analyses that call to question much of the handed down wisdom. The point I'm making without having to show a bunch of links and citations is to say that people here have seen the arguments and research and found the information to be compelling.\n\nIt's compelling because it's easy and people are easily manipulated.  These people are at risk.\n\n\n&gt; My personal experience is enough for me to continue in this mode. And I am not some exception that \"rewrites the rule.\" I do not know a single person who has not been helped substantially by switching to Paleo tenets. The conventional rules being offered are either wrong or being misrepresented by the critics here.\n\nThat doesn't say all that much. Peoples bodies are different.  Do you suffer from metabolic syndrome like many?  I do, if I eat more than a certain amount of calories I store fat.  It's just how it works.  \n\n---\n\nSo sorry, but I am not missing the point.\n\n\n", "gilded": 0, "created_utc": "1299268494", "subreddit": "Paleo", "score": -8, "controversiality": 0}
{"body": " after the update, some more less than completely obvious pairings, for which the decision taken by someone may give indications of their deeper psyche.,\n\nSlap vs Tickle\n\nCheddar vs Brie\n\nSnookie vs Bieber\n\nWine vs Beer\n\nBeing Happy vs Being Correct\n\nRare vs Well Done\n\nSoup vs Salad\n\nDawn vs Dusk\n\nDuck vs Swan\n\nYettie vs Loch Ness Monster\n\nGas vs Electricity\n\nSteam Engine vs Internal Combustion Engine\n\nSword vs Bow\n\nET vs Close Encounters\n\nKirk vs Spock\n\nDr McCoy vs Scotty", "gilded": 0, "created_utc": "1299274702", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "The Loch Ness Monster", "gilded": 0, "created_utc": "1299285319", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1299290242", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I'll do it. But I need about tree fiddy.", "gilded": 0, "created_utc": "1299303052", "subreddit": "reddit.com", "score": 8, "controversiality": 0}
{"body": "omfg a weed nessie how jealous am i", "gilded": 0, "created_utc": "1299306844", "subreddit": "trees", "score": 7, "controversiality": 0}
{"body": "if humanity can do this, humanity can find the loch ness monster! [6]", "gilded": 0, "created_utc": "1299312380", "subreddit": "trees", "score": 4, "controversiality": 0}
{"body": "that's where the loch ness monster's head sleeps", "gilded": 0, "created_utc": "1299322274", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I told you before ya damn loch-ness-monster, ya ain't gonna get no goddamt tree fiddy. ", "gilded": 0, "created_utc": "1299323955", "subreddit": "trees", "score": 7, "controversiality": 0}
{"body": "You obviously mean the Loch Ness Monster...", "gilded": 0, "created_utc": "1299326757", "subreddit": "Drugs", "score": 1, "controversiality": 0}
{"body": "\"I gave him the tree fiddy.\"\n\"God dammit woman you gave him the tree fiddy, that's why he won't go away.\"", "gilded": 0, "created_utc": "1299326959", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "i want tree fiddy ounces by tree fiddy god dammit or ill send the loch-ness monster atter you", "gilded": 0, "created_utc": "1299341071", "subreddit": "trees", "score": 5, "controversiality": 0}
{"body": "Don't forget the single conspiracy-nutter that no one will believe!\n\n\"...UFO!  UFO!!\"  \\*snaps picture of the loch ness monster\\*", "gilded": 0, "created_utc": "1299353404", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "tree fitty", "gilded": 0, "created_utc": "1299367619", "subreddit": "AskReddit", "score": 9, "controversiality": 0}
{"body": "I need about tree fitty", "gilded": 0, "created_utc": "1299374157", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "In Germantown, Ohio, there is the Butter Street Monster.  It is either a wolf-like  creature that lives in the woods, walks on its hind legs and eats children and livestock, a retired circus freak that wanders out at night, or possibly a Loch Ness monster like creature that lives in one of the flooded, abandoned gravel pits in the area, depending on who you ask.\n", "gilded": 0, "created_utc": "1299381137", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Have you seen the loch ness monster? ", "gilded": 0, "created_utc": "1299422472", "subreddit": "IAmA", "score": 0, "controversiality": 0}
{"body": "LOL no!! I have been to Loch Ness but Nessie neglected to make an appearance the times I've been there. I read a book once that had an interesting theory that there is a sort of 'time gate' under Loch Ness and the monster is a dinosaur that happened to swim through the gate on occasion. ", "gilded": 0, "created_utc": "1299423156", "subreddit": "IAmA", "score": 6, "controversiality": 0}
{"body": "I'm afraid of UFOs, astral projections, mental telepathy, ESP, clairvoyance, spirit photography, telekinetic movement, full trance mediums, the Loch Ness monster and the theory of Atlantis.", "gilded": 0, "created_utc": "1299457282", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "That's brilliant Nessie. Cheers", "gilded": 0, "created_utc": "1299486557", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Imma need about tree fitty.", "gilded": 0, "created_utc": "1299489589", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Tree Fiddy.", "gilded": 0, "created_utc": "1299531876", "subreddit": "news", "score": 12, "controversiality": 0}
{"body": "Nah, in order for a species of that size to exist it would have to cover a very large area. We're not going to find a half dozen of them hiding in a few trees, living things expand their range as much as they can, we would find them. Keep in mind these things are meant to inhabit Europe, not deep jungles, I don't think there is any significant amount of Europe that has not been explored repeatedly.\nLoch Ness, it's difficult to explore under water, but the effort put into it was way more than was necessary to rule out Nessie, anyway. The Loch is too small for a population of creatures of that size to live in.\n\nNo doubt there are plenty of animals we've yet to find, but that's going to be beetles, lizards, amphibians and so on. Relatively small creatures living in dense jungles or other relatively unexplored areas.", "gilded": 0, "created_utc": "1299604510", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I've got a CT1 out in the barn. I can assure you that this is not the bike you want to take out to the desert. It's a great little bike...a lot of fun in the yard. It's completely gutless power-wise, but it makes up for it by having completely shitty brakes. \n\nYou really need to ask yourself this question; Do I want to wrench on a bike or do I want to ride a bike? If you want to wrench, by all means, get a 40 year old bike. If you want to ride, save your pennies and get something from this century. Modern bikes are infinitely better in performance, reliability and overall enjoyment. \n\nA low budget motorcycle restore is exactly like Bigfoot or the Loch Ness Monster. I've heard people talk of such things, but I have never seen one with my own two eyes. The bike in that ad is going to require well over $1000 in parts and months of time chasing them. Do you wanna wrench or do you wanna ride?", "gilded": 0, "created_utc": "1299673475", "subreddit": "motorcycles", "score": 2, "controversiality": 0}
{"body": "God damn it monster, why you keep comin round here askin for tree fiddy?", "gilded": 0, "created_utc": "1299685381", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "That Loch Ness monsters are a canniballistic organism who rise from the lake after if they face food shortage. i.e. They eat up all their own.", "gilded": 0, "created_utc": "1299686665", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1299697800", "subreddit": "AskReddit", "score": 16, "controversiality": 0}
{"body": "Listen bastard, I've got a personal relationship with the Loch Ness monster you couldn't understand!  He touched my heart and healed my soul (yes he also swallowed one of my legs, but \"no pain no gain\", right?)", "gilded": 0, "created_utc": "1299704857", "subreddit": "Christianity", "score": 3, "controversiality": 0}
{"body": "Link?  Are you referring to the Loch Ness / cryptozoology comments?  People honestly believe in things like that (no reason to restrict this conversation to Nessie) and yet it seems you are not willing to give them the benefit of not assuming their \"thing\" of belief is not imaginary.  How can you expect others to do it for you?  Because of time/tradition/popularity?  ", "gilded": 0, "created_utc": "1299709925", "subreddit": "Christianity", "score": 3, "controversiality": 0}
{"body": "&gt; rationalists like Dawkins... are in one sense the least well-equipped to understand what they castigate, since they don’t believe there is anything there to be understood, or at least anything worth understanding.\n\n\"Because he doesn't believe the same things I do, he's unqualified to comment on their plausibility\".  Total horseshit - criticise him for specific errors or oversimplifications all you want, but trying to pre-emptively hand-wave away his qualifications to speak on a subject on the basis he doesn't already agree with you is weak sauce.\n\n&gt; Reason, to be sure, doesn’t go all the way down for believers, but it doesn’t for most sensitive, civilised non-religious types either.\n\n\"All my arguments are apologism for unsupported and inconsistent axioms, but nobody else is any better\".  Over-simplified tripe that ignores factors like the *depth* at which belief kicks in.  Many people - lacking the skills to check for themselves - \"believe\" in the scientific consensus, but only because they know it's sanity-checkable in principle, and thousands of people have been doing so, rigorously, objectively and repeatably for hundreds of years... and not only have yet to find much in the way of inaccuracies, but even where we know there are problems, have yet to find any better theories to explain them.\n\n&gt; God is not a celestial super-object or divine UFO, about whose existence we must remain agnostic until all the evidence is in. Theologians do not believe that he is either inside or outside the universe, as Dawkins thinks they do. His transcendence and invisibility are part of what he is, which is not the case with the Loch Ness monster.\n\n**Says who?**  Who says the Loch Ness monster isn't some sort of transcendent entity that's exempt from the normal dichotomy of \"existence vs. non-existence\"?\n\nAnd if I assert he is, does that mean it would be just as reasonable to believe in it as in God?  After all, the legend of the Loch Ness monster is less self-contradictory than most Christian dogma regarding god, so it's more plausible even on the face of it.\n\nThe problem with religions is that they state that God *exists* in some relevant, \"objective\" form.  If Eagleton was prepared to admit that his god's existence might be purely metaphorical or memetic, atheists wouldn't disagree with them because *that's exactly what atheists believe*.\n\nThis is pure \"I've asserted God is immune to rational investigation, so you aren't allowed to rationally investigate him\".  I.e., bollocks.\n\n\n\n&gt; He seems to imagine God, if not exactly with a white beard, then at least as some kind of chap, however supersized.\n\n... Which is a viewpoint inherited from his Judeo-Christian culture, derived from Judeo-Christian Holy Books, which portray god as having very human motivations, opinions and concerns, even if they then baselessly assert that he's \"unknowable\" or \"transcendental\".\n\nGod-as-big-beard-in-the-sky is an idea that comes primarily *from most religions*, not something unique to atheism.\n\n... Bah.  I tried to keep going, but this is just a collection of flawed reasoning and the same tired old disingenuous (or nonsensical) arguments as we've had for the last few hundred (or in some cases, thousand) years.", "gilded": 0, "created_utc": "1299785828", "subreddit": "philosophy", "score": 100, "controversiality": 0}
{"body": "&gt;God is not a celestial super-object or divine UFO, about whose existence we must remain agnostic until all the evidence is in. Theologians do not believe that he is either inside or outside the universe, as Dawkins thinks they do. His transcendence and invisibility are part of what he is, which is not the case with the Loch Ness monster.\r\n\r\nBut just how much sense do these claims make?  Why should anyone consider such claims credible?  Why should anyone take theology seriously?\r\n\r\nHow much of theology can be reduced to \"we don't have to answer that question because (invisibility is in god's nature/god is neither inside nor outside the universe/god is not an object)\r\n\r\nWhat are the sorts of things that we don't need evidence for?  Are there others or is god the only one?  How do we identify members of that set?\r\n\r\n&gt;This is not to say that religious people believe in a black hole, because they also consider that God has revealed himself...\r\n\r\nAnd their justification for believing this is very weak.  Moreover, their justification for believing that any particular claimant is *the* revelation is also quite weak.\r\n\r\nOne does not need to read theology to grasp this.\r\n\r\n&gt;For Judeo-Christianity, God is not a person in the sense that Al Gore arguably is. Nor is he a principle, an entity, or ‘existent’: in one sense of that word it would be perfectly coherent for religious types to claim that God does not in fact exist. He is, rather, the condition of possibility of any entity whatsoever, including ourselves. \r\n\r\nDoesn't this take us completely out of anything that could be called Judeo-Christian and into some sort of vaguely pantheist anthropomorphism of basic underlying principles - Spinoza or \"Einstein's god\" as Dawkins uses that term?  In what sense can the \"condition of possibility of existence\" be equated with a historical figure?\r\n\r\nDoes one really need to read theology before dismissing the whole notion as incoherent?\r\n\r\nMoreover, although \"God is not a person\" Eagleton has no qualms stating *in the very next paragraph* that:\r\n\r\n&gt;He is what sustains all things in being by his love...he brought it into being ex nihilo... out of love rather than need. ...God is an artist who did it for the sheer love or hell of it, not a scientist at work on a magnificently rational design \r\n\r\nSo it appears that he'll depersonalize god if that makes his arguments seem sound, but he doesn't actually defend that notion at all...?  In fact, he'll immediately backpedal into a personalized god to make a new point.\r\n\r\n&gt;Now it may well be that all this is no more plausible than the tooth fairy. Most reasoning people these days will see excellent grounds to reject it.... but anyone who holds it is in my view to be respected\r\n\r\nAnd why on earth would the simple acquiesence in a widely-held, but admittedly implausible belief be grounds for respect?\r\n\r\n&gt;critics of the richest, most enduring form of popular culture in human history have a moral obligation to confront that case at its most persuasive, rather than grabbing themselves a victory on the cheap by savaging it as so much garbage and gobbledygook.\r\n\r\nFalse dichotomy - just because one confronts it at its most persuasive doesn't mean one can't dismiss it as gobbledygook.\r\n\r\nMy take on Dawkins is that he thinks he is presenting the best possible case for theism and finds it wanting.  One could certainly argue that he has not, in fact, presented theism \"at its most persuasive\" but one would then be obliged to provide a more persuasive case - not simply a beautifully written explication of an involved, subtle and appealing *conception of god* but a *persuasive argument* that there's something there worth talking about.\r\n\r\nFor all that theologians have created very nuanced and engaging ideas about what a god might be like, they have, so far as I know, not made any persasive arguments to the effect that what they're talking about bears any relation to reality.  It is neither \"philistine and provincial\" nor is it \"grabbing ... a victory on the cheap\" to expect them to do so *before* discussing the fine points of their models.\r\n\r\n \r\n", "gilded": 0, "created_utc": "1299788815", "subreddit": "philosophy", "score": 8, "controversiality": 0}
{"body": "&gt;\"All my arguments are apologism for unsupported and inconsistent axioms...\r\n\r\nFor what it's worth, I don't think by \"It doesn't for most sensitive, civilised non-religious types either\" that Eagleton means \"You make mistakes too\".  The kind of unreason that he's referring to isn't 'making dumb decisions' or 'espousing false beliefs'.  He is merely pointing out that things like 'eyeball judgments' and 'assuming that something you've done over and over again will go the same way next time when there's no reason to believe otherwise' are part of everyone's daily life and that no one lives without these commonplace examples of 'unreason'\r\n\r\n&gt;Says who? Who says the Loch Ness monster isn't some sort of transcendent entity that's exempt from the normal dichotomy of \"existence vs. non-existence\"?\r\n\r\nPeople who claim to have seen the Loch Ness monster do.  Everyone who talks about the Loch Ness Monster is talking about an animal, and animals are something we have plenty of for comparison. That's the only point to the whole Loch Ness Monster bit as far as I can tell, that the classical understanding of God is not \"objective\" in the way that you seem to be saying.\r\n\r\nThe situation of your classifying forms of being (objects, metaphors, and memes) as you are do in your analysis of this passage is a prime example of how you are different from Dawkins.  You've got a good handle on what you're talking about as far as I can tell, better than good enough for a reddit comment, but if you were going to write a book about the subject, wouldn't you take a look at what philosophers you respected had to say before you did?\r\n\r\nThe main trouble with Dawkins (as far as this article is concerned) isn't that he's wrong.  It's that at the end of books like the Selfish Gene, he is talking about human nature in a way that is substantially different from a discussion of human behavior or anthropology, it's prescriptive.  He talks about reasons for hope, etc.  The turn from biology to addressing humanity's understanding of itself in the universe as a whole is a significant change in genre.  The genre of philosophy and ethics in particular is one that is handled professionally by philosophers who have studied epistemology and speak the language of philosophy.  The problem is that Dawkins isn't an epistemologist with a knack for writing on a popular level, he doesn't care much for epistemology at all, and is crowding out a place that could be taken up by an atheist philosopher with a genius for saying what we're all thinking instead of someone who is no more a philosopher than any clever man taken off the street.", "gilded": 0, "created_utc": "1299797506", "subreddit": "philosophy", "score": 4, "controversiality": 0}
{"body": "You've missed the point. Eagleton is complaining about Richard Dawkins creating strawmen. He's not trying to argue any of your points. You've completely ignored the heart of his argument:\n\n&gt; This is why they invariably come up with vulgar caricatures of religious faith that would make a first-year theology student wince. The more they detest religion, the more ill-informed their criticisms of it tend to be.\n\nWhen he says \"since they don’t believe there is anything there to be understood, or at least anything worth understanding,\" he's not using it as some kind of argument, he offers it as an explanation as to why Dawkins misrepresents theological beliefs.\n\nWhen he says,\n\n&gt; God is not a celestial super-object or divine UFO, about whose existence we must remain agnostic until all the evidence is in. Theologians do not believe that he is either inside or outside the universe, as Dawkins thinks they do. His transcendence and invisibility are part of what he is, which is not the case with the Loch Ness monster.\n\nhe's **not trying to convince you.** He's telling you the state of theology as he sees it, and showing you how at odds with Dawkins' representations it actually is.\n\n&gt; God-as-big-beard-in-the-sky is an idea that comes primarily from most religions, not something unique to atheism.\n\nThat's an idea that has come about from people who don't understand theology -- in the same way that some jerk on the street is going to give you a (most likely flawed) metaphorical abbreviation of anything they're not familiar with, people tend to simplify religious doctrines into \"BIG BEARDED MAN IN THE SKY.\"  Dawkins basically holds up the people with the worst understanding of religious text as both literal and representative of every person with religious beliefs. \n\nI mean, what you're saying is ridiculous. You have to reduce any concept into human-understandable terms before humans can understand it. It would be like saying \"physicists always portray molecules and electrons as tiny little blue balls, even if they baselessly assert that those are 'simply models' and that 'electrons really aren't blue balls of stuff.'\"", "gilded": 0, "created_utc": "1299801048", "subreddit": "philosophy", "score": 28, "controversiality": 0}
{"body": "then Poseidon would burst forth, ram his trident up her cunt and be like \"bitch that's not tree fiddy\"\n\nor something like that", "gilded": 0, "created_utc": "1299805835", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "&gt; His transcendence and invisibility are part of what he is, which is not the case with the Loch Ness monster. \n\nI am 30 and waht is this?", "gilded": 0, "created_utc": "1299808324", "subreddit": "philosophy", "score": 1, "controversiality": 0}
{"body": "Was the girl scout you bought that from about eight stories tall and a giant crustacean from the paleolithic era?  I had to tell you this, but your $3.50's gone.", "gilded": 0, "created_utc": "1299809412", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Creed Bratton: \"Two eyes, two ears, a chin, a mouth, ten fingers, two nipples, a butt, two kneecaps, a penis. I have just described to you the Loch Ness Monster.\"", "gilded": 0, "created_utc": "1299812840", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Damn loch ness monster ...", "gilded": 0, "created_utc": "1299813257", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "\"Two eyes, two ears, a chin, a mouth, ten fingers, two nipples, a butt, two knee kneecaps, a penis. I just described to the Loch Ness monster. And the reward for its capture, all the riches in Scotland. So i have one question for you, why are you here?\"", "gilded": 0, "created_utc": "1299823469", "subreddit": "funny", "score": 7, "controversiality": 0}
{"body": "'bout tree fiddy", "gilded": 0, "created_utc": "1299827038", "subreddit": "gamecollecting", "score": 4, "controversiality": 0}
{"body": "In other news, aliens walk among us and there's an epic fight between Bigfoot and the Loch Ness Monster scheduled next week.", "gilded": 0, "created_utc": "1299828558", "subreddit": "worldnews", "score": 4, "controversiality": 0}
{"body": "...and he wuz like....i need aboud tree fiddy\n\nand i wuz like \"fuck you lok ness monster.\"", "gilded": 0, "created_utc": "1299829165", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt;God is not a celestial super-object or divine UFO, about whose existence we must remain agnostic until all the evidence is in. Theologians do not believe that he is either inside or outside the universe, as Dawkins thinks they do. His transcendence and invisibility are part of what he is, which is not the case with the Loch Ness monster.\n\nThis reminds me a lot of (I think) CS Lewis' argument that only a truly divine being could so completely hide himself from our perception.\n\nBaloney, in other words. ", "gilded": 0, "created_utc": "1299844601", "subreddit": "philosophy", "score": 1, "controversiality": 0}
{"body": "Creed:  Two eyes, two ears. A chin, a mouth. Ten fingers. Two nipples. A butt, two kneecaps, a penis. I have just described to you the Loch Ness Monster. And the reward for its capture? All the riches in Scotland.  So why are you here?", "gilded": 0, "created_utc": "1299848826", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "First off, as far as I know, Eagleton doesn't believe in any gods, so the *ad hominem* that underscores most of your points is not only fallacious but also misplaced.\n\nSecondly, bear in mind that Eagleton was trying to address a 200+ page book within the constraints of a review that couldn't run more than several pages. So a point-for-point rebuttal was never likely to happen. If you want a bit more depth, you can try Eagleton's book, [*Reason, Faith and Revolution*](http://www.amazon.com/Reason-Faith-Revolution-Reflections-Lectures/dp/0300151799), but even there I think you're likely to be disappointed. Dawkins and Hitchens are part of the discussion there, but the broader topic is the intersection of, well, the concepts named by the title. For something closer to a point-by-point rebuttal, [there's this](http://www.archive.org/details/AgainstTheIrreligiousRight).\n\nBut (and this is my third general point), I think you're likely to be disappointed there, as well. Or maybe complacent, rather than disappointed. My experience has been that people who are already in general agreement with Dawkins et al tend to be a great deal more generous in reading them than they are in reading arguments against them. For most of those people, I doubt there will ever be an argument that they don't dismiss as more of \"the same tired old disingenuous (or nonsensical) arguments as we've had for the last few hundred (or in some cases, thousand) years.\" And that's likely to be the case no matter how well-argued and reasonable those arguments may be. Team spirit is doing as much to drive the debate these days as an unbiased, rational assessment of the arguments, and that's true for the most stringent proponents of both sides, religious apologist *and* anti-theist.\n\nThose are my big points, so if you can't be bothered to address everything that I've written here, stop here. The rest is just responding to the minutia of your original comment:\n\n&gt; &gt; rationalists like Dawkins... are in one sense the least well-equipped to understand what they castigate, since they don’t believe there is anything there to be understood, or at least anything worth understanding.\n\n&gt; \"Because he doesn't believe the same things I do, he's unqualified to comment on their plausibility\". Total horseshit...\n\nWhen you paraphrase it like that, it is, but I think your paraphrase is wrong, and so you've missed Eagleton's point. Rather, he seems to mean that Dawkins has prejudged the value of theology, and his *a priori* dismissal of the whole field prevents him from ever taking it seriously long enough to actually evaluate any of its arguments. His point isn't about belief, it's about how you evaluate the beliefs of others. If you start that evaluation with the assumption that their conclusions will, as a matter of course, be wrong, then it's easy to interpret their arguments so as to make that assumption seem true.\n\n&gt; &gt; His transcendence and invisibility are part of what he is, which is not the case with the Loch Ness monster.\n\n&gt; Says who? Who says the Loch Ness monster isn't some sort of transcendent entity that's exempt from the normal dichotomy of \"existence vs. non-existence\"?\n\nSays the theology that Dawkins ignores or misinterprets. A close reading of Anselm and Aquinas will show that their arguments derive a god that (whether or not it does, in some sense, exist) logically cannot exist the same way that causal things exist. You could, if you want to, give their First Cause the name \"Loch Ness monster\", but it would be logically have all of the same qualities that are logically attributable to what Anselm and Aquinas identify as God. You'd also be breeding confusion, since most people understand the Loch Ness monster to be, in most ways, as material and causal as the rest of the empirical world. The point is, the qualities that Eagleton has in mind were not merely asserted -- they were derived by logical argument from premises about causal reality.\n\n&gt; The problem with religions is that they state that God exists in some relevant, \"objective\" form.\n\nNot all do. Not all religions even posit gods at all. That may be a problem with all theisms, but not all religions are theistic and not all theisms are necessarily religions. That's a terminal confusion that runs throughout a lot of anti-theist argument, and *The God Delusion* in particular.", "gilded": 0, "created_utc": "1299860085", "subreddit": "philosophy", "score": 5, "controversiality": 0}
{"body": "Cheers - worth knowing, but in the interview I linked to above he appears to be more of an agnostic, or even lapsed (but still religious) Catholic:\n\n&gt; Would Eagleton call himself a Christian? 'I am a lapsed Catholic; the Church is cunning in that you can never really leave it. I have deep objections to the way it has screwed up people's lives, though I have gone to Mass occasionally right through my life. It's like keeping a foot in a culture that I value.'\n\n&gt; He suggests that the question 'do you believe in God?' is akin to asking someone whether they believe in the Loch Ness monster... God is not a person in the sense that Al Gore arguably is... He is the condition of possibility of any entity whatsoever, including ourselves. He is the answer to why there is something rather than nothing. God and the universe do not add up to two any more than my envy and my left foot constitute a pair of objects.'\n\n&gt; Eagleton is not convinced this God exists, but believes that anyone who holds that He does is to be respected\n\nThat said, the interview (2007) is a lot closer to the publication date of his attack on Dawkins (2006) than the book you cite (2009), so perhaps it would be most accurate he was sympathetic to religious thinking when he wrote the review, but seems to have stopped wavering and finally settled on one side of the fence in the intervening time?", "gilded": 0, "created_utc": "1299860232", "subreddit": "philosophy", "score": 4, "controversiality": 0}
{"body": "I think that when you refer to \"society\", you generalise too much. Your first two answers are opinion—which I am capable of respecting—but your second two seem to imply that you think that society is one cohesive entity, which agrees with itself unanimously on all matters. Actually, this is not the case. Members of society frequently disagree over matters, such as what constitutes theft and vandalism—and no one member of society ever fully agrees with anybody else over everything!\n\nConsider that nothing is steadfast, in the community or in the world. Everything is always changing, and growing—the system of law included. Let us have a look at the process of how societal values are developed, and how they give rise to the law. As many groups of people engage in discussions like the one that you and I are having, society does further refine and progress its understandings, and its definitions of its communal concepts and values—such as what constitutes vandalism/defacement. Through disagreement and conflict, realities are defined, refined, and redefined—and history is made. This process of \"progress through internal disagreement\" is called *dialectics.* Through dialectics, communal values do emerge, transform, and become codified. Similarly, laws, too, constantly evolve, to reflect societal growth: Laws are frequently reinterpreted, and new precedents are set in court when it is deemed by a judge (or by a group of judges) that a current law is insufficient, or simply does not to fit the bill anymore. This is what happens when society evolves passed the law—as it often does—for once again, the law is merely a human-created, lifeless and fallible system, in need of constant readjustment. Furthermore, new laws are always being drafted—and old ones refined, to account for these insufficiencies. Thus what is witnessed is the evolution of an imperfect, incomplete system (the law), whose overseers attempt to keep it up with the constant growth of the organism that it applies to (society)! It is natural, that the organism would outgrow the law from time to time—and quite frankly it does, all the time.\n\nIf the law were never challenged, it would not grow. Soon, the law would become completely irrelevant: It would fail to change, and to adapt to society's every-evolving needs. People would be forced to either challenge and to change the law, or to disobey the law outright. To do otherwise, would be for society to resign itself to an imperfect, woefully incomplete, often inapplicable, binding system! As you can hopefully see, it is imperative to challenge the law, where applicable!—or, if appropriate, to disobey it outright. Through doing so, one forces another to ask: \"Why is this law being contested?\" By forcing such consideration, what's promoted is it (the law's)—and more importantly, society's—evolution.\n\nIf morally good, and beneficial to the world, civil disobedience **can** be a positive force of change! Illegal revolutions overthrow corrupt dictators, for example. If a law makes no sense, then it should not be adhered to pedantically. Almost everyone jaywalks when it's safe to! Similarly, painting an enjoyable mural under a bridge, on or on an abandoned property where only ugly tags existed before does **not** constitute a criminal offense, in anyone's eyes but the law's—which has not kept up with society, in this regard. (With all due respect, this is due to law-makers' ignorance of the subject, and xenophobia of its purporters.)\n\nThere is no clear-cut, generalised answer that everyone in society can agree upon, to the question of whether or not the unlawful, unpermitted, willful application of marking-media to a surface that is not expressedly *owned* by said applicator, constitutes vandalism or art—or whether or not it physically damages a property, even—and it is not just graffiti writers who support this perspective, but the majority of the younger demographic, and a sizable chunk of the older demographic, too! This has been my experience! Despite what is pushed as *popular opinion,* people really **are** open-minded when what they see is positive creation. People smile and wave as they walk their dogs, when I spend ten or twenty hours painting a beautiful mural on an abandoned well, along the path!\n\nEach case of graffiti is very, very different—and should be considered as such. It is imprudent to generalise all cases of graffiti, as one and the same. Only in some instances are graffiti damaging—whereas in other cases, they are improving. There are plenty of appropriate locations for graffiti: under bridges, in water-tunnels, in skate-parks, on track-side walls, on the backs of factories, in and on abandoned buildings, in certain alley-ways, on otherwise plain/rusted dumpsters and electrical boxes and vehicles, on freight-trains, on retainment-walls and highway barricades, on other plain, out-of-the-way concrete... good, skillful, and appreciable graffiti exist in these environments, and improve all of these otherwise drab, and lifeless surfaces! Graffiti breathe life **into** them! The fact is, though, that most people wouldn't know it—because they've yet to see good examples of such excellent graffiti. What the general public sees, are mostly simple but prolific graffiti that are executed in high-profile locations—and what's missed out on, are graffiti of the careful, articulate and masterpiece variety. That's because the latter graffiti exist in out-of-the-way places, that are kept hush-hush so that good painting can continue! There are gold-mines of artwork, and treasure-troves of paintings hidden in the corners of nearly every urban environment in the world...!—and such locations are dynamic, and ever-evolving public art-galleries. They are on display for those who know where to find them! They are accessible, and anyone with talent is encouraged to contribute to them.\n\nThe law **needs** to be challenged! The law is not perfect, or steadfast. Communal values and definitions are **always** evolving, and are **never** unanimous—and the law cannot possibly keep up with and reflect this dynamic growth. Everyone has an opinion, and a perspective—and, if it's a popular one, then it should be accounted for by the law. Graffiti-writers **do** make up a significant portion of the population, whose opinions are unaccounted for. This movement is world-wide! There are lots of people who breathe, eat, sleep and shit this art form. Go take a look on flickr, or on [ArtCrimes.com.](http://www.artcrimes.com) Graffiti are present and prolific, nearly everywhere in the world...!\n\nAlas, Nessie—you've yet to fully answer which you think are more important, in your view: a society's laws, or its communal interpretations of them? In other words, what is more important: The existence of a law, or in what esteem a law is held by society...? You kind of side-stepped the question in your last post. I am curious to hear learn what you think about all of this, now!", "gilded": 0, "created_utc": "1299883318", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "I was gonna say, your Loch Ness Monster is pretty weak compared to a 50-meter tall lizard monster with freaking radioactive breath and kung-fu moves.", "gilded": 0, "created_utc": "1299891473", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "It's like mowing the yard. You put in all that hard work then stand back and admire the greatness you have accomplished....except in this case it's a Nessie popping out of the water.", "gilded": 0, "created_utc": "1299901458", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Am I a unicorn? Sasquatch? Loch Ness Monster? Nope! I\"m a true moderate! It does seem like we are sorely under-represented here!! I find myself arguing all the time with conservatives and liberals alike over the dumbest shit!!  It seems to me that the moderate stance would be the most logical one when you consider the fanaticism at both extreme ends of the political spectrum. On one hand you have super-religious, \"tough-guys\" that support war on who or whatever we can declare it on. On the other hand you have the extreme-green movement who want to save the planet to the exclusion of it's inhabitants.  ", "gilded": 0, "created_utc": "1300006074", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Roughly, about tree fitty. ", "gilded": 0, "created_utc": "1300028963", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Wrong again. I left religion because I had too many unanswered questions, I found that a lot of what they told me was false, and I accept the world around me for what it is. Example. When I was still in church and was going through mandatory marriage classes ( yes, I married in the church ), I asked my pastor many questions about god since I had some personal time with him. Answers like \"if we were one foot closer to the sun, we would burn, once foot further, we would freeze\" made me think. Im sorry, but I dont accept an answer just because a person of authority claims it is right. I looked it up, and surly enough, the distance from the earth to the sun ranges by million of miles. Feeding these lies to people whom do not question works, but not on me. I am too curious to find the absolute truth, and not truth based on opinion.\n\nAlso, to be honest, I have more comfort in knowing that when I die, the lights just go out. No more worries, no more pain, no more responsibility. The opposite is true for you. You will have to worship an ego maniac for the remainder of eternity. You will have to watch people you love casted into hell because they did not believe. If you go into heaven but your son or daughter did not believe and was casted into hell, would it still be heaven knowing that they are suffering?\n\nAs far as your near death experience claim is concerned. There are numerous accounts of people being abducted by UFO's, Bigfoot sightings, Loch Ness monster sightings, Trolls, Monsters, Leprechauns, ect.... Hey, they said it, it must be true! It has nothing to do with people wanting you to believe the same as they with a story, and nothing to do with chemical imbalances in your brain that cause hallucinations. Point being, people will say anything using an exaggerated story to claim proof that something exists. Does not work on people like me. I am not that gullible, which seems to be the main trait in accepting religion", "gilded": 0, "created_utc": "1300132713", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "http://www.greatplay.net/uselessia/articles/images/nessie.jpg", "gilded": 0, "created_utc": "1300154429", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "The Loch Ness Monster", "gilded": 0, "created_utc": "1300195891", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Oh dear, it seems I have fallen out of character.  Thanks for correcting me Nessie. ", "gilded": 0, "created_utc": "1300233318", "subreddit": "MLS", "score": 3, "controversiality": 0}
{"body": "About [Tree Fiddy](http://www.youtube.com/watch?v=B4C96ZTJIhU)", "gilded": 0, "created_utc": "1300258018", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "Yes, because that's how it's spelt. Like the Loch Ness Monster.", "gilded": 0, "created_utc": "1300260983", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "If you'e saying some mystical force causes chemicals in our brains to move around then you're wrong.  The particles our brains are made of behave in probabilistic ways and there's absolutely no evidence of any supernatural influence.  Even if some mystical force WAS controlling our brains, you would be wrong for thinking so until we actually have evidence.\n\nIf I can say the Loch Ness Monster doesn't exist, I can say God doesn't exist.  I don't profess to have absolute certainty because absolute certainty is impossible.", "gilded": 0, "created_utc": "1300279954", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "I once caught chrome stealth updating, under the \"About Google Chrome\".\n\nI felt like I briefly witnessed the loch ness monster humping big foot.", "gilded": 0, "created_utc": "1300283138", "subreddit": "WTF", "score": 161, "controversiality": 0}
{"body": "Anyone else see the freaking loch ness monster on the sun there? Upper left hand area of the sun.", "gilded": 0, "created_utc": "1300295008", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "there have been many more than four different accounts of the loch ness monster. does that make it real?", "gilded": 0, "created_utc": "1300295980", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Well they supposedly broke them in the Halloween update or around then, but they supposedly fix it in the last big update. I say supposedly because since I've never seen one, I have no evidence they have ever, or ever will, exist. They are my Loch Ness Monster.", "gilded": 0, "created_utc": "1300301177", "subreddit": "Minecraft", "score": 3, "controversiality": 0}
{"body": "I go by dj tree fiddy", "gilded": 0, "created_utc": "1300335296", "subreddit": "DJs", "score": 4, "controversiality": 0}
{"body": "Tree fitty.", "gilded": 0, "created_utc": "1300402492", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1300403829", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1300406788", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Nessie? Is that you?", "gilded": 0, "created_utc": "1300409070", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "GOD DAMN LOCH NESS MONSTER!", "gilded": 0, "created_utc": "1300435414", "subreddit": "funny", "score": 108, "controversiality": 0}
{"body": "IF YOU KEEP GIVIN HIM TREE FITTY HE JUST GONNA COME AROUND BACK FOR MORE", "gilded": 0, "created_utc": "1300439693", "subreddit": "funny", "score": 32, "controversiality": 0}
{"body": "&gt; a) Multiple gods are simply illogical\r\n\r\nI only mentioned those single, specific characters. They need not come with the whole religion which includes multiple gods. It is a possibility that Zeus exists but the other Greek gods do not, for example.\r\n\r\n&gt; b) a god who allows his religion to expire is illogical\r\n\r\nMany similar arguments could be made against Christianity, such as that a god who allows his religion to be subdivided in to more than 10,000 denominations is illogical, or that a god who allows different religions to worship him is illogical etc.\r\n\r\n&gt; c) their stories of creation aren't persuasive and are illogical\r\n\r\nAs is the Christian one.\r\n\r\n&gt; For 5: a) We have not observed anything non-natural from Andromeda\r\n\r\n1. Why would aliens be non-natural?\r\n2. We have not observed anything non-natural from here either. Nothing that can be at all confirmed anyway.\r\n\r\n&gt; b) cheese is a human invention - if there are aliens anywhere, the likelihood of them even knowing what cheese is is pretty slim.\r\n\r\nIf there exists milk on a planet in Andromeda and intelligent lifeforms, it's entirely possible that cheese would also exist. The fact that you only went to a 5 is quite interesting though. That's not all that certain and means that you probably take the possibility quite seriously. Far more seriously than that a rich guy might be browsing Reddit? Seems pretty odd to me.\r\n\r\n&gt; For 6: a teapot is a human invention.\r\n\r\nThere are plenty of human inventions in space.\r\n\r\n&gt; In order for something of that small of mass to be orbiting the sun, it would have to be moving at a great rate of speed.\r\n\r\nWhy? Why can't it orbit the sun slowly? And why is that a concern?\r\n\r\n&gt; For 7: I highly doubt anyone with that much money would be surfing reddit at all\r\n\r\nWhy not? Maybe it's a trust fund that I can't touch yet, or maybe I just like to browse Reddit? That is not at all compelling evidence, and certainly not good evidence on which go to all the way to a 9! Maybe a 4 or a 5 at most!\r\n\r\nYou see, all your evidence is really quite flaky and essentially different variations of \"Well that just wouldn't make much sense\". What if I threw in a few others, like:\r\n\r\n* The Loch Ness Monster\r\n* Big Foot\r\n* Dragons\r\n* Invisible Dragons\r\n* Poltergeists\r\n\r\nNow what if I asked you to provide evidence that:\r\n\r\n* 9/11 wasn't a government conspiracy\r\n* The moon landings weren't faked\r\n* Aliens and alien technology aren't being held and studied in secret government facilities\r\n* The government isn't experimenting with bizarre time travel technology that has actually worked but is kept secret\r\n\r\n\r\nThe point I'm driving at is that the majority burden of proof lies with those making the bizarre claims, not the ones who think they're false.\r\n\r\nI'm sure you could probably find some evidence that, for example, the moon landings weren't faked, but I also doubt that you've extensively studied the moon landing evidence yet still accept that it happened. Or if you're some moon landing conspiracy theories, pick any of the others or any other kind of government conspiracy theory or urban legend or myth that takes your fancy.", "gilded": 0, "created_utc": "1300468001", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "I tried using a condom I earned at an anime convention. It felt like a tire and cut off the circulation to my little platypus, causing it to go limp - I decided that, as a reasonable man, I should flop it around and call it the loch ness monster. I made dinosaur noises. But hey, there was penetration. ", "gilded": 0, "created_utc": "1300478982", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "You 2, Nessie. You 2.", "gilded": 0, "created_utc": "1300532337", "subreddit": "answers", "score": 2, "controversiality": 0}
{"body": "Am I the only one who read $3.50 as tree fiddy?", "gilded": 0, "created_utc": "1300545411", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Are you the *Loch Ness Monster*?", "gilded": 0, "created_utc": "1300554558", "subreddit": "pics", "score": 10, "controversiality": 0}
{"body": "&gt;Cryptozoology (from Greek κρυπτός, kryptos, \"hidden\" + zoology; literally, \"study of hidden animals\") refers to the search for animals whose existence has not been proven.\n\n[Wikipedia](https://secure.wikimedia.org/wikipedia/en/wiki/Cryptozoology)\n\n&gt;the study of evidence tending to substantiate the existence of, or the search for, creatures whose reported existence is unproved, as the Abominable Snowman or the Loch Ness monster. \n\n[Dictionary.com](http://dictionary.reference.com/browse/cryptozoology)", "gilded": 0, "created_utc": "1300561561", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "&gt; And you can say that your statement is 100% factual?\n\nNone can say that. However, the burthen of proof is on you, superstitious one, not me. \n\n&gt; There is more proof they are real than evidence to the contrary.\n\n...what?\n\nYou'll have to give me more than anecdotes for that one, O sagacious vagina.\n\n&gt; why don't you try summoning one (instructions all over the internet) and let us all know how that works out for you.\n\nTaking six months to purify myself so the wyrd will accept me as *an þá wiccan* and spending the money on various archaic implements of superstition isn't on my priority list.\n\nOh, I'm sorry--do I know a bit too much about *The Key of Solomon*? Have I been through it a few too many times? Have I immersed myself in the folklore of the *Book of Enoch* a little too much?\n\nWasting my time on disproving something as fitting into reality as Big Foot and the Loch Ness monster, or Ken Hamm's modern herds of African parasaurolophi. Yeah, I'll let you know how that turns out.\n\nFor some you can't do anything of a sexual nature for eighteen months (see: *Greater Key of Solomon*). Alistair Crowley got three months in, if I recall correctly, before saying \"fuck it\" and inventing his own religion, taking the Old English word for \"wizard\" and polluting it in popular culture so that we who love the old speeches and old gods cannae throw them into everyday conversation.", "gilded": 0, "created_utc": "1300571906", "subreddit": "IAmA", "score": 0, "controversiality": 0}
{"body": "If you own an invisible dragon that is also incorporeal, completely silent, and whose firey breath produces no heat, then I have no reason to believe it exists. That invisible dragon is functionally indistinguishable from a non-existent dragon. That fact that there is no evidence of the dragon means I am not compelled to believe in it. Similarly, I am not compelled to believe in unicorns, leprechauns, Zeus, Krishna, Allah, the Loch Ness Monster, Yahweh, the Tooth Fairy, El Chupacabra, Santa Claus, or rational theism.", "gilded": 0, "created_utc": "1300575240", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "*UFOs, astral projection, mental telepathy, ESP, clairvoyance, spirit photography, telekinetic movement, full-trance mediums, the Loch Ness monster, and the theory of Atlantis*", "gilded": 0, "created_utc": "1300583737", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I'm saying that i am innately skeptical of that which cannot be proven. it is why i do not believe in fairies or the loch ness monster. because there is no proof for them.\n\nfor god to be real, god must have, either now, or both in the past and present, affected the physical world in some way. if you claim that god is outside the realm or the provable, then you must accept that god is incapable of interacting with the physical world, and the existence of that sort of entity would be meaningless either way, as such a being could never influence our lives or anything else. if god could interact with the world, he could be proven. but since anything anyone can claim that god did can be explained by natural, and not supernatural means, why believe in the explanation that demands faith in god?\n\nyou must have a reason to believe in god. so you must believe that there is proof for god, which would, by your interpretation of my reasoning, place god in the realm of the logical and reasonable. my point is that no one has shown me any reason to believe in god. I don't believe a magical invisible turtle monster is living in my house, because there is no proof for it, and because no one has ever presented me with a reason to believe in such a creature. this places is in the same realm as god in this scenario, as something that cannot be proven. so could that not too be real? and if it were, why would i believe it? i am trying to understand why i should believe in the existence of something which its supporters admit cannot be readily proven. what is the difference between god and the tiger creature?", "gilded": 0, "created_utc": "1300589062", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "If you survived childhood in the Paleolithic era [you'd live to about forty.](http://en.wikipedia.org/wiki/Life_expectancy#Life_expectancy_variation_over_time) A large part of the stuff that is killing us now has been introduced by ourselves, e.g. your throat infection came from smoking. Paleolithic era humans over the course of a whole year did not see a fraction of the people we see daily, which means less infections. I'm fairly sure that the games they did play were much less harmful then the ones we play (fun fact: the introduction of the helmet to American football has severely decreased common head injuries, but has led to a much more aggressive play style which can cause much greater injures. No helmet means you have to play safer, or else). They did not have access to cigarettes, much less access to alcohol then we do, no cars.\n\nThe worst parts were that they did not have the same access as we do to regular healthy food of sufficient variety (but look at what we do with that *cough obesity epidemic cough*), and if they did injure themselves they wouldn't have access to modern medicine. \n\n*Disclaimer: I am not an expert in this field, take what I said with a grain of salt.*", "gilded": 0, "created_utc": "1300623734", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Loch Ness monster at 2:20", "gilded": 0, "created_utc": "1300634923", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "Well, about tree fiddy. ", "gilded": 0, "created_utc": "1300635071", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Based on Nessie, I suppose. &gt;_&gt;", "gilded": 0, "created_utc": "1300639726", "subreddit": "pokemon", "score": 3, "controversiality": 0}
{"body": "It's the loch ness monster of prehistoric animals, but time traveling! A wuss like you wouldn't know anything about that.", "gilded": 0, "created_utc": "1300683673", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Something very similar to the loch ness monster? \n\nA wobbly bit of rotten meat that was later found to be a bit of basking shark, the two don't really equate.", "gilded": 0, "created_utc": "1300691429", "subreddit": "todayilearned", "score": 5, "controversiality": 0}
{"body": "There are so many on the market that you'll have to do a lot of undercutting. I'll give you tree fiddy.", "gilded": 0, "created_utc": "1300703638", "subreddit": "shittyadvice", "score": 2, "controversiality": 0}
{"body": "About tree fitty", "gilded": 0, "created_utc": "1300720393", "subreddit": "WTF", "score": 35, "controversiality": 0}
{"body": "&gt;About tree fiddy\n\nFTFY.", "gilded": 0, "created_utc": "1300720547", "subreddit": "WTF", "score": -5, "controversiality": 0}
{"body": "Technically, the sound made is neither a /t/ nor a /d/. It's a flap (a /ɾ/). Both t's and d's can be pronounced as flaps in English, and \"tree fitty\" would be pronounced the same as \"tree fiddy\" by most speakers. That is, the tt and the dd would both be pronounced as flaps.\n\nDon't fix what isn't broken.", "gilded": 0, "created_utc": "1300725396", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "I fly a little over 100 segments a year - for years - I have never seen anyone using one of these - has anyone? - to me this is like the \"Nessie\" of the skies", "gilded": 0, "created_utc": "1300764737", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Was anybody else expecting video evidence of the Loch Ness Monster?", "gilded": 0, "created_utc": "1300769039", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "NESSIE IS NOT A MONSTER!", "gilded": 0, "created_utc": "1300769765", "subreddit": "pics", "score": 20, "controversiality": 0}
{"body": "Can I have about tree fiddy?", "gilded": 0, "created_utc": "1300772423", "subreddit": "circlejerk", "score": 4, "controversiality": 0}
{"body": "god damn loch ness monster!", "gilded": 0, "created_utc": "1300774287", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "I need ['bout tree fiddy](http://www.youtube.com/watch?v=f9dqS31d9RM&amp;feature=related).", "gilded": 0, "created_utc": "1300775069", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "I thought this was going to be something like \"Monster Quest\" on the History channel.  I was all set to ask you about Nessie and Bigfoot.  Not gonna lie; bit disappointed here.", "gilded": 0, "created_utc": "1300781876", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster!", "gilded": 0, "created_utc": "1300807777", "subreddit": "guns", "score": 1, "controversiality": 0}
{"body": "If you believe reality is as subjective as you say it is, any truth claim is valid and knowledge, no matter how limited it's scope, is impossible. In such a view, the the Loch Ness monster is as valid as Christianity. UFO's are also just as valid, that the world is flat, that Zeus lives on Mount Olympus, the insane are sane etc.\n\nAll claims about reality must rest on certain assumptions. Logic is precisely as objective as people think as it rests on the assumption that the universe is intelligible, I have no idea how you came up with logic requiring omniscience; To that end, the scope of logic, while not infinite, far surpasses that of personal experience.\n\ntl;dr: logic is more objective than faith which makes it better for finding out the truth.", "gilded": 0, "created_utc": "1300815942", "subreddit": "DebateAChristian", "score": 1, "controversiality": 0}
{"body": "dammit, I came here to say \"lol ask for about tree fiddy\" but this is a much better idea instead", "gilded": 0, "created_utc": "1300820209", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "dammit, I came here to say \"lol ask for about tree fiddy\" but this is a much better idea instead", "gilded": 0, "created_utc": "1300820339", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "I've participated in a lot of conversations about \"fringe science\" -- claims for new sources of energy, sensing devices that read emotions or spot explosives at a distance, Atlantis, Bigfoot, Loch Ness monster, etc etc -- and the term \"mainstream science\" is often used in those conversations to distinguish. ", "gilded": 0, "created_utc": "1300820920", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I'll give you tree fiddy", "gilded": 0, "created_utc": "1300830950", "subreddit": "business", "score": 1, "controversiality": 0}
{"body": "naw but in trees it's playful, no one's comparing (e.g. loch ness monster blunt, cross joints, etc.). disclaimer: I brag about having better weed than everyone, for I am a californian", "gilded": 0, "created_utc": "1300850666", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "I think you're wanting deductive proof of things and completely discounting induction, which is the basis of the bulk of human knowledge.\n\nThat you expect a ball to fall to earth when you drop it is an inductive belief, but do you really ever doubt that a ball you drop isn't going to do exactly that? Same with you expecting the sun to rise tomorrow.\n\nI assume you also think that Bigfoot and the Loch Ness Monster and alien abductions should also be seriously considered as they are not deductively disprovable either.", "gilded": 0, "created_utc": "1300862567", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I got tree fiddy. ", "gilded": 0, "created_utc": "1300910459", "subreddit": "business", "score": 10, "controversiality": 0}
{"body": "bout tree fiddy...\n\nGuy here. I don't have a rule, but if I really like a girl I'd rather wait a little while. So I wouldn't be trying to get in her pants the first date like I would with a one-and-done girl. ", "gilded": 0, "created_utc": "1300916323", "subreddit": "sex", "score": 5, "controversiality": 0}
{"body": "Yep, I got a whole tree fitty with my dividends.", "gilded": 0, "created_utc": "1300921857", "subreddit": "technology", "score": 11, "controversiality": 0}
{"body": "Oh gawd dammit its that damn loch ness monster again", "gilded": 0, "created_utc": "1300925114", "subreddit": "technology", "score": 14, "controversiality": 0}
{"body": "I'd like to change my full name to \"Nessie (R)\" and run on the Democratic ticket in Utah, just to see what happens. ", "gilded": 0, "created_utc": "1300935997", "subreddit": "politics", "score": 8, "controversiality": 0}
{"body": "Pickles: One dollar.  \nGiant Pickles from the paleolithic era:  Tree Fiddy", "gilded": 0, "created_utc": "1301010719", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Our bodies don't evolve as fast as our technology. Diet isn't a \"habit\", it's not like a lion has a \"preference\" for eating a gazelle. We're still identical in form to humans of the paleolithic era.", "gilded": 0, "created_utc": "1301017685", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "another dude usually offers to do it for 9,999.99.\n\nI'll do it for tree fiddy.", "gilded": 0, "created_utc": "1301027087", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I'm going to reply the easy stuff now, and research and reply the harder stuff.\n\nPlease bear in mind that early Christianity is an area of casual curiosity to me, that my sources are neither scholarly nor unbiased, and that the main reason I haven't gone digging through the literature in detail is that being precise is not very important to me, and I don't care to read tedious apologetics. I don't need to knock holes in literalism to dismiss Christianity.\n\nI might as well give you a data dump of my sources:\n\n- The book [Nailed](http://www.amazon.com/Nailed-Christian-Myths-Jesus-Existed/dp/0557709911) by David Fitzgerald (it's messily formatted, but informative - for example it's interesting how long the church took to become culturally prominent rather than just one competing thread).\n\n- http://rationalrevolution.net/articles/jesus_myth_history.htm and its follow-up http://rationalrevolution.net/articles/jesus_myth_followup.htm\n\n- A documentary I saw, that discussed how the evidence of archaeology doesn't align with a Jewish migration into or out of Egypt, a journey through the desert to Palestine, or a genocide and takeover, or a huge kingdom. On the contrary, the pre-Jewish culture fits into the region, indicating a local origin. Some of the things about the Moses story make zero sense, for example, Egypt ruled the area of Palestine back then. Running for cover thataway would be madness. But it makes a lot of sense as a historical *fiction*, compounded to back the newly forged monotheist religion of a shaky kingdom around the time of the return from Babylon. Alas, I still kick myself I didn't make note of the title, so it's not much use as a cite.\n\n- Casual Wikipedia browsing inspired by the above.\n\nAs for deism, it can't be ruled out exactly, but neither can anything - you are asking for a probability of p=0 which simply doesn't happen in a universe that has to be understood via evidential refinement of plausibility estimates. What it can be is ruled \"pointlessly overcomplicated and thus wildly implausible, beneath notice\".\n\nOccam's razor can be formalized as Solomonoff induction. The mathematical fact is that adding one binary bit to the essential complexity of a guess at the laws of the universe halves your likelihood of guessing right. This can be used as a \"universal prior\" for Bayesian updates - it takes evidence to push your best estimate towards a more complex guess. It would take a mountain of evidence to make a deist theory more plausible than regular physics. And by definition a deist universe is indistinguishable from a godless one, zero evidence. The concept is basically a senseless dodge into la-la land (bigfoot and the Loch Ness monster are *hugely* more plausible) simply with the goal of saving a useless and unnecessary god.\n\nSo it's religion, because religion isn't bound to be sane. But it's not worth actually considering as a theory of reality.\n\nAs for dark matter, any appeal to that that is a variation on \"we are ignorant, therefore god\". Yes, it's inconvenient. No, we don't understand it yet. presumably there is a gap in the theory. That does not constitute enough of a nod-and-wink to invalidate the many tests that have *thoroughly confirmed* quantum and relativistic theories to extreme precision in the observable universe, both locally and not. (Seek a physicist for better detail on this. I am not sure how much people are still considering the theory that the laws of physics might vary. These things do get disproven, and that disproof doesn't necessarily filter down to the pop sci press.)", "gilded": 0, "created_utc": "1301109471", "subreddit": "TheAgora", "score": 2, "controversiality": 0}
{"body": "tree fiddy.", "gilded": 0, "created_utc": "1301112136", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Nessie. The Loch Ness Monster!", "gilded": 0, "created_utc": "1301112603", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "&gt; deism ... can't be ruled out exactly, but neither can anything - you are asking for a probability of p=0 which simply doesn't happen in a universe that has to be understood via evidential refinement of plausibility estimates.\n\nThere are lots of cases of p=0.\n\n&gt; What it can be is ruled \"pointlessly overcomplicated and thus wildly implausible, beneath notice\".\n\nI don't think deism is either complicated or implausible. It's one of the simplest theories and one of the most believable. There may be other arguments against deism but not these.\n\n&gt; Solomonoff induction\n\nYou've pushed the right buttons. Now I'm off on an internet journey.\n\n&gt; adding one binary bit to the essential complexity of a guess at the laws of the universe halves your likelihood of guessing right\n\nThis assumes that you gain no more explanatory power from adding the bit.\n\n&gt; It would take a mountain of evidence to make a deist theory more plausible than regular physics. \n\nI don't agree. You're  limiting the valid questions and valid answers in a way that's favourable to physics.\n\n&gt; bigfoot and the Loch Ness monster are hugely more plausible [than God]\n\nDepends on the properties of God.\n\n&gt; any appeal to [dark matter] is a variation on \"we are ignorant, therefore god\"\n\nI was rebuting your statement that \"There is no place for god in modern physics.\" Maybe I am over-interpreting, but it seemed like you were trying to imply that physics is somehow sufficient to make claims that are relevant for theology. Since physics still isn't right, it cannot (yet).\n\nThat's not to say that God must be in the gaps.", "gilded": 0, "created_utc": "1301124685", "subreddit": "TheAgora", "score": 1, "controversiality": 0}
{"body": "&gt;There are lots of cases of p=0.\n\nNot for anything where evidence is involved. There are things that are intrinsically contradictory, particularly in math (\"I have two infinite parallel lines on a Euclidean plane that cross each other\") but don't especially relate to the real world. However in the real world, you have to use something like Bayes' theorem, and if there are no instances of p=1 or p=0, any amount of less than perfectly certain evidence won't introduce them.\n\n&gt;I don't think deism is [...] complicated \n\nI'm talking about a fairly specific sense of complicated here. I mean: it complicates up the shortest description of the laws of physics. We can describe our current guess of the ultimate laws of physics on a few pieces of paper. You would need an awful lot more paper to define a set of laws of physics that include defining-into-existence a deist's god.\n\n&gt;This assumes that you gain no more explanatory power from adding the bit.\n\nPlease bear in mind I was simplifying the math. The actual thing we're adding bits to is a representation of the laws of physics as a computer program. See my links up-thread. And the thing that is halved is your chance of guessing right *with no information*. Each additional bit of sensory evidence is going to modify those probabilities. So for example to raise up the complicated/unlikely god theory above the simple/likely godless theory, you would need a sufficient mountain of evidence which was expected true given god and expected false given no god.\n\n&gt;Depends on the properties of God.\n\nSasquatch and Nessie don't laugh in the face of physics, so they require only the relatively small implausibility of  a critter that is very, very good at hiding.\n\n&gt;it seemed like you were trying to imply that physics is somehow sufficient to make claims that are relevant for theology\n\nI'm actually saying that *math* (of probability) is usable for making claims about theology and about the comparative plausibility of physics that either does, or does not, include a god.\n\n&gt;Since physics still isn't right, it cannot\n\nPhysics isn't \"right\" yet, but it also isn't uncertain about a lot of things. This is like saying \"I know all my garden except the bit behind the impenetrable thorn bush\". Your knowledge of the flower beds and the lawn is not invalidated by this partial ignorance.", "gilded": 0, "created_utc": "1301142529", "subreddit": "TheAgora", "score": 1, "controversiality": 0}
{"body": "&gt; intrinsically contradictory [things] don't especially relate to the real world.\n\nSure they do. In particular with relation to theology, lots of people believe in an omnibenevolent, omnipotent God, which is impossible (p=0).\n\n&gt; specific sense of complicated\n\nIt sounds like you mean in a certain William of Ockham sense: don't add a hypothesis if it doesn't give more explanatory power.\n\nMy counterpoint is that invoking a god *does* add a lot of explanatory power -- just not of a kind that atheist scientist rationalists usually consider valid, important, or worthwhile. However for the religious I think it does add explanatory power and other desirable outcomes with very little expense.\n\nFor example, what was before the big Bang? This is a big question in cosmology. The answers I have heard are Wheeler's universes-within-black-holes (still leaves a question of first mover) and Penrose's topological attachment of t=∞ to t=0. Actually that's not originally his idea, but he came up with a way to test the t=0 &lt;--&gt; t=∞ attachment by looking at current microwave background radiation and making some assumptions about how the attachment would work physically.\n\n&gt; Sasquatch and Nessie don't laugh in the face of physics\n\nNeither do certain versions of God.\n\n&gt; seems like you're saying physics makes claims on theology ... no, probability can make claims on theology\n\nOK, but you did it again in referring to Nessie. Assuming that existence of God violates the laws of physics.\n\nI understand that you're using probabilistic reasoning, but part of the \"inductive evidence\" you're invoking to achieve those probabilities is based on deductions from physical theory -- which is not done yet.\n\n&gt; Physics isn't \"right\" yet, but it also isn't uncertain about a lot of things. This is like saying \"I know all my garden except the bit behind the impenetrable thorn bush\". Your knowledge of the flower beds and the lawn is not invalidated by this partial ignorance.\n\nUsing your garden analogy, you could not say \"I know *for sure* that there is not a groundhog anywhere in my garden\". You could say it's unlikely because shouldn't the groundhog have showed herself in the rest of the garden? But still you cannot rule it out.\n\nHowever I don't think the garden analogy is apt, because new physics can totally reverse where the arrow of suggestion is pointing.\n\nAdvancing physical theories can demonstrate that things which were \"impossible\" under the old theory are indeed possible under the new theory. For example you \"cannot\" achieve a negative refractive index according to Newtonian optics.\n\nGiven the subject matter (theology not engineering), physics needs to be totally done to justify conclusions about what *cannot* be done. (Now it is certainly very...very...very unlikely to go faster than the speed of light, but one could have said in the 17th century that it's very...very...very unlikely to make a negative refractive index, and been right. How about imaginary mass particles?)", "gilded": 0, "created_utc": "1301164584", "subreddit": "TheAgora", "score": 1, "controversiality": 0}
{"body": "Approx. $3.57\n\nIn other words... ABOUT TREE FIDDY", "gilded": 0, "created_utc": "1301205903", "subreddit": "gamecollecting", "score": 1, "controversiality": 0}
{"body": "1) [Loch Ness Monster](http://www.crystalinks.com/lochnessurgeon.jpg)\n\n2) [Migrant Mother](http://www.google.com/search?q=migrant+mother&amp;hl=en&amp;safe=off&amp;client=firefox-a&amp;hs=NHz&amp;rls=org.mozilla:en-US:official&amp;prmd=ivns&amp;tbm=isch&amp;tbo=u&amp;source=univ&amp;sa=X&amp;ei=qLmPTZuANYvmsQPA-7GTCQ&amp;ved=0CDwQsAQ&amp;biw=1276&amp;bih=647)\n\n3) [Federal dead on the field at Gettysburg](http://popartmachine.com/artwork/LOC+1171473/0/%5BFederal-dead-on-the-field-of-battle-of-first-day,-Gettysburg,...-painting-artwork-print.jpg)\n\n4) [Lee Harvey Oswald shot by Jack Ruby](http://www.markccollins.com/images/rubyshot.jpg)\n\n5) [The corpse of Che Guevara](http://www.makefive.com/categories/experiences/hobbies/top-5-most-amazing-photos-ever-taken/the-corpse-of-che-guevara)", "gilded": 0, "created_utc": "1301265061", "subreddit": "Favors", "score": 1, "controversiality": 0}
{"body": "bout tree fiddy", "gilded": 0, "created_utc": "1301273885", "subreddit": "pics", "score": 15, "controversiality": 0}
{"body": "They exist!  They MUST!  People have always laughed at me for my strange obsessions.  Aliens, the fact that Elvis is alive, dinosaurs on an island somewhere, hot pot smoker chicks, and the loch ness monster.  It's all connected!  Maybe the loch ness monster keeps having babies which are then abducted by aliens, eaten by dinosaurs, and then those dinosaurs are given high levels of THC while listening to live elvis performances, and then a hot pot smoker chick comes out of this big equation.  It's all starting to add up.  Maybe this should go in /r/conspiracy?\n\ntl;dr - Barracudas are not an animal.  They are a swim team of 8 - 11 year-olds who, for the most part, suck at swimming.", "gilded": 0, "created_utc": "1301279904", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "'bout tree fitty.", "gilded": 0, "created_utc": "1301286985", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "The difference is that ball lightning has been reliably captured on film (at meteor observation stations), has a few viably plausible theories as to how it happens and some approximation can be reproduced in the laboratory. There's active research on the subject published in plasma and atmospheric science journals. \n\nThe loch ness monster, on the other hand, has just eyewitness accounts and fuzzy photos.", "gilded": 0, "created_utc": "1301323009", "subreddit": "science", "score": 11, "controversiality": 0}
{"body": "&gt; its like the Loch Ness Monster of lightning\n\nFTFY.  I think most people accept that the loch itself definitely does exist.", "gilded": 0, "created_utc": "1301324535", "subreddit": "science", "score": 14, "controversiality": 0}
{"body": "You're confusing the Loch Ness Monster with real things.", "gilded": 0, "created_utc": "1301325109", "subreddit": "science", "score": -2, "controversiality": 0}
{"body": "I know this one, it's tree fiddy.", "gilded": 0, "created_utc": "1301360905", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "It is just as significant as THE loch ness monster. It shows up here every now and then and only a choice few see it at a time.....its funny how ironic but if only if only...that would be phenomenal to burn! here is an upvote you have seen the legendary Loch Ness Blunster!\n", "gilded": 0, "created_utc": "1301362199", "subreddit": "trees", "score": 3, "controversiality": 0}
{"body": "You get outa here loch ness monster!", "gilded": 0, "created_utc": "1301365456", "subreddit": "pics", "score": -1, "controversiality": 0}
{"body": "I have to save this comment for posterity.  No one will ever believe I saw lurking_misanthrope post. It's like a picture of the top of the Loch Ness Monster, or Bill Murray...no one will ever believe me.", "gilded": 0, "created_utc": "1301367640", "subreddit": "relationship_advice", "score": 2, "controversiality": 0}
{"body": "Loch Ness Monster Balls", "gilded": 0, "created_utc": "1301394299", "subreddit": "trees", "score": 6, "controversiality": 0}
{"body": "'Bout tree fiddy.", "gilded": 0, "created_utc": "1301431600", "subreddit": "circlejerk", "score": 5, "controversiality": 0}
{"body": "You're right.  In wine, at least, there's a lot of studies showing that placebo effects and expectation games can account for most perceived quality differences.\n\nI don't have the study itself, but [here](http://www.gourmet.com/magazine/2000s/2004/08/shattered_myths?printable=true) is an old piece on Riedel, a glassmaker who relies on the belief that glass shape dramatically affects wine taste in order to sell scamishly specific glasses (like one specifically for Loire valley Chardonnay, for instance).  The studies don't support that at all.\n\nHowever, none of the few studies I've heard of so far used professional food tasters.  Using people trained to detect subtle taste elements in a double blind study might get rid of the problems that comes from using the wine industry's fuzzily undefined and practically useless vocabulary.\n\nExpectation plays a big role in this, you're right.  But the reason the Pepsi Challenge tests gave the win to Pepsi wasn't just because the blind format took away marketing effects.  Pepsi also won because, in their format, they had drinkers take only a small sip.  That small sip emphasized the sweeter taste of Pepsi and made it harder to get the subtler caramel favours of Coke.  In later tests where drinkers had a larger amount that was closer to real life usage, Coke came out on top.\n\nSo, the way we drink something can affect how it tastes,  even without expectation issues.  That could easily happen with these glasses, though not to the degree Riedel seems to think.  Just making a glass that puts the nose closer to the wine when we drink would be enough to affect the taste somewhat.\n\nThe issue here isn't so much that its a bunk effect, but that its really hard to design a good format here that separates the different pieces of the experience.  And even if you do that, then you're left with widely varying perceptions (one study found wine connessieurs couldn't even agree on when something was 'oaky' or 'fruity').  Like others said, taste is subjective.  I don't think that murkiness is enough to say that *all* of the experience is in our heads, though.  There are a few reasonable reasons to believe glasses can play a non-psychological role in taste.\n\nSorry about the lack of linkies.  I'll try to track down some of these old studies when I'm not on a phone keyboard.", "gilded": 0, "created_utc": "1301468125", "subreddit": "skeptic", "score": 4, "controversiality": 0}
{"body": "If you think Twilight was bad, try the fourth one, Breaking Dawn.  I've never read it but I've seen excerpts and I know the basic plot, and it sounds horrific.  Mostly the part where she gives birth to a demon spawn that breaks her spine while she vomits blood, and Edward rips open her uterus with his teeth.  They name her Nessie.\n\nI can't wait for the movie. ", "gilded": 0, "created_utc": "1301469946", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "There were condoms in the paleolithic era, when human sexual behaviors and mating strategies evolved? Wow!", "gilded": 0, "created_utc": "1301608925", "subreddit": "fffffffuuuuuuuuuuuu", "score": 4, "controversiality": 0}
