{"body": "&lt;groundskeeper_willie&gt;Uggghhhhh... Back to the Loch with you, Nessie!&lt;/groundskeeper_willie&gt;", "gilded": 0, "created_utc": "1285908964", "subreddit": "entertainment", "score": 3, "controversiality": 0}
{"body": "I met up with this girl I had met online. We went to the local bar, and started talking. I was in Edinburgh at the time. We got to chatting and it turns out she went to the same elementary school as I did, in the middle of nowhere in Colorado. I ordered a round of drinks for us, and she said she was short of cash. I asked her how much she needed. She said \"I'm gonna need about tree fiddy.\" Well it was about that time I noticed she was tall and scaly...", "gilded": 0, "created_utc": "1285956091", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Even a soft atheist takes a stand on the matter of belief in god while an agnostic doesn't. Anyone who disbelieves in god must concede that we don't know whether he exists because you can't prove that something _doesn't_ exist, you can only prove that it _does_ exist.\n\nSaying you're an 'agnostic' in the sense that you don't take a stand on the issue is, in my opinion, pointless. Do we have to remain neutral in discussions about other mythological animals / gods? Are there 'Loch Ness' agnostics? It's 100% possible to not believe that Nessie exists while still holding that it's entirely conceivable that Nessie might be there.\n\nIt's a matter of saying that the evidence is insufficient to make you believe but that your mind could be turned by evidence to the contrary.", "gilded": 0, "created_utc": "1285991847", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy.", "gilded": 0, "created_utc": "1286082656", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "If you're not gonna go with a tree, at least go with about tree fiddy.", "gilded": 0, "created_utc": "1286136412", "subreddit": "AskReddit", "score": 11, "controversiality": 0}
{"body": "That's pretty much it.\n\nSide story: I actually live around the corner from a locally-famous white witch druid. Last week he was in local newspaper trying to contact the Loch Ness Monster via radio wives.\n\nAside from everything else wrong with that I live right on the south coast, so about as far as you can get from Loch Ness as you can get in the UK.", "gilded": 0, "created_utc": "1286153516", "subreddit": "offbeat", "score": 2, "controversiality": 0}
{"body": "Mmmmm, 'bout tree fiddy.", "gilded": 0, "created_utc": "1286164983", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Yeah, it's all the same for me. Beaches are ok up to the first few feet of depth, but after that, no thanks (if I'm alone).\r\n\r\nLakes have funny things like the Loch Ness monster in them. That bitch is nuts.", "gilded": 0, "created_utc": "1286191375", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I don't see why mehum's message is getting downvoted (note: it was previously in the negative). People don't seem to get that the United States didn't do anything to promote the Okinawan language, and neither did the Okinawan government itself. As a result, there are very few speakers who speak Okinawan proper, and most if not all of them are too old and don't care enough to revitalize the language. The Okinawans had chosen to not teach the language to their children, partly due to the dialect stigma, but moreso in an effort to conform and unify with the rest of Japan. Today, the locals speak a variant of Japanese nicknamed Uchinā Yamatoguchi (Okinawan Japanese), which is essentially Standard Japanese, mixed with a few Okinawan elements. In other words, they do in fact speak Japanese, contrary to Nessie's statement.", "gilded": 0, "created_utc": "1286197955", "subreddit": "worldnews", "score": -5, "controversiality": 0}
{"body": "Nessie, Jehad or Jihad menas putting effort into doing something. When you add the word Islamic to it, it becomes the general term used in US media which is putting effort into doing something in the name of Islam or Struggle for Islam.", "gilded": 0, "created_utc": "1286210292", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "It's a joke from south park. Chef's parents constantly have interaction with the Loch Ness Monster who asks for $3.50, or as the father puts it, \"Tree Fiddy.\" The mother always pays the monster, and the father is always upset. ", "gilded": 0, "created_utc": "1286221460", "subreddit": "AskReddit", "score": 8, "controversiality": 0}
{"body": "I wasn't putting any blame on the Americans. My comment was aimed at Nessie, who stated that it's because of the Americans that the language persists today, and this further implies that Americans did something to promote the language, which simply isn't true. I don't really care myself if the Okinawans choose not to retain their own language, ultimately that's their own choice to make. The variant they speak today is, in fact, a dialect of Japanese, which means that they *are* speaking Japanese (in opposition to Nessie's statement). But whatever, downvote me for pointing out the truth.", "gilded": 0, "created_utc": "1286229401", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "I never blamed the United States, I criticized Nessie for saying that it's thanks to the US that Okinawans don't speak Japanese, which implies that they're priviledged to be able to speak their local language. The problem though, is that Okinawans no longer speak the language, and now speak a variant of Standard Japanese (which goes against Nessie's statement). It's their own fault, and I have nothing against that.", "gilded": 0, "created_utc": "1286230349", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "No, because Quran verse or Mohammed saying (dunno which) demand all nun Muslims out of Arab gulf.\n\nEdit: as Nessie pointed.", "gilded": 0, "created_utc": "1286232328", "subreddit": "worldnews", "score": -3, "controversiality": 0}
{"body": "Atheism implies little more than a lack of belief in deities. In fact, you sound like an atheist. There are some atheist who might claim certainty that there is no god, but, most here are slightly more agnostic about their position.\n\nThat said, I do not believe in god. I'd be happy to hear any evidence for the existence of gods, but, nothing I have seen makes me think that they are real.\n\nAs far as strong atheists, they might suggest that the evidence for god existence is just as \"strong\" as the evidence for the existence of ghosts, the Loch Ness monster, or Santa Claus. Does denying their existence seem as untenable as believing in their existence?", "gilded": 0, "created_utc": "1286248832", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Your parents were putting toys under your tree to spare your feelings because you were a naughty boy and Santa wasn't going to give you anything.\n\nNo real evidence for the Nessie, but, there are still believers and \"researchers\" watching the Loch to this day.\n\nNo solid proof of ghosts either, but, people still believe. \n\nIs it so ludicrous that some people outright deny the existence of the these ideas?\n\nEdit; Your proof that Santa isn't real is just as good as many strong atheists proof that god isn't real.", "gilded": 0, "created_utc": "1286249481", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "So your \"possibility\" of some sort of god logically follows to believing in all the dogmas and rituals of the Catholic Church, which include that I, as an atheist, am going to hell.\n\nAlso: If we only need to consider the possibility of something then why not also believe in the Loch Ness Monster? Your process of belief opens you up to believing anything that seems plausible. \n\nGod is not plausible. We have never been able to demonstrate an existence of something outside of the material world. It's a fairy tale.", "gilded": 0, "created_utc": "1286287668", "subreddit": "Catholicism", "score": 3, "controversiality": 0}
{"body": "The stereotype of theists as unthinking sheeple is about as tired as the conception of atheists as amoral narcissists. Of course a belief in God does not require that Catholicism follow. Obviously, there are many other religions out there, just as there are many Christianities. What belief can do, however, is to open one to the rich and variegated philosophical traditions of the Church, which people are free to weigh and accept as they deem fit. The magisterium of the Church is a living, mutable institution. While it is free to claim whatever authority it likes in light of traditions such as apostolic succession, that authority must always be weighed against the vast preponderance of unrevealed truth that it has never claimed to have total access to. Even within Catholicism, accepted dogma is open for debate, reinterpretation, and innovation, and has been since the start; otherwise there would never have been any growth, and we wouldn't have the ridiculously complex philosophical/theological system that we have now. That more or less leaves any thinking Catholic free to question many of the dogmas of the church. That they do so in the shadow of a complex theological system, which may render some arguments more defensible than others (as indeed the case with any system of thought, abstract or otherwise) does not change the fact that arguments can and should be made. I grew up in a more or less areligious environment (I remember going to a Methodist Church a few times with my grandparents when I was like 4 or 5, but otherwise didn't), but became Catholic later in appreciation of the Church's and my own philosophical beliefs. I wasn't indoctrinated, and I sure as hell don't accept anything just because someone told me it was so.\n\nThe Loch Ness monster analogy is just a shitty one, and misses half the point of what I was saying before. I am a firm believer in science to answer questions about the physical world around us. Like any good scientist, I certainly would be open to the possibility of the Loch Ness monster. But then I would go to that Loch, look around, analyze my findings, and based on my findings I would say their is no such thing. But I don't look for God in the physical world. I'm entirely open to Dr. Hawking's recently published theories that the physics of the Universe explain themselves, and that we don't need recourse to God to explain its existence. I would of course caution that the rigor and suitability of a theory does not serve to automatically negate other possibilities. Instead, it *convinces* us on the strength of its argument, regardless if its true or not. I'm a big fan of Occam's Razor, because it makes good sense, but I also recognize that it doesn't dictate reality, but rather gives us a good tool for sorting through what we think and understand. Even so, I'll be happy to endorse Hawking if and when I get to read his new book and weigh his findings.\n\nBut as I said, I don't base my belief in God in the physical world, because He's not required for its existence and functioning (though again, this lack of necessity doesn't require His non-existence, either). Instead, indeed, I look for him outside of the material world in those fairy tales you mentioned, abstract absolutes such as Goodness, Justice, whatever. You're free to think of such things as relativistic socio-biological constructs unique to any particular world, species, race, or person, and so (myopically, I think) place them firmly in the realm of physical material (neurons and culture) here on our tiny corner of the universe, but I don't find that convincing. Rather instead I think these things transcend our own temporary being, and exist freely outside of the human or any other sentient mind. Without drawing out what is already a lengthy response with particular philosophical arguments, it is the belief in these concepts that open belief in God for me, and go on from there to the rest. You might not agree on this basic premise, and that's fine, I'm not saying you have to or are somehow stupid for not doing so. The athiest position makes perfect sense to me, and I'll never fault anyone for arriving at that conclusion. What I am asking, though, is that you don't stroll in like here like a dick with half-baked arguments, and try to dismiss thousands of years of philosophical tradition carefully considered by some of the greatest thinkers in history as something as silly and child-like as a 'fairy tale'.", "gilded": 0, "created_utc": "1286298078", "subreddit": "Catholicism", "score": 5, "controversiality": 0}
{"body": "\"obl\" seems about as real as the loch ness monster these days.", "gilded": 0, "created_utc": "1286354990", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "I grew up near Crater Lake. I've been there several times. It's a lovely place, great camping spot, great hiking spot, and has it's own \"Loch Ness Monster\" myth, which is pretty funny.", "gilded": 0, "created_utc": "1286396278", "subreddit": "environment", "score": 1, "controversiality": 0}
{"body": "I logged in, specifically to to you that you have no idea what you're talking about. Not the slightest clue.\r\n\r\nCompact flourescents DO burn your hand. You leave them on for 18-24 hours a day ALL day and you really think they produce NO reasonable measure of heat?\r\n\r\nAlso...a 200w CFL? ARE YOU FUCKING INSANE? CFL's go to about 7-20 watts.\r\n\r\nYou see...that's kind of the fucking POINT. To produce a high amount of LUMENS (in 1000 or 10,000s) with a VERY LOW wattage. Do you know what lumens are?\r\n\r\nIf I seem angry it's because you've posed yourself as a semi-expert-ish person and are feeding FALSE info.\r\n\r\n\r\nHigh Pressure Sodium lights are VERY hot. And big. The lightbulbs are comically huge. But...and here's the thing...THIS IS WHY YOU GET A LIGHT HOOD FOR THE HEAT, A PROPERLY WIRED BALLAST AND AIR CIRCULATION.\r\n\r\nGod DAMN...you sound like the police here. Grow lights are not dangerous. Stupid people are. They can not \"easily burn down\" a house. Not by a long shot.\r\n\r\n\r\nIn addition. Extremely potent cannabis (not sure how you define the term) is extremely potent, yes. I will conceed that anxiety (and heart-rate...silly to differentiate the two when it comes to the high at this point...) can be an experience of more potent weed....but why is this a bad thing?\r\n\r\nSmoke less. You'd drink a pint of beer, but not a pint of vodka, yes?\r\n\r\n\r\nTo say that \"slightly less potent cannabis actually optimizies the experience\" is ridiculous. \r\n\r\nI'm truly sorry you had weed that was too strong for your body/mind to handle. That's your \"fault\". You are not \"optimizing\" the experience...except in the sense that you cannot handle good weed and seem to need poorly produced weed.\r\n\r\n\r\nAlso, \"old man\" weed here...usually refers to hippies knowing what they're doing and producing conessieur strains. Not low potency.\r\n\r\n\r\nI'm not sure you truly know what ditch weed is. It's horribly unpleasant to smoke. And bad for you. Worse for you.\r\n\r\n\r\nAnyways.\r\n\r\n\r\nTLDR; poster above me is full of crap, don't listen to his \"advice\".", "gilded": 0, "created_utc": "1286411567", "subreddit": "WTF", "score": 39, "controversiality": 0}
{"body": "**In light of this oversight** your question doesn't make sense. What is the agenda of people that don't believe in Horoscopes? Or the agenda of people that are skeptical about Sasquatch, The Loch Ness Monster, Chupacabra, or little green men from outer space? What agenda do people that don't believe in Leprechauns have?\n\nDo you see the problem yet? Atheism is the rejection of the theistic claim that gods exist. It isn't a people's movement, or a political action group. It's not a club or an ideology. There are no central tenants or customs. In and of itself, all other issues aside, atheists have no more reason to organize than non-piano players.\n\nIf you want to talk about what Secularists must or must not do, that is another topic entirely. State your position clearly. If you are simply an anti-theist, then we could talk about that as well. But when you talk about the \"atheist agenda\" you sound like a rube. It's a statement that advertises your ignorance to the definition. As an atheists, I don't need to choose a side any more than I need to choose a side as a non-believer of Unicorns.", "gilded": 0, "created_utc": "1286423325", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1286459205", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I ain't giving you no tree fiddy you goddamn Loch Ness monster! Get your *own* goddamn money!", "gilded": 0, "created_utc": "1286459644", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1286463578", "subreddit": "programming", "score": -2, "controversiality": 0}
{"body": "Yeah, fair comment. I don't think it's a bad film at all, I just think it's very good as opposed to excellent. And as Nessie said, there are fewer good horror movies :)", "gilded": 0, "created_utc": "1286480691", "subreddit": "entertainment", "score": 1, "controversiality": 0}
{"body": "'bout tree fiddy", "gilded": 0, "created_utc": "1286480934", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "1. meh.\n\n2. sure, the church says that. of course, i've always felt that actions speak much louder than words. \"by their fruits you shall know them\" and all that. and i have seen the fruits of god-worship.\n\nand my \"strange conception\" of god comes from those worshippers, and i tend to picture him as a dour, serious guy who is overly concerned with my sex life, who gets angry if i ask too many questions, and who chucks people into a pit of fire if they don't praise him enough. yeah, i don't want to hang around that guy.\n\ni'm an honest person with an open mind, and i live by a strong code of ethics. i sincerely doubt that there are any such things as gods, ghosts or the loch ness monster, and if your \"loving\" god feels that i ought to be sent to hell for that, then i'll go to hell with my head held high. because i'll know that i did my best given the limited tools i have.\n\nand if he decides to forgive me for being skeptical and using the intellect that he gave me, and lets me into heaven even though i'm an atheist, then he might be an alright bloke after all.\n\nbut i seriously doubt that any of this will be an issue.", "gilded": 0, "created_utc": "1286481899", "subreddit": "Christianity", "score": 2, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy!", "gilded": 0, "created_utc": "1286493295", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "God damn Loch Ness Monster!", "gilded": 0, "created_utc": "1286500604", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Most atheists do not utterly dismiss the notion of god. We do not believe in gods in the same way we do not believe in the Loch Ness monster. No evidence leads us to not believe.", "gilded": 0, "created_utc": "1286503107", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "why is the loch ness monster different from god? I'm missing your point.", "gilded": 0, "created_utc": "1286504111", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Tree fiddy.\r\n\r\nSeriously though, $1.50.", "gilded": 0, "created_utc": "1286549341", "subreddit": "Economics", "score": 1, "controversiality": 0}
{"body": "so this one is actually pretty interesting. i'm afraid of oceans, but it's a controlled fear. it's mostly the creatures, but big waves on small boats are freaky, too.\n\nwhy lakes and ponds? they're pretty self-contained. the whole loch ness monster thing?", "gilded": 0, "created_utc": "1286589389", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "[Here](http://www.financiarul.com/uploads/image/enigme_coperta_tipfar-1.jpg) it is on a book, something to do with the Loch Ness monster, and great mysteries throughout history.", "gilded": 0, "created_utc": "1286592180", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "It was the Loch Ness monster! Did you give it three-fitty?", "gilded": 0, "created_utc": "1286663859", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "[Loch Ness Monster!](http://i.imgur.com/APaxZ.jpg)", "gilded": 0, "created_utc": "1286680129", "subreddit": "trees", "score": 7, "controversiality": 0}
{"body": "&gt;In your opinion are not all Buddhists atheists?\r\n\r\nIn my opinion the majority of Buddhists worldwide are not atheists. \r\n\r\nAs I think I posted elsewhere on this page, almost all human beings throughout history have believed in gods and supernatural stuff (because they wanted to).  \r\n\r\nBuddhists are human beings, therefore most Buddhists have believed (and still believe) this stuff. \r\n\r\nBut broadly speaking, in Buddhism and unlike a lot of other religions, *this stuff is optional*. \r\n\r\nIf you like to believe this stuff, you can be a good Buddhist.\r\n\r\nIf you think that all this stuff is nonsense, you can be a good Buddhist. \r\n\r\nThe comparison that I like to use is that it's like the opinion most religions have about the Loch Ness Monster. \r\n\r\nYou can be a good Christian or Muslim or Jew or Buddhist whether you believe in the Loch Ness Monster or not. Buddhism just happens to have the same attitude about gods, spirits, and the supernatural. \r\n\r\nA large percentage of Westerners who have become Buddhists are atheist.\r\n\r\n&gt;your specific sect or denomination \r\n\r\nI'm personally an eclectic Buddhist (like a lot of Western Buddhists) who has been very influenced by \r\n\r\n- Vietnamese Zen (Thien), which as far as I know never talks about anything supernatural. \r\n\r\n\\- http://en.wikipedia.org/wiki/Buddhism_in_Vietnam -\r\n\r\n(see many very good books by Thich Nhat Hanh) \r\n\r\n\\- http://en.wikipedia.org/wiki/Thich_Nhat_Hanh - \r\n\r\n- and by Korean Zen, in which I've never heard/read anybody talk about anything supernatural, but I'm not sure that they'd definitely rule it out.  \r\n\r\n\\- http://en.wikipedia.org/wiki/Buddhism_in_Korea -\r\n\r\n(A couple of IMHO very good books by Seung Sahn Sunim)\r\n\r\n\\- http://en.wikipedia.org/wiki/Seung_Sahn -\r\n", "gilded": 0, "created_utc": "1286729666", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Uh... bout tree fiddy.", "gilded": 0, "created_utc": "1286746147", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "That'll be about... Tree fitty. G'ah damn lochness monsta!", "gilded": 0, "created_utc": "1286747682", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "I already told you... I ain't givin you no tree fitty!", "gilded": 0, "created_utc": "1286769186", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "i'll give you tree fiddy. ", "gilded": 0, "created_utc": "1286771293", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt; two things that trouble my mind and make me think about things unexplainable are the reports of ghosts/spirits, and psychic activity.\r\n\r\nWhy? What makes these two trouble you more than the Loch Ness monster?", "gilded": 0, "created_utc": "1286801066", "subreddit": "atheism", "score": 10, "controversiality": 0}
{"body": "Who makes societal laws based upon the Loch Ness monster?", "gilded": 0, "created_utc": "1286810862", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "\"Reveal\"  Area 51 (or bigfoot, or Loch Ness monster, etc) to distract the population so we can get some real work done behind the scenes. You think you're distracted by the media *now*? Wait until I'm in charge.", "gilded": 0, "created_utc": "1286840745", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Wow what beautiful photos! Thanks Kathleen :) lots of love to you and your family! Big hug!\n\n(oh, and Nessie says hi too!)\n\nxxx", "gilded": 0, "created_utc": "1286842914", "subreddit": "reddit.com", "score": 4, "controversiality": 0}
{"body": "One of lifes great mysteries. The discarded bag of an impressive collection of porn. It's up there with Bigfoot and Nessie.", "gilded": 0, "created_utc": "1286852311", "subreddit": "AskReddit", "score": 11, "controversiality": 0}
{"body": "I only need about tree fiddy", "gilded": 0, "created_utc": "1286861603", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "I am the evidence that my parents had a child, and natural evolutionary biology. Natural occurrences do not prove the supernatural. As far as my reason for being an athiest? Ok i will bite, I was raised Catholic, after reading the bible and my own logical reasoning i came to the conclusion that the god of the bible is completely ridiculous. The glaring inconsistency in scripture, and the irrationality of the god in the bible was just to much for me. I mean if you actually examine the way the character of god is portrayed in the bible he fails as a literary character. After that just basic knowledge gained through education about our natural world further cemented my reasoning. In the end the conclusion that remains is that I do not believe in the god of the bible, or any god. It is really the same reasoning why people do not believe in the loch ness monster, or big foot, or aliens. But for some reason atheist are the only people that seem to have the need to explain their reasoning for not believing in a character from a book written in the adolescence of human knowledge. ", "gilded": 0, "created_utc": "1286916938", "subreddit": "atheism", "score": 6, "controversiality": 0}
{"body": "&gt; romanticizing pre-industrial life is simply naive. Life before anesthetics, antibiotics, and refrigeration was typically short, brutal, and painful.\n\nThis is true if we limit the discussion to post-agricultural pre-industrial life, but in the paleolithic era (pre-agriculture) antibiotics weren't needed because there were no prevalent infectious diseases (which only came about after population density shot through the roof) and refrigeration wasn't needed because they didn't have to stockpile food since it was easily accessible at all times of the year.  And how often do people really need anesthesia?", "gilded": 0, "created_utc": "1286941951", "subreddit": "collapse", "score": 3, "controversiality": 0}
{"body": "Your \"subjective\" proof is no different than the subjective proof for fairies, The Loch Ness Monster, and Bigfoot.  In other words, it is worthless.  BTW, most people share the religion of their parents and/or community.\n\nIf you were in India, you would be arguing for Hinduism.  If you grew up in Tibet, you'd be arguing for Buddhism, etc.  You sound American, so you're either Christian or have some wacky new age version of monotheism going on.", "gilded": 0, "created_utc": "1286950233", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Err, your claim is that you read something by some Canadian redditors, but I can just as easily claim I ready something by a bigfoot redditor, discussing how the Loch Ness monster is an ass. I'm not questioning their veracity, since I cannot see the context in which their post wast made, nor am I questioning whether they are trolling, since I would need their comment history to determine their character. In fact, I can't even see what it was they actually claimed, so I can't question them at all. Instead I'm questioning whether you honestly read such a post instead of making it up; a lot of your comments have a slightly trolly tinge to on them, so it's a perfectly reasonable question, especially in /r/politics. \n\nBasically, if you want to use evidence to support your point, you should either be ready to provide the evidence, or be ready to admit that you do not actually have the evidence you used, and stop using it to argue your point. This is vital in any sort of debate, since it allows everyone involved to determine whether your argument has any merit. In other words, we're not talking about other's claims here; you should cite your arguments with specific data, avoid making the arguments, or just present them as an opinion. If you're just too lazy to track those comments down again, then stop using this information to make a point. I'm not asking for anything amazing here, just consistency.\n\nThus far I honestly not seen data on the topic of Canadian anchor babies one way or another. Given that I read reddit a lot more than I should, that's enough cause for me to wonder about your claims. Are you telling the truth? You might be, I never said you weren't. I just want to see the information you used to come to this decision. Basically, the problem is not that people are attacked as liars, it's that people use evidence that they are then not willing to produce. That's not lying, just bad debate form, and reddit is not very forgiving to bad debate form.\n\nTo finish off, I have not yet made any claims except that \"I have not seen a single piece of data to suggest this is even happening.\" Are you trying to say that I'm lying, and have in fact seen the post you are talking about? In fact, I currently do not hold any opinion on Canadian anchor babies except, \"Some guy named insomniac84 on reddit was saying they're an issue.\" What more, reddit is me, and it's you, and it's millions like us. We are each a tiny part of the community, and the community is a part of our internet persona. Are you saying you believe everything you read on reddit? If so, then you clearly believe me, and if not, then it would be more correct to say you believe this mysterious post over me.", "gilded": 0, "created_utc": "1286998880", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "My original point still stands.  Your \"subjective proof\" for \"God\" can be applied to fairies, Bigfoot, or The Loch Ness monster or any other deities or entities that men can imagine.  The deist god is just as real as those -- that is to say, not real at all.", "gilded": 0, "created_utc": "1286999526", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Turn it into a Loch Ness Monster.", "gilded": 0, "created_utc": "1287006510", "subreddit": "Minecraft", "score": 1, "controversiality": 0}
{"body": "tree fiddy! god damn loch ness monster!", "gilded": 0, "created_utc": "1287064783", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "They'd just write you a paper ticket with toll fare + $3.50 \"administrative fee\".\nThing is I had this happen to me twice and both times mailed a check for $8.50 ($5 toll + tree fiddy fee) and both times they never cashed it.", "gilded": 0, "created_utc": "1287073994", "subreddit": "IAmA", "score": 9, "controversiality": 0}
{"body": "You're right about the subject. I would have given my right eye for a boat or some kind of Loch Ness monster, but alas the sea is a cruel mistress.", "gilded": 0, "created_utc": "1287094894", "subreddit": "photocritique", "score": 1, "controversiality": 0}
{"body": "Lets not forget the Loch Ness monster too. And Bigfoot.", "gilded": 0, "created_utc": "1287103220", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.\n\nSeriously, I was at the grocery store checkout and my card was declined and I left my groceries and went to the bank and checked my balance and it was -3.50.", "gilded": 0, "created_utc": "1287135633", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": " Last week, Japanese scientists placed explosive detonators at the bottom of Lake Loch Ness to blow Nessie out of the water. Sir Curt Godfrey of the Nessie Alliance summoned the help of Scotland's local wizards to cast a protective spell over the lake and its residents, and all those who seek a peaceful existence with our underwater ally.", "gilded": 0, "created_utc": "1287141911", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Heh. All you ever need to remember, is that the iconic footage of Bigfoot was a hoax, as is the iconic photograph of the Loch Ness monster. I've never particularly looked into UFO stuff since I was in Grade 5, as I became aware of just howfuckinghugetheuniversereallyisandallthatothershit.\n\nI'm going to have to ask if we can agree to disagree on this one - I feel that my experience post-X-Files is different to yours (in the way that we perceive the public perceiving the 'fringers'). What you've described isn't the same as what I've noticed. I'll happily keep my eyes out to see if I can pick up anything to agree with you though.\n\nI will, however, point out that if someone stated they were a Vampire incarnate 15 years ago, people would be slightly weirded out. After the release of Twilight, True Blood, Vampire Diaries, etc, the reaction of most members of the public would be skepticism and open hostility.", "gilded": 0, "created_utc": "1287156905", "subreddit": "DAE", "score": 1, "controversiality": 0}
{"body": "[This](http://profile.ak.fbcdn.net/profile-ak-snc1/object3/494/79/n86174826077_6142.jpg) is about tree fiddy.", "gilded": 0, "created_utc": "1287171373", "subreddit": "WTF", "score": 7, "controversiality": 0}
{"body": "About tree fitty.", "gilded": 0, "created_utc": "1287196556", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "I believe in ghosts / the paranormal / aliens / bigfoots / the loch ness monster less and less every day.  You know why?  The billions of cameras/video cameras/recording devices in our collective pockets.  You'd think the video footage of this stuff would be EXPLODING, but it's not.  Pics or it didn't happen. ", "gilded": 0, "created_utc": "1287205230", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "man im not givin you tree fiddy you gd loch ness monster", "gilded": 0, "created_utc": "1287279331", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "The loch poster has Nessies head pointing in the wrong direction in the water's reflection.", "gilded": 0, "created_utc": "1287295865", "subreddit": "Design", "score": 8, "controversiality": 0}
{"body": "I'll give you tree fiddy for it.  ", "gilded": 0, "created_utc": "1287372475", "subreddit": "guns", "score": 1, "controversiality": 0}
{"body": "\"television series loch ness monster little boy swimming pool godzilla\"\n\nMy sister was trying to remember the name of a tv series ([Surface)](http://www.imdb.com/title/tt0452718/), and I was going with what I remembered about the show. Took about 20 minutes, but I found it!", "gilded": 0, "created_utc": "1287380896", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "It'll cost about tree fiddy.", "gilded": 0, "created_utc": "1287401995", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "[The Loch Ness Monster](http://www.google.com.au/imgres?imgurl=http://funkydowntown.com/wp-content/uploads/2010/07/Guide-to-the-Puppetry-of-the-Penis-1.jpg&amp;imgrefurl=http://funkydowntown.com/tutorial-to-teach-you-enjoy-yourself-with-your-penis-balls-and-foreskin-puppetry-of-the-penis/&amp;usg=__nsa33Q_di_pE8ChQDW5y_aeVHDA=&amp;h=613&amp;w=500&amp;sz=38&amp;hl=en&amp;start=0&amp;sig2=kxTDOdmiecYSvsDH9SMdSA&amp;zoom=1&amp;tbnid=EPd_a-PNbTHgYM:&amp;tbnh=129&amp;tbnw=105&amp;ei=BoK8TP_JOYbIvQOMsfWaDQ&amp;prev=/images%3Fq%3Dpuppetry%2Bof%2Bthe%2Bpensi%26um%3D1%26hl%3Den%26safe%3Doff%26sa%3DN%26biw%3D1280%26bih%3D685%26tbs%3Disch:1&amp;um=1&amp;itbs=1&amp;iact=hc&amp;vpx=793&amp;vpy=200&amp;dur=614&amp;hovh=249&amp;hovw=203&amp;tx=125&amp;ty=100&amp;oei=BoK8TP_JOYbIvQOMsfWaDQ&amp;esq=1&amp;page=1&amp;ndsp=33&amp;ved=1t:429,r:14,s:0) \n\nAnd anything else by Puppetry of the Penis.", "gilded": 0, "created_utc": "1287422547", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "&gt; What do you think would happen after death (after life),\n\nThis is the unproven idea of a soul, and this idea is worth exploring. The soul is usually meant to mean your personality, your thinking and consciousness. It's supposed to be something that inhabits your flesh body and which animates it in some way. It's like a ghost or spirit, an invisible puppeteer.\n\nPlato and the Pythagorians advocated a mind/body distinction in terms of the supernatural and natural. At the time this ideology helped justify slavery because a slave’s caged body had a soul that would later rest in an afterlife; after the slave owners were done with the slave’s body. The idea of a distinction between the mind and body has powerful implications for what we will tolerate within our lives.\n\nWe now know through modern research that disabling parts of the brain can affect the mind and its personality. Those with brain damage can have different personalities, and this effect can last for life. A person could live for one half of their life with one personality and then — through brain injury — live the other half with a very different personality.\n\nThe concept of one essential personality is false. The idea of ghosts or souls that survive death of the body must be reconciled with the dozens of personalities that we can induce in the body’s brain.\n\nThere's no reason to think that anything like a soul survives death. When we die our atoms will scatter and our minds are gone.\n\n&gt; and how would it feel like?\n\nMy brain wouldn't have the capacity to feel when it's brain dead.\n\n&gt; To make things clear, I'm not against atheists or any religion. I just want to get the right picture of what atheists believe.\n\nWell I wouldn't use the word \"belief\" to describe what I've said above. What's been said above is based on facts, so belief is unnecessary.\n\nI haven't said that souls don't exist for certain, but I have said that there's no reason to think they exist (along with gods, ghosts, an afterlife, etc.). It doesn't require \"belief\" to think that Zeus is unproven, or to think that Scientology is funny, or to think that there's no evidence, sadly, of Yetis. Religious ideas aren't falsifiable so there's no way to know which one is right and which one is wrong. It seems to be all based on culture, and no religion ever traveled faster across the globe than people's ability to tell stories. For all intents and purposes they don't exist.\n\nI've looked for religious or soul-like answers but they were unconvincing, and they seemed to be wishful thinking.\n\n&gt; Don't care if you downvote, just want clear answers and want to know if atheists have different beliefs or all of them believe in one thing.\n\nMost atheists around here are materialists (in the 'natural universe made of atoms' sense, not in a 'cash money' sense)\n\n&gt; doesn't that scare you?\n\nWell if it's true then I may as well get on with it. Bending my idea of reality to what's comforting would be childish.\n\nI never expected to be immortal so it's not depressing and having one life makes it infinitely more valuable. I have any reason to think I'll get a second chance at this.\n\n&gt; what if you don't fulfill all you desire in this life... What's the purpose of life then?\n\nWell, what makes you think the universe owes you purpose? \n\nLife exists because it's better at holding its atoms together than non-life. In a sense we as a species have evolved tendencies to reproduce.\n\nFor individuals we make our own purpose and we enjoy people and things in the world. See also: http://imgur.com/6tS72.jpg\n\n&gt; because we are here , and we have the ability to think. we developed a thinking conscious to solve something, for a purpose.\n\nThere's no reason to think that life neatly fits into a narrative of purpose.\n\nConsciousness is an evolved product of the brain. Being able to reason about upcoming events is a survival benefit. It may have no greater purpose and there's no reason to think there is.\n\n&gt; why would we make children, if they're going to die and end up as we did nothing?\n\nBecause we feel biologically compelled to, and because life can be fun. We try to give our children a good start into the world.\n\n&gt; i mean in this life.. it doesn't feel it's long enough.\n\nThen make the most of it and don't waste time on Sunday mornings in a large room talking about superstition.\n\nReligions say they'll give a payback in the form of supernatural rewards the question is whether there is any payback. Our innate reciprocal altruism can be co-opted by the promise of supernatural rewards that are inherently unknowable. It’s as if you lent money to a friend who promises they’ll pay it back in an afterlife. Religions are simply a bad deal.\n\n&gt; Ok what about Out Of Body experience ... Why wouldn't it feel like this in afterlife?\n\nOut of body experiences, or near death experiences, often involve a tunnel of light and this can be explained by the experience of 'tunnel vision'.  As far as floating around your body I have dreams like that all the time, but I'm never able to identify anything that makes me think it's anything more than a dream.\n\nYou can reproduce Out of Body experiences in your own body http://imgur.com/dbn4g.jpg \n\n&gt; Let me get this straight, so atheists don't believe in souls? im confused a little bit.\n\nThe dictionary definition of atheist means someone who is without any belief in gods. People can call themselves atheist and believe in the Loch Ness Monster or Unicorns or souls. For example, Buddhists believe in reincarnation (e.g. souls) but they don't believe in gods.\n\nOn Reddit most atheists disbelieve in gods and souls.\n\n&gt; some people told me, why not having a religion just in case you were wrong about the existence of god..and it shows up that god does exist. ( i know you can't have a religion if you don't believe from the beginning ), but what do you think?\n\nThis is called Pascals Wager which is basically gambling. Pascal's Wager is a bad reason to believe and here are two videos of about why:\n\nhttp://www.youtube.com/watch?v=07JvzfO0vOk\n\nhttp://www.youtube.com/watch?v=fZpJ7yUPwdU\n\n", "gilded": 0, "created_utc": "1287433710", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "IT stinks?  Nessie is a 'she', thank you very much.", "gilded": 0, "created_utc": "1287435774", "subreddit": "humor", "score": 1, "controversiality": 0}
{"body": "I've had a couple Nessies in my toilet in my day.  It takes a couple times, but she goes right down eventually.", "gilded": 0, "created_utc": "1287436995", "subreddit": "humor", "score": 1, "controversiality": 0}
{"body": "This articfact is from 30k years ago, yes?\n\nThat's like the dead end of the Paleolithic era. ~2.5 million years ago to about 20k years ago is the era IIRC. So yea, some grains were found near the end. It's the way we _left_ the paleolithic era according to the article, so then this wouldn't really be the \"paleo\" diet. It would be \"the diet right before the end of the Paleolithic era\".\n\nSo, I don't think this is going to have any impact on people who are on low/no-grain diets. And I think if we are declaring what the \"Paleolithic diet\" is, it should include the other 83% of the era.", "gilded": 0, "created_utc": "1287438694", "subreddit": "Fitness", "score": 12, "controversiality": 0}
{"body": "I'm not expert.  At all.  But looking at Wikipedia, it shows that [anatomically modern humans](http://en.wikipedia.org/wiki/Anatomically_modern_humans) didn't appear until 200,000 years ago.  And fully modern behavior didn't evolve until 50,000 years ago.  \n\nDoes the paleo lifestyle advocate for the lifestyle of our human ancestors spanning the entirety of the paleolithic era, or just *human sapiens sapiens'* time in it.\n\nPlease note I am not trying to troll (which is all to common in these sort of posts) but am trying to learn.", "gilded": 0, "created_utc": "1287439502", "subreddit": "Fitness", "score": 5, "controversiality": 0}
{"body": "You punched down a thousand trees and burrowed though your world with nothing but a wooden pick... i say your just about rdy to take on nessie", "gilded": 0, "created_utc": "1287439742", "subreddit": "Minecraft", "score": 4, "controversiality": 0}
{"body": "Ill give ya both for right bout tree fiddy", "gilded": 0, "created_utc": "1287450031", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Don't forget to bring about tree fiddy.", "gilded": 0, "created_utc": "1287462140", "subreddit": "Minecraft", "score": 3, "controversiality": 0}
{"body": "Damn Loch Ness Monster raised the rent to tree fiddy.", "gilded": 0, "created_utc": "1287465533", "subreddit": "politics", "score": 17, "controversiality": 0}
{"body": "It's just a log, nessie is not a real thing.", "gilded": 0, "created_utc": "1287474716", "subreddit": "Minecraft", "score": 1, "controversiality": 0}
{"body": "Looks like the rent is about [tree fiddy](http://vids.myspace.com/index.cfm?fuseaction=vids.individual&amp;videoID=2027687639)", "gilded": 0, "created_utc": "1287492985", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "About tree fitty?", "gilded": 0, "created_utc": "1287519281", "subreddit": "pics", "score": 20, "controversiality": 0}
{"body": "And that's when I found out that in fact that was not my father but instead a giant Loch Ness monster disguised as my father.", "gilded": 0, "created_utc": "1287519687", "subreddit": "pics", "score": 17, "controversiality": 0}
{"body": "As far as I've read, cancer and other 'modern' diseases are a result of civilization -- which dates back some 10,000 years. With civilization came poor nutrition (I'm looking at you, grains), squalor, etc.\n\nAncient Greece was very much civilized; I'm not surprised they found cancer. I'm more inclined to believe that in the paleolithic era, there was very little disease that humanity had to contend with.", "gilded": 0, "created_utc": "1287595933", "subreddit": "science", "score": -2, "controversiality": 0}
{"body": "&gt;I stopped going to mass, avoided mass, would not receive the Eucharist, lived a life of manipulating people especially women for my own desire and selfishness. I became an atheist. Read on Dawkins, hailed Hawking, flying spaghetti monster, and the Darwin fish. I indulged myself with all the pleasures of this world could offer. It was a great time, a happy life... to a degree! Nevertheless, it was empty... is this it? is it all there to life?\n\nThis is all I needed to know. You didn't become an atheist, you became disillusioned. If you \"come to\" atheism for any reason other than because you thought about it, and it didn't seem reasonable that there is a god, then of course you're going to feel like something's missing-- because, as I said, you were looking for something to begin with. The first thing religion does to a young person is to give them a sense of dependency on that religion-- absence of religion is associated with doubt, fear, sadness, suffering, evil, and everything else bad known to man.\n\nAtheism has nothing to do with manipulating people, hailing Hawking, giving in to desires of the flesh, or any of those things. Those things are simply stuff you wanted to do before but couldn't, or things that you did simply to spite a God that on some level you still believed in. Many atheists are happy to acknowledge that while many religious practices may be ludicrous in terms of why they're practiced, they've been around long enough taht through trial and error, many of those practices have positive results. If they didn't work, they wouldn't be codified and practiced by huge groups of people, at least to some degree and in some context. It's no surprise that if you went around breaking every taboo known to your religion and began mistreating people, you weren't happy.\n\nI never stopped going to mass myself, not until the very end of the process of letting go. Catholicism never seemed like nonsense, it seemed like a very deep challenge that at times filled me with doubt, but it was never nonsense. I attended bible study regularly-- of *course* Catholics have bible study, I've never heard the stereotype that they don't! I taught catholicism to grade school children for years, and read the Bible every night before bed. I never \"turned away\" from Catholicism out of anger, boredom, some terrible event in my life, or anything like that-- in fact, I left it with sadness, because I really enjoyed the practices that went along with it. I miss the community, and I miss the communal singing, I miss praying before bed each night-- there are a lot of comforting practices that go along with religion. And even after I realized I didn't believe, I continued to go to church for quite some time, just for the songs and the community. I only stopped because it felt dishonest. Once you start recognizing some of the patterns that lead people to believe in religions, superstitions, astrology, etc, though, you cannot stop seeing them, and you cannot go back to believing them yourself, at least not without some major life trauma. It's hard to be around people who strongly believe in something when you do not believe in it, and in addition feel that you understand what motivates them to believe in it.\n\nI'm sorry that you felt empty without religion, but I firmly believe that is because you have never let go of religion to begin with. In the same way that people can convince themselves they believe in a religion when deep down they don't, I don't find it at all unusual to convince yourself you don't believe in religion when deep down you do. And if that's the case, you'll eventually return to religion, and you'll have all kinds of guilt and other issues in the meantime.\n\nhttp://youarenotsosmart.com/2010/09/11/the-texas-sharpshooter-fallacy/\nLet's examine your coincidences.\n\nFirst, you met someone named Luke who was a Catholic. Luke is a very common name for Catholics. Second, you read from the book of Luke in a Bible study. Well-- most Bible study groups that I've been involved with always pick one reading from the Gospels in addition to another from the old testament or letters. You had a 1/4 chance of getting a reading from Luke. You also had a 1/4 chance of getting a reading from Luke when you next went to Church. In addition, since it was the Liturgical Year of Luke, it was even more likely, since that's the whole point of the Liturgical cycles-- to pay special attention to some aspect of the Bible, such as the Gospel of Luke. \n\nHow many liturgical years are there? Correct me if I'm wrong, but aren't there only three, based on the three Synoptic Gospels?\n\nBut more importantly than trying to reduce the impact of the coincidences that did happen, think how many possibilities you're ignoring. How many people did you meet during this time? How many were named \"John\" or \"Matt\" or \"Mark?\" How many readings from other books of the gospel did you hear that weren't from Luke? How many masses did you attend, any of which would have been equally \"impressive\" had any one of them happened to be the Feast Day of St. Luke? (You make it sound like it was your second mass back, is that accurate? But what if it had been, instead of \"the day you almost didn't go after exams\" but rather \"the day that my favorite sports team one the playoffs\" or \"the day that Grandma called out of the blue and told me she loved me\" or \"the day that you started dating a wonderful new girl\"-- all of these things would have seemed like amazing things to happen on the very same day that you ended up attending mass on St. Luke's feast day, but in fact there are so many things that some of them were bound to happen. All of this goes double because after the first coincidence, you probably kept your eyes out for more like them. You may never know it, but coincidences that are just as striking may have occurred with John, Paul, Andrew, James, Peter, and so forth-- but you weren't looking for them. And it also goes double because looking back on our memories, we make a lot of changes for them to conform to what we want them to be. Not you, but everyone.\n\nAnd finally, even if this were an incredible coincidence, there are thousands of people who have experienced equally incredible coincidences leading them to believe countless different things-- anything from religions that are absolutely clear that Catholics re going to hell to evidence for the Loch Ness Monster or UFOs. Unless a disproportionate number of incredible coincidences happen in favor of Catholicism when compared to the amount happening that seem to point to another belief system or idea, I can't use that coincidence to turn towards one particular idea.\n\nAnyway, that ran long, I'm sorry. It's not really my place to talk you out of believing in this, but I get drawn into it.", "gilded": 0, "created_utc": "1287651326", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "I ain't givin' you no tree fiddy, you god damn Loch Ness Monster!", "gilded": 0, "created_utc": "1287664435", "subreddit": "funny", "score": 7, "controversiality": 0}
{"body": "If you believe in ghosts whats to stop you from believing in any of the crazy hogwash out there? Theres just as much \"proof\" for ghosts are there is for the Loch Ness monster or vampires or tarot cards. (none.)", "gilded": 0, "created_utc": "1287701917", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I'd have tree fiddy. ", "gilded": 0, "created_utc": "1287708434", "subreddit": "funny", "score": 21, "controversiality": 0}
{"body": "Well it was about this time that I noticed this girlscout was about 8 stories tall and a Crustacean from the Paleolithic era. \n", "gilded": 0, "created_utc": "1287709705", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt; tree fiddy\n\nFTFY", "gilded": 0, "created_utc": "1287711096", "subreddit": "programming", "score": 8, "controversiality": 0}
{"body": "... he said tree fiddy.  Well it was about that time...", "gilded": 0, "created_utc": "1287738235", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "I think Nessie was making fun of your typos.", "gilded": 0, "created_utc": "1287754925", "subreddit": "bicycling", "score": 1, "controversiality": 0}
{"body": "I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!", "gilded": 0, "created_utc": "1287784474", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "it was in fact\n\"Thats a myth, like the loch ness monster, or North Dakota.\" ", "gilded": 0, "created_utc": "1287803247", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I was 9 years old. I had been hanging out with my best friend all day, riding bikes, learning how to shuffle cards, burning ants with magnifying glasses, micromachines, you know.\n\nIn the very depths of my stomach I felt Nessie herself rear back in anguish. I knew I was going to puke.\n\nI rushed upstairs and flung open the bathroom door, barely angling my flow to hit the toilet. Nothing came out. I collapsed to my knees, eyes closed, and gripped the rim of the toilet bowl, waiting for my core to tense up again. I wretched a few times, then felt it coming.\n\n**Hworf.**\n\n**Plop.**\n\nI hesitantly opened my eyes to inspect my output. There in the water, instead of a putrid stew of half-digested fruit rollups and Yoohoo, floated what appeared to be a whole, peeledd, boiled egg. I wiped my mouth, stood up, flushed, and for the first time in my life said, \"What the fuck?\"\n\nYears later a doctor, upon listening to my tale of absurdity, would tell me it was very likely a bezoar.\n\nGross.", "gilded": 0, "created_utc": "1287813441", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt;Mobile devices and consoles are distinctly different from Personal Computers\n\nYes, but should they be?\n\nThat's the question that deserves asking, and it seems like Apple's been thinking on it. At least they're making noises like they have been.\n\nThere's a story that's been making the rounds lately; I have no idea if it's true at all, but it sounds about right. After the iPad was announced, Jobs held a meeting of the senior managers in the MacBook group. He walked in with an iPad. Touched the little button at the top, and pow, it was on and ready to go. \"Why can't I do that with a MacBook?\" he's said to have asked.\n\nIt's a damn good question. Yes, you can say \"Well, a MacBook is a personal computer, and it's distinctly different from a mobile device,\" but that misses the point. The point is, what's preventing Apple from *changing* the MacBook hardware or Mac OS X — or both — to make the devices wake up instantly from a deep-power-saving state barely distinguishable from off?\"\n\nThat's just one example; there are others that have already been mentioned in the thread. Why do we have to save files? Right now, applications are generally fail-deadly. If you don't save your file manually, and anything interrupts the application you're using, your data just disappears. That's dumb. Why can't that be changed?\n\nOr, to use an example from the demo last week, why isn't there OS-level support for a full-screen display mode for Mac OS X applications? Sometimes full-screen applications are really cool. iPhoto was the example given, but in my world it's definitely true of Aperture, Nuke and Photoshop, all of which I use in full-screen most of the time. Other applications, like Final Cut Pro and After Effects, have a sort of fake-full-screen mode as well; why not go the extra step and give the developers of those applications an easy way to make the *entire* computer user interface disappear?\n\n\"Mobile devices,\" which I guess is what we've decided to call things like the iPhone, the iPod touch and the iPad, are, as you say, distinctly different from computers right now. But in what ways are they *better* than computers, and what ideas can we steal from them and bring back to make computer better? That's the question, and it's a *good* question, and I'm glad somebody's asking it.\n\n&gt; My not too far fetched fear is that Apple will turn said Personal Computers into locked down Computing appliances like their mobile devices.\n\nGiven that there's absolutely no reason to believe this, any more than there's a reason to believe in the Loch Ness Monster, I'm reluctant to even discuss it. But okay, let's say it's true. Let's say that's exactly what a Mac of 2014 is like.\n\nWhy would that be bad? Such a Mac would certainly be more reliable than the ones we have today. Right now, anybody who wants to — respected ISV, mischievous teenager, whatever — can make an application available for sale without any vetting or quality-control. Nothing's stopping, say, Adobe (those jerks) from shipping a fundamentally broken installer for their software. If software for the Mac *had* to be examined by experts before that software could be sold, that'd be a better thing for everybody.\n\nAnd such a Mac would definitely be simpler and easier to use. Let's go back to the Adobe example. You want to install CS5? Prepare yourself for a good long session of fighting with their fucked-up installer. You want to *uninstall* CS5? Forget it. It's effectively impossible. You either spend all day hunting down files one at a time in the most obscure places on your Mac, or you just take the short route and wipe the drive and reinstall the OS. An iron-fisted App Store approach would solve that right away. Adobe would be *forced* to clean up their act if they want to ship Mac software … and given that Mac software accounts for more than half of their sales, they'd go along with it without hesitation. And you know what? There's a fair chance their attitude would be one of *gratitude,* 'cause Apple would be going out of their way to *help* Adobe get it right.\n\nI'm not seeing it as the dystopia you seem to imagine.\n\n&gt; Any non-permitted devices will not be blocked or you will have your ass thrown in jail.\n\nRight now, if you drive a car without having insurance, you get your ass … well, not thrown in jail, but you get your driving license revoked. It's reasonable to require that people take personal responsibility to limit their liability, when they're doing things that can negatively affect others. Again, this does not sound dystopian to me. This sounds *responsible.*\n\nNow, it's obvious that your extreme hypothetical scenario would never come to pass. Whether the outcome is dystopian or utopian, it'd take way too much work to get from here to there; it's simply not practical.\n\nBut the point is, when somebody steps up and says \"We have some ideas about making computers better, faster, more accessible and more energy-efficient,\" the reasonable response is *not* to go conspiracy-theorist-nuts and assert that these ideas are bad because, if combined with a whole bunch of crap you just made up in your head, they'd lead to a scenario that you, personally, don't want. That's just … well, really childish. Kind of pathetic, really.", "gilded": 0, "created_utc": "1287837192", "subreddit": "apple", "score": 2, "controversiality": 0}
{"body": "I saw this terrible tv show when I was a kid, and there was some scary monster (I believe it was the Loch Ness monster, in its infancy) and it infiltrated the sewer system, and proceeded to take a chomp out of someone if they sat on the toilet without checking. \nScarred for life. Straddle no seat un-turned.", "gilded": 0, "created_utc": "1287869345", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "I dreamt that there was a loch ness monster in my pond. Half of it's muzzle was bitten off. I was going to shoot it with my shotgun but I wasn't sure if it would kill it from a distance. ", "gilded": 0, "created_utc": "1287893491", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Yeah, I mean God is such an obviously made up concept that I think it makes a lot of sense to assign a &lt; 1% probability to his existence.  Every culture makes up its own gods and its own mythological creatures (witches, yetis, werewolves, vampires, ghosts, succubi, demigods, angels, demons, centaurs, unicorns, Loch Ness monsters, etc.)\n\nAren't you more than 99% sure that Zeus and Athena don't exist?  And Vishnu and Baal and all the rest?  Why the double-standard for the modern, Western God?", "gilded": 0, "created_utc": "1287928706", "subreddit": "DebateAnAtheist", "score": 4, "controversiality": 0}
{"body": "This assumes that all wrong beliefs are created equal.  When belief in Atlantis, astrology, or the loch ness monster causes people to vote against abortion, gay rights, or stem cell research then I might be inclined to agree it's a wash.  Until then I'll take a palm reader over a fundamentalist any day.", "gilded": 0, "created_utc": "1287951931", "subreddit": "philosophy", "score": 1, "controversiality": 0}
{"body": "And that's when I realized it wasn't a moose at all but the Loch Ness monster. And I said 'Damn you Loch Ness Monster...'", "gilded": 0, "created_utc": "1288021870", "subreddit": "funny", "score": 22, "controversiality": 0}
{"body": "I AIN'T GIVIN' YOU NO TREE FIDDY!", "gilded": 0, "created_utc": "1288025461", "subreddit": "funny", "score": -1, "controversiality": 0}
{"body": "Or maybe we should stencil it on the side of the Loch Ness Monster.\n\nI mean, more people would see it that way. ", "gilded": 0, "created_utc": "1288032139", "subreddit": "sports", "score": 9, "controversiality": 0}
{"body": "I've recently become un-employeed. Finances are tight and getting worse by the day. I've had to pawn several things that were at one time considered \"Priceless\" including her mothers diamond necklace. She kept it in the safety box we keep at the bank, it will most likely be many months if not years before she notices. Finally had to ask her for money the other day (we keep separate accounts), she said \"How much do you need?\" I hemmed and hawed for about 5-10 minutes trying to downplay the amount of money I was about to hit her up for. I said \"how about tree fidy...\" it was about that time she realized I was about eight stories tall and was a crustacean from the protozoic era. She said “I ain’t giving you no tree fiddy you goddamn Loch Ness monster! Get your own goddamn money!”", "gilded": 0, "created_utc": "1288038326", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "It's a god damn crustacean from the Paleolithic era. ", "gilded": 0, "created_utc": "1288042772", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "[Here's how I fared.](http://www.philosophersnet.com/games/bg_final.php?q1=yes&amp;q2=yes&amp;q3=yes&amp;q4=yes&amp;q5=no&amp;q6=yes&amp;q7=no&amp;q8=yes&amp;q9=yes&amp;q10=yes&amp;q11=no&amp;q12=yes&amp;q13=no&amp;q14=yes&amp;q15=no&amp;q16=yes&amp;q17=no&amp;bulletcount=2&amp;hitcount=1&amp;hit7=&amp;bullet7=&amp;hit9a=&amp;hit9b=&amp;bullet11=&amp;hit11=&amp;hit12a=&amp;hit12b=&amp;bullet12=true&amp;hit13a=&amp;hit13b=&amp;bullet13=&amp;hit14=true&amp;bullet14=&amp;hit15a=&amp;hit15b=&amp;bullet15a=&amp;bullet15b=&amp;bullet16=true&amp;hit16a=&amp;hit17a=&amp;hit17b=&amp;hit17c=&amp;hit17d=&amp;miss=&amp;newtotal=509815&amp;newhits=699160&amp;newbullets=557703&amp;newh7=10118&amp;newb7=27704&amp;newh9a=3843&amp;newh9b=6179&amp;newh11=23331&amp;newb11=27668&amp;newh12a=28776&amp;newh12b=21063&amp;newb12=41890&amp;newh13a=29409&amp;newh13b=21504&amp;newb13=68362&amp;newh14=165075&amp;newb14=106146&amp;newh15a=52147&amp;newh15b=112507&amp;newb15a=37264&amp;newb15b=37653&amp;newb16=211275&amp;newh16a=52128&amp;newh17a=22263&amp;newh17b=107217&amp;newh17c=28879&amp;newh17d=14118&amp;newmiss=89669&amp;avhonour=8.14&amp;avdistinction=46.07&amp;avservice=37.82&amp;avnone=8.06&amp;avhits=1.37&amp;avbullets=1.09)\n\n&gt;You've just taken a direct hit! Earlier you agreed that it is rational to believe that the Loch Ness monster does not exist if there is an absence of strong evidence or argument that it does. No strong evidence or argument was required to show that the monster does not exist - absence of evidence or argument was enough. But now you claim that the atheist needs to be able to provide strong arguments or evidence if their belief in the non-existence of God is to be rational rather than a matter of faith. The contradiction is that on the first ocassion (Loch Ness monster) you agreed that the absence of evidence or argument is enough to rationally justify belief in the non-existence of the Loch Ness monster, but on this occasion (God), you do not.\n\nIt might be a direct hit, but maybe the test should have asked \"Is there strong evidence to suggest that God exists?\" While I don't believe that any of the evidence supporting the existence of the fabled Loch Ness Monster exists is strong, I believe that there is strong evidence supporting the existence of God. \n\nAt the same time, if a person believes that there is strong evidence to support the lack of a God, then their atheism is rational and not based on faith (as would be the case if a person believed there are no strong arguments or evidence against God and was an atheist anyway.)\n\n&gt;You claimed earlier that any being which it is right to call God must want there to be as little suffering in the world as possible. But you say that God could make it so that everything now considered sinful becomes morally acceptable and everything that is now considered morally good becomes sinful. What this means is that God could make the reduction of suffering a sin... yet You've said that God must want to reduce suffering. There is a way out of this, but it means biting a bullet. So You've got to make a choice: (a) Bite the bullet and say that it is possible that God wants what is sinful (to reiterate the argument here - she must want to reduce suffering; she could make the reduction of suffering a sin; but if she did so, what she wanted (reducing suffering) would be sinful). (b) Take a direct hit and say that this is an area where your beliefs are just in contradiction.\n\nSurely, God could reverse morality if he chose, but there is no rational reason to believe that He would, based on what I understand of Him which I why I was willing to bite the bullet on this one.\n\n&gt;You've just bitten a bullet! In saying that God has the freedom and power to do that which is logically impossible (like creating square circles), you are saying that any discussion of God and ultimate reality cannot be constrained by basic principles of rationality. This would seem to make rational discourse about God impossible. If rational discourse about God is impossible, there is nothing rational we can say about God and nothing rational we can say to support our belief or disbelief in God. To reject rational constraints on religious discourse in this fashion requires accepting that religious convictions, including your religious convictions, are beyond any debate or rational discussion. This is to bite a bullet.\n\nI think this is a given. We cannot empirically 100% prove that God exists. Nor can atheists empirically 100% prove that It does not. \n", "gilded": 0, "created_utc": "1288045120", "subreddit": "Christianity", "score": 4, "controversiality": 0}
{"body": "It would seem to me that logically:\n\nBelief that there is strong evidence for/against God would make a person's belief/atheism rational.\n\nLack of belief that there is strong evidence for/against God would make a person's belief/atheism irrational and entirely faith-based.\n\nPlenty of people believe that there is strong evidence/argument for the existence of a Loch Ness Monster, even when faced with evidence/arguments that suggest otherwise. It might be more accurate to say that they have faith that evidence FOR Nessie is more sound than evidence against, given a lack of conclusive proof. The opposite applies for people who don't think there's any sort of monster in Loch Ness.\n\nReplace Nessie with God in that last paragraph and you've got the crux of the disagreement between theists and atheists.", "gilded": 0, "created_utc": "1288047772", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "&gt; \"Belief that there is strong evidence for/against God would make a person's belief/atheism rational.\"\n\nThis is a tricksy statement, though I'm not implying that you are attempting to be deceptive.  I am saying, though, that you have two non-equal statements packaged together as equivalent.\n\nI'll explain what I mean though.\n\n - Belief that there is strong evidence for God\n\nThis case is clear.  The only question it raises is that of, \"What is your threshold/definition of 'evidence'?\"; but whatever the definition, if someone has what they consider to be 'evidence' that God exist then certainly - the belief in God based upon that evidence is potentially viewable as rational, (only subject to argument over the definition of evidence).\n\n- Belief that there is strong evidence against God\n\nWould in and of itself be an irrational belief given that there is no logically consistent way to 'prove' a negative.  Therefore there can never be any 'strong evidence' for the existence of a negative.\n\nNow.. what I mean by 'negative' in this case is, \"The absence of something\"; and I'll give you a concrete example of what I mean.\n\nLets say that you have misplaced your keys.  You can absolutely prove where they are by simply finding them.  So, if you want to 'prove' that the keys are somewhere in the kitchen, you must find them in the kitchen.  Until you find the keys in the kitchen, you have no proof that they are there.  \n\nHowever, you will never be able to provide 'proof' that the keys are not in the living-room.  This is because no matter how long you search the living room, no matter how much time passes without you finding your keys in the living room, it will always be possible that they are actually there and that you just haven't found them yet.\n\nWhat you can do is disprove a negative.  So.. you can disprove the idea that the keys are not in the living room, simply by finding the keys in the living room.\n\nWhich brings us back to proof for/against God.  Proof **for** God is entirely possible.  This is a positive claim and validation of it is up to God, (eg. he can reveal himself or not).  However, proof **against** God isn't possible.  Even if God doesn't exist, all that could ever be accomplished is increasing confidence that his existence was unlikely, (just like proving that your keys are not in the living room.  It's an imposibility... except in the case of your proving that they **are** in the living room..) .  Or, in other words, the disproof of a negative is the proof of it's testable, positive, anti-thesis.\n\nSo, you can prove a positive and disprove a negative, but not the other way around.  \n\nSo you are looking at the atheist side of things wrong from the start.  It isn't that they feel there is strong evidence or proof against God.  Instead, they feel that in the absence of evidence for God, it is reasonable to suppose he doesn't exist.\n\nIf you are going to understand where atheist are coming from, (the reasonable ones that is), this logical distinction is very important.\n\n&gt; \"Lack of belief that there is strong evidence for/against God would make a person's belief/atheism irrational and entirely faith-based.\"\n\nThe same logical process I discussed above regarding the rationality of a position applies in reverse here.\n\nThe logical position is that belief in anything without adequate evidence requires a retreat to Faith.  The question of weather or not Faith can be seen as rational or irrational is actually a separate argument, (and is highly conditional for the 'rational' category).\n\n&gt; \"Plenty of people believe that there is strong evidence/argument for the existence of a Loch Ness Monster, even when faced with evidence/arguments that suggest otherwise.\"\n\nWhich returns the questions to the core one, which is, \"how are the two sides defining 'evidence'?\"", "gilded": 0, "created_utc": "1288058712", "subreddit": "Christianity", "score": 3, "controversiality": 0}
{"body": "As a professional mythical creature hunter, let me tell you that the loch ness monster wants much more than tree-fiddy.  He wants your fucking life.", "gilded": 0, "created_utc": "1288068086", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Nessie is Scottish. Loch is a Scottish word.", "gilded": 0, "created_utc": "1288136496", "subreddit": "IAmA", "score": -1, "controversiality": 0}
{"body": "THIS!....Now I'd want to know what other wacky stuff she believes in just because it has not been 'disproved'...big foot, loch ness monster, healing crystals, homeopathy....etc.  As someone already pointed out..DO NOT BREED with her.", "gilded": 0, "created_utc": "1288143530", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Way, way late reply, but... This is a reference to South Park, mainly from the episode \"The Succubus\" where Chef's father (who lives in Scotland) tells the boys about his frequent encounters with the Loch Ness monster, who always tries to get a sum of \"tree fitty\" (tree dollars and fitty cents) from them.\n\nhttp://en.wikipedia.org/wiki/The_Succubus", "gilded": 0, "created_utc": "1288167167", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I will do it but I need about tree fiddy.", "gilded": 0, "created_utc": "1288186031", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Only after they cover Big Feets and Nessie.", "gilded": 0, "created_utc": "1288192468", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1288197902", "subreddit": "Frugal", "score": 1, "controversiality": 0}
{"body": "No, you just need to understand the physics behind it. The combination of his angular acceleration, his momentum, and the surface tension of the water allows an average of about 6 jesus-like steps. It's really quite easy with practice. I have been practicing this as well as telepathy for a while now and have nearly perfected both. I'm also the lead researcher on the team studying the Loch Ness Monster.", "gilded": 0, "created_utc": "1288205933", "subreddit": "WTF", "score": 71, "controversiality": 0}
{"body": "I am the Loch Ness Monster. ", "gilded": 0, "created_utc": "1288224116", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Run Demoman! It's the ghost of the Loch Ness Monster!\n\n...and he wants about tree fity.", "gilded": 0, "created_utc": "1288309903", "subreddit": "tf2", "score": 7, "controversiality": 0}
{"body": "god damn it ghost of loch ness monster! i ain't givin you no tree fiddy! ", "gilded": 0, "created_utc": "1288310270", "subreddit": "tf2", "score": 5, "controversiality": 0}
{"body": "F7U12?  Lemme call up my buddy who is an expert in F7U12! [](/troll \"tree fiddy\")\n", "gilded": 0, "created_utc": "1288313066", "subreddit": "fffffffuuuuuuuuuuuu", "score": 11, "controversiality": 0}
{"body": "Nessie is the Royal Reddits rally cry, Nessie is the tune they always sung..", "gilded": 0, "created_utc": "1288352387", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "well he's a communist and that's how [communists do it](http://www.flickr.com/photos/mytripsmypics/2859362481/), and the person who took that photo is European and Scotland is in Europe the home of the loch ness monster, which was featured  on an episode of the Simpson's produced by James L. Brooks who is jewish, if that doesn't prove it's all a new world order conspiracy I don't know what will.", "gilded": 0, "created_utc": "1288364137", "subreddit": "politics", "score": 11, "controversiality": 0}
{"body": "like the Loch Ness monster, always asking me for tree fiddy.", "gilded": 0, "created_utc": "1288370788", "subreddit": "pics", "score": 8, "controversiality": 0}
{"body": "Jack the Ripper was actually...the Loch Ness Monster!", "gilded": 0, "created_utc": "1288371180", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "&gt; \"Eventually there will be observable evidences of God\"\n\nBut you believe now. So RIGHT NOW why do you believe? What is your reason? What do you see or feel that makes you think there is a god?\n\nWith your argument I can say: Eventually there will be observable evidence of the Loch Ness Monster.", "gilded": 0, "created_utc": "1288385706", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Remember, this is a society that thinks that wrestling is real, UFOs only grab rednecks in the desert, Sarah Palin would make a good president, The Loch Ness Monster and Sasquatch are buddies and the earth is only 6000 years old. I'm surprised that even more don't think Obama raised taxes and was born a Muslim in Kenya...", "gilded": 0, "created_utc": "1288396502", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Then we should make a rope of king kongs and loch ness monsters [](/troll)", "gilded": 0, "created_utc": "1288458430", "subreddit": "fffffffuuuuuuuuuuuu", "score": 2, "controversiality": 0}
{"body": "Should work, if the coefficient of friction on the Loch Ness monsters is high enough... [](/melvin)", "gilded": 0, "created_utc": "1288464146", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "Dude...isn't it obvious. It's so obvious...NESSIE! How'd you get to be so small Nessie?\n", "gilded": 0, "created_utc": "1288474170", "subreddit": "trees", "score": 3, "controversiality": 0}
{"body": "Basically, the paleo diet seeks to re-create as closely as possible the dietary conditions in which we evolved as a species, ie, what we ate in the paleolithic era, which ended somewhere between 10,000 and 40,000 years ago. Paleo man was purely a hunter/gatherer/scavenger, and so grains, which were the product of a much later agricultural era, wouldn't have been a regular part of his diet. Both grain and dairy have only been a part of our diets for about the last 10,000 years, which is almost nothing in evolutionary terms. \n\nSo the general idea is that while we may have adapted somewhat to consume grains and dairy, they're not foods we evolved to optimally live on. The wide prevalence of lactose intolerance and the relative commonness of things like celiac disease back this up. ", "gilded": 0, "created_utc": "1288474947", "subreddit": "loseit", "score": 6, "controversiality": 0}
{"body": "x2 for Nessie", "gilded": 0, "created_utc": "1288540668", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "No, that's the Loch Ness monster obviously not a leoploriadon which it appears to be if it were a dinosaur but it isn't.", "gilded": 0, "created_utc": "1288541419", "subreddit": "atheism", "score": 1, "controversiality": 0}
