{"body": "LOL. Did they ride the Loch Ness Monster on their way to kill Grendel's mother?\n\nEdit: It took me a while to realize you were joking. Yes, it's Halloween. Witches, ghosts, goblins, and vikings. They all exist!", "gilded": 0, "created_utc": "1320114921", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "tree fiddy?", "gilded": 0, "created_utc": "1320124111", "subreddit": "appstate", "score": 0, "controversiality": 0}
{"body": "This author is a fucking idiot. His premise is flawed. There are tons of beer guides online. Printing them as books is a bad idea. Maybe printing beer guides would be a good idea back in the paleolithic era, but there are so many beers, and so many new beers get made every year it would never be up to date. By having sites like ratebeer and beeradvocate and the myriad of beer blogs, it's easier for the author to update and the reader to search.", "gilded": 0, "created_utc": "1320165637", "subreddit": "beer", "score": 4, "controversiality": 0}
{"body": "I'd pay tree fitty. ", "gilded": 0, "created_utc": "1320167340", "subreddit": "guns", "score": 1, "controversiality": 0}
{"body": "You keep giving away tree fitty and that goddamn lockness monster is gonna keep coming back!", "gilded": 0, "created_utc": "1320168498", "subreddit": "guns", "score": 1, "controversiality": 0}
{"body": "Cash and a pipe that looks like the loch ness monster and/or a Vaporgenie? Or a nice all white bubbler I paid 40 bucks for? How about an iPhone 3GS or a first model DS? Or some PS3 games? ", "gilded": 0, "created_utc": "1320181219", "subreddit": "EntExchange", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1320208413", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I once came upon a website claiming that the Loch Ness Monster grew wings and flew into the Twin Towers. ", "gilded": 0, "created_utc": "1320215064", "subreddit": "AskReddit", "score": 15, "controversiality": 0}
{"body": "DAMN I AINT GIVING YOU NO TREE FITTY", "gilded": 0, "created_utc": "1320234100", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "Holy shit its the loch Ness Monster!", "gilded": 0, "created_utc": "1320244045", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "\"A few more examples. That the earl of Oxford wrote Shakespeare is pseudoscience. So are the beliefs that Elvis is still alive, Diana was killed by MI5, JFK was killed by the CIA, 911 was an inside job. So are ghosts, UFOs, telepathy, the Loch Ness monster and pretty well everything to do with the paranormal.\"\n\nSanta?", "gilded": 0, "created_utc": "1320253982", "subreddit": "climateskeptics", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1320264584", "subreddit": "gifs", "score": 80, "controversiality": 0}
{"body": "Damn Loch Ness monster!", "gilded": 0, "created_utc": "1320269117", "subreddit": "southpark", "score": 7, "controversiality": 0}
{"body": "Awesome. 1 crate costs about tree fiddy. \n\n\n", "gilded": 0, "created_utc": "1320272356", "subreddit": "promos", "score": 2, "controversiality": 0}
{"body": "First reading the title: \"WTF is an oh-nessie\"\n\nDamn, I'm stupid.", "gilded": 0, "created_utc": "1320277954", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Can I have tree fiddy?", "gilded": 0, "created_utc": "1320278839", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "GOD DAMN LOCHNESS MONSTA YOU AINT GETTIN NO DOMN TREE FIDDY!", "gilded": 0, "created_utc": "1320279610", "subreddit": "IAmA", "score": 50, "controversiality": 0}
{"body": "goddamn loch ness monster!", "gilded": 0, "created_utc": "1320284801", "subreddit": "IAmA", "score": 39, "controversiality": 0}
{"body": "Chef, WHY do YOU need tree fiddy?", "gilded": 0, "created_utc": "1320290120", "subreddit": "southpark", "score": 3, "controversiality": 0}
{"body": "Can i have three fiddy? I have a problem with the Loch Ness Monster.", "gilded": 0, "created_utc": "1320310025", "subreddit": "IAmA", "score": 0, "controversiality": 0}
{"body": "1. Sorry, but you don't get to make claims and then tell other people to go find good research on your behalf. That's not how it works. If you can't be arsed to make intelligent claims backed by credible sources, then I'm certainly not going to be arsed to do the work for you. I'm not the one trying to assert your point. If you want to prove yourself, YOU do it - I'm not the one trying to convince myself Resorting to 'lol i'm not writing an article' is lazy and I'm going to guess you're just another underinformed slacktivist.\n\n2. I glanced over the video footage you offered and it does not offer a clear perspective. It's a lot of running around and camera shaking from one viewpoint. That's not something that shows your point beyond a shadow of doubt. This isn't objective reporting, it's some person with a camera running around from what I can tell. Besides, there are videos that claim to show Nessie, Big Foot, and ghosts. That doesn't mean anything.\n\n3. Wikipedia can be a good source as a general overview of an issue, but when it comes to politics and conspiracy theories, it lacks nuance. Just because it shows up on Wikipedia doesn't mean it's substantiated or true. Wikipedia covers broad topics like conspiracy theories, but does not necessarily examine all the evidence involved. Plus there's the whole thing where it can be edited by anyone.", "gilded": 0, "created_utc": "1320331928", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "god.. i need about tree fiddy", "gilded": 0, "created_utc": "1320362173", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Get out of here Nessie.", "gilded": 0, "created_utc": "1320370674", "subreddit": "leagueoflegends", "score": 1, "controversiality": 0}
{"body": "WHERE YOU AT, NESSIE? I KNOW YOU HERE!", "gilded": 0, "created_utc": "1320374243", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Leprechauns are associated with pots of gold and rainbows. Dragons are associated with caves. Yetis are associated with snowy mountains. The loch ness monster is associated with loch ness. Non-existant things are just as capable of association with real things as real things are to real things.", "gilded": 0, "created_utc": "1320380232", "subreddit": "starcraft", "score": 1, "controversiality": 0}
{"body": "Ah, I see.\n\nI didn't realize that while the Loch Ness monster is fully capable of association with, and is in fact associated with Loch Ness, that association is not \"inherently implied.\"\n\nI also didn't realize that while ghosts are fully capable of association with cemeteries, and are in fact associated with cemeteries, that association is not \"inherently implied.\"\n\n/sarcasm", "gilded": 0, "created_utc": "1320381788", "subreddit": "starcraft", "score": 1, "controversiality": 0}
{"body": "The association of the Loch Ness monster with Loch Ness is not implied, you fucking retard. It's explicit. Jesus Christ, you're stupid. I tried to explain it to you and just let you be on your way, but no, you had to make your stupid ass, invalid response.", "gilded": 0, "created_utc": "1320381895", "subreddit": "starcraft", "score": 1, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1320385841", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "That's not how it happened.\n\nHe was accused, and an investigation was started by a temporary prosecutor because it was a weekend and the ordinary one was not on call. When the ordinary prosecutor returned, she dropped **one** of the points. The womens' lawyer applied for it to be lifted again, and it was, all this within days. Assange then a while (a month or so I think) later, Assange left, having been unreachable for a week before. During this week, the prosecution was looking for him for questioning. Assange had been given permission to leave, this is true, but it was always with the understanding that he would return. Assange is currently holding gout in the UK, doing his best not to return for questioning. If that's not running away, then nothing is.\n\nAny \"rumours\"  about visits from US representatives are as unsubstantiated as documented sightings of the loch ness monster. It's nothing more than conspiracy theories at this stage.\n\nIt seems like you are not that informed about this case. I can understand if you're having a knee-jerk reaction if your idol is being accused of a crime, but try to keep a level head and think for yourself a bit.", "gilded": 0, "created_utc": "1320401695", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Loch Ness Monster\n", "gilded": 0, "created_utc": "1320408335", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1320415217", "subreddit": "Autos", "score": 2, "controversiality": 0}
{"body": "What you describe is the broad category of natural foods, which could apply to almost any diet centered around nutrition. What defines the Paleolithic diet for most people is its exclusion of half the foods people normally eat today, including all grains (even \"healthy\" ones like oat, bran) , legumes, most dairy, most sugar, etc... Natural, locally sourced bread would be shunned by adherents of Paleo. \n\nThe name itself gives away what the diet is about. In general: if humans didn't eat the food in the Paleolithic era, don't eat it now. ", "gilded": 0, "created_utc": "1320431166", "subreddit": "food", "score": 2, "controversiality": 0}
{"body": "My son has been watching a lot of Scooby Doo movies and most of the newer animated ones do not have real monsters.\n\nIf anyone cares, I shall now spoil a bunch of direct-to-video Scooby-Doo movies by classifying them as having real monsters or not:\n\n Title                                    | Year | Real monsters? \n:-----------------------------------------|:-----|:-----------------------\nScooby-Doo on Zombie Island               | 1998 | Yes\nScooby-Doo and the Witch's Ghost          | 1999 | Yes, but also fake ones\nScooby-Doo and the Alien Invaders         | 2000 | Yes, but also fake ones\nScooby-Doo and the Cyber Chase            | 2001 | Haven't watched it\nScooby-Doo! and the Legend of the Vampire | 2003 | No\nScooby-Doo! and the Monster of Mexico     | 2003 | No\nScooby-Doo! and the Loch Ness Monster     | 2004 | No\nAloha, Scooby-Doo!                        | 2005 | No\nScooby-Doo! in Where's My Mummy?          | 2005 | No\nScooby-Doo! Pirates Ahoy!                 | 2006 | No\nChill Out, Scooby-Doo!                    | 2007 | No\nScooby-Doo! and the Goblin King           | 2008 | Yes\nScooby-Doo! and the Samurai Sword         | 2009 | No\nScooby-Doo! Abracadabra-Doo               | 2010 | No\nScooby-Doo! Camp Scare                    | 2010 | No\nScooby-Doo! Legend of the Phantosaur      | 2011 | No\n", "gilded": 0, "created_utc": "1320431651", "subreddit": "skeptic", "score": 24, "controversiality": 0}
{"body": "Oh, those things. If Bigfoot existed I'd assume it's just some sort of evolutionary anomaly. Same with any creature, i.e. the Loch Ness Monster. As for ESP, I don't believe in psychic powers, as awesome as that would be. And of course spontaneous human combustion exists! It's how I plan to die.", "gilded": 0, "created_utc": "1320439613", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "yea, uhh, I need about tree fitty.", "gilded": 0, "created_utc": "1320461654", "subreddit": "arizona", "score": 1, "controversiality": 0}
{"body": "Science assumes god does not exist until evidence supports his/her/its existence (just like until proven otherwise science assumes unicorns, leprechauns, bigfoot, and the Loch Ness Monster don't exist).\n\nTherefore until proven otherwise, science's default position on god(s) is atheism.", "gilded": 0, "created_utc": "1320501557", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "try the candy shop, bring tree fiddy.", "gilded": 0, "created_utc": "1320512310", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "The Loch Ness monster shows up", "gilded": 0, "created_utc": "1320526566", "subreddit": "YouShouldKnow", "score": 6, "controversiality": 0}
{"body": "Loch Ness Monster.", "gilded": 0, "created_utc": "1320533810", "subreddit": "YouShouldKnow", "score": 10, "controversiality": 0}
{"body": "&gt; Atheists are not required to show any evidence. The entire burden of proof is on Theists.\n\nYes. What would you say if I tell you I believe in a magical unicorn and tell you you must believe in it too because I have a 2000 year old book about a magical unicorn here with me. Richard Dawkins is an agnostic. All atheists are agnostic. Agnostism is knowing that nothing can be known 100%. I am an atheist in that I assume, through repeatable tests, that if I drop my pen it will fall. I am agnostic in that I am not 100% sure that my pen will fall if I drop it countless times. But agnostism is a red herring. That's why you see people calling themselves agnostic atheist. That's the same as an atheist.\n\n&gt; I will only except evidence using the scientific method, so logical arguments, and appeals to experience don't count.\n\nLet's get this straight. You're saying scientific method is not a good method to discern things around us? Here's a definition of scientific method for you: [scientific method](http://en.wikipedia.org/wiki/Scientific_method):\n\n&gt; \" To be termed scientific, a method of inquiry must be based on gathering empirical and measurable evidence subject to specific principles of reasoning. \"\n\n&gt; \" Scientific researchers propose hypotheses as explanations of phenomena, and design experimental studies to test these hypotheses via predictions which can be derived from them. These steps **must be repeatable**, to guard against *mistake* or *confusion* in any *particular experimenter*. \"\n\nShow me any evidence from the people who write the articles for 'evidence' that their claim follows the scientific method, and is therefore scientific and I can accept. Please, if the scientific experiments was valid, it would be repeatable, and scientists would repeat it. Trust me, if what science is doing is flawed in any way, the person who points it out will win the nobel prize.\n\nedit: **So can we agree that you ignore the 'scientific method' in reaching your conclusions?**\n\nLogical arguments? *Give me a logical argument that creationists use*. In fact, I'll tell you one. The earth is round. The bible states the earth is round. Therefore, the bible is true. God is true.\n\nThis is *not* logic. Certain observations in the bible is true, but it does NOT provide logical evidence that the bible is the word of god. Just because some of it is true does not mean the rest of it is.\n\nSo let's get one thing straight: **You believe that you can reach justified conclusions through experience, as you cannot show scientific evidence (that is repeatable) that God exists.**\n\nI am not disagreeing. If God spoke to you, if you touched God, sure. You are TOTALLY JUSTIFIED in believing in God, and I will not argue with you.\n\nHowever...\n\nThe experience that one person feels that leads to his belief does not justify another person needing to believe in the same thing, because that is *blind faith*, as the 2nd person has not had the 'experience'.\n\n&gt; Theism is not a physical science, so there are no proofs using the scientific method.\n\nYes I agree. It is not a science at all, let alone physical science. Conclusions in science is based on scientific method, so yes I agree.\n\n&gt; Theism must not be true.\n\nI disagree. There is no proof of God's existence, but like all Atheists, I accept the fact that nothing EVER is 100% known. The lack of evidence POINTS me to the lack of a God, but no one will know. Like I said, 'absolute' truth is a red herring, and it is also wrong for theologists to 100% KNOW that there is a God, because nothing is absolute.\n\n----------------------------------------------------------------------\n\nMy flaws in the argument that you pointed out to me.\n\n&gt; The burden of evidence (for proof will probably be beyond everyone's grasp) is on both Atheism and Theism. You are not an agnostic, or a passive weak atheist, so I think you have the same level of burden as I do.\n\nFirst do you agree with what you're saying, that **There is no physical, scientific evidence for God, but atheists require evidence to show that God doesn't exist?**\n\nAnd you say theology has logic? I agree totally many theologists provide logical arguments, but this is not one.\n\nLook at my *Bigfoot example*, *magical unicorn* example. Atheists don't need evidence. Speak with your pastor about it. Look at debates. Creationists DO NOT ask Atheists for evidence that no God exists, because, for the hundreth time, **HOW CAN YOU PROVIDE EVIDENCE OF SOMETHING THAT DID NOT EXIST?** \n\nSorry I wrote that in caps, but you don't seem to understand this. You're saying that those that believe in the Loch Ness monster and Big Foot are on equal footing in terms of evidence as those that don't believe in them? That you must listen to the believers of UFO as much as those that don't believe in UFOs? If you do, then we'll end this argument here.\n\nWithout evidence for God, what makes you think you're religion is right and Islam, Hinduism, Buddhism are any further from the natural truth? Without evidence, it's your word against theirs. You have scientific evidence? SHOW ME. Scientific evidence needs to stand up to the scientific method btw (repeatable, etc)\n\n2nd flaw in my argument you said:\n&gt; Logical arguments are valid and useful, even if they are not scientifically reviewed. They are powerful tools for discerning between world views.\n\nOf course logic is a powerful tool. Like I said above, *show me* a 'logical' argument from a creationist standpoint and I'll show you why it's not logical. If there are any arguments I disagree with, I'll go through their 'logic' and show you what I disagree with, and we can discuss from there.\n\nThere is no use us discussing whether or not creationists claims are scientific, or logical, if you don't bring forth any creationists claims we can discuss. \n\n---------------------------------------------------\n\nSo am *I* getting it right? Do you know see the flaws in *your* argument?\n\nI point out the bigfoot/ UFO/ unicorn examples as to why we don't need to show evidence for something that does not exist, but you're ignoring half the points I'm making. At least I'm answering all of yours.\n", "gilded": 0, "created_utc": "1320540641", "subreddit": "DebateAChristian", "score": 1, "controversiality": 0}
{"body": "r/Paleo concerns the paleo diet.  Wikipedia explain it thus: The dietary regimen known as the Paleolithic diet, popularly referred to as the caveman diet, Stone Age diet and hunter-gatherer diet, is a nutritional plan based on the presumed ancient diet of wild plants and animals that various human species habitually consumed during the Paleolithic era.  Centered on commonly available modern foods, the \"contemporary\" Paleolithic diet consists mainly of meats, fish, vegetables, fruit, roots, and nuts, and excludes grains, legumes, dairy products, salt, refined sugar, and processed oils.  \n\nr/keto is for people on a ketogenic diet.  A ketogenic diet restricts the consumption of carbs in favor of fat and protein.  When carbs are restricted, the body enters a state of ketosis, burning ketone bodies instead of glucose.\n\nBoth diets are very high in meat and very low in food created from grain.", "gilded": 0, "created_utc": "1320600138", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "I perfer the term 'Cannabis Connessieur'", "gilded": 0, "created_utc": "1320601616", "subreddit": "trees", "score": 12, "controversiality": 0}
{"body": "The Loch Ness monster!", "gilded": 0, "created_utc": "1320616518", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "And I told dat loch ness monster to go away!", "gilded": 0, "created_utc": "1320620932", "subreddit": "nfl", "score": 1, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1320620950", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Agreed, the sun both \"shining\" and \"hitting my face\" are redundant.  If it's hitting your face, it's shining.  Personally, I would change Nessie's suggestion to:\n\n&gt;\"I awoke to sparrows chirping loudly, with the sun hitting my face through the bedroom window .\"\n\njust because I don't like the way the word \"my\" was used twice in close proximity.", "gilded": 0, "created_utc": "1320623694", "subreddit": "grammar", "score": 4, "controversiality": 0}
{"body": "I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Git your own goddamn money!", "gilded": 0, "created_utc": "1320626919", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "I do very well with grenade launcher, chargin targe/splendid screen, and my nessie Nine iron. Once I get four heads, I move so faaaaaaaast...", "gilded": 0, "created_utc": "1320637224", "subreddit": "tf2", "score": 1, "controversiality": 0}
{"body": "tree fiddy. http://www.youtube.com/watch?v=B4C96ZTJIhU", "gilded": 0, "created_utc": "1320646492", "subreddit": "skyrim", "score": 1, "controversiality": 0}
{"body": "I'd give him tree fiddy.", "gilded": 0, "created_utc": "1320655871", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt; I'm discounting from this any obvious trolls such as WBC, I'm talking about your average Christian on this sub, for example.\n\nSo, first of all, the question is whether groups like the WBC would exist without religion. Given that they currently base their agenda entirely on their religion, it's an interesting question -- are there any members of the WBC who aren't actually homophobic, but genuinely do believe it's a sin?\n\nIf so, then this is an example of why Hitchens is antitheist. Good people can do good things with or without religion, and evil people can do evil things with or without religion, but it takes something like religion to make good people do evil things.\n\nIf your point is that the WBC isn't Christian, then that's a no true scotsman -- if I'm right and there are some WBC-ers who genuinely aren't homophobic and really do believe \"I don't hate them, God hates them,\" then we can trace the cause of something like the WBC back to something nearly all people who self-identify as Christians have: Faith. If they didn't have faith that the Bible is true, and their interpretation of it is correct, then they couldn't believe God hates fags.\n\nBut that's what you have, isn't it? Faith that the Bible is true, and that your interpretation of it is correct.\n\nTo answer your more general question:\n\n&gt; ...I wonder what aspects of faith that you believe it to be an actual danger?\n\nFaith itself is dangerous. Faith, in this context, means believing something without sufficient evidence and often in the face of evidence to the contrary. If faith means something different to you, please explain what it is.\n\nThere's nothing stopping me from having faith in anything. The WBC is an example of this -- I could have faith that God hates fags. The 9/11 hijackers are a better example -- I could have faith that Allah wants me to kill the infidels, and that I'll be rewarded with 72 virgins in Heaven. This is also pretty much the definition of gullibility -- if I asked you to PM me your credit card info, if you had *faith* that I'd do nothing evil with them, then you'd be a gullible fool.\n\nNote the difference between \"Faith\" in this context and \"faith\" in the context of \"I have faith in you.\" If you knew me well enough, you might well \"have faith in me\", and *trust* me to handle your bank account details properly. But in that context, you have *evidence* that I've been trustworthy in the past. Atheists typically like to use the word \"trust\" to refer to this kind of faith, to distinguish it from Faith in the religious sense.\n\nI would hope, now that we've made this distinction, that you agree with me that Faith in something that isn't true can be a Bad Thing.\n\nHow do you know what is true?\n\nIt doesn't make sense to use Faith, because you're trying to decide what to have Faith in to begin with, and you end up back where you started. The WBC *knows* that it's *true* that God Hates Fags, because they have Faith that it's true. You have Faith that they're wrong, but they have Faith you're wrong.\n\nWhat most atheists use, and what most Christians use for *everything but* religion, is some flavor of empiricism. We know that the Earth is round, not because the Bible says so (it arguably says the opposite if it says anything), but because we *observe* that maps are generally consistent with the world, and that ships going over the horizon disappear bottom-up, and that [shadows are different in different places](http://en.wikipedia.org/wiki/Eratosthenes#Eratosthenes.27_measurement_of_the_Earth.27s_circumference), and that it not only looks round from space, but anyone in orbit has flown completely around the Earth and seen it as a sphere from all sides. We know that Evolution is true, not because Darwin said so (he was in fact wrong about many of the details), but because [the evidence is overwhelming](http://www.talkorigins.org/faqs/comdesc/) -- or, if we haven't looked into such evidence ourselves, because we've generally seen that scientists know about evidence, so when pretty much every biologist tells us that the evidence is overwhelming, we have good reason to believe them.\n\nIf you know something is true because of evidence like that, then you don't need Faith to believe it, and you might not even call it Faith. In fact, while it's fair to doubt something before you really understand the evidence, I think that once you really look into something like the shape of the Earth, you'd need Faith to doubt it.\n\nIf you don't know that it's true, then unless you have Faith, you don't believe it. You probably don't have Faith in UFOs, Bigfoot, the Loch Ness Monster, or any number of other things, because you honestly don't know one way or the other.\n\nWith things like this, Faith is mostly harmless, but it is problematic because Faith is tenacious. For example, it used to be believed that homosexuality was a mental disorder. It's only fairly recently that it's become apparent that it isn't. If your belief that homosexuality is a disorder was based on evidence, then the refutation of that evidence should change your mind, and you'd accept gays. If your belief that homosexuality is a disorder was based on Faith, on the idea that homosexuality is a sin, then you will hold onto that belief despite evidence to the contrary, and you'll become the WBC, or at the very best, Exodus International (which has repeatedly been shown to be harmful to the mental health of the people they try to \"help\").\n\nThis is probably made overly long because of all the real-world examples, but I hope I've made the case that believing things without sufficient evidence is a Bad Thing. Religion makes a virtue of this and calls it Faith. That is why I'm against any religion which advocates Faith -- there are religions which don't, but Christianity overwhelmingly does.", "gilded": 0, "created_utc": "1320687870", "subreddit": "DebateAChristian", "score": 4, "controversiality": 0}
{"body": "He saved you from Nessie, too. Guy deserves a medal.", "gilded": 0, "created_utc": "1320691824", "subreddit": "videos", "score": 5, "controversiality": 0}
{"body": "Have any of you heard of deism, a belief in a being/race/'God' which could create a universe but that they would not care about the intelligent life in the universe it/they created, this is my own belief in 'God' which fits in nicely with all that i have mentioned. Also on a similar note do you really believe that a 'God' would let humans live today when there is so much hate, poverty and death in this world not to mention the fact we are killing it slowly to an extent which will force life in the seas to die out because of a too higher PH level. On a similar note does anyone believe in Aliens? or how about Big Foot? witches perhaps? maybe even loch ness monster?", "gilded": 0, "created_utc": "1320698608", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "about tree fitty\n\nedit: three to tree", "gilded": 0, "created_utc": "1320698952", "subreddit": "WTF", "score": 13, "controversiality": 0}
{"body": "Reality is known to be hostile to fantastical claims. If some guy believes in the loch ness monster, it's socially acceptable to call him a crank. If he believes the loch ness monster created the universe, it's socially acceptable to call him insane. If he believes a being with an irrational dislike of foreskins created the universe...  suddenly his beliefs are precious snowflakes and you can't say they're ridiculous because it would be *rude*.\n\nI don't get it. Help me understand.", "gilded": 0, "created_utc": "1320704472", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "its easy to flee from Nessie, you just need about $3.50.", "gilded": 0, "created_utc": "1320718725", "subreddit": "videos", "score": 3, "controversiality": 0}
{"body": "First and foremost you CANNOT \"KNOW\" god exist anymore than I \"KNOW\" the Loch Ness monster exist. You can believe it to be completly true deep in your heart but that does not mean you know in any way, I'm sorry.\n\nSecondly, in order to answer a yes or no question...... you have to answer the question with a yes or no, incredibly simple yet not a surprise for someone who can't propery understand the definition of the word \"know\" to comprehend. And it's one thing if you can't entertain the idea of your religious view being wrong rather than just saying no, but to try and defend that crap that you posted as a answer should be embarrassing because its sure as hell offensive for you assume this community is stupid enough to accept that as an answer.", "gilded": 0, "created_utc": "1320719606", "subreddit": "Christianity", "score": 0, "controversiality": 0}
{"body": "I ain't giving you no **tree**-fitty you goddamn Loch Ness monster", "gilded": 0, "created_utc": "1320743173", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "how much does it cost to make a woman love you chef? well, about tree fiddy.", "gilded": 0, "created_utc": "1320757925", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Here's why the coelacanth (or any cryptid) is an inaccurate comparison:  Lost or mysterious animals can hide.  The planet is a pretty big place, and we can't see everywhere at once.  The oceans are absolutely huge, and we've only ever seen a couple percent of them.  At any one time, we're only looking at a miniscule fraction of a percent.  We still can't *conclusively* rule out the existence of the Loch Ness monster, simply because it's so hard to see what is (or isn't) in the comparatively small lake.\n\nYet god is supposed to be *everywhere*.  You shouldn't have to go looking for a truly \"omnipresent\" deity.  If god really touches all aspects of reality, then evidence should not only be abundant, but inescapable.  Yet no evidence has ever been found - and certainly not for lack of trying.\n\nWe can certainly rule out the existence of the christian concept of god due to overwhelming lack of evidence.  There could still be some sort of god hiding somewhere, but if so, it is nothing like what modern theists believe.  And without any evidence as to what this shy god is actually like, any theory is going to be pure fantasy.", "gilded": 0, "created_utc": "1320761951", "subreddit": "DebateAnAtheist", "score": 1, "controversiality": 0}
{"body": "I'll give you tree fiddy for em.", "gilded": 0, "created_utc": "1320765516", "subreddit": "magicTCG", "score": 6, "controversiality": 0}
{"body": "&gt;By choosing this belief system, you restrict yourself.\n\nAgain, I only restrict myself from things that don't have evidence. This includes, but is not limited to, religion, little green men, faked moon landings, floating teapots in space, dragons in my garage, unicorns, goblins, ogres, hobbits, wizards, vampires, werewolves, zombies (though some ants can become zombified, so I do believe in those), Santa Claus, the Tooth Fairy, and the Loch Ness monster. The fun part about science is the fact that if evidence is found to support one of these things, it moves from disbelief to belief. My beliefs aren't set in stone before I'm old enough to speak. I don't have to adjust the facts of the world to match my beliefs because I instead adjust my beliefs as I receive more facts.\n\nI mentioned that we use critical thinking and evidence assessment in making decisions in a court of law. Being religious would be the equivalent of my parents telling me that the defendant shot the victim, giving me a story that said the defendant shot the victim, and me making my decision on that alone. Requiring evidence and basing my conclusion on the facts instead of the other way around would allow me to hear testimony from eye witnesses, see scientific proof that the defendant was in a different time zone when the shooting occurred, and then decide what I believe. There's a reason we go with the second method over the first.\n\n&gt;What I see is that your critical of others including belief in things that you restrict yourself from.\n\nNo more critical of someone believing in religion than someone who believes in Santa Claus, the Tooth Fairy, or magic. If there were three billion people participating in the worship of Santa Claus, I'd be pointing out to them that their belief doesn't have evidential backing as well. Fortunately, only a bunch of kids believe in him, and as they get older and develop some basic critical thinking skills, they recognize that he's not real. Usually their parents inform them as well. They neglect to do the same with religion.\n\n&gt;The justifications of reason and logic don't justify the condescension such a critique requires.\n\nI want you to take a minute to imagine the scenario I'm going to present to you. Truly think about it.\n\nHow would you look at and treat someone who believed Santa Claus was real and tried to convert you to that belief? How would you look at them if they thought you were going to burn in hell for all eternity if you didn't believe in Santa Claus? How about if they talked daily about how Santa had saved them and thanked him for things like finding their keys? How about if they prayed to Santa? Ignored the fact that Santa disregards all the starving children throughout the world and instead helps their local pastor drive a Cadillac? If they prevented people you knew, consenting adults, from getting married simply because Twas the Night Before Christmas didn't allow it? If they tried to get schools where your kids attend to start having worship services and teacher-led prayers towards Santa? If they printed \"In Santa We Trust\" on every public building, included a prayer to him in the national anthem that was said at every sporting event and every day in school, and had the most powerful lobbying groups in a Congress that featured a belief rate of over 98% in Santa? If the countries of the world fought wars and killed hundreds of thousands of people every decade over whether Santa Claus, the Easter Bunny, or the Tooth Fairy was the right religion? And then, after all that, they told you that you were evil, had no morals, and were trying to take over and destroy your home city, state, and country.\n\nNow, think of all the evidence you have to not believe in Santa Claus. Would you be condescending if 95% of the rational adults you meet and interact with on a daily basis based a significant portion of their lives on their belief that Santa Claus is real? Would you then laugh when someone told you that your lack of belief in Santa Claus, with all the evidence you have to not believe in him, was restrictive? I would. I do.", "gilded": 0, "created_utc": "1320771038", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "Tree Fiddy", "gilded": 0, "created_utc": "1320784720", "subreddit": "atheism", "score": 7, "controversiality": 0}
{"body": "Aww, I gave you some arguments you couldn't rationalize, so you just ignored them. That's so sweet. It's like you're going for a participation trophy.\n\nHow do you know your state will make consensual sexual activity between two males illegal in your state? Do you think Rep. Paul would force the legislation? Do you also believe that the Loch Ness Monster will rise from the grave and cause the apocalypse? Those two beliefs seem to have the same base in reality.\n\nAlso, in the current system... No! You can not in fact sodomize all you want. That was the point of my prior argument. You keep saying \"All this shit is going to happen because of PAUL, man!\" When in reality... that shit has been happening for years.\n\n&gt;They can stop right now, but they don't.\n\nStates have tried to stop enforcing laws pertaining to drugs like marijuana for a while. The federal government pressures them into taking away legislation before it even hits the voting floor. Hell, the federal government told California they're not even allowed to broadcast the locations of medical marijuana dispensaries anymore.\nThe BATFE has told many states many times that it is illegal for them to legalize marijuana because it is illegal on the federal level.\n\nPointing out the logical fallacies of your argument is not a straw man. This time, if you're going to ignore my arguments, just don't respond.", "gilded": 0, "created_utc": "1320789259", "subreddit": "Libertarian", "score": 2, "controversiality": 0}
{"body": "Pretty sure the Sugar Maple predates the paleolithic era by a lot.", "gilded": 0, "created_utc": "1320793241", "subreddit": "fitnesscirclejerk", "score": 2, "controversiality": 0}
{"body": "Little did you know that crazy broad just saved your life. That cashier was about to ask you for tree fitty. Do you know what would have happened if you would have given him tree fitty? DO YOU?", "gilded": 0, "created_utc": "1320806832", "subreddit": "fffffffuuuuuuuuuuuu", "score": 8, "controversiality": 0}
{"body": "there was a time, in the paleolithic era, when one such creature kept requesting three dollars and fifty cents. . . ", "gilded": 0, "created_utc": "1320816666", "subreddit": "AskReddit", "score": 879, "controversiality": 0}
{"body": "I need about tree fitty", "gilded": 0, "created_utc": "1320819004", "subreddit": "AskReddit", "score": 358, "controversiality": 0}
{"body": "&gt;tree fiddy\n\nFTFY", "gilded": 0, "created_utc": "1320820231", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1320824002", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I ain't givin' no lochness monster no tree fitty...", "gilded": 0, "created_utc": "1320832553", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "You god-damn Loch Ness Monster! You done followed me here on Reddit. Ain't no way you gonna get no tree fity!!!", "gilded": 0, "created_utc": "1320838472", "subreddit": "AskReddit", "score": 13, "controversiality": 0}
{"body": "It was about that time I realized the little girl was a giant monster from the paleolithic era. I said \"godDAMNIT monster, get off my front porch!\"", "gilded": 0, "created_utc": "1320842207", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "it was about that time that this girlscout was actually seven stories tall, and looked just like the loch ness monster. i say DAMN YOU LOCH NESS MONSTER!", "gilded": 0, "created_utc": "1320843571", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I'm not sure if it's peated malt, but it's definitely made from whisky malt: [Eggenberg Mac Queen's Nessie](http://beeradvocate.com/beer/profile/285/1831)\n\nThe [Bloed Zweet en Tranen from De Molen](http://beeradvocate.com/beer/profile/11031/46426) definitely has english peat smoke malts as well as Bamburg smoke malts.\n\nWe currently have a key keg of the latter on at work and it's wonderful. If you like peaty whisky, you'll love it. The nose is 100% Bamburg smoke malt but the taste is just peaty with a nice sweet finish. Reminds me of heavily peated Ardbeg.", "gilded": 0, "created_utc": "1320845396", "subreddit": "beer", "score": 1, "controversiality": 0}
{"body": "IT WAS DAT GODDAMN LOCH NESS MONSTER!!!!!", "gilded": 0, "created_utc": "1320845834", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I can surgically repair your countenance for about tree fiddy.", "gilded": 0, "created_utc": "1320846955", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Looks like you got a pretty nasty infestation in your sink there. I can get rid of that for you for about tree fiddy.", "gilded": 0, "created_utc": "1320847086", "subreddit": "aww", "score": 0, "controversiality": 0}
{"body": "What you talkin about tree fitty?", "gilded": 0, "created_utc": "1320850145", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "\n&gt; I am arguing that one doesn't have a reason to.\n\nReasons are again a matter of opinion. I certainly have reasons, just as you have reasons for doing what you think pleases God. People can have plenty of reasons outside of belief in a deity. Your religion has taught you exactly the opposite, which is why that’s so hard for you to accept.\n\n&gt; I don't.\n\nExcellent!\n\n&gt; When did I deny that there were societal values that encourage prosperity?\n\nI must have misunderstood you then – what exactly are those societal values again, specifically, and how do they contribute to prosperity?\n\t\n&gt; This is an actual study supporting what I said.\n\n*Sigh* :P  That paper is limited to the US and European countries, and finds a correlation, as we’ve already noted exists. [Far broader studies find no causal relationship]( http://www.un.org/esa/population/publications/completingfertility/completingfertility.htm). Once you control for religion, it’s clear it is not a causal factor. \n\nNon-religiousness tends to correlate with the factors indicating low birth rate (higher age of marriage, low mortality for both child and mother, higher education, economically involved women, access to contraception, etc). A religious population sharing those same factors is about as likely to have a low birth rate. Religion has nothing to do with it (unless of course their religious beliefs affect any of the factors directly, such preventing women from economic participation, using contraception, waiting to marry, going to school, pushing them to have babies, etc).\n\nHigh birth rates have been a global concern and an intensively studied topic for nearly a century. We have quite complete data on what causes it, as well as long term observations of the results of different approaches to confronting it. There’s simply no debate on this, sorry. Religiousness itself has virtually no causal relationship with birth rate. \n\nAgain:\n\n“the single universal factor affecting fertility rate decline is mortality decline, **regardless of** race, **religion** or political context. Extrapolated from this sole factor of mortality, there are other universal factors effecting fertility rates, **regardless of** race, **religion** or political context. This **well-proven and exhaustively studied group of factors** has affected the population policy of all UN member nations” 1. Female age at marriage. The younger the female at first marriage, the higher the rate of fertility and vice versa. 2. Female literacy and education. The higher the female education, the lower the fertility rate. 3. Female mortality rates in childbirth and infant/child mortality. The higher the rates of death in childbirth, and crude infant or child deaths, the higher the crude fertility rate. 4. Female economic participation. The greater the female participation in any form of economic activity or capacity, the lower their fertility. 5. Access to contraception.””\n\n&gt; You're incorrect in all accounts.\n\nNope. I understand you don’t want to accept the evidence indicating a causal relationship with the factors listed, rather than religiousness, and for some reason are fixated on the odd idea that non-belief in a deity itself prevents women from having babies. You also think that massive ever-increasing populations of Mexican descendants and native-born Americans living together in the US would somehow be great for the country. Odd. I’m at least glad you have these opinions and consider the consequences. I think you’ll eventually reason them through more practically.\n\n&gt;Argument from Ignorance\n\nI’m afraid your repeatedly stating “argument from ignorance” doesn’t make it so (again I neither make nor deny any claims, which is a requirement of the argument from ignorance), and certainly doesn’t provide a reason to believe in a deity, or anything else for which there is no evidence whatsoever.\n\n&gt; When will you learn that absence of evidence has no correlation whatsoever to the likelihood that something is true or not?\n\nIt does, particularly if it’s something you’d expect to find evidence of and have searched for evidence. If you’re looking for the Loch Ness Monster – a massive sea creature in a lake, which should be easy to find without even trying – and you can’t find any evidence it exists after combing the lake with every resource available, it becomes pretty unlikely that the Loch Ness Monster exists. However some people may want to believe so bad that even if you drain the lake and point they would still \"believe\". Same with a deity.\n\nIncidentally, your position is in fact the argument from ignorance – you’re asserting that a proposition is true because it has not yet been proven false. Unless you’re not claiming it’s true there is a God…\n\t\t\n&gt; Secular humanists preach genocide. Do you share their ideas?\n\nI didn’t know that and find it surprising. Nope, definitely against genocide. Didn’t really look into it, but I’ll take your word for now. I don’t really need to have a label, but it’s just annoying being lumped in with a bunch of others that I may have little in common with other than a lack of belief in a deity. I guess I’ll stick with thoughtful non-believer, for now.\n\n&gt; So, all your moral judgements are all a matter of opinion. \n\nYour favorite question, yet again. Yes, all of our moral judgments are essentially a matter of opinion, just as is your opinion of whether or not you should do what you think pleases God. The difference is a matter of considering the consequences and caring about them.\n\n&gt; An opinion that you have no way to substantiate as correct? Did I get that right?\n\nDefine “correct” – that’s also a matter of opinion, just as when you say “better”. I have an opinion of “correct” and “better”, but you claim not to. Without an opinion you can have no arguments to support your opinion - you have simply nothing. State an opinion on that first and we can discuss. Otherwise, you simply have nothing to think about here.\n\n&gt; What you want to say is that there aren't fundamental moral truths. \n\nYes, that’s exactly what I mean. I thought it was obvious we weren’t discussing whether 1+1 actually equaled 2.\n\n&gt; And then I would have to disagree since wecan recognize evil when we see it. Even a six month old child can recognize evil when he sees it. How can it be not fundamental?\n\nIn this case you would ask “why does that make it fundamental?” I find that pointless and unproductive and prefer to give it a thoughtful opinionated response. \n\nIn one sense I agree - as I mentioned previously, there are certainly things that seem to be universally accepted truths. There are things that are natural, like caring for one’s children, family, community and society. Then there are still other things that personally I find to be fundamentals of my world view and opinions.  However, they’re only a product of our society, experiences, education, environment, biology, etc. Importantly in my opinion, unless we take care to act in ways which produce productive individuals and societies and spread positive ideas, the society will fail, while those individuals and societies that do a better job will succeed. That’s something I care about, but of course it’s only my opinion. Those that don’t care about such things (as you claim to care very little) will likely also belong to societies that fail, which is why I argue for thoughtfully caring about the consequences of one’s actions.\n\n", "gilded": 0, "created_utc": "1320854778", "subreddit": "DebateReligion", "score": 1, "controversiality": 0}
{"body": "It was at about that point that I realized **HAMMER_HEAD_SHART** was a seven story tall crustacean from the paleolithic era...", "gilded": 0, "created_utc": "1320862182", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Tree fitty!", "gilded": 0, "created_utc": "1320881982", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "God damn loch ness monster!  You ain't gonna get no tree fitty!", "gilded": 0, "created_utc": "1320885453", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Tree fitty men. It never gets old for me.", "gilded": 0, "created_utc": "1320885606", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "i need about tree fitty!", "gilded": 0, "created_utc": "1320892277", "subreddit": "AmericanHorrorStory", "score": 2, "controversiality": 0}
{"body": "Is that so? Then I challenge you to disprove that fairies, dragons, leprechauns, Bigfoot, the Loch Ness Monster, UFO's and The Flying Spaghetti Monster are real. The burden of finding the proof is carried by you, right?\n\nOr maybe I'm right and the burden of proof is on the one who makes the claim (Hint: I am)\n\nHere's the thing about Christians and spiritualists: They have zero scientific evidence to support their claims. And in the pursuit of the truth about the nature of the universe, that's literally the only thing that matters.", "gilded": 0, "created_utc": "1320893312", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Tree fiddy. ", "gilded": 0, "created_utc": "1320897559", "subreddit": "fffffffuuuuuuuuuuuu", "score": 12, "controversiality": 0}
{"body": "\"I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!\"", "gilded": 0, "created_utc": "1320897961", "subreddit": "fffffffuuuuuuuuuuuu", "score": 13, "controversiality": 0}
{"body": "And then i realized it was Emeril Lagasse again! And I said \"Go away Emeril, I ain't got no tree fitty!\"", "gilded": 0, "created_utc": "1320906391", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt; Reasons are again a matter of opinion. \n\nNo, they aren't. [Rationalizations are a matter of opinion](http://en.wikipedia.org/wiki/Rationalization_%28making_excuses%29). Reasons are objective and outside of your opinion. People often confuse both, but they aren't the same thing.\n\n\"Ernest Jones was 'the man who, appropriately, contributed the term \"rationalization\" to psychoanalysis (in 1908) - \"the inventing of a reason for an attitude or action the motive of which is not recognized\".\"\n\nAn atheist doesn't have a reason to do anything moral. He may rationalize his decisions, but he doesn't have any reason for them. That allows atheists to handpick their morals, selecting only those that are convenient for them.\n\n&gt; I must have misunderstood you then – what exactly are those societal values again, specifically, and how do they contribute to prosperity?\n\nIt depends on the society, its development stage, technological level and even geographic location. There is no single set of societal values that can answer this question.\n\n&gt; That paper is limited to the US and European countries, and finds a correlation, as we’ve already noted exists.\n\nWhat part of \"the current growth of atheism is a phenomena restricted to USA and European countries only\" you missed?\n\nHow exactly you analyze the impact of atheism on fertility on countries where no atheism exists? You don't.\n\n&gt; Far broader studies find no causal relationship. Once you control for religion, it’s clear it is not a causal factor.\n\nThis is again, incorrect. I took my time and read the studies that were open to be read. You know, I should have done it the first time around. There is not even a single reference to *atheism* on them. There is not a single instance of study that controls for religion against lack of it. When they say they control for religion, it is not whether or not you are religious, but which religious affiliation you belong to.\n\nWhen everyone in your sample data is religious, it certainly ceases to be a factor.\n\nIn the end, none of your studies contradict what I said.\n\n[Source](http://www.un.org/esa/population/publications/completingfertility/RevisedCosio-Zavalapaper.PDF): \"The results of the multivariate analysis do suggest that religion and nationality have a significant influence on predicting reproductive behavior (both intentions and action upon those intentions), however these influences are considerably weaker than that exerted by region. They also suggest that being a Muslim or a Hindu has quite different ramifications for reproductive behavior depending on the region of residence”\n\nNo mention of atheism anywhere. The only control is whether you are Muslim or Hindu. And it is the only study that controls for religion on the page you linked to. Yes, I checked all of them.\n\n&gt; Nope. I understand you don’t want to accept the evidence indicating a causal relationship with the factors listed, rather than religiousness, and for some reason are fixated on the odd idea that non-belief in a deity itself prevents women from having babies.\n\nYour evidence doesn't support your conclusions, sorry. You are welcome to read them and point out exactly which study says that the impact of lack of religion on fertility is smaller than any other factor. And I mean, an actual study, like I linked, not a Wikipedia article that you pretend that supports you.\n\n&gt; You also think that massive ever-increasing populations of Mexican descendants and native-born Americans living together in the US would somehow be great for the country.\n\nWay to miss the point. You're basically ascribing to me the opposite of what I said. Did you even read what I wrote? What part of \"death of your civilization\" made you think that I consider it great for your country?\n\n&gt; I’m afraid your repeatedly stating “argument from ignorance” doesn’t make it so (again I neither make nor deny any claims, which is a requirement of the argument from ignorance)\n\nNo, the requirement of the argument from ignorance is the linking of the veracity of the premise to the absence of evidence. In \"there is no evidence, therefore I don't believe\" the \"*there is no evidence*\" part is the argument from ignorance. \"I don't believe\" is your *conclusion,* not your argument. That's why it is an argument from ignorance whether you believe or not. It is your conclusion, not the argument.\n\nEverytime you say \"there is no evidence, therefore X\" it is an argument from ignorance, regardless of what X is.\n\n&gt; It does, particularly if it’s something you’d expect to find evidence of and have searched for evidence.\n\nNo, it doesn't. There is no correlation whatsoever between the veracity of a premise and either the presence or absence of evidence for it. Reality *is*. It doesn't care about your opinion.\n\n&gt; If you’re looking for the Loch Ness Monster (...) it becomes pretty unlikely that the Loch Ness Monster exists.\n\n[Absence of evidence is not evidence of absence](http://en.wikipedia.org/wiki/Argument_from_ignorance#Distinguishing_absence_of_evidence_from_evidence_of_absence). You're comparing apples to oranges.\n\n&gt; Incidentally, your position is in fact the argument from ignorance – you’re asserting that a proposition is true because it has not yet been proven false.\n\nWhen did I make the claim that God exists because no one has proven that He doesn't? Quote it.\n\n&gt; I didn’t know that and find it surprising. Nope, definitely against genocide. Didn’t really look into it, but I’ll take your word for now.\n\nTo be fair, they don't call it genocide. They merely advocate that mankind's population should be drastically reduced, and that we should take some form of action towards it. Maybe by killing all those religious people.\n\n&gt; Define “correct” – that’s also a matter of opinion, just as when you say “better”. I have an opinion of “correct” and “better”, but you claim not to.\n\nThe dictionary's definition is fine.\n\nAnd claiming that your opinion is correct because you are of the opinion that it is correct is begging the question, which serves to demonstrate that, when it comes down to it, atheists are irrational. As I said in the beginning.\n\n&gt; Without an opinion you can have no arguments to support your opinion \n\nOpinions to support your opinions is begging the question.\n\nAre you seriously arguing that the results of your \"thoughtful reasoning\" is that your opinions are correct because you are of the opinion that they are correct? Really? Is that what passes for \"critical thinking\" nowadays in the atheist circles?\n\n&gt; In this case you would ask “why does that make it fundamental?”\n\nI know exactly what makes it fundamental.\n\n&gt; I find that pointless and unproductive and prefer to give it a thoughtful opinionated response.\n\nI thought you prefered critical thinking.\n\n&gt; There are things that are natural, like caring for one’s children, family, community and society. Then there are still other things that personally I find to be fundamentals of my world view and opinions. However, they’re only a product of our society, experiences, education, environment, biology, etc.\n\nEither they are natural or they are a product. They can't be both at the same time because such concepts are mutually exclusive.\n\n&gt; Importantly in my opinion, (...) but of course it’s only my opinion. \n\nLook, I will tell you, again. I don't care about your opinion. I care about *truth*. I understand that you have a right to an opinion, but I do not care about it an iota more than the next person.\n\nThe result of a society where everyone lives by their opinions is not an utopia. It is *anarchy*. Unless you are advocating for anarchy, you need to be able to give me a good reason to why I should *care* about your opinion and listen to it.\n\nAnd a good reason does not include your opinion that we would be better of because of it.", "gilded": 0, "created_utc": "1320925961", "subreddit": "DebateReligion", "score": 1, "controversiality": 0}
{"body": "This is a pretty famous piece: it's from the life of St. Columba, and it's part of a section describing Columba's famous encounter with the Loch Ness Monster. I'm hoping, frankly, that no one actually ever reads r/latin, because I was hoping to use a different part of this text on a test... ", "gilded": 0, "created_utc": "1320934645", "subreddit": "latin", "score": 1, "controversiality": 0}
{"body": "Ok, sell all the possessions and open a trust.  Then I can give to the poor, say, tree fitty?", "gilded": 0, "created_utc": "1320936598", "subreddit": "atheism", "score": -2, "controversiality": 0}
{"body": "The problem also exists for the guy making the claim. He saw something weird, he called it a ghost. He's doing that because he didn't stop to think that maybe he was seeing a trick of the light, or an outright deception by somebody trying to spook people for shits and giggles.\n\nNobody, not even the person who had the confusing (and sometimes terrifying) experience, should take a weird story and say \"well, how else CAN you explain it without God/ghosts/alien abduction/the loch ness monster/crystal demonology/etc?\"\n\nA personal experience, no matter how profound or terrifying, cannot be taken at face value when trying to determine what happened. It's especially bad when retold weeks later, probably with plenty of critical details omitted or changed to sound more impressive. After telling of how a spirit healer literally made the bones move in a girl with scoliosis and now she no longer needs her back brace, I was asked \"well, how else can you explain it?\" I wasn't going to list all the various ways it could have been wrong, including her own faulty memory adding certain details that fit the overall picture she had and omitting others. My answer was \"I wasn't there, I couldn't possibly explain it with anything. That's why I'm not gonna jump in with the people who attribute it to their favorite creature, whether it's God, Allah, Elvis, aliens, spirit animals or crystal healing.\"\n\n", "gilded": 0, "created_utc": "1320955964", "subreddit": "DebateReligion", "score": 2, "controversiality": 0}
{"body": "I gave him the tree fitty", "gilded": 0, "created_utc": "1320973820", "subreddit": "IAmA", "score": 73, "controversiality": 0}
{"body": "well no *wonder* he keeps coming back if you keep giving him tree fiddy!", "gilded": 0, "created_utc": "1320993018", "subreddit": "IAmA", "score": 13, "controversiality": 0}
{"body": "The word \"God\" means to some people \"beauty\", \"laws of physics\" etc. To others (most population), it means \"creator\", \"salvation\", \"being in heaven\" etc. These two meanings are very different, there are scientists like Hawking or Einstein who talk about \"God\" but they are atheists. The first meaning is extremely rare and usually introduces confusion.\n\nYou might want to read first chapter of \"The God's delusion\" by Dawkins. He tells more about that.\n\nIf you believe that a god can influence the world when you pray, that he does miracles, then you will be mocked here.\n\nAbout the theme: Many people became atheists by realizing that we are not the center of the universe, and it's ridiculous a god created the whole universe, yet made such tiny fragment for people to live. We are not in the center of universe, and our planet is not special. There is also [Russell's teapot](http://en.wikipedia.org/wiki/Russel's teapot), a common argument against holding beliefs in improbable ideas (such as Loch Ness Monster or God)", "gilded": 0, "created_utc": "1320995846", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "So that's why he came back yesterday asking for another dolla. Goddamn Lochness Monster, Don't be givin them tree fiddy.", "gilded": 0, "created_utc": "1321004795", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "The Loch Ness Monster's secret hideout?", "gilded": 0, "created_utc": "1321016244", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Stories about fierce beasts have been around since as long as we can remember. That's why we have so any myths about creatures like Nessie, or the Yeti. That and the thing about the chinese that \"SirPringles\" said. ", "gilded": 0, "created_utc": "1321025302", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I'd say about tree fiddy.", "gilded": 0, "created_utc": "1321027277", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Well it was about this time I noticed that this girl scout was about 8 stories tall and was a crustacean from the protozoic era!\n\nSo now can i have tree fiddy?", "gilded": 0, "created_utc": "1321033685", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "Messy would be my suggestion reminds me of the loch ness monster", "gilded": 0, "created_utc": "1321037402", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "because she's the loch ness monster?", "gilded": 0, "created_utc": "1321040878", "subreddit": "pics", "score": 58, "controversiality": 0}
{"body": "Share relevant please! I need to understand why Nessie only pays a 3.50 tab.", "gilded": 0, "created_utc": "1321041878", "subreddit": "pics", "score": 7, "controversiality": 0}
{"body": "[Chef's parents tell the kids that The Loch Ness Monster asked them $3.50 but if Nessie lives in Scotland, surely she would not ask for dollars as they are not used anywhere in the UK.  Nessie would have asked for sterling.](http://www.tv.com/shows/south-park/the-succubus-2450/)", "gilded": 0, "created_utc": "1321042353", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "It was about that time I realize that this \"big girl\" was about eight stories tall and actually a crustacean from the paleolithic era.", "gilded": 0, "created_utc": "1321044799", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "The joke isn't that she's ugly. The joke is that some dude is willing to entertain ~~the loch ness monster~~ her for his buddy to get laid by fakeboobsmcgee. ", "gilded": 0, "created_utc": "1321050515", "subreddit": "pics", "score": -2, "controversiality": 0}
{"body": "Hmm a credible website about the existence of vikings.  Hang on it took me 10 days to find one...\n\nWe'll start with this one because it's easy to understand.  http://www.vikinganswerlady.com/\n\nThen, move on to a few special books that are the staple of viking studies.\nhttp://books.google.com/books?id=aLA8AAAAIAAJ&amp;pg=PP7&amp;source=gbs_selected_pages&amp;cad=3#v=onepage&amp;q&amp;f=false\n\nhttp://books.google.com/books?id=sWLVZN0H224C&amp;printsec=frontcover&amp;dq=The+Lost+Beliefs+of+Northern+Europe#v=onepage&amp;q=&amp;f=false\n\n\nAs for the loch ness monster and others, I hear MonsterQuest has some GREAT, researched, podcasts on them.", "gilded": 0, "created_utc": "1321062491", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "List of items, for the lazies.\n**Genuine Hats**\n\n* Genuine Aperture Labs Hard Hat\n* Genuine Dragonborn Helmet\n* Genuine Dread Knot\n* Genuine Geisha Boy\n* Genuine Hetman's Headpiece\n* Genuine Killer Exclusive\n* Genuine Noh Mercy\n* Genuine Pip-Boy\n\n\n**Vintage Hats**\n\n* Vintage Backbiter's Billycock\n* Vintage Bonk Helm (Pink - 216)\n* Vintage Brigade Helm\n* Vintage Demoman's Fro\n* Vintage Fancy Fedora\n* Vintage Football Helmet\n* Vintage Frenchman's Beret\n* Vintage Killer's Kabuto\n* Vintage Noble Amassment of Hats\n* Vintage Otolaryngologist's Mirror\n* Vintage Professional's Panama\n* Vintage Prussian Pickelhaube\n* Vintage Respectless Rubber Glove\n* Vintage Ritzy Rick's Hair Fixative\n* Vintage Shooter's Sola Topi\n* Vintage Texas Slim's Dome Shine\n* Vintage Tyrant's Helm\n* Vintage Vintage Merryweather\n* Vintage Vintage Tyrolean\n* Vintage Whiskered Gentleman\n\n\n**Normal Hats**\n\n* Berliner's Bucket Helm\n* Big Steel Jaw of Summer Fun\n* Blighted Beak\n* Defiant Spartan\n* Emerald Jarate\n* Flipped Trilby\n* Futankhamun\n* Ghastlierest Gibus\n* Grimm Hatte\n* Manniversary Paper Hat\n* Noh Mercy\n* Pencil Pusher\n* Pocket Medic\n* Prairie Heel Biters\n* Professor Speks (Untradeable, Gifted)\n* Sober Stuntman\n* Tam O' Shanter\n* Villain's Veil (Greed)\n* Ze Goggles\n\n\n**Promo Hats**\n\n* Alien Swarm Parasite\n* SpaceChem Pin\n* The Athletic Supporter\n\n\n**Strange Weapons**\n\n* Strange Axtinguisher\n* Strange Backburner\n* Strange Bonesaw\n* Strange Bushwacka\n* Strange Crusader's Crossbow\n* Strange Flare Gun\n* Strange Medi Gun\n* Strange Minigun\n* Strange Shotgun\n* Strange Sniper Rifle\n* Strange Syringe Gun\n* Strange Wrench\n\n\n**Vintage Weapons**\n\n* Vintage Axtinguisher\n* Vintage Axtinguisher (Level 51)\n* Vintage Backburner\n* Vintage Blutsauger\n* Vintage Bonk! Atomic Punch x 2\n* Vintage Buff Banner\n* Vintage Cloak and Dagger (Level 32)\n* Vintage Dalokohs Bar x 2\n* Vintage Dead Ringer\n* Vintage Direct Hit\n* Vintage Equalizer\n* Vintage Eyelander\n* Vintage Flare Gun (Level 91)\n* Vintage Force-A-Nature\n* Vintage Frontier Justice\n* Vintage Gunboats\n* Vintage Gunslinger\n* Vintage Homewrecker\n* Vintage Huntsman\n* Vintage Jarate x 2\n* Vintage Killing Gloves of Boxing\n* Vintage Kritzkrieg\n* Vintage Natascha\n* Vintage Pain Train x 2\n* Vintage Sandman x 2\n* Vintage Sandvich x 2\n* Vintage Ubersaw (Level 84)\n* Vintage Wrangler\n\n\n**Normal Weapons**\n\n* Ali Baba's Wee Booties\n* Ambassador\n* Amputator\n* Atomizer\n* Backburner\n* Battalion's Backup\n* Bazaar Bargain\n* Big Earner\n* Black Box\n* Boston Basher\n* Brass Beast\n* Buffalo Steak Sandvich\n* Candy Cane\n* Chargin' Targe\n* Claidheamh Mòr\n* Concheror\n* Conniver's Kunai\n* Cow Mangler 5000\n* Crit-a-Cola\n* Darwin's Danger Shield\n* Degreaser\n* Detonator\n* Disciplinary Action\n* Enforcer\n* Eviction Notice x 2\n* Family Business x 2\n* Fan O'War\n* Fishcake\n* Fists of Steel\n* Gloves of Running Urgently\n* Half-Zatoichi\n* Holy Mackerel\n* Jag\n* Liberty Launcher\n* Loch-n-Load\n* Machina\n* Mad Milk\n* Mantreads\n* Market Gardener\n* Nessie's Nine Iron\n* Original\n* Overdose\n* Postal Pummeler\n* Powerjack x 2\n* Quick-Fix\n* Reserve Shooter\n* Righteous Bison x 2\n* Scotsman's Skullcutter\n* Scottish Resistance\n* Shahanshah x 2\n* Sharpened Volcano Fragment\n* Short Circuit\n* Shortstop\n* Soda Popper\n* Solemn Vow\n* Southern Hospitality\n* Splendid Screen\n* Sun-on-a-Stick\n* Sydney Sleeper\n* Tribalman's Shiv\n* Ullapool Caber\n* Vita-Saw\n* Warrior's Spirit\n* Widowmaker\n* Winger\n* Your Eternal Reward\n\n\n**Crates**\n\n* Series 3 Crate x 4\n* Series 4 Crate\n* Series 5 Crate\n* Series 7 Crate x 4\n* Series 8 Crate x 3\n* Series 9 Crate x 2\n* Series 18 Crate x 2\n* Series 21 Crate\n* Series 23 Crate\n* Series 25 Crate x 2\n* Series 26 Crate x 3\n* Series 27 Crate x 5\n* Series 29 Crate x 5\n\n\n**Metal**\n\n* Refined Metal x 27\n", "gilded": 0, "created_utc": "1321062861", "subreddit": "Tf2Trading", "score": 1, "controversiality": 0}
{"body": "Atop the building on the right, two Loch Ness monsters in fancy hats have surfaced to admire each other.", "gilded": 0, "created_utc": "1321078361", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1321080119", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "Cryptids: Bigfoot, Nessie, Chubacabra, etc.  Despite constant lack of evidence or clear evidence of mis-identification or hoax, I want desperately for these large unknown animals to exist.  I especially cling to the \"small groups of otherwise long-extinct animals\" theories.\n\nNot sure exactly why, but it probably has something to do with the lack of scientific mystery in our modern world - we've explored and uncovered so much and the idea of exploring for exploring's sake is all but dead among the majority.\n\nAlso, aliens.", "gilded": 0, "created_utc": "1321120160", "subreddit": "AskReddit", "score": 23, "controversiality": 0}
{"body": "My meaning is much more general than that.  In other words \"Bigfoot and Yeti are isolated and remaining populations of Gigantopithicus\" or \"Nessie and Champie are a branch of plesiosaur that survived the KT event\" sorts or theories.\n\nAgain, in line with the thread I do not actually think these true - I just want them to be despite evidence otherwise.", "gilded": 0, "created_utc": "1321145184", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "The left one looks like a dragon to me, while the right one looks like a Loch Ness monster. Really cool stuff", "gilded": 0, "created_utc": "1321145996", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "Not affiliated in anyway, but they have a lot of rad patches up from star wars to the loch ness monster.", "gilded": 0, "created_utc": "1321146394", "subreddit": "shutupandtakemymoney", "score": 1, "controversiality": 0}
{"body": "There is more evidence for the loch ness monster than Jesus. ", "gilded": 0, "created_utc": "1321146545", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "i see what you mean. I just wanted to point out that the bottom of the ocean is like the dark side of he moon. It's neat to speculate about what's down here. i hope you find your loch ness monster!", "gilded": 0, "created_utc": "1321146708", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Damnit I told you not to give that loch ness monster no god damn tree fiddy", "gilded": 0, "created_utc": "1321152102", "subreddit": "AskReddit", "score": 21, "controversiality": 0}
{"body": "i want to photoshop the loch ness monster eating you but Im too lazy.", "gilded": 0, "created_utc": "1321154966", "subreddit": "Kayaking", "score": 2, "controversiality": 0}
{"body": "I was referring to the paleolithic era, when our digestive systems were still evolving.", "gilded": 0, "created_utc": "1321157241", "subreddit": "keto", "score": 1, "controversiality": 0}
{"body": "The burden of proof is on the believer. There's not sufficient evidence for a god, so there's no reason to hypothesise that a god exists. If lack of evidence one way or another was the threshold for accepting something as true, you would have to believe in all [2,705 documented gods](http://konewone.wordpress.com/gods/), along with Bigfoot, unicorns, elves and the Loch Ness monster, for the sake of consistency.\n\nYes, there is sufficient reason to think that aliens exist. We know that life can arise from environments similar to Earth, we know that there's an incomprehensible number of galaxies out there, with an incomprehensible number of stars in each, and planets orbiting those stars. We can use the [Drake equation](http://en.wikipedia.org/wiki/Drake_equation) to assess the parameters of the universe and determine that in all likelihood, there are aliens out there.\n\nThe topic of god and the topic of aliens are different. We are living evidence of the universe giving rise to sapient beings - it's nonsense to suggest it couldn't happen again given the right conditions. And we know the right conditions *probably* exist somewhere else out there. In asserting that there is a god, however, the only evidence to back you up is one book, among many thousands, that says that your particular god exists. \n\nSherlock Holmes (or rather, Sir Arthur Conan Doyle) put it best: *\"It is a capital mistake to theorize before one has data. Insensibly one begins to twist facts to suit theories, instead of theories to suit facts\".*", "gilded": 0, "created_utc": "1321176393", "subreddit": "atheism", "score": 6, "controversiality": 0}
{"body": "I need about tree fiddy. ", "gilded": 0, "created_utc": "1321183899", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Nessie is right, this is a clear provocation against the Muslims of Switzerland. First it was the minarets, now this. It's not that hard to assimilate people Europe - just respect them and ensure they have access to social mobility.", "gilded": 0, "created_utc": "1321189815", "subreddit": "worldnews", "score": -2, "controversiality": 0}
{"body": "Given the absence of evidence, it is best to accept the null hypothesis - i.e. the position not making positive claims.\n\nA positive claim is something like \"God exists\" or \"This tree exists\".\n\nYou can touch a tree, take a picture of it, climb it. You can feel a change in temperature when you are walking into its shadow. It is safe to say that it exists.\n\nOn to god. \n\n* Is this god loving? Then why eternal torture (hell), aka infinite torture for finite sins? \n* Is this god the creator of the universe? They why is it so imperfect? Beautiful things are almost always fragile and easily marred. Much of the universe is harsh and inhospitable. We are worried about asteroids wiping us out.\n* Is this god responsible for intelligent design? Then why AIDS? Why the plague? Why are human eyes so much worse than those of other species? Why are there *eight* different eye designs? [SMOGGM](http://www.freewebs.com/oolon/SMOGGM.htm) has more.\n* Does this god answer prayer? Then why did a double-blind study show that people who knew they were being prayed for have significantly worse outcomes than those who were not being prayed for?\n\nMore questions like this can be found in [God: The Failed Hypothesis](http://www.amazon.com/God-Failed-Hypothesis-Science-Shows/dp/1591024811)\n\nIf you are reserving judgement about god, then are you doing the same for dragons, fairies, santa, the loch ness monster? Why not? All of those mythical things are written about in old books.\n\n", "gilded": 0, "created_utc": "1321190386", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "How the hell did the Loch Ness Monster get to Thailand?", "gilded": 0, "created_utc": "1321236255", "subreddit": "pics", "score": 23, "controversiality": 0}
{"body": "They're like Bigfoot, or the Loch Ness Monster - they make an appearance every so often just long enough to convince believers that they really might be out there somewhere.", "gilded": 0, "created_utc": "1321244138", "subreddit": "nfl", "score": 2, "controversiality": 0}
{"body": "&gt;Rather, that God is the most real (most actual) thing, and sustains us in our very existence as the prime mover. :P Welcome to the club!\n\nI think I've always been in the club, just not aware that it was one. Calling this thing god is like finding a gold fish, calling it the loch ness monster, and saying \"look, there *is* a loch ness monster after all!\". You're redefining the concept of a deity to be so broad it could literally encompass any belief system.\n\n&gt;We're talking about two separate things here-- the nature of God is immutable, but this says nothing of His Will. Hell, all it means for God to be immutable is what I said-- He's the most real thing, and has no unreality in Him.\n\nImmutability implies that god is just that; immutable. It can't be changed by anything, for any reason, meaning that he would have to be acting totally unaware of anything that happened beyond the beginning of his existence. The bible would suggest that this isn't the case, as demonstrated in his conversation with Adam/Eve, Abraham, apparation as Jesus, etc. Sure, they could still happen, but he'd be broadcasting pre-recorded messages, not looking at what happened and passing judgement.\n\n\n\n\n", "gilded": 0, "created_utc": "1321246587", "subreddit": "DebateReligion", "score": 3, "controversiality": 0}
{"body": "I do believe they've found the loch ness monster!", "gilded": 0, "created_utc": "1321250899", "subreddit": "WTF", "score": -3, "controversiality": 0}
{"body": "I only gave him tree fitty one time and now of course tha damn monsta come over and keep askin for tree fitty!", "gilded": 0, "created_utc": "1321255307", "subreddit": "pics", "score": 18, "controversiality": 0}
{"body": "There really is no Doctor Who continuity.  BBC has never made any comment on what is and what is not Doctor Who canon, so it tends to fall into that gray area of \"canon is whatever you want it to be\".\n\nWhereas I tend to think that only what has aired on television is canon, this also causes problems as the Doctor Who TV movie introduces conflicts, they've given like 3 explanations for the destruction of Atlantis and 2 for the Loch Ness Monster.\n\nSo, it is what it is.  Apply the books if you'd like.", "gilded": 0, "created_utc": "1321257667", "subreddit": "doctorwho", "score": 6, "controversiality": 0}
{"body": "What!?! You gave that monsta another damn tree fitty?", "gilded": 0, "created_utc": "1321260572", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "It was about that time i noticed the body builder looked like a dinosaur from the paleolithic era, and you know what that dinosaur wanted.....treeefifty.\n", "gilded": 0, "created_utc": "1321262901", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "This song and Ole Nessie got me into Mastodon. 2 months until I get to see them live!", "gilded": 0, "created_utc": "1321287472", "subreddit": "Metal", "score": 1, "controversiality": 0}
{"body": "Downoting threads is disabled. Downvoting comments is disabled. We allow everyone to come here and post, but we're the nut cases? Thanks. \n\nAs an atheist, I cannot disprove god. But I cannot disprove leprachauns, the Loch Ness monster, fairies and Harry Potter either. The burden of proof lies in the believer to prove the existence of their deity. So, I take offense at your comment that we are \"self righteous people.\" If I am ever proven wrong about any of these things, I would gladly believe them.\n\nIf religious people can't debate seriously, DEMAND respect when none is given in return and post condescending posts about how much we don't know about their magical beliefs, then yes, I will be a bit rude and condescending. I'd do it if you were Muslim, Christian, Jew, Jain, Buddhist, Sikh, Pastafarian, or whatever.", "gilded": 0, "created_utc": "1321288011", "subreddit": "exmuslim", "score": 3, "controversiality": 0}
{"body": "1461 elo IGN: Wheresnessie Server: NA\n\nHaven't been playing too much lately, need to play more this week esp with new masteries and spells cause there's a local tourny going on this weekend. ", "gilded": 0, "created_utc": "1321305355", "subreddit": "leagueoflegends", "score": 1, "controversiality": 0}
{"body": "EDITED.\nLoch Ness monster. \nJust too many people have seen it. Could be a widespread hysteria type deal, where they saw something and their brain fills in the blank as \"Nessie\". But I don't know.\n\nThey HAVE done sonar multiple times, some picked some stuff up, the most recent one was very thorough and saw nothing. But there's SO MANY underground caverns and caves down there that it would take months for a group to scout everything out thoroughly, as boats on the surface can't use sonar for something deep in a cave.\nA Sonar wave is like a rubber ball. Throw it, use how it returns as data. But throw a rubber ball into a deep cave, it'll bounce around pretty unpredictably and return with little strength or just get lost. Sorry, analogy isn't great. \n\nRespond if you disagree/don't see my point. I myself have never been to Loch Ness and am not a scientist of any kind, what I write is just a result of a science project and a few weeks of 'net surfing.", "gilded": 0, "created_utc": "1321306566", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "God damn loch ness monster!", "gilded": 0, "created_utc": "1321318705", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "That looks like the Loch Ness Monster ate somebody.  And the guy he ate is kind of ok with the situation.", "gilded": 0, "created_utc": "1321320317", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "I ain't giving you no Tree Fiddy you God Damned Lochness Monster! Get your own money!", "gilded": 0, "created_utc": "1321320670", "subreddit": "AdviceAnimals", "score": 9, "controversiality": 0}
{"body": "I'm guessing about tree fiddy.", "gilded": 0, "created_utc": "1321322775", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Give me a picture of the Loch Ness monster that has not been proven to be fake. \n\nEyewitness reports are bullshit when it comes to things like this. People are easily sensationalized and will make themselves believe things out of a desire to be famous or special. ", "gilded": 0, "created_utc": "1321323769", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "[Tree fitty an ounce](http://www.amazon.com/Bulk-Herbs-Witch-Hazel-Leaves/dp/B005DSWNFY/ref=sr_1_8?ie=UTF8&amp;qid=1321323707&amp;sr=8-8 \"Gawd damn loch ness monster!\")", "gilded": 0, "created_utc": "1321323890", "subreddit": "wicked_edge", "score": 4, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy!", "gilded": 0, "created_utc": "1321324167", "subreddit": "wicked_edge", "score": 4, "controversiality": 0}
{"body": "&gt;I am curious if any of you believe in ghosts\n\nNope.  No ghosts, boogeymen, Ancient Aliens, Loch Ness Monsters, Bigfeet, Psychics, or non-delicious chocolate cake.", "gilded": 0, "created_utc": "1321325361", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "How about tree fiddy?", "gilded": 0, "created_utc": "1321333771", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "You should have given him tree fitty.", "gilded": 0, "created_utc": "1321341678", "subreddit": "skyrim", "score": 4, "controversiality": 0}
{"body": "I just gave that dragon tree fiddy last Wednesday.", "gilded": 0, "created_utc": "1321362922", "subreddit": "skyrim", "score": 6, "controversiality": 0}
{"body": "It's not just as simple as \"there aren't any facts about religion\". That's putting religion into the same harmless camp as Bigfoot or the Loch Ness Monster. \n\nThere are a number of problems with religion. I'll relate a few. \n\nThe first is that religion causes death. Just look at the tinderbox that is the Middle East. Ancient religious hatreds being played out with modern weaponry. People are killing and being killed all in the name of their God and belief system. And let's not forget the USA, AKA \"Christianity Inc.\". They are helping Israel through some Judeo-Christian belief that the fate of the Jews are tied to the fate of Christians. And so this superstitious nonsense is played out on a global scale resulting in religion being the number one cause of death OF ALL TIME. \n\nTheocractic encroachment on free society. Every time you hear the news or open a paper there is some example of Christian influenced politicians wanting to pass lass legislation that restricts a persons' freedon. Be it anti-abortion, anti-gay marriage, blue laws, liquor laws, etc. there has been so much deprivation of simple rights based on religious superstition. \n\nHypocrisy. As George Carlin has said, the biggest purveyor of bullshit in the world is religion. Speaking specifically about the Catholic church, they suggest that we shoul worship a peasant carpenter and reject wealth. \"It is easier for a camel to pass through the eye of a needle than it is for a rich man to enter heaven.\" Yet do you know any priests that aren't well off? Of course not, because that quote is the whole reasoning behind tithing all your money to the church. The vatican is sitting on arguably the largest trove of wealth in the world. It's a total pyramid scheme and the only thing they are giving you in return is supposed salvation in the afterlife. A completely intangible thing that you have to die to receive. How does anyone with even a small modicum of intelligence believe this shit? \n\nThere were lots of religions before Christianity. The creators of Christianity saw how useful religion was - you get a lot of people to do what you want them to do and they give you money without expecting anything in return. So in order to make it easier for people to convert to this new religion, they co-opted parts other religions. That is why there are so many similarities between Jesus and figures from other religions such as Horus, Krishna, Mithra, etc. Look it up. That is why even though the Bible suggests that Jesus was born in a temperate month, Christianity celebrates his birth on December 25th - because it coincides with Winter Solstice and it would be much easier for pagans to convert if they still had a holiday to celebrate on that date. Same for Easter, etc. \n\nReligion encourages ignorance. Most church leaders do not want their congregations reading the bible for themselves. They want you to go to church every Sunday and hear the pastors' interpretation of select passages. Anything taken from the bible that is bad, is twisted and made to be good and suggested that it's not to be taken literally. \n\nI was going to continue writing but honestly, I'm just not that interested in rehashing common knowledge. I'm tired of revealing how full of shit religion is to theists because nothing ever comes of it. Theists will just push back with more ponderous and intellectually devoid arguments. \n\nYou have to come to your own conclusions. Try reading some books by Dawkins, Hitchens, Harris, and Dennet to get an alternative view. If I had to choose one book for all theists to read, it would be \"God is Not Great: How Religion Poisons Everything\" by Hitchens. The God Delusion is great but I fear it may be too complex and verbiose for theists. Hitchens' God is Not Great is just s simple bitch slap to wake up theists. ", "gilded": 0, "created_utc": "1321371041", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "If Nessie is real, it's a Sturgeon.", "gilded": 0, "created_utc": "1321376004", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Tree fitty? ", "gilded": 0, "created_utc": "1321377899", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Very, very pretty girl. Early twenties. \n\nChef's dad would guess eight story tall crustacean from the paleolithic era.\n\nPlease confirm which is correct.", "gilded": 0, "created_utc": "1321387080", "subreddit": "firstimpression", "score": 4, "controversiality": 0}
{"body": "Tell me, if I don't believe the Loch Ness monster exists with a chance of 99%, does that make me the same as a person who thinks it exists with a chance of 99%? Can you invent any concept you like and make the belief therein the same as the disbelief?", "gilded": 0, "created_utc": "1321391093", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "You should add in a Nessie's Nine Iron just to complete the set.", "gilded": 0, "created_utc": "1321393775", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "Lol downvotes? He has a point, you're forcing a theme that would never work without the nametag / nessie's 9 iron. If i saw it without the given pictures all I'd see is a planets hat.", "gilded": 0, "created_utc": "1321396037", "subreddit": "tf2trade", "score": 10, "controversiality": 0}
{"body": "Bigfoot and the Loch Ness Monster told them we were all a bunch of dicks.", "gilded": 0, "created_utc": "1321409079", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I actually really like this picture...it's like a grainy photograph taken by some crazy person who thinks dragons and Bigfoot and the loch ness monster exist. ", "gilded": 0, "created_utc": "1321436915", "subreddit": "skyrim", "score": 1, "controversiality": 0}
{"body": "Sort of. There was a period after I became an atheist and before I became a sceptic, where I thought about Big Foot, Loch Ness Monster, extra-terrestrial visitors, and other crap like that.", "gilded": 0, "created_utc": "1321444624", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I think I have sighted the Loch Ness Monster in that one ear.", "gilded": 0, "created_utc": "1321456094", "subreddit": "dogpictures", "score": 1, "controversiality": 0}
{"body": "Many other redditors, including yourself, have suggested that it may be impolite to christians to make fun of a scene from the bible. I hardly think being shunned by the christian population of reddit or a few thin-skinned atheists is worth giving up my principle that christianity is a delusion, ridiculous, and worthy of scorn. \n\nIf you honestly believe that people who believe in fairies, leprechauns, loch ness monsters, vampires, or jesus deserve my esteem then I must vehemently but respectfully disagree. \n\n", "gilded": 0, "created_utc": "1321458694", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "I would reply more concisely, otherwise he won't read it. His reasoning suggests that belief in Loch Ness monster and disbelief (or that Elvis is alive) are on the same level of sanity.", "gilded": 0, "created_utc": "1321460520", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Goddammit Loch Ness Monster! You ain't gettin' no tree fiddy!", "gilded": 0, "created_utc": "1321467862", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "[Loch Ness Monster Sighting](http://i.imgur.com/SjMyr.jpg)", "gilded": 0, "created_utc": "1321471141", "subreddit": "dogpictures", "score": 3, "controversiality": 0}
{"body": "bout tree fiddy", "gilded": 0, "created_utc": "1321475454", "subreddit": "DotA2", "score": 1, "controversiality": 0}
{"body": "1. This is a cop-out. No one would call \"aunicorism\" a belief, and even if he wants to construct his definition of \"belief\" to include \"negative beliefs\" highlight the difference between beliefs based on evidence (or lack thereof) and beliefs held on pure faith (antithesis of reason).\n\n2. Atheism isn't a philosophy unto itself. There ARE certain implications atheism can have on personal philosophy but that doesn't really strengthen or harm anyone's argument.\n\n3. This is also a cop out. There is also no scientific evidence that proves magical invisible dragons don't exist but no one believes in them...\n\n4. No atheist claims to have PROOF there is no god, just in the same way as no one claims to have PROOF of the lack of existence of magical invisible dragons. This doesn't mean they exist.\n\n5. The norm is a TERRIBLE place to put our trust. I would also point out that all of us are born atheists, the \"norm\" is a result of years of dogma.\n\n6. There are countless personal testimonies of people seeing aliens, bigfoot, loch ness monster, werewolves, vampires, dragons, unicorns, sea monsters, not to mention people positing to have experienced things that atheists and theists alike are impossible. Personal testimony is flawed and asking for empirical/physical evidence of something is PERFECTLY reasonable.\n\n7. If we accept this argument than we accept that belief in something makes it real. For thousands of years humans believed in all the \"gods\" the author rejects (they enjoyed mass appeal too). Also, people again believed in things that are certifiably untrue (the earth is flat) for years; this did not make it true.\n\n8. Some truth here, but religion is a VERY important tool in galvanizing people to fight a war they have no interest in. Religion is also sometimes the direct cause of war.\n\n9. It doesn't prove that all Christians are evil and I don't think most atheists would argue that it does. But it does show the calamitous potential behind people not guided by reason.\n\n10. This seems irrelevant. Were I debating the author I would concede that there are imprisoned people of both opinions.\n\n11. Again, this doesn't seem relevant to the question...\n\n12. Atheists who are guided by survival instincts act in the closest manner to altruism because their actions are made for the long-term survival of the SPECIES. Theists do \"good\" deeds only in self-interest.\n\n13. This is a cop-out. I can justify any logical fallacy by saying that humans are just too flawed and stupid to understand it.", "gilded": 0, "created_utc": "1321483280", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I think the article makes it pretty clear that the game is a myth and nothing more. It's a well known legend, and it deserves a place on Wikipedia, just as much as Bigfoot, Yeti and the Loch Ness monster.", "gilded": 0, "created_utc": "1321486303", "subreddit": "wikipedia", "score": 30, "controversiality": 0}
{"body": "Supposing that the 5% of true-blue UFO cases are NOT military, our own craft, E.T., inter-dimensional beings, etc...\n\nI have always wondered about the possibility that the Earth has an as-yet-undiscovered form of intelligent energy.  A result of humankind being part of the highly chaotic, entropic, complex system called Earth, is that the Earth acts as a conduit and amplifier for our collective unconscious as well as our own history.  What we have percieved as ghosts, devils, flying triangles, pixies, witches, Nessie, Bigfoot, Grey aliens, etc) are really just our subconscious projections being channeled and displayed by our Mother Earth.  In much the same way that virtual quantum particles flit into and out of existence, this Earth energy may be able to harness to create virtual projections of our own subconscious and also effect the physical world around us.  \n\nSometimes these human-Earth projections reside in our consciousness only (such as in cases of ghosts and time-slips). Sometimes these projections can even create disturbances detectable with our electronic equipment (such as coo-berating radar evidence found in many UFO cases).  And sometimes these projections can effect permanent changes to our surroundings (crop circles, \"impossible\" ancient monuments, etc).\n\nA few far-fetched, crazy ideas to expand on this crazy thought:\n\nGhosts, time slips, etc are the Earth playing back scenes from it's memory (which is really *our* memory).\n\nUFOs, aliens, etc are the most recent manifestations of humankind's collective thoughts, hopes, fears, etc. \n\nThe Bermuda triangle might be an unwanted side effect of the Earth's power.  The pyramids of Giza might be an amplifier of this power.\n\nHere is the first chapter of the audio book I created based entirely on on my (hopefully!) original [theory](http://www.youtube.com/watch?v=XZ5TajZYW6Y)", "gilded": 0, "created_utc": "1321493405", "subreddit": "UFOs", "score": 1, "controversiality": 0}
{"body": "Nessie", "gilded": 0, "created_utc": "1321494619", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I would say I very strictly would hold that I don't believe there are no gods, I simply lack a belief in any gods. That said, I think it can be proven that certain forms of god, including the Christian god and the properties said god would have, conflicts with reality. But you could create a god, like for example with deism, which as far as I could tell would exist without a way to really tell, and thereby rule out. However, any such god that has no significant effects also isn't worth worrying about. As such, I assume that there is no god when I live my life.\n\nWith the other comparisons, I don't believe that there is NO bigfoot, or aliens, or loch ness monster. I consider all of these highly unlikely and without any real evidence, but not things I believe to be entirely untrue. (With the possible exception of the Loch Ness monter, which is a limited enough area that a search can be done thoroughly to rule it out entirely).\n\nTo draw another point, I don't believe in the big bang, or in evolution. I accept both to be very robust scientific theories, and think they have high certainties of being right, but I wouldn't label anything as beliefs, as that implies a certainty that I'm skeptical to give to just about anything.", "gilded": 0, "created_utc": "1321499100", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "So I tole' the Goddamn Loch Ness Monster I ain't givin' him no three fitty!  ", "gilded": 0, "created_utc": "1321500917", "subreddit": "wikipedia", "score": 6, "controversiality": 0}
{"body": "You are largely correct. However, there are some distinctions I'd like to make. I consider myself an agnostic atheist. The atheist part is pretty straightforward, I lack a belief in a god, ergo, I'm an atheist. The agnostic part is only slightly tricky. \n\nTo be quite honest, I actively disbelieve any gods exist. I can't help this, it is a natural human tendency, but this impulse is regulated by my application of logic. You mention bigfoot, the loch ness monster and ancient aliens. I also have an active disbelief in these things, but I don't have to qualify that with agnosticism. The reason being is that these things are _empirical_, they can be tested for, they have a theoretical physical presence if they exist. Despite the interest and efforts of many people, there isn't any credible evidence that they do. Now, I can always be wrong about such things, but the only way I can be demonstrably wrong about them, is if evidence turns up. This isn't possible for a god, well for the kind of god we are talking about most of the time. A totally non-falsifiable, non-empirical, force like entity. For most conceptions of gods, there is never the possibility that it can be shown to be demonstrably true, because a universe in which a god exists is indistinguishable from one where it does not.\n\nAnd that is why I have to assume a philosophical position of agnostic atheism if I am going to be completely intellectually honest. It is my firm conclusion that no gods exist, the only reason I don't strongly proclaim that is indeed the case is because if such a deity exists, I'd never be able to tell. I take this position because I care if the things I say and advocate are actually _true_. I can't say conclusively that no gods exist, despite the fact I am absolutely convinced this is the case.\n\nIt isn't very satisfying. Being able to loudly proclaim \"I'm right! You're wrong\" has a certain visceral attraction to it. It's also a bit immature. Regardless of how much I'd like to be able to state unequivocally that no gods exist, there is a reason I don't. I might be wrong. I really doubt that, but if I assert it as absolutely true, there isn't much of a chance for discussion. I maintain a position of agnostic atheism because I feel that the discussion is worth having. Not because I think there might be a chance that religious people's subjective conceptions labeled 'god' might actually exist, but because they believe it. Gods have no effect on the world because they are non-existent, but beliefs are real and have great potential for greatness. This potential can be realized as indescribable acts of barbarity or as some of the finest accomplishments of mankind.\n\nI don't want to exclude myself from that discussion. Atheism may reinforce the notion that I am a small and insignificant portion of the universe, but I only know the wonder of the universe and reality by my relationship to it as defined by the positions I hold, the thoughts I entertain and the company I keep. To that end, I will continually seek to ever refine what it is I know and I refuse to limit my ability to do that by maintaining untenable positions.", "gilded": 0, "created_utc": "1321501523", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "&gt; but I don't recall anyone saying, \"Sure, they molested children, but God told them to do it, so it's okay!\"\n\nHow about wars then? :)\n\n&gt; but I believe that community can be beneficial to some.\n\nSure, but subscription to dogma is not required...\nIf you wanna hang out with people, hang out with them.\nNo need to sign up for anything.\n\n&gt; [...] nor do I believe it's okay for religious beliefs to consume portions of the secular world (Ie: The government).\n\nAnd I admire you for that one.\n\nI wonder why oyu call yourself agnostic, since we all are agnostics with regards to all kinds of things.\nEspecially because we can't be 100% certain about anything.\n\nWe are all agnostics with regards to vampires, bigfoot, the loch ness monster, fairies, etc.\nThere is a possibility that those exist, but it is very unlikely that they, isn't it?\n\nSo for the sake of observing the evidence, the assumption that they don't exist until it has been proven that they exist is the best approach.\n\nSaying that they do exist, with no solid evidence or ways of proving it, would be fallacious - and potentially dangerous.\n\nSo in that regard, saying that you are an agnostic adds nothing to the discussion, since we all are agnostics with regards to all kinds of things.\n\nThe real question is not whether you KNOW something exists (since absolute knowledge would be required to know -anything- for sure) but whether you BELIEVE in something or not.\n\nI bet you don't believe that there are vampires, unicorns or fairies, but you choose to not believe in them, until they have been proven to exist.\nYou also probably don't believe in Zeus, Odin, Izanagi, Ahura Mazda, Ra or Krishna. So why stop at catholicism?\n\n", "gilded": 0, "created_utc": "1321548386", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "How about [this guy who has dedicated](http://www.nessiehunter.com/) his life to hunting down the loch ness monster?\n\nGiven that the lake isn't large enough for a breeding population of such animals and that the surrounding fossil record shows no indication that such a creature like that has existed in the area for millions of years, this guy is basically throwing his life away to try and find a convincing driftwood silhouette. ", "gilded": 0, "created_utc": "1321559359", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "And exactly theres the error in your equotation: These things aren't disproved, people just say they are because they fear the consequences of them being real. If you look closely, you will not find any evidence against ghosts, a collective subconsciousness, The Bigfoot and not even friggen Nessie.\nIf you grab a stone and let it fall on the ground, then that is proof a gravity. If you make me look on a white bench through green glasses, that is not proof that the bench is green.\nOf course there are plenty of things disproved which are still \"researched\" by a bunch of idiots. Thats what I mean when I say \"more serious research in parasciences!\".\nAlso, research is not about proving things, its about looking how they actually work. Take astronomy for example. You cannot prove most things astronomers claim to be real. You cannot reconstruct the circumstances in a laboratory so you can repeat the process, but still, its really happening. ", "gilded": 0, "created_utc": "1321563728", "subreddit": "LucidDreaming", "score": 1, "controversiality": 0}
{"body": "YOU'RE THAT DAMN LOCH NESS MONSTA!\nGet outta here! you ain't gettin my tree fitty!\n\n", "gilded": 0, "created_utc": "1321564043", "subreddit": "Jokes", "score": 12, "controversiality": 0}
{"body": "No, he said tree fiddy.", "gilded": 0, "created_utc": "1321599988", "subreddit": "videos", "score": 0, "controversiality": 0}
{"body": "Do you believe in UFOs, astral projections, mental telepathy, ESP, clairvoyance, spirit photography, telekinetic movement, full trance mediums, the Loch Ness monster and the theory of Atlantis? \n\n--Ah, if there's a steady paycheck in it, I'll believe anything you say.", "gilded": 0, "created_utc": "1321631013", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I know your pain.   Lost my beloved Westie, named Nessie, to inoperable cancer.  My morning wake-up calls just haven't been the same.", "gilded": 0, "created_utc": "1321645058", "subreddit": "aww", "score": 1, "controversiality": 0}
{"body": "What amazes me is that people are surprised when they play a Bethesda game and they find out it's the most buggy piece of shit ever released.  This has happened with every Bethesda game in the history of time, going back to the Paleolithic Era, and indeed even on every platform that has existed since the Atari -65536 yet people are still somehow surprised every time it happens.", "gilded": 0, "created_utc": "1321659729", "subreddit": "PS3", "score": 0, "controversiality": 0}
{"body": "I'd buy that for about tree fiddy.", "gilded": 0, "created_utc": "1321663139", "subreddit": "funny", "score": 61, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1321663193", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "How 'bout tree fiddy?", "gilded": 0, "created_utc": "1321666318", "subreddit": "funny", "score": 36, "controversiality": 0}
{"body": "A society has the disorders it can afford.\n\nFor primitive people, the margin between living and dying could be razor thin...there were most likely schizophrenics during the paleolithic era, but if it impacted their ability to survive, they wouldn't have lasted long.\n\nAnd there were certainly hoarders in the medieval era...Dante wrote of them in *The Divine Comedy* in the early twelfth century.  In fact, a lot of pre-scientific authors describe unusual behaviors, from demonic possession to divine rhapsody, that almost certainly were severe mental disorders.  ", "gilded": 0, "created_utc": "1321673398", "subreddit": "askscience", "score": 1, "controversiality": 0}
{"body": "GET OUTTA HERE LOCH NESS MONSTA I AINT GIVEN YOU NO TREE FIDDY!", "gilded": 0, "created_utc": "1321673918", "subreddit": "funny", "score": 44, "controversiality": 0}
{"body": "I think the quality adds to the effect. It's like the photos you see of Bigfoot or the Loch Ness monster.", "gilded": 0, "created_utc": "1321678366", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "Goddamn Loch Ness Monster! Get your own goddamn money!", "gilded": 0, "created_utc": "1321679837", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "He only wants about tree fitty.", "gilded": 0, "created_utc": "1321680707", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "uhhhh...I need about..tree fiddy.", "gilded": 0, "created_utc": "1321681386", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "DAMN LOCH NESS MONSTER! I AINT' GONNA' GIVE YOU NO TREE FIDDY'!", "gilded": 0, "created_utc": "1321683563", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "tree fiddy... well it was about damn i notice that wikipedia founder Jimmy Wales was 8 stories tall and a crustacean from the paleolithic era. DAMN IT MONSTER GET OFF MY LAWN, I AIN'T GIVING YOU NO TREE FIDDY!", "gilded": 0, "created_utc": "1321687652", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "So I was perusing Wikipedia one day and a banner popped up with wikipedia founder Jimmy Wales. Jimmy was asking for donations for his website and I felt obliged to help. I asked how much he needed to which he replied \"I need about tree-fiddy\". It was at that point I noticed that Jimmy Wales was a 28 foot tall crustacean from the paleolithic era. I was like \"God damn it loch ness monsta! I ain't giving you no tree-fiddy!\"", "gilded": 0, "created_utc": "1321688201", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "He should ask for tree fiddy on the southpage page", "gilded": 0, "created_utc": "1321699469", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "goddamn Loch Ness monster... it want´s my 3.50!", "gilded": 0, "created_utc": "1321702456", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "I need about tree fiddy", "gilded": 0, "created_utc": "1321705093", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Dont give dat lok nis monsta tree fiddy!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "gilded": 0, "created_utc": "1321714769", "subreddit": "funny", "score": -3, "controversiality": 0}
{"body": "Tree fitty!", "gilded": 0, "created_utc": "1321715088", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "what, you gave that goddanged monster anotha tree fiddy?!", "gilded": 0, "created_utc": "1321717465", "subreddit": "funny", "score": 35, "controversiality": 0}
{"body": "Can some explain the 350? Bodybuilding.com uses it for \"I lift about tree fiddy\" but I'm still not sure what it has to do with that monster here", "gilded": 0, "created_utc": "1321721062", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "It's a South Park reference. Chef's parents are from Scotland and claim that the Loch Ness monster tries to trick them into giving him $3.50 on various occasions. Chef's dad pronounces it \"tree fiddy\" ", "gilded": 0, "created_utc": "1321721293", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "That's right. I said, \"I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!\" ", "gilded": 0, "created_utc": "1321721442", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "i just donated about tree fitty. do you think he'll be around again?", "gilded": 0, "created_utc": "1321723419", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Chef why you want tree fiddy? you know how much tree fiddy is??", "gilded": 0, "created_utc": "1321723497", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Well, once upon a time, I was scrollin through dat there Reddits. I was lookin ta find somethin I could get a good laugh from. So I was scrollin through dat there \"funny\" section when I got around dat numba nine. Now I done noticed this picture was gonna be somethin about wikipedia, I could tell from da title. I click on the link and out jumps a picture of that fella always asking for money on that wikipedia. Now I assumed that was the joke and it gave me a good laugh until I saw that he said \" ...I need about tree fitty.\" Now it was around that time that I noticed this person in the picture was a two story tall crustacean from tha paleolithic era. And so I said, \"Godammit, Loch Ness monsta, you ain't gettin no tree fitty!\"", "gilded": 0, "created_utc": "1321729003", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "well no wonder he keeps coming back, you keep giving him tree fiddy!", "gilded": 0, "created_utc": "1321729561", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Half? Hell with expenses, and various logistics involved I would get it done for right about tree fiddy.", "gilded": 0, "created_utc": "1321731934", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "I said I aint givin' you no god damb tree fiddy. Getcha own money, you god damb loch ness monsta.\n\nI gave 'em a dolla.\n\nShe gave 'em a dolla!\n\nI thought he'd go away if I gave 'em a dolla. \n\nWell course he ain't gonna go away woman! You give 'em a dolla, he gonna assume you got more!", "gilded": 0, "created_utc": "1321732366", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "I aint giving you no god damb tree fiddy. And so's he says, \"well how about two fiddy?\". And I said, \"what is there a discount on loch ness monsta cookies now?\".", "gilded": 0, "created_utc": "1321732603", "subreddit": "funny", "score": 9, "controversiality": 0}
{"body": "tree fiddy, you say?  HIRED!\n\nThen we'll paper bomb the hell out of their offices, fax machines, mailboxes, etc.", "gilded": 0, "created_utc": "1321733694", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "tree fitty", "gilded": 0, "created_utc": "1321737847", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I ain't givin you no tree fiddy loch ness monster!", "gilded": 0, "created_utc": "1321739250", "subreddit": "funny", "score": 41, "controversiality": 0}
{"body": "&gt;tree fitty\n\nFTFY", "gilded": 0, "created_utc": "1321740874", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "[Tree fiddy.](http://i.imgur.com/reNz8.jpg)", "gilded": 0, "created_utc": "1321746593", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Dammit monster, get off my lawn, I ain't givin you no tree fiddy!", "gilded": 0, "created_utc": "1321751127", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "Oh, bout tree fitty. ", "gilded": 0, "created_utc": "1321753247", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Goddammit woman! Why'd you go an' give Jimmy Wales tree fiddy? Now he's just gonna keep asking us for more!", "gilded": 0, "created_utc": "1321753257", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1321758275", "subreddit": "fffffffuuuuuuuuuuuu", "score": 3, "controversiality": 0}
{"body": "If they asked for tree fitty instead of $5 I bet they would get an enormous response.  \nThen it lands you on the page for the Loch Ness Monster.", "gilded": 0, "created_utc": "1321763472", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I mean, I know we all hate Twilight here or something or whatever, but for what it's worth she DOES at least attempt to explain it: \"Vampires are physically similar enough to their human origins to pass as humans under some circumstances (like cloudy days). There are many basic differences. They appear to have skin like ours, albeit very fair skin. The skin serves the same general purpose of protecting the body. However, the cells that make up their skin are not pliant like our cells, they are hard and reflective like crystal. A fluid similar to the venom in their mouths works as a lubricant between the cells, which makes movement possible (note: this fluid is very flammable). A fluid similar to the same venom lubricates their eyes so that their eyes can move easily in their sockets. (However, they don't produce tears because tears exist to protect the eye from damage, and nothing is going to be able to scratch a vampire's eye.) The lubricant-venom in the eyes and skin is not able to infect a human the way saliva-venom can. Similarly, throughout the vampire's body are many versions of venom-based fluids that retain a marked resemblance to the fluid that was replaced, and function in much the same way and toward the same purpose. Though there is no venom replacement that works precisely like blood, many of the functions of blood are carried on in some form. Also, the nervous system runs in a slightly different but heightened way. Some involuntary reactions, like breathing, continue (in that specific example because vampires use the scents in the air much more than we do, rather than out of a need for oxygen). Other involuntary reactions, like blinking, don't exist because there is no purpose for them. The normal reactions of arousal are still present in vampires, made possible by venom-related fluids that cause tissues to react similarly as they do to an influx of blood. Like with vampire skin—which looks similar to human skin and has the same basic function—fluids closely related to seminal fluids still exist in male vampires, which carry genetic information and are capable of bonding with a human ovum. This was not a known fact in the vampire world (outside of Joham's personal experimenting) before Nessie, because it's nearly impossible for a vampire to be that near a human and not kill her.\"\n\n[Source](http://www.stepheniemeyer.com/bd_faq.html)\n\n", "gilded": 0, "created_utc": "1321764769", "subreddit": "funny", "score": 41, "controversiality": 0}
{"body": "i'll take the Battalion's Backup and Nessie's Nine Iron off your hands, i'll add you (i'm WOINGS)", "gilded": 0, "created_utc": "1321773694", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "I only need about.. tree fiddy", "gilded": 0, "created_utc": "1321777358", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I did not dodge the question at all. I answered it, and I'll admit not fully, after pointing out the flaw in it, which is a huge flaw, because you ASSUME god is fake. If they don't know for sure that it isn't real then they believe that it isn't real and therefore it would be like being an agnostic atheist you don't believe but admit you could be missing evidence. If the child flat out claims there is no possible way for it to exist it would be like being an atheist. If they held their judgement and said quite frankly they don't know and would need complete evidence they would be like an agnostic.\n\nI don't believe in bigfoot or the loch ness monster but I don't have the evidence to say they can't possibly exist.\n\nEdit: I did actually dodge the question I suppose. I did not mean to I just got caught up in my own thoughts.\n ", "gilded": 0, "created_utc": "1321808154", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "&gt;It's just a matter of looking outside isn't it? :)\n\nNo. All you can prove is that the sky is blue. That is proving a positive. Not a negative.\n\n&gt;We can prove that the moon is not make of cheese\n\nNo. You can though prove the moon is made of moon rock.\n\n&gt;or that I'm not dead\n\nNo. You can prove you are alive though.\n\n&gt;What cannot be proven is that there is no pink bunny.\n\nFinally, we agree. You can prove there are white bunnies, but you can't prove a negative.\n\nThe question that started all this was, \"god does not exist\" and if that can be proven. It can not because you can't prove a negative.\n\n(Stolen from an atheist blog)\n“Can you prove that Leprechauns do not exist? Unicorns? The Loch Ness Monster? An invisible porcelain teapot orbiting around the Sun that answers prayers?\n\nThe point being, that you cannot prove a negative. And you don’t have to prove a negative. The burden of proof relies on the positive claim: that a god exists in the first place. Why believe in something without evidence? We don’t believe in faeries, Leprechauns, unicorns, Big Foot, etc. because there is no evidence to believe in them. And yet people forget their skepticism of other outrageous claims when it comes to their religion and willfully accept that an invisible man in the sky exists and answers their prayers.”", "gilded": 0, "created_utc": "1321808693", "subreddit": "DebateAChristian", "score": 1, "controversiality": 0}
{"body": "Wait...so now there are people blame Bigfoot for faking the Moon landings?!?!  What's next?  That the Loch Ness Monster was the shooter on the grassy knoll?  ", "gilded": 0, "created_utc": "1321816318", "subreddit": "skeptic", "score": 1, "controversiality": 0}
{"body": "Everyone knows aliens were on the grassy knoll. The Loch Ness monster was at the Bay of Pigs.", "gilded": 0, "created_utc": "1321823462", "subreddit": "skeptic", "score": 3, "controversiality": 0}
{"body": "That'll be about tree fiddy.", "gilded": 0, "created_utc": "1321832275", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "That'll be tree fitty.", "gilded": 0, "created_utc": "1321834157", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Good article, but I dislike it when authors take Ron Paul seriously.  When they write about his unworkable plans, they make it seem like his ideas are legitimate when they are not.  We don't need authors writing about why the Loch Ness monster isn't real and we don't need real economists writing about hacks like Ron Paul.", "gilded": 0, "created_utc": "1321834447", "subreddit": "politics", "score": -4, "controversiality": 0}
{"body": "Now it was about that time I realized that wasn't no Girl Scout, but a seven story tall creature from the paleolithic era!\n\n*I gave him a dolla*\n\n**SHE** gave him a dolla!", "gilded": 0, "created_utc": "1321842628", "subreddit": "gamecollecting", "score": 3, "controversiality": 0}
{"body": "*tree fiddy", "gilded": 0, "created_utc": "1321844006", "subreddit": "movies", "score": 3, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1321850435", "subreddit": "funny", "score": 11, "controversiality": 0}
{"body": "..and that's when I realized it wasn't bob, it was that damn Loch Ness Monster again asking me for my $3.50.", "gilded": 0, "created_utc": "1321852202", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Would they happen to be the loch ness monster?", "gilded": 0, "created_utc": "1321852448", "subreddit": "funny", "score": 783, "controversiality": 0}
{"body": "if you do that the loch ness monster won't leave you alone!", "gilded": 0, "created_utc": "1321852559", "subreddit": "funny", "score": 17, "controversiality": 0}
{"body": "um do you think i could borrow $3.50. Thats all i need i swear i just need...tree fiddy.", "gilded": 0, "created_utc": "1321856039", "subreddit": "funny", "score": 27, "controversiality": 0}
{"body": "It's that damn Loch Ness monster owes me tree fitty! Get outta here monster!", "gilded": 0, "created_utc": "1321856782", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "Yes. The only other acceptable way for you to pay them back involves them dressing up like the Loch Ness monster dressing up as a girl scout.", "gilded": 0, "created_utc": "1321856798", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "Can I get about a tree fiddy?...", "gilded": 0, "created_utc": "1321857587", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Came just to see loch ness monster comments. Thanks guys.", "gilded": 0, "created_utc": "1321857971", "subreddit": "funny", "score": 29, "controversiality": 0}
{"body": "south park reference. chefs parents have trouble with the loch ness monster... all it wants is tree fitty.", "gilded": 0, "created_utc": "1321858443", "subreddit": "funny", "score": 62, "controversiality": 0}
{"body": "tree fitty", "gilded": 0, "created_utc": "1321859288", "subreddit": "funny", "score": 7, "controversiality": 0}
{"body": "Did you originally come up with this? Because a while back a friend and I started a campaign for 1000 money paper cranes to be donated to a friend of ours in the hospital after he was involved in a drunk driver collision. \n\nFor weeks, we set up posters all around the school and managed to exceed our goal in days. People even began to fold their own with get well wishes, and it became a contest to see who could come up with the most original money origami. Someone anonymously donated a superhero much like that one out of $50 bills. When we took the collections to our friend in the hospital, he shook his head and looked sadly at us, and told us it wasn't nearly enough to cover his treatment. Determined to continue this campaign as long as necessary, we asked him how much more he needed, to which he replied, \"I'ma need about tree fiddy.\"\n\nNow it was about that time that I realized my friend was actually an 8 story tall crustacean from the Paleolithic era. And I said \"goddamnit loch ness monster you ain't gettin no tree fiddy I work hard for my money goddamnit.\" To which he replied  \"well how about two fiddy\" to which I responded \"oh, now its only two fiddy! what is there a sale on loch ness munchies or something? git the hell out of here\" Man was I angry.", "gilded": 0, "created_utc": "1321859324", "subreddit": "funny", "score": 189, "controversiality": 0}
{"body": "I believe the correct spelling is \"Tree Fiddy\"", "gilded": 0, "created_utc": "1321859795", "subreddit": "funny", "score": 17, "controversiality": 0}
{"body": "[Tree Fiddy!](http://www.youtube.com/watch?v=9cn7xfBpZ3M)", "gilded": 0, "created_utc": "1321859876", "subreddit": "funny", "score": 50, "controversiality": 0}
{"body": "He's the one who borrowed the 3.50... wouldn't that make HIM the loch ness monster?", "gilded": 0, "created_utc": "1321861259", "subreddit": "funny", "score": 16, "controversiality": 0}
{"body": "I need about tree fitty", "gilded": 0, "created_utc": "1321862068", "subreddit": "funny", "score": 7, "controversiality": 0}
{"body": "I ain't givin' you tree fiddy! ", "gilded": 0, "created_utc": "1321865216", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Well it was about that time that I notice that girl scout was about eight stories tall and was a crustacean from the palezoic era. Goddamn Loch Ness monster aint gettin no tree fiddy!", "gilded": 0, "created_utc": "1321866052", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I ain't giving you tree fiddy you god damn loch ness monster!", "gilded": 0, "created_utc": "1321867625", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "Haven't looked at the link yet, but unless your answer is 'Dressed as the Loch Ness Monster' then no, no it isn't.", "gilded": 0, "created_utc": "1321870889", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Tree fiddy? Its that god damn Loch Ness Monster!", "gilded": 0, "created_utc": "1321871098", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Dammit Loch Ness monster you get off the Reddit now!", "gilded": 0, "created_utc": "1321878458", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "\"I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!\"\n-Chef's Father!", "gilded": 0, "created_utc": "1321881834", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "[TREE FIDDY?](http://www.youtube.com/watch?v=B4C96ZTJIhU)\n", "gilded": 0, "created_utc": "1321883470", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "GIMME MY TREE FIDDY!", "gilded": 0, "created_utc": "1321883891", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "| give this man *tree fiddy!*\n\nFTFY.", "gilded": 0, "created_utc": "1321884132", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "Gosh Darn Lochness Monster! I just gave him tree fiddy last week!", "gilded": 0, "created_utc": "1321886398", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "Loch Ness monster ~ tree fiddy", "gilded": 0, "created_utc": "1321888644", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I think it's a myth, just like vampires, the loch ness monster, and the Queen of England.", "gilded": 0, "created_utc": "1321888723", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "Woman you crazy! Why you go give tha' boy tree fiddy!", "gilded": 0, "created_utc": "1321891543", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Well it was about that time I noticed that -someone- was about eight stories tall and was a crustacean from the pedozoic era! I said, dammit monsta! Get off my lawn! I ain't given you no tree fiddy!!", "gilded": 0, "created_utc": "1321891741", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "As someone who never believed in Santa, I'd say it's no big deal either way. To the people saying it'll ruin the \"magic of childhood, \" I'd say that I still believed in Bigfoot, flying saucers, the Loch Ness Monster, and a million other things.  I believed that one day I'd marry Princess Leia and we'd explore the universe with the X-Men on the USS Enterprise.  I believed that is was inevitable that I would some day be rich and famous and heroic.  But I never believed in Santa.\n\nThere's plenty of magical, dumb shit to believe in beyond Santa.\n\nBut it's really not that big of a deal either way.  I would suggest sticking with the \"some people believe\" approach, .\n\nBut anyone who uses the \"if you're not good Santa won't bring you any presents\" thing needs a good [indian burn.](http://en.wikipedia.org/wiki/List_of_school_pranks)", "gilded": 0, "created_utc": "1321891765", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "God damn Loch ness monster we ain't givin' you no 3.50.", "gilded": 0, "created_utc": "1321892893", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "What chu need tree fiddy fo'?", "gilded": 0, "created_utc": "1321897273", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Or sasquatch or aliens or the Loch ness monster or whatever the hell they decide to think up that day.", "gilded": 0, "created_utc": "1321897824", "subreddit": "videos", "score": 3, "controversiality": 0}
{"body": "Ctrl+F: Tree fiddy\n­\n \n\nI was not disappointed. ", "gilded": 0, "created_utc": "1321897869", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Same here, I was so worked up with pent-up horniness in the days leading to it that I probably wanked 10 times in a 2-day span, desensitizing the heck out of it. Lasted prob 45 min the first time following all that, seemed to be somewhat decent, even in retrospect.\n\nAlso: dammit Loch Ness Monster!! We work for our money around heaw, get your own damn treefiddy!!", "gilded": 0, "created_utc": "1321898797", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "now don't you go givin' that loch ness monster tree-fitty, woman!", "gilded": 0, "created_utc": "1321902641", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "i'm gonna need about tree fiddy.", "gilded": 0, "created_utc": "1321908983", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Whoa maaan, the behind the back South Park Loch Ness Monster Bel-Air, that's like skipping the Double Dog Dare and going right for the jugular.", "gilded": 0, "created_utc": "1321910375", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "And the reason you wouldn't base life decisions off of fairies is because it's different than God. You are trying to make it sound like Christians don't look for proof. If we didn't see it, we wouldn't believe in Him. I am an intelligent person who is skeptical of plenty of things. I have had so many times where I've just gotten so fed up with life I say, \"screw this, how can there be a God?\", but I go back. Why? Because He isn't to blame. I don't get life sometimes and it's those times that I usually lose my temper a bit.\n\nThink about the Loch Ness Monster. Many people believe it exists, many don't. You know which ones think it exists? The ones who have *seen* it, or what they believe to be it. They aren't pulling it out of thin air. They are absing it on what they have experienced. Just because you yourself haven't seen it doesn't mean the others are lowering their standards of what is proof. In my experience, the atheists that tell me there is no God without a doubt are like the people who have never been to the lake where the Loch Ness monster has been spotted yet they think they *know* it doesn't exist. They haven't even been looking in the right place for evidence with their own eyes.", "gilded": 0, "created_utc": "1321914647", "subreddit": "Christianity", "score": 2, "controversiality": 0}
{"body": "I am agnostic towards god, but I KNOW the loch Ness Monster does not exist. They proved the whole thing to be fake and the guy that did it even came forward, if I remember correctly. I suggest wikipedia. \n\nI know that people believe because they are satisfied with evidence. I know people use homeopathy and have even met a \"vampyre.\" People act based on things they think are evidence, whether or not they actually are evidence. \n\nWhat I am saying is that scientifically the bible is inconclusive at best, and the authorship is dodgy. There is wiggle room. The eye witnesses themselves do not often do the writing, and much later historical confirmation is of the existence of Christians, not of Christ himself. The Jesus story isn't as fool proof as the civil war, or WWII, or the existence of Barack Obama. \n\nThe burden of proof is on Christians, and to blame atheists for turning away on purpose is not very considerate. \n\n", "gilded": 0, "created_utc": "1321915523", "subreddit": "Christianity", "score": 0, "controversiality": 0}
{"body": "No, it has to be in the shape of the Loch Ness monster.", "gilded": 0, "created_utc": "1321918334", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "If only there was a Wikipedia page for \"I need about tree fiddy.\"", "gilded": 0, "created_utc": "1321925167", "subreddit": "funny", "score": 15, "controversiality": 0}
{"body": "and i said to him, i said, loch ness monster what da hell you doing dressed up like a jehova's witness. loch ness monster said...well i need about tree fidty", "gilded": 0, "created_utc": "1321929116", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1321933587", "subreddit": "trees", "score": 3, "controversiality": 0}
{"body": "[I aint giving you no tree fiddy Loch Ness Monster!](http://www.youtube.com/watch?v=9cn7xfBpZ3M)", "gilded": 0, "created_utc": "1321936278", "subreddit": "trees", "score": 3, "controversiality": 0}
{"body": "Fuck that. He'll just give it to that damn loch ness monster.", "gilded": 0, "created_utc": "1321936857", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "tree fiddy?", "gilded": 0, "created_utc": "1321937526", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "And he needs 'bout tree fiddy.", "gilded": 0, "created_utc": "1321942878", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "This reminds me of the time 'bout 7 or 8 years ago, me and the little lady was out on this boat ya see, all alone at night.  When all of a sudden this huge creature, this giant crustacean from the paleolithic era comes out of the water!  It stood above us lookin down with these big red eyes, and I yelled I said \"What do ya want from us monsta?\"  The monster bent down and said \"I need about tree fiddy.\"  I said \"I aint givin ya no tree fiddy you god damn Loch Ness Monsta! Get your own God Damn money!\"  She gives him a dolla!  She thought he might go away if she gave him a dolla, well of course he not gonna go away.  You give him a dolla he's going ta assume you got more!", "gilded": 0, "created_utc": "1321948473", "subreddit": "EarthPorn", "score": 1, "controversiality": 0}
{"body": "I think I'm going to have to lay down some verse\n\nBecause that was a diss half a shot from a curse\n\nYo I drop redditors like a downvoting troll\n\nYou can't stop me can't top me yo I'm on a roll\n\nBlazing faster than /new refresh all night long\n\nWith comments more infectious than the best memetic song\n\nI throw down facts with tact it's true I'm a menace to reddit and you too foo\n\nSo back away from the computer you've had enough for tonight\n\nNow let me exercise my poetic telekinetic might\n\nI could get frontpage by posting a picture of my shit\n\n'Cause I'm so damn interesting, even my toilet knows it\n\nI get tree fiddy orangereds a day\n\nI bet this is the first one comin' your way\n\nSo pick up yo keyboard and hold it over your head\n\n'Cause you're a failed karma-whore, you're downvoted, dead.\n\n\nSHOUTS OUT TO ALL MY REDDITAHS\n\nPEACE", "gilded": 0, "created_utc": "1321953181", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "He's not electable unless the majority of the country agrees with him, which probably won't happen before he dies.  Why maintain the false boundaries of real people being the ideal president?  Superman? Santa Claus? Loch Ness Monster?  Don't they all have the same negligible chance of being President of the USA?", "gilded": 0, "created_utc": "1321954799", "subreddit": "Libertarian", "score": 1, "controversiality": 0}
{"body": "I love how much assumption and validity is given to this story when we have no idea how much of it is true. Most of these comments are based in faith that a woman that we do not know personally is telling the truth that we do not yet have proof of. In that case Jesus saved bigfoot right after he turned the loch ness monsters homemade sherbert sprite punch into jack Daniels at satans birthday party. You saw it on redditt it must be true. Im not saying its isn't but until proof we do not know that it is.  ", "gilded": 0, "created_utc": "1321964933", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Indeed it does, friend. It was an invention of Dr. Frink used while trying to track down the Loch Ness Monster on an episodes of the Simpsons. ", "gilded": 0, "created_utc": "1321990357", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!", "gilded": 0, "created_utc": "1321997859", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "...I need about tree fiddy?", "gilded": 0, "created_utc": "1321999175", "subreddit": "AskReddit", "score": 40, "controversiality": 0}
{"body": "No, it wasn't \n\nbut money was mentioned and the loch ness monster is always funny for his economic irresponsibility.\n\n\nThought it would bring some kind of humor to this \"most depressing of threads\"\n\n\n\nTHANKS BUZZ KILLINGTON!!!\n", "gilded": 0, "created_utc": "1322015560", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "That's too bad, because I owe the Loch Ness monster $10 and I was looking for a way to pay it back.", "gilded": 0, "created_utc": "1322019310", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "It is a myth/legend, much like the loch ness monster. I believe it was made by the First Nations a long time ago to stop their kids from going into Okanagan Lake unsupervised. \n\nI have no idea. According to wikipedia, Okanagan Lake's deepest spot is  232 meters.", "gilded": 0, "created_utc": "1322026574", "subreddit": "ILiveIn", "score": 1, "controversiality": 0}
{"body": "Honestly? Loose Change is probably one of the most debunked things to ever exist aside from that picture of the Loch Ness Monster that turned out to be an elephant trunk on a toy boat.\n\nI'm a reformed truther. I used to be one of you until I opened my mind EVEN FURTHER and discovered that I was being manipulated by these youtube videos that weave facts and speculation together to form a narrative that sounds both exciting and appealing.\n\nI would suggest that you open your mind and perhaps search for the counter-arguments to Loose Change and the other theories. That is, if you're not afraid of being wrong.", "gilded": 0, "created_utc": "1322030513", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "'bout tree fitty.", "gilded": 0, "created_utc": "1322034255", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "That's just Jimmy Wales in a bear suit. \"I need about tree fiddy\".", "gilded": 0, "created_utc": "1322034281", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "I believe the correct way of saying that is \"about tree fitty\"", "gilded": 0, "created_utc": "1322067851", "subreddit": "skyrim", "score": 8, "controversiality": 0}
{"body": "dammit lockness monsta, I work hard fo' my tree fitty!", "gilded": 0, "created_utc": "1322071488", "subreddit": "skyrim", "score": 4, "controversiality": 0}
{"body": "What inspired you to be a cartoonist? And how did you end up working for Nickelodeon? \n\nCan I get a picture of Bigfoot with a bazooka riding the Loch Ness Monster to the tune of Ride of the Valkyries?", "gilded": 0, "created_utc": "1322086754", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Others have posted specific criticism of your claims, so I'll simply ask you to evaluate your threshold for evidence, and whether you give Christian or Catholic claims special treatment in that respect. For example, is there more or better evidence for Catholic miracles than there is for reincarnation? Do you also believe in Bigfoot, alien abduction, ghosts and Nessie? Those all have photographic evidence, even! I find it difficult to imagine a coherent worldview that can reasonably reject Joseph Smith's claims about angels but accepts those of a long dead pope about saints.", "gilded": 0, "created_utc": "1322092159", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Mm, about tree fiddy.", "gilded": 0, "created_utc": "1322096432", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "WHAT DO YOU WANT MONSTA.....Tree fitty.", "gilded": 0, "created_utc": "1322096699", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I'm going to check this out! Like Fuqwon said - Nessie is too smart for his own good I think the treat ball and tug-a-jug will give him some nice stimulation.", "gilded": 0, "created_utc": "1322102292", "subreddit": "dogs", "score": 1, "controversiality": 0}
{"body": "Oh man, you should totally draw Nessie and Sasquatch smoking a bowl and post it on trees!", "gilded": 0, "created_utc": "1322106401", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "\"Half a Dimmy Wawes wanting Tree Fiddy\"\n\nExplain in English what you just posted. Please?", "gilded": 0, "created_utc": "1322107915", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "Last week, Japanese scientists explaced... placed explosive detonators at the bottom of Lake Loch Ness to blow Nessie out of the water. Sir Kurt Godfrey of the Nessie Alliance summoned the help of Scotland's local wizards to cast a protective spell over the lake and its local residents, and all those who seek a peaceful existence with our underwater ally.", "gilded": 0, "created_utc": "1322120262", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "[Dimmy Wawes](http://i.imgur.com/bZKqt.png)\n\n[Tree Fiddy](http://www.youtube.com/watch?v=4qcbgclG4_A&amp;feature=related)", "gilded": 0, "created_utc": "1322120961", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "I don't get out of bed for anything less than tree fiddy. ", "gilded": 0, "created_utc": "1322122552", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Uptokes for National Geographic, exploring the world whilst exploring your own mind. Also, loch ness monsters.", "gilded": 0, "created_utc": "1322126632", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "Yes, and charge tree fiddy for it.", "gilded": 0, "created_utc": "1322136339", "subreddit": "AdviceAnimals", "score": 1, "controversiality": 0}
{"body": "If I tell you \"Bigfoot is real, it exists!\" would you believe me? If you don't, would that mean that you are claiming that Bigfoot does not exist? Do you have proof of that? (and if you believe Bigfoot exists, change the question to the Loch Ness monster, or the Yeti or whatever.)", "gilded": 0, "created_utc": "1322146110", "subreddit": "DebateReligion", "score": 6, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1322167978", "subreddit": "movies", "score": 13, "controversiality": 0}
{"body": "A loch ness monster. Move to Scotland and buy the loch.", "gilded": 0, "created_utc": "1322178442", "subreddit": "AskReddit", "score": -2, "controversiality": 0}
{"body": "NESSIE LIVES!", "gilded": 0, "created_utc": "1322182257", "subreddit": "trees", "score": 0, "controversiality": 0}
{"body": "oh god, been quoting that for years.\n\ni-i need about tree fiddy.", "gilded": 0, "created_utc": "1322187051", "subreddit": "southpark", "score": 2, "controversiality": 0}
{"body": "tree fiddy!  This is my favorite South Park conversation too.  Love it :]  Damn Loch Ness Monster!", "gilded": 0, "created_utc": "1322191365", "subreddit": "southpark", "score": 2, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1322191933", "subreddit": "hardware", "score": 8, "controversiality": 0}
{"body": "This is the opposite (weirdest thing I've seen when getting something delivered).  I ordered a pizza and breadsticks and the delivery guy showed up to me door a lot faster then I expected.  I had forgotten what the total was because I normally get the money due off of the pizza hut screen when it says the guy is driving.  I ask the guy how much it is, and he looked at the box and said \"oh i reckon about tree fiddy\".  I found that really odd but that's when I realize that it was the loch ness monster and I said \"damnit you stop bothering me and asking for tree fiddy\", whereupon the monster snuck off into the bushes.  The actual driver came 20 minutes later and we had a laugh about it.", "gilded": 0, "created_utc": "1322201926", "subreddit": "AskReddit", "score": 12, "controversiality": 0}
{"body": "...then he asked for three fiddy!  So I told him, you go away Loch Ness Monster, I'm making room for thanksgiving leftovers!", "gilded": 0, "created_utc": "1322208146", "subreddit": "pics", "score": -1, "controversiality": 0}
{"body": "Every time I see someone making a joke about Jimmy asking for money, I think of the South Park episode where Chef's parents keep telling the story about the Loch Ness monster asking for $3.50.\n\n\"Get outta here monstah, I ain't givin' you no tree-fiddy\"", "gilded": 0, "created_utc": "1322210305", "subreddit": "IAmA", "score": 6, "controversiality": 0}
{"body": "Tree Fiddy", "gilded": 0, "created_utc": "1322213687", "subreddit": "IAmA", "score": 54, "controversiality": 0}
{"body": "Gagging sounds the same in Japanese I'm sure. Who says the Japanese get to have a monopoly on tentacle monsters either. Never know about that Loch Ness monster...", "gilded": 0, "created_utc": "1322215217", "subreddit": "gonewild", "score": 3, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1322219998", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "About tree fiddy in an hour", "gilded": 0, "created_utc": "1322221868", "subreddit": "videos", "score": 5, "controversiality": 0}
{"body": "Nessie and I are good pals. He's my cryptozoological fuck buddy.", "gilded": 0, "created_utc": "1322221944", "subreddit": "gonewild", "score": 6, "controversiality": 0}
{"body": "My favorite part of this episode is the very end, when the ophthalmologist ask Cartman if he has tree fiddy.", "gilded": 0, "created_utc": "1322227167", "subreddit": "southpark", "score": 2, "controversiality": 0}
{"body": "Goddamnit loch ness monsta i aint givin you no tree fiddy.", "gilded": 0, "created_utc": "1322242498", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Tree fiddy?", "gilded": 0, "created_utc": "1322253633", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "About tree fiddy..", "gilded": 0, "created_utc": "1322259463", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Twenty three?!\n\nI'd peg him for only tree fiddy.", "gilded": 0, "created_utc": "1322262527", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "What the hell you need tree fiddy for boy?", "gilded": 0, "created_utc": "1322269148", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "Probably about tree fiddy.", "gilded": 0, "created_utc": "1322281518", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "About tree fiddy. ", "gilded": 0, "created_utc": "1322284400", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "We do not have to prove that god isn't real. If someone claims that the Loch Ness monster exists, we do not have to prove that it doesn't.", "gilded": 0, "created_utc": "1322300607", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "Because if god is real, *I want to know.* If faster-than-light travel is possible, *I want to know.* If evolution is false, *I want to know.* If I'm wrong about anything important like this, *I want to know.*\n\nI want to understand the universe accurately to the highest degree I can.\n\nThat you refuse to give what you claimed was a \"good reason\" to believe in god because it's \"personal\" tells me everything I need to know. You don't have a good reason at all, you have \"personal experience\" or some other bullshit excuse. People also have \"personal experience\" with alien abductions, with Allah, with Ganesha, with fundamentalist versions of your faith, with the Loch Ness monster, with the geocentric universe and the flat earth, and so on.\n\nIt's far more likely that you've been fooled by your own psyche, like everyone else on the list.", "gilded": 0, "created_utc": "1322302287", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "It's supposed to be very cold around Seattle this winter! Mittens and a scarf wouldn't be a bad idea. \n\nPerhaps he likes...[Lake Monsters](http://www.ravelry.com/patterns/library/nessie-2)?", "gilded": 0, "created_utc": "1322306634", "subreddit": "crochet", "score": 1, "controversiality": 0}
{"body": "THE LOCH NESS MONSTER WAS REAL!\n\nTHE MOON-LANDING WAS FAKE!\n\nHITLER IS ACTUALLY AN ALIEN AND IS IN A COMA IN THE CENTRE OF THE EARTH!", "gilded": 0, "created_utc": "1322335734", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "When it's just one long log that touches the bottom of the bowl and breaks the surface, I call it a Loch Ness Monster.", "gilded": 0, "created_utc": "1322355125", "subreddit": "AdviceAnimals", "score": 2, "controversiality": 0}
{"body": "Only cuz you asked... I like corner stores too \n\nBut at the bodega Papi makes me a hero for tree fitty AND that comes with anything on it.  And they got the jalapeno popprrs them shits is slammin b. [Bodega Bodega Bodega](http://www.youtube.com/watch?v=11nsZ3lEWD0)", "gilded": 0, "created_utc": "1322365180", "subreddit": "nyc", "score": 1, "controversiality": 0}
{"body": "Crate number tree fiddy is the next big crate.", "gilded": 0, "created_utc": "1322401128", "subreddit": "tf2trade", "score": 0, "controversiality": 0}
{"body": "I prefer \"bugfoot\" over \"Loch Ness Monster bug.\"", "gilded": 0, "created_utc": "1322401499", "subreddit": "programming", "score": 63, "controversiality": 0}
{"body": "\"Carl, how many times do I have to tell you? Your permanent record is just a myth, like the Loch Ness Monster, or North Dakota!\"", "gilded": 0, "created_utc": "1322403626", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "I can see it now.\n\"Aye yo biches, jus got a knew pet, fol like Tree fiddy, go loins!\"\nI spelled stuff wrong on purpose, because i assume they can't spell for shit up there anyway.", "gilded": 0, "created_utc": "1322411959", "subreddit": "WTF", "score": 0, "controversiality": 0}
{"body": "You know the loch ness monster but not bigfoot?", "gilded": 0, "created_utc": "1322413863", "subreddit": "programming", "score": 5, "controversiality": 0}
{"body": "Damn you Loch Ness monster", "gilded": 0, "created_utc": "1322427688", "subreddit": "AskReddit", "score": 203, "controversiality": 0}
{"body": "Can I get about tree fitty?", "gilded": 0, "created_utc": "1322429765", "subreddit": "IAmA", "score": 0, "controversiality": 0}
{"body": "How about tree fiddy?", "gilded": 0, "created_utc": "1322430223", "subreddit": "IAmA", "score": 71, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1322432358", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "A friend was visiting town, so I met up with her at the bar with a bunch of her friends (strangers to me).  Someone asks that question, and we go around...\n\n**Stranger 1:** \"Brontosaurus.\"\n\n**Me:** \"That never existed actually, that was an early mix-up of two different skeletons.\"\n\n**Stranger 1:** \"Oh.\"\n\n**Stranger 2:** \"Pterodactyl.\"\n\n**Me:** \"That's not a dinosaur, that's a pterosaur.\"\n\n**Stranger 2:** \"Oh.\"\n\n**Stranger 3:** \"Mine's always been the loch ness monster-y ones?\"\n\n**Me:** \"Plesiosaur?\"\n\n**Stranger 3:** \"Yes!\"\n\n**Me:**  \"Not a dinosaur.\"\n\n*Forever alone*", "gilded": 0, "created_utc": "1322438312", "subreddit": "AskReddit", "score": 574, "controversiality": 0}
{"body": "He's gonna need'bout tree fiddy.", "gilded": 0, "created_utc": "1322438641", "subreddit": "nosleep", "score": 3, "controversiality": 0}
{"body": "cotdamn loch ness monster", "gilded": 0, "created_utc": "1322438700", "subreddit": "IAmA", "score": 6, "controversiality": 0}
{"body": "Loch Ness monster.", "gilded": 0, "created_utc": "1322459016", "subreddit": "funny", "score": 18, "controversiality": 0}
{"body": "Then who took my tree fiddy?", "gilded": 0, "created_utc": "1322459617", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "Have you even notice how close the word 'monster' is to 'mobster'. Now I'm not saying that the Loch Ness monster is in the mob. I'm just saying there are too many similarities for this to be a coincidence ", "gilded": 0, "created_utc": "1322459990", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "Well I'd say about tree fiddy.", "gilded": 0, "created_utc": "1322488209", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "\"Welll it was right about this time I noticed my cell phone was actually a 9-story tall monsta from the late cretacious.  I said god dammit Loch Ness monsta, I ain't gonna give you no tree fitty!\"", "gilded": 0, "created_utc": "1322497395", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I married a very religious girl thirty years ago.  We were both 21.  I had been an atheist since I was 15.  She is still very religious, and still hounds me to become religious.  She insists that I wasn't an atheist when we married.  It's true that I didn't call myself an atheist.  But I was outspoken about the fact that I didn't (and don't) believe in any gods or spirits, bigfoot, nessie, alien visitors, etc.  I think the difference between \"Atheist\"  and \"Someone who thinks exactly like an atheist but doesn't call themselves atheist\" is huge in their tiny minds.\n\nDo I still love her?  Yes.  Would I do it again?  HELL NO!!!  Run friend, run...", "gilded": 0, "created_utc": "1322504870", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Convince you of what, exactly? That there are no gods? That's not an established fact, nor is it one that we claim. Gods, by their very nature, have no nature that can be observed, detected or measured, and this universe, as far as we're concerned, is essentially infinite in expanse. That means that even if a god *could* be detected, we'd have to search every inch of an infinite universe to make sure it didn't. That's simply impossible.\n\nWhat you really have to ask yourself is this, \"At what point would I still consider it intellectually honest to dismiss an unsubstantiated claim, not as categorically untrue, but whose likelihood of truth is so miniscule as to be utterly irrelevant?\"\n\nIn other words, where do you draw the line of reasonable dismissal? Honest politicians? Aliens? Ghosts? The Loch Ness Monster? Supernatural beings and creatures? Angels? Gods? \n\nAt what point do you decide that even if indisputable proof can't be obtained, you can probably move on with your life until sufficient evidence is presented? \n\nAtheism is not a decision, so to speak. Belief is a compulsion that is most often based on proof, evidence, reason, trust, social pressure or some combination thereof. Atheism, being a lack of belief altogether, instead of a belief in no gods, is simply the result of valuing the first 3 of those 5 factors, and realizing that extraordinary claims require extraordinary evidence. \n\nI do not *believe there is no god(s)*, I simply don't consider them necessary for me to be a good person, and I realize that I have no reason to believe that a soul exists, which means there's likely no afterlife either. Until there is sufficient reason to believe such things, I will continue to withhold belief. \n\nThat's all atheism is. \n\n*Also, apologies for the numerous edits.", "gilded": 0, "created_utc": "1322515803", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "tree fitty ...", "gilded": 0, "created_utc": "1322517761", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "Get outta here you loch ness monster!", "gilded": 0, "created_utc": "1322521743", "subreddit": "fffffffuuuuuuuuuuuu", "score": 41, "controversiality": 0}
{"body": "Don't know why he keep askin for tree fiddy... gave him a dollar just the other week now...\n", "gilded": 0, "created_utc": "1322523665", "subreddit": "fffffffuuuuuuuuuuuu", "score": 14, "controversiality": 0}
{"body": "And you know what? I'm okay with that. I'm fine with knowing that we don't know everything. It's sort of beautiful to know that there are still some surprises left out there for us to uncover. \n\n*Nessie, you can't stay hidden forever*", "gilded": 0, "created_utc": "1322530094", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "And you know what? I'm okay with that. I'm fine with knowing that we don't know everything. It's sort of beautiful to know that there are still some surprises left out there for us to uncover. \n\n*Nessie, you can't stay hidden forever*", "gilded": 0, "created_utc": "1322530135", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "And you know what? I'm okay with that. I'm fine with knowing that we don't know everything. It's sort of beautiful to know that there are still some surprises left out there for us to uncover. \n\n*Nessie, you can't stay hidden forever*", "gilded": 0, "created_utc": "1322530160", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "And you know what? I'm okay with that. I'm fine with knowing that we don't know everything. It's sort of beautiful to know that there are still some surprises left out there for us to uncover. \n\n*Nessie, you can't stay hidden forever*", "gilded": 0, "created_utc": "1322530177", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "about tree fiddy.", "gilded": 0, "created_utc": "1322530500", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I'm gonna need about tree fiddy.", "gilded": 0, "created_utc": "1322544610", "subreddit": "pics", "score": 41, "controversiality": 0}
{"body": "Most atheists are sceptics, and some may have become atheist because of scepticism. That scepticism would usually apply to other paranormal and supernatural tales as well, but not always. And not all atheists are sceptics either. There may be some atheists out there who believe in ghosts and yeti and Nessie, etc.", "gilded": 0, "created_utc": "1322548008", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "About tree fitty", "gilded": 0, "created_utc": "1322550871", "subreddit": "chicago", "score": -5, "controversiality": 0}
{"body": "cummon gimme tree fiddy", "gilded": 0, "created_utc": "1322562586", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I've heard a lot of crazy descriptions, but this one wins the prize!  Does she mean a tentacle-y monster like Cthulhu or a lizard-y finned one like Nessie?  ", "gilded": 0, "created_utc": "1322568731", "subreddit": "botany", "score": 1, "controversiality": 0}
{"body": "Woah! That's more than tree fiddy!", "gilded": 0, "created_utc": "1322570168", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Are you a giant crustacean from the paleolithic era?", "gilded": 0, "created_utc": "1322576094", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "the lock ness thing? That isn't an easter egg. He loves Nessie and believes she exists... it just means he found her and is proud. :/", "gilded": 0, "created_utc": "1322582970", "subreddit": "HIMYM", "score": -16, "controversiality": 0}
{"body": "Its an Easter egg because never in the story (past/present/future) are we told that Marshall discovers Nessie. It's just a little \"for the fans\" present as we all know Marshall loves Loch Ness...like a lot. ", "gilded": 0, "created_utc": "1322586524", "subreddit": "HIMYM", "score": 13, "controversiality": 0}
{"body": "but an easter egg is something from something else. Like a little mario toy sitting on a shelf in zelda.. not saying that's happened, but that's an example. Saying that Nessie was caught by a lawyer just means that that could happen in the future of the same story.", "gilded": 0, "created_utc": "1322593859", "subreddit": "HIMYM", "score": -8, "controversiality": 0}
{"body": "Ima need bout tree fitty", "gilded": 0, "created_utc": "1322601812", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "I have. It was FREEZING. I used to go there when I was small because my family had friends that owned a cottage nearby and we stayed there during the holidays. I was obsessed with the Loch Ness Monster and had toys and memorabilia, but alas never spotted him.", "gilded": 0, "created_utc": "1322604604", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "I met DeVito not too long ago. He was a really nice guy truth be told. I was at a Starbucks in LA, and we talked for a good five minutes or so while waiting to get coffee. He was telling me about how different it is being in television now compared to his Taxi days and the weird ways you have much more creative freedom on content, and yet so much less in your use of the language conveying the content. When we got to the counter to order, he realized he didn't have any cash on him, and actually asked ME for some money to pay. Laughing I asked him, \"Wow, famous TV star and you need me to pay for your coffee! How much is it?\" And do you know what he said? \"I'm gonna need bout tree fiddy.\"\n\nNow it was about that time that I realized Danny DeVito was actually eight stories tall and a crustacean from the paleolithic era. And I said, \"Dammit Loch Ness monster, I ain't given you no tree fiddy! I work hard for my money dammit! Now get out of here!\" \n\nI was so angry.", "gilded": 0, "created_utc": "1322611132", "subreddit": "IAmA", "score": 46, "controversiality": 0}
{"body": "[Tree Fitty](http://i51.photobucket.com/albums/f388/mark75101/tree_fitty-1.gif)", "gilded": 0, "created_utc": "1322616100", "subreddit": "guns", "score": 2, "controversiality": 0}
{"body": "Might as well also dig for data: where is the thing from, what does the plant look like, perhaps refine the description, are we talking the nessie type of seamonster or the cthulhu type?", "gilded": 0, "created_utc": "1322618589", "subreddit": "botany", "score": 1, "controversiality": 0}
{"body": "I'm not sure if you actually want to know this, or are just having fun, but I'll take a stab at it (I've never heard of this field before now, but I do have a degree in Pure Mathematics, so I feel I should be able to do something here): \n\nDifferent shapes have different properties.  For example, a drum made in the shape of a circle will produce a different sound than a drum made in the shape of a square, even though both drums may be made from the same material and have the same surface area.\n\nThe field of Spectral Geometry is about studying certain properties that shapes have (a \"manifold\" is essentially a fancy math term for shape).  For a very simple example, one way of telling that a flat surface is different than a curved one is to compare the normals of two different points, and see if they are parallel or not (a \"normal\" is what you get if you take a stick and jab it into the surface such that it is standing straight up with respect to the part of the surface you jabbed it into).  They are just looking at slightly more complicated information about the surface.\n\nI'm not sure if this is being used anywhere in an applied way, but it seems like it might be very useful for determining the shapes of objects based on the sounds they make.  I could definitely see this being used in military or science applications... for example by putting a microphone underwater you may be able to tell the rough shape of an object making noise in the deep (a submarine or the loch ness monster maybe).\n\nConversely, it could be used to design objects with specific acoustic properties.  For example, if you want to design a speaker that delivers the purest possible music without introducing any weird frequencies from the sides or back of the speaker, you could mathematically find the optimal shape to damp out the undesired frequencies.  You could then sell your speakers to audiophiles for thousands of dollars each, with mathematical proof that they are the best.\n", "gilded": 0, "created_utc": "1322619531", "subreddit": "explainlikeimfive", "score": 1, "controversiality": 0}
{"body": "I believe it's more of a \"won't\" on principle then a \"can't\"... but he should be more kindly to the poor loch ness monster.", "gilded": 0, "created_utc": "1322629904", "subreddit": "southpark", "score": 17, "controversiality": 0}
{"body": "&gt; I have said multiple times that the only faith that is empirically justifiable is soft agnosticism. \"I don't know and I don't know if it's possible to know.\"\n\nUnless this is coupled with \"But I believe anyway,\" this is also atheism.\n\n&gt; I just found something that rings true and I'm sticking to it till I have a good reason not to.\n\nIs the Problem of Evil not a good reason?\n\nWhat about the scholarly claim that the Jews were polytheistic until very recently, on the order of 200 BC?\n\nWhat about the fact that with *any other* extraordinary claim, you'd place the burden of proof on the person making the claim, not the person doubting it? Why should God be exempt from this?\n\nIf you want your beliefs to be as accurate as possible -- and I would hope you do -- then the way to do that is *not* to accept a belief until you have a good reason not to, as you would then be forced to accept Bigfoot, UFOs, the Loch Ness Monster, ghost visitations, seances (at least the ones Randi &amp; co. haven't debunked), The Force, and that's before we even get to the contradictory ideas. What's your good reason not to believe in both Yahweh and Odin? They can't both be real, by definition.\n\nIf you don't care whether your beliefs are accurate, then I wonder what you *do* care about when choosing beliefs. I have to imagine you could come up with something more fun to believe in than the Torah. Why not Star Wars? I certainly would like to believe I'm a Jedi. For that matter, why not Zoidberg?", "gilded": 0, "created_utc": "1322633536", "subreddit": "DebateReligion", "score": 2, "controversiality": 0}
{"body": "I would know that based on the knowledge bestowed upon me by my forefathers, yes.  What I wonder, though, is how much of that \"common sense\" is only common because we're standing on the shoulders of giants.  If you took a modern man, brainwashed him...and threw him back in the paleolithic era, would he then know to bend the stick?  Would a feral child know? (I legitimately don't know if a feral child would, although im sure it's been looked into)", "gilded": 0, "created_utc": "1322633988", "subreddit": "science", "score": 34, "controversiality": 0}
{"body": "Playing TF2, decided to use the name Loch Ness Monster, but it was too common, so I switched the L an N.  Figure I've got at least eight names within this username I can break out, as well.", "gilded": 0, "created_utc": "1322636523", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Yeah you don't go be given that monster no tree fitty.", "gilded": 0, "created_utc": "1322668897", "subreddit": "southpark", "score": 5, "controversiality": 0}
{"body": "No. You can't say all morality is subjective - except in X case. That is a logical fallacy and incredibly inconsistent with the very definition of 'subjective' and 'objective'. If something is objective, then there is no way to misinterpret it, it either is or isn't.\n\n\nIt's not black and white for the plain reason that we're even arguing this - one person has already interpreted the event differently, which already means that the morality of the situation is subjective. For example, we generally consider murder (the ending of a human life) to be morally objectionable, but we are willing to be more lenient or understanding when a person murders someone else for a perceived good cause (abusive spouse, etc) - and we even rebrand the act to differentiate even though at its core, it is still ending a human life.\n\n\nThe point? *Context matters.* When I see a video that cuts in after police have started doing something questionable, but does not show what lead up to it, **that is not clear.** I'm not comfortable being smugly certain of what went on through inferring alone - that's intellectually dishonest. When you're making a claim as huge as \"holy shit, the police are corrupt government shills\", you damn well better have evidence with a more solid ground, because catching something that's supposedly that big and widespread should have a hell of a lot more journalistic integrity than a fuzzy, shaky Nessie or Bigfoot video.\n\n\nThe protesters have demonstrably violated the rights of others before by refusing to leave private property (no, you can't protest wherever you want and your rights to assemble do not steamroll everyone else's - if you protest in my house, I have the right to forcibly remove you if you refuse to go), have compromised the safety of others by blocking traffic, and have thrown things at police officers. Am I saying each and every instance of questionable police activity is justified? Of course not, and I believe all of these incidences are worth investigating and bringing down disciplinary action when warranted. Am I saying that because these events are chaotic and neither side's actions are clearly portrayed such that it's impossible to declare an absolute moral judgment? **Yes.**", "gilded": 0, "created_utc": "1322668991", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Hey sorry I didn't read the link that carefully, didn't realize it was advertising a book. The principal is there though, just don't eat solid foods for 24 hours once a week.\n\nHonestly, even just skipping a meal once in a while will benefit. Just don't adjust the other meals to make up for the calorie deficit.\n\nHere's the 2 second rundown on the diets.\n\nThe ketogenic diet is a extremely low carb diet. All you need to do is keep your carbs below ~20g a day. This means avoiding a lot of foods, notably starches, legumes, root vegetables, etc... If it has a label, look at the carbs per serving, if it doesn't, learn the carbs per serving online. Your body then goes into a super fat-burning mode called ketosis. I could not do justice to the science behind it in this short paragraph.\n\nThe paleolithic diet is a natural whole-foods diet that mimics what humans ate in the paleolithic era, a significant timespan in our evolution. There are variations on the diet, but basically you can only eat whole foods and grass fed animals, and must avoid wheat, legumes, vegetable oil, and anything that has a label.\n\nIn my opinion, the combination of being in ketosis as well as cutting out processed food (there are a lot of processed foods advertised as low carb and I don't trust them) is ideal for rapid weightloss.", "gilded": 0, "created_utc": "1322674172", "subreddit": "loseit", "score": 2, "controversiality": 0}
{"body": "Nice try, Loch Ness Monster.", "gilded": 0, "created_utc": "1322675749", "subreddit": "southpark", "score": 4, "controversiality": 0}
{"body": "Around tree fiddy?", "gilded": 0, "created_utc": "1322678089", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "'Bout tree fiddy.", "gilded": 0, "created_utc": "1322684607", "subreddit": "StanleyKubrick", "score": 1, "controversiality": 0}
{"body": "The Succubus from season 3 probably, just because of Chef's parents explaining how they met the Loch Ness Monster and giving him \"about tree fiddy\"", "gilded": 0, "created_utc": "1322691279", "subreddit": "television", "score": 2, "controversiality": 0}
