{"body": "I think you're so way off you're not even asking the right questions. You might as well ask whether people are opposed to chupacabras or not, or what they think should be done about the Loch Ness Monster. It's just nonsensical. If there were people *advocating* the political and commercial union of which you speak, then there's a conversation to have. But I don't see that being done, seriously. It was in Europe -- people talked about it openly, pro and con. But here no-one's seriously talking about it apart from the paranoid cranks who think it's being done by a secret cabal and it's going to be imposed somehow. And you are very hard to take seriously.", "gilded": 0, "created_utc": "1196731909", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I'll get ya chillens for tree fitty", "gilded": 0, "created_utc": "1196921715", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Was. Or Nessie. Oh well...", "gilded": 0, "created_utc": "1197315899", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "BRING ME THE HEAD OF THE CREATURE FROM THE BLACK LAGOON!!!... what?  ... oh really?  ...when was this?  ..umm Ok put it over there, thanks.\r\n\r\nNOW BRING ME THE HEAD OF THE LOCH NESS MONSTER!!!", "gilded": 0, "created_utc": "1197648488", "subreddit": "reddit.com", "score": 42, "controversiality": 0}
{"body": "Tree fiddy! LULZ!!1", "gilded": 0, "created_utc": "1197702283", "subreddit": "reddit.com", "score": -3, "controversiality": 0}
{"body": "72 part video?  That's too much time for me to sit not-believing-in-God.  I'm short on time, what with all my not-believing-in-Bigfoot, and not-believing-in-Nessie.", "gilded": 0, "created_utc": "1197949665", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "The cat obviously conspired with the baby-eating Loch Ness monster in the water.", "gilded": 0, "created_utc": "1198945878", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "I'm sorry, but that footage is about as clear as mud. Up there with the clarity of Bigfoot, or Loch Ness Monster footage.", "gilded": 0, "created_utc": "1199115635", "subreddit": "politics", "score": 0, "controversiality": 0}
