{"body": "When I was 10 years old I stood in front of my class a delivered a book report about the Loch Ness Monster as non-fiction. So yes, the movie's themes are very familiar.", "gilded": 0, "created_utc": "1241211291", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "&gt;Atheists believe in\n\n&gt;Christians believe in\n\nThat's an awfully general statement.  Atheists can believe all sorts of wacky stuff.  They can believe in ghosts, the loch Ness monster, or qi.  They just don't believe in any gods.  Similarly, Christians can believe in methodological naturalism.  Granted, some Christians do believe in these epistemologies, but you'll find, I think, that most people (on either side) do not even bother to think about it; it doesn't affect their day to day lives much.", "gilded": 0, "created_utc": "1241543539", "subreddit": "Christianity", "score": 5, "controversiality": 0}
{"body": "IS reading that hard for you? \n\nHere's one:\n\n&gt;Dawkins holds that the existence or non-existence of God is a scientific hypothesis which is open to rational demonstration. ... Believing in God, whatever Dawkins might think, is not like concluding that aliens or the tooth fairy exist. God is not a celestial super-object or divine UFO, about whose existence we must remain agnostic until all the evidence is in. Theologians do not believe that he is either inside or outside the universe, as Dawkins thinks they do. His transcendence and invisibility are part of what he is, which is not the case with the Loch Ness monster.\n\nA bit more: \n\n&gt;He seems to imagine God, if not exactly with a white beard, then at least as some kind of chap, however supersized. He asks how this chap can speak to billions of people simultaneously, which is rather like wondering why, if Tony Blair is an octopus, he has only two arms. For Judeo-Christianity, God is not a person in the sense that Al Gore arguably is. Nor is he a principle, an entity, or ‘existent’: in one sense of that word it would be perfectly coherent for religious types to claim that God does not in fact exist. He is, rather, the condition of possibility of any entity whatsoever, including ourselves. He is the answer to why there is something rather than nothing. God and the universe do not add up to two, any more than my envy and my left foot constitute a pair of objects.\n\nIn other words, Dawkins' basic understanding of religion is so fundamentally mistaken that much if not most of his book is basically beside the point; he is arguing with a caricature of religion that he's basically made up. ", "gilded": 0, "created_utc": "1241555810", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "\"Two fiddy?  Wummin, don't you go givin' that ol' Loch Ness Monster no two fiddy!", "gilded": 0, "created_utc": "1241595506", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "In high school, I was a staunch creationist, and Kent came to our area. I invited him to our school before class, where (wisely) our principal promptly threw him out. This guy is made of charisma and poison. At the time, I was so blinded by the idea that there could be science supporting my beliefs, that I totally missed the obvious- there was no science in what he was saying at all. He supports the idea that nessie is a modern day dinosaur, that erosion levels in the grand canyon prove that the earth is only 6000 years old, and that the fact some ferns have over 200 genes proves evolution is not possible. He lives on rhetoric and sounds scientific enough to fool the gullible, or more heartbreakingly, those who were like me- desperately trying to find a bridge between the science we knew was true, and the faith we had be ingrained with from birth. It took me 10 years, and a very patient biology professor for me to understand just how far gone I was in this non-sense. I am embarrassed for the actions of my youth, for the people I helped convince, and that I was ever dumb enough to be taken in by this hack.", "gilded": 0, "created_utc": "1241626218", "subreddit": "atheism", "score": 10, "controversiality": 0}
{"body": "That show was so good.  Wikipedia:\n\nThe premise of the show revolved around the idea of Gary Busey teaching Adam de la Pena all about the world. In one episode, for example, de la Pena complained to Busey about his lack of a love life. Busey helped de la Pena become more confident by setting him up with a date and then feeding him lines through an earpiece. During that episode, Busey told Adam to tell the girl that he had \"a Loch Ness monster in his pants.\"\n", "gilded": 0, "created_utc": "1241722770", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "You want [Whirlpool](http://en.wikipedia.org/wiki/Whirlpool_(cryptography\\)). It's 512-bit hash based on modified AES cipher (and has same co author as AES, Vincent Rijmen). It's recommended by the NESSIE and has no known weaknesses. It is slower than SHA-512, though. \n\nI would guess that it is the best hash function in use  until SHA-3 winner has been selected. Speed might be the issue for some uses (~1.7x _slower_ than SHA-512).\n\n", "gilded": 0, "created_utc": "1241809826", "subreddit": "programming", "score": 10, "controversiality": 0}
{"body": "The supernatural.\n\nI consider myself a person of science, and I don't follow any religion.  I'm agnostic/athiest (whatever the difference between those is).  But when I read about, say, UFO sightings with plenty of seemingly qualified witnesses and mounds of evidence, it seems extremely likely that UFOs exist.  Same with a few other phenomena:  Bigfoot, Nessie, crop circles, even ghosts and poltergeist activity. \n\nUnlike Fox Mulder, I *don't* want to believe;  I think beliefs are obstructions to critical thinking.  And critical thinking is the basis of science.  Yet the more I investigate about these supernatural phenomena *while employing my critical thinking*, it just leads me to the conclusion that these phenomena are \"real\".  But to think that is, by the current standards of science, nonsense.  \n\nBut there it is:  if I stop researching the supernatural, it's much easier to dismiss it, all of it.  But the more I research it the more I'm led to the conclusion that our science is woefully incomplete.  Which is, more or less, a belief.  And unscientific.", "gilded": 0, "created_utc": "1242189459", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "It depends on your definition of god. Yes, it's possible, just as it's possible that unicorns or the Loch Ness Monster exists. But what's more probable?\n\nAtheism is the lack of theism. I don't possess a belief in any gods, for whatever justifications I may have for the individual gods. Some definitions of god I can offer actual evidence or philosophical arguments.", "gilded": 0, "created_utc": "1242408057", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "The Loch Ness Monster is keeping his tree fiddy", "gilded": 0, "created_utc": "1242627794", "subreddit": "obama", "score": 2, "controversiality": 0}
{"body": "This is from a movie. Incident at Loch Ness.\n\nhttp://www.imdb.com/title/tt0374639/\n\nEntertaining movie, but it's a spoof documentary about searching for Nessie.", "gilded": 0, "created_utc": "1242658108", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "I did read the book review (and also managed to refrain from any sarcasm). The way you were talking, I thought that you were suggesting that I read the book, as there is absolutely nothing in the review to suggest any kind of slam-dunk against Ditchkins arguments. \n\nTheologians make up any and all kind of tosh. The suggestion that a god-like being may not exist with the space-time continuum says absolutely nothing. So might a magic tooth fairy or the Loch Ness monster. This is just a load of wishy-washy nonsense that I would expect to come out of the mouth of the Archbishop of Canterbury, having finally conceded that the generally accepted view of god can't really exist (or have any more likely chance of existing than any of the other pantheons of gods and supernatural beings that the human mind can conjure up).", "gilded": 0, "created_utc": "1242751059", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Lol I love the comments on the page:\r\n&gt;Looks like BS to me honestly. I think its closest ancestors are Big Foot and Nessie, maybe even the Chupacabbra. Even if it is real, so what? Its a monkey with a tail, that hardly proves anything about the supposed link between humans and apes. What a load of ****. \r\n\r\n&gt;Posted By :david\r\n\r\n\r\n&gt;Hmmm. This begs the question: What are we as humans going to evolve to? Will we grow wings and fly? Will we evolve into mutants as seen in X-Men? Maybe those comic book authors had the same vision as Darwin, eh? We will eveolve into a super race of beings. This \"missing link\" proves that we are still evolving. What will we become? \r\n\r\n&gt;Now back to reality: Science has always been proven wrong and history has proven this to be true. Although Darwin may be close, there will never and I mean NEVER be a link of evolution of man from apes. We have a far more pure purpose. Think about it.\r\n\r\n&gt;Posted By :Karl Stumpf\r\n\r\n\r\n&gt;Evolution is as fallacious as philosophy. Scientists are just as bankrupt in their search for the truth as this man was. \r\n\r\n&gt;\"\"If the facts do not match The THEORY Change the facts!!!\" einstein\r\n\r\n&gt;Posted By :Professor MOmOh", "gilded": 0, "created_utc": "1242752618", "subreddit": "atheism", "score": 13, "controversiality": 0}
{"body": "&gt;Communism, in its ideal, is stateless and \n\nThat's like the Loch Ness monster or Big Foot - it doesn't exist and can't exist (unless for a society made of robots). The only Communism is the real one - Soviet or Chinese. Everybody calls it Communism.\n\n&gt;Socialists tend to create mixed economies of both public and private sector elements.\n\nYeah, I know that this what they say but it's not correct. Say, the French railways are 100% state owned and run. That is a 100% Communist(Socialist) enterprise no difference whatsoever compared to the former Soviet railways. Some other firms are 100% capitalist.\n\nSo, a mixed economy has Socialist enterprises and also Capitalist enterprises. **It's not a new system, it's both systems**, that's my point. You can't really have a new system who isn't capitalist or Socialist, somebody (the state or a person) have to own the thing.\n\nIMO there are only TWO systems, the Social-Democracy is  BOTH systems, not a new one.\n\nIf you have apples and hammers in a bag, the result is not a new object but a collection of objects. There is no such thing as a \"third way\", it's both ways together.\n\n", "gilded": 0, "created_utc": "1242869002", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "The Loch Ness Monster is a trap devised by highlanders to lure thick American/Canadian tourists.", "gilded": 0, "created_utc": "1242876442", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Hell no.  Nessie's secrets are safe with me.  ", "gilded": 0, "created_utc": "1242879899", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "\"That's like the Loch Ness monster or Big Foot - it doesn't exist and can't exist (unless for a society made of robots).\"\n\nThere are people who are willing to work for the benefit of society for the sake of society. If they could implement their ideas democratically, then perhaps it is possible. After all, Anarchist Catalonia and pre-European native tribes shows that humans are capable of proceeding in egalitarian fashion.\n\n\"The only Communism is the real one - Soviet or Chinese. Everybody calls it Communism.\"\n\nBandwagon fallacy. When Lenin, Stalin, and Mao call themselves Communists, do you think they have any interest in the worker, as actual Communists do? They called themselves Communists, yet implemented a system nothing like theoretical Communism, yet you still choose to call it Communism. When propagandists use labels to ascend themselves to power and create systems completely opposite of their supporter's intents, why would you choose to call the system the label?\n\n\"You can't really have a new system who isn't capitalist or Socialist, somebody (the state or a person) have to own the thing.\"\n\nActually, I thought this was an interesting point, which I'd like to expand on. A property can be owned by a government, by individuals, by nothing, or by democratic control by the individuals who operate it.\n\nSo rather, if you choose to define ideologies by ownership of property, we've developed quite many here. State Socialism, State Capitalism, Capitalism, Anarchism, and Syndicalism. Note that the broad genre of Socialism encompasses vastly different economic systems and thus, can be divided into separates.", "gilded": 0, "created_utc": "1242971608", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1243042025", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "I think it looks more like the [Loch Ness Monster](http://en.wikipedia.org/wiki/Loch_Ness_Monster) in a body of water.", "gilded": 0, "created_utc": "1243238784", "subreddit": "WTF", "score": 4, "controversiality": 0}
{"body": "So do I also have faith that an invisible fire breathing dragon doesn't live in my garage? Faith that tiny elves aren't putting lint in my belly button as I sleep? Faith that my parents weren't eaten by bigfoot and now are merely elaborate androids powered by coal? Faith that the loch ness monster isn't hiding in my room? Faith that dinosaurs aren't all still around, just _really_ stealthy? Faith that Frosty the snowman isn't real? Faith that the tooth fairy isn't real? These are just a few of the infinite unprovable propositions that one could imagine. Those beliefs aren't faiths. The belief that no evidence exists for those claims isn't a faith. Neither is the belief that no evidence exists for the existence of god(s)\n\n", "gilded": 0, "created_utc": "1243272350", "subreddit": "worldnews", "score": 2, "controversiality": 0}
{"body": "What willfully ignorant believers/apologists such as yourself conveniently fail to consider is that what you said is neither the *de facto* definition of atheism nor the kind of atheism most atheists subscribe to. \n\nIn practice, what atheism means for most of us is that we've heard the arguments for the existence of a god, but we were simply not convinced. \n\nThe stance we have regarding any notion of god proposed so far is the same we have regarding Bigfoot, Yeti, the Chupacabras, the Loch Ness Monster, fairies, ghosts, demons, etc. We don't say we are *agnostics* regarding any of those, why would we say we are agnostics regarding the idea of god? It was the believers who upped the status of that particular claim, but to us that's just a case of special pleading.\n\nThe fact that \"there is always the possibility\" that such things exist means nothing. Unless there is positive or reasonable evidence for their existence, we're perfectly justified in not believing they exist, and living our lives as if they didn't. \n\nThere's always the possibility that I am actually an alien using my highly advanced mental waves to tap into the Earth's Internet and \"write\" this comment while I reprogram most countries' military system to attack one another. But you'd be crazy to claim agnosticism regarding such possibility just because it can be conceived and not immediately disproven.\n\nSo, you know, fuck the fuck off.", "gilded": 0, "created_utc": "1243381944", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Looks like the Loch Ness monster got the engines on his spaceship working again. Good luck finding your home planet, Lochy!", "gilded": 0, "created_utc": "1243406415", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Aliens??? Get real people. This is clearly an upwelling of gas from a perfectly natural gastronomical process well-known among Loch Ness Monsters.", "gilded": 0, "created_utc": "1243408764", "subreddit": "science", "score": 4, "controversiality": 0}
{"body": "That's where Nessie farted", "gilded": 0, "created_utc": "1243410829", "subreddit": "science", "score": 5, "controversiality": 0}
{"body": "It's Nessie not Lochy", "gilded": 0, "created_utc": "1243422131", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "It just looks like a cloud.. but hell, according to EnglishRussia we've already found Bigfoot, the entrance to the centre of the Earth and the Loch Ness Monster. So why not?", "gilded": 0, "created_utc": "1243452768", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Last week, Japanese scientists explaced... placed explosive detonators at the bottom of Lake Loch Ness to blow Nessie out of the water. Sir Cort Godfrey of the Nessie Alliance summoned the help of Scotland's local wizards to cast a protective spell over the lake and its local residents and all those who seek for the peaceful existence of our underwater ally. ", "gilded": 0, "created_utc": "1243470723", "subreddit": "reddit.com", "score": 5, "controversiality": 0}
{"body": "Nessie just pooped, that's all.", "gilded": 0, "created_utc": "1243481096", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "They still have unions in America? I thought it was a myth - or a trick of the light.  Like the Loch Ness Monster, or corporate pensions... ", "gilded": 0, "created_utc": "1243502223", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt; Basically, designers want to create Loch Ness, but QA ends up telling them it should actually just be a dragon that can turn into a submarine.\n\nThis is what's wrong with designers. Their idea of designing is telling QA and dev that they want \"Loch Ness\" (which is a *lake*) and then getting pissed off when dev delivers a body of water and QA files bugs about how wet it is. *Nessie* is the monster that lives *in* Loch Ness.\n\nI kid. I love you guys. Shine on, you crazy diamonds.", "gilded": 0, "created_utc": "1243522487", "subreddit": "IAmA", "score": 5, "controversiality": 0}
{"body": "Nessie!", "gilded": 0, "created_utc": "1243623520", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "No, it has an 5.7L 8 cylinder in it.  \r\n\r\nBut they are basically overgrown Chevy Cavaliers.  \r\n\r\nAnd I'll give him tree fitty for it.", "gilded": 0, "created_utc": "1243698241", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Actually it's up to bout tree fiddy now", "gilded": 0, "created_utc": "1243739920", "subreddit": "offbeat", "score": 3, "controversiality": 0}
{"body": "$3.50 for the Loch Ness Monster.  ", "gilded": 0, "created_utc": "1243798353", "subreddit": "worldnews", "score": 9, "controversiality": 0}
