{"body": "Tree fiddy?", "gilded": 0, "created_utc": "1217594042", "subreddit": "linux", "score": 1, "controversiality": 0}
{"body": "Call me a dreamer, but I'm still holding out hope for a Nessie-like discovery.  How rad would it be to find a living aquatic dinosaur!", "gilded": 0, "created_utc": "1217605798", "subreddit": "science", "score": 27, "controversiality": 0}
{"body": "I call shenanigans, looks like methane clouds from the combined flatulence of Bigfoot, and Loch Ness Monster, and Chupacabra", "gilded": 0, "created_utc": "1217609229", "subreddit": "WTF", "score": -2, "controversiality": 0}
{"body": "I heard this is where Nessie and Bigfoot go for drinks on the weekend.", "gilded": 0, "created_utc": "1217785636", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I would agree that there is an underlying biological basis for why men are seen as more replaceable than women or kids, which becomes institutionalized in human culture. Males are the natural risk-takers, and the front line to protect the tribe against danger.\n\nHowever, we're not living on the edge of extinction in the paleolithic era. Our biological roles don't justify keeping women \"barefoot and pregnant\", and they likewise shouldn't justify treating men as disposable warriors or workers.\n\nIt's similar thinking that leads to the situations in India and China where girls are seen as a burden for a family, while a boy is an economic benefit. A girl's \"job\" is to be married off and have kids, and boys are better able to secure their parents' future.\n\nEquality is incompatible with forced gender roles.\n\nAs for children, most people have natural urges to protect and nurture them as they are weak and vulnerable, while adults can \"fend for themselves\". However, it can be argued that adults represent a much larger social investment: it can take 15-20 years before an infant really starts pulling their own weight, while an adult can provide for themselves and others. It's harder to replace a productive adult, than a child. That's a callous calculus, almost unspeakable in our society where children are revered. In fact, it's often the same in the media: if an accident occur, it's the loss of children that is lamented, while the adults are dismissed.\n\n", "gilded": 0, "created_utc": "1217788927", "subreddit": "MensRights", "score": 6, "controversiality": 0}
{"body": "It could have been either: Yeti, Bin Laden, Karl Rove, McCain's tiny penis, Nessie, God, etc etc...", "gilded": 0, "created_utc": "1218141230", "subreddit": "reddit.com", "score": 153, "controversiality": 0}
{"body": "I left those concepts behind with Santa, the Easter Bunny, the Tooth Fairy, Big Foot, and the Loch Ness Monster.", "gilded": 0, "created_utc": "1218156712", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "\nNational Enquirer, for our younger viewers, was the Prison Planet of what we used to call \"News Papers\" (more or less, in their case) that were actually printed on paper.\n\nIn addition to conspiracies, UFOs, Big Feet, vampires, Nessie, they also did sleazy celebrity scandals.  \n\nMainstream media, they're not.\n\n", "gilded": 0, "created_utc": "1218159155", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "My IRL nickname is \"Nessie\". I will never get used to sharing it with a mythological creature. ", "gilded": 0, "created_utc": "1218162931", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "&gt; or any that have proved spirit does not exist?\r\n\r\n&gt; Probably just as impossible to prove as it is to disprove.\r\n\r\nHave you ever looked into what the term 'logic' means?  I'm just wondering because you seem to have no concept what the word means, and a lot of difficulty when you try to implement the concept into your thinking.  \r\n\r\nSo basically according to what you're saying, anytime someone points out something that you can't prove *doesn't* exist, you autmatically believe that it *does* exist?  I don't know how you even function in your day to day life with all the preoccupation about fairies, leprechauns, unicorns, the loch ness monster, bigfoot, aliens, the flying spaghetti monster...the list goes on and on.  It seems like that would really clutter your brain.\r\n\r\nPS  Your analogy with the iron ships made me wonder, in your infinite knowledge about him, is God as powerless against iron *ships* as he is against iron *chariots*? jw", "gilded": 0, "created_utc": "1218584776", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Waiting for Nessie now", "gilded": 0, "created_utc": "1218633030", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "http://bugleobserver.canadaeast.com/article/374413\n\nA Nessie lookalike in Canada was spotted last month.", "gilded": 0, "created_utc": "1218633194", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "Maybe in the paleolithic era.", "gilded": 0, "created_utc": "1218654424", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "Maybe they can get back my god damn tree fiddy when they find him.", "gilded": 0, "created_utc": "1218731829", "subreddit": "gadgets", "score": 1, "controversiality": 0}
{"body": "Shit... this is totally gonna make my \"I have the loch ness monster in my swimming pool\" story seem a little lame now.\n\nPeople are such fucking idiots it is unbelievable...", "gilded": 0, "created_utc": "1218733321", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I think it's [this](http://thehorrordome.com/HDSHOPPINGPROPS/SasquatchLARGE.htm) suit with someone's false teeth plus some animal gut for effect.\n\nNope, sorry, but there are no sasquatches, yetis or Loch Ness monsters.\n\nAn alien in a flying saucer told me that.", "gilded": 0, "created_utc": "1218833465", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "If anyone believes this garbage, I have a loch ness monster in my bathtub that I'll let you see for $15.  ", "gilded": 0, "created_utc": "1218844518", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "We're about as likely to find the loch ness monster or sasquatch as we are to find another major oil field. More likely, I dare say.", "gilded": 0, "created_utc": "1219153767", "subreddit": "energy", "score": 1, "controversiality": 0}
{"body": "If the White House didn't hire the Loch Ness monster to assassinate JFK, why have they prevented any official investigation of Nessy's involvement in the Kennedy assasination?", "gilded": 0, "created_utc": "1219189776", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "That's my point, conspiracy theories are dumb. I was being sarcastic. I don't *actually* think that the Loch Ness monster killed Kennedy. ", "gilded": 0, "created_utc": "1219206514", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Loch Ness Monster?  Turns out he's just a fat guy adrift at sea. ", "gilded": 0, "created_utc": "1219243195", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "Same reason we want to believe in UFOs, Santa Claus, The Loch Ness Monster, Leprechauns, The Easter Bunny, God, and the Tooth Fairy: it adds excitement and hope to our otherwise boring lives. If a mythical creature could live in the woods and never be found then that means other magical things could be true as well. Maybe we'll find the pot of gold and go to Heaven and live happily ever after.", "gilded": 0, "created_utc": "1219290822", "subreddit": "offbeat", "score": 2, "controversiality": 0}
{"body": "\"The Great Satan\"\n\"Zionist oppressors\"\n\"Israel's bitch\"\n\nThere's also a long history in Scotland (you may know it as \"Scatchland\") of charging them double for everything. We invented the Loch Ness Monster specifically for this purpose.\n\nThere's little to laugh at Americans for just now, their insane foreign policies will kill us all.", "gilded": 0, "created_utc": "1219573742", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Personal friend of the Loch Ness monster", "gilded": 0, "created_utc": "1219854026", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I agree with terato, one of the major problems with truthers is that they for some reason think that everybody else has to prove that their \"evidence\" is false, not that they have to prove it's true.\n\nThat's not logically valid and not how the non-truther (/bigfoot/UFO/Nessie) world works.\n\nEdit:  Do police scanners (of 2001 vintage) record to MP3?\n\nAnother edit:  Really, from now on I'm going to answer \"Private Investigator\" to question I get from truthers from now on.  At some point we'll see *Truther* Private Investigators of course but that has to be overcome when it happens.\n\nCops have something called \"Chain of Custody\" that follows evidence from when it's gathered all the way until the case is closed; whoever takes possession of it has to sign a form and the form stays with the evidence.  Something like that is needed for 9/11 but obviously I'm crazy if I think that's going to happen, so never mind.", "gilded": 0, "created_utc": "1219869364", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "&gt;The fact that I KNOW you pulled it out of your ass is evidence that it doesn't exist.\n\n\n\nWhy?  Its true that I think it doesn't exist - but the sole reason for that is because I feel there is no evidence for it, and that it is valid to consider something false if that is the case - the very point we're debating.  You can't consider my belief that it is false evidence unless you also accept the reasons I have to believe it false.  After all, if I was of your stated belief, and the concept of \"crack vampires\" came into my head, I'd be keeping an open mind on their existance\n\n\n\nUnder what conditions *do* you consider some zero-evidence claim merits an \"I don't know\" status, rather than false.  Is it just that the person speaking believes it (ie. if you convinced me of your point and *then* I hypothesised a vampire, admitting an \"I don't know\" position, would you change your opinion?)  If some nutcase who genuinely *believed* it was telling you?\n\n\n\n&gt;Same thing with leprechauns, everyone knows they are not real, unicorns, flying spaghetti monster, and whatnot. \n\n\n\nHuh?  I can't see the reasoning behind your examples.  Leprechauns and unicorns are examples out of folklore.  At one time largish groups of people did believe they exist.  There are probably still some that do.  Bigfoot seems exactly the same thing to me, except that its a more modern example with more current believers.  Why the difference?  Is it just popularity?  If so, that's a very different criteria (though a fallacious one): you're considering popular belief as evidence (Argumentum ad populum).\n\n\n\n&gt;I know this makes your head want to explode if you only see two options there.\n\n\n\nNo it doesn't - like I said, I've held that position myself so I understand where you're coming from.  I just believe it to be a flawed position after reasoning through the implications.\n\n\n\n&gt;I say no. It does not necessarily mean this entity is intelligent. \n\n\n\nThen why call it \"God\"? - thats a highly confusing abuse of a term with deep connotations - \"God\" generally denotes an entity with sentience and consciousness (possibly incomprehensibly different consciousness, but like us in some way all the same).  With that semantic confusion removed, your claim boils down to \"in the beginning, there might have been *something*\" which is perfectly unobjectionable to anyone as it says pretty much nothing.  Making specific claims with no evidence is what I object to - theres no reason to think such a thing was a tree, or intelligent, or 3 meters high.  These don't affect us, so holding such a belief or not doesn't particularly matter for our decisions, but treating them differently from entities which *do* affect us is a very inconsistent position.\n\n\n\n&gt;I feel like you're trying to get me to convert to your viewpoint instead of respecting the viewpoint I already have. I feel I am being honest with myself by leaving it at I don't know.\n\n\n\nI am, yes - isn't the very purpose of an argument to either convince, or (preferably) to be convinced.  I don't respect the viewpoint you have because I think it is flawed.  With a similar position, I concluded that I was being dishonest with myself, or at best inconsistent.\n\n\n\n&gt;I just feel as if you think that there is no possibility of there being a supreme being.\n\n\n\nPossibly the sticking point is that \"no possibility\" claim.  Its a dangerous trap to get sucked into using completely different vocabulary, and much stricter conditions on notions like \"belief\" that you use otherwise. It's very easy blind yourself to the fact that you're using different standards even though you're using the same words, so I'll give some definitions:\n\n\n\nThe words \"belief\" or \"disbelief\" do not require \"no possibility\" of being wrong - if they did, they would be pretty useless words, as you can't say *anything* with literally *no* possibility of being wrong.  A belief is simply something you currently consider to be true.  a disbelief is something you currently consider to be false.\n\n\n\nFor example: I believe my fridge has milk in it.  It is possible that someone has broken into my house and emptied the fridge - in fact its *much* more likely than the existance of vampires, gods etc (as I at least have evidence that this *could* happen - just none that it *has*). Nevertheless, its perfectly sensible for me to state \"I believe there is milk in my fridge\", and make decisions, such as whether to buy more, based on that without having to rush home to test the possibility.  Having to waffle with \"I don't know\" answers merely to cover hypotheticals I have no evidence for would be ridiculous in this situation - so why is it acceptable when the entity under discussion is God, Bigfoot or the Loch Ness Monster which by any sensible measure would be *less* likely than my hypothetical milk thief?\n", "gilded": 0, "created_utc": "1220028112", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "You say:  \"That's not really true - there is evidence both ways.\"\n\n--Yeah but you asked for *real* evidence.  Such as a body or a DNA sample.\n\nYou say:  \"Those statements are independant of whether you believe it exists. I've addressed the difference between \"possibility\" and \"belief\" in my other post - its a very important distinction.\"\n\nYes, but you are only leaving it at yes I believe, or no I do not.  You are not even considering that there is another option of \"I am open to both possibilities.\"  Or maybe if I word it like this:  \"I *believe* that both possibilities are possible, I don't choose one over the other though.\"\n\nNow don't get me wrong, there *are* things that I believe in, and there are things that I do not believe in.  Please do not assume that I hold the \"I don't know\" position on every single thing in every situation.  But when it comes to a supreme being/creator/God/whatever, I am open to both possibilities (existence AND nonexistence.)  And I have already given you a reason \"why is there something and not nothing?\".  \n\nYou say:  \"To have any hope of reasoning about the world, I have to make the assumption that these things are false.\"\n\n--Yes, but all of this other stuff about the lochnes monster and turning itself invisible and burrowing into the mud and the aliens from alpha centauri really doesn't have anything to do with my \"I don't know\" position on a supreme being, now does it.  \n\nThere are an infinite number of \"what ifs\" and you are correct about wasting time trying to consider every single one of the what ifs.  But all of this other side nonsense has NOTHING to do with the fact that I just don't know about a supreme being, I believe that existence is just as possible as nonexistence.  Are you at least starting to see where I am coming from, or are you going to try and point out something that doesn't make sense about bigfoot or the lochness monster or aliens or something else unrelated to my position, and then try to apply that to my position on a supreme being?\n\nIt's this simple:  \n\n1)  the universe exists.\n2)  It might have been created by something.\n3)  It might NOT have been created by anything.\n4)  I don't know either way, I believe #2 is just as possible as #3.  \n\nIt just seems to me (and many others) to be a better choice than to either believe in a god or not believe.  We choose to leave it at I don't know, either option is possible.\n\nI don't know how many more times I can reiterate this.  Yes I know that some things in life I have to assume are false in order to make progress (such as the alpha centaurian aliens and nessie's invisibility, etc), but is this really one of them?  Is progress being made if I just say \"OK, I don't believe in God\" or \"OK, I definitely believe in God\"?  \n\nWhat the hell is wrong with people that believe that existence is just as good an option as non-existence?  And why do so many reddit atheists have a problem with this position when I know lots of other people that have this position?  It seems alot of the reddit atheists want to try to make my position seem like it is illogical, like it is not very well thought out, like I don't know what I am talking about, when I have thought about this my entire life (I am 28 by the way - almost 29 - and I have a Bachelor's degree in Biology).  \n\nWhat is wrong with \"OK I see where you are coming from, best wishes to you in your travels.\"  I always get flack for presenting a viewpoint that does not match the same as some of the reddit atheists.  Oh well.  I guess it's not my problem really.  I don't tell theists that their position is flawed, I don't tell atheists that their position is flawed, and I don't tell agnostics that *their* position is flawed.  But I do like to discuss these things with others, it's just that here on reddit I get attacked by people who say \"your viewpoint is not a real viewpoint, you are fooling yourself etc etc blah blah.\"  \n\nCan I get a \"OK, I sort of see where you are coming from, best wishes to you in your journey?\"  \n\n(Hopefully my rantings don't sound too crazy, and hopefully you are starting to see where I am coming from, because I'm pretty sure I see where you are coming from.)", "gilded": 0, "created_utc": "1220037323", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt;Yeah but you asked for real evidence. Such as a body or a DNA sample.\n\nThat is real evidence.  Its just not convincing evidence (at least for - I'd consider the man-hours, various silly scanning expeditions etc that have shown up nothing fairly strong (but not conclusive) evidence for the existance of a being of the size and appearance given by most popular conceptions.\n\n&gt;You are not even considering that there is another option of \"I am open to both possibilities.\" \n\nOf course there is another option.  I'm saying it is the *wrong* option for things we have no evidence for.  Always choosing that option leads to widespread inconsistencies in your worldview such that you can't make rational decisions.  Thats why I don't believe you are consistently applying it as you claim ( a moot point, as I see you admit this below).\n\n&gt;Yes, but all of this other stuff about the lochnes monster and turning itself invisible and burrowing into the mud and the aliens from alpha centauri really doesn't have anything to do with my \"I don't know\" position on a supreme being, now does it.\n\nIt has everything to do with my claim that the default state for hypothesis we have no evidence for should be *disbelief* - the thing I have been arguing for the past few posts.  Are you now admitting that this is indeed not your belief?  If so, then **Why do you not apply the same reasoning to God?**  What exactly is different?  The \"Loch ness monster exists and is an alien\" hypothesis has no evidence for or against.  Just like \"an intelligent being created the universe\".  Why treat one hypothesis any differently to the other?\n\n&gt;1) the universe exists. 2) It might have been created by something. 3) It might NOT have been created by anything. 4) I don't know either way, I believe #2 is just as possible as #3.\n\nIf you're defining \"anything\" as literally *anything*, and applying disbelief to the proposition that this \"anything\" was something we'd call a \"God\" - ie. an intelligent being, then this is a fully atheistic position.  If you *are* giving special treatment to the proposition that that \"anything\" was a God, that you don't to the proposition that it was \"red\", \"3 meters tall\", \"a tree\" etc, then you're being inconsistent.\n\n&gt;I don't know how many more times I can reiterate this. Yes I know that some things in life I have to assume are false in order to make progress\n\nOnce would have been nice - its what I've been trying to ask you for the last few posts!\n\n&gt;Is progress being made if I just say \"OK, I don't believe in God\" or \"OK, I definitely believe in God\"?\n\nYes - it would mean that you're applying your epistemology consistently, rather than making a special case for no reason.\n\n&gt;Can I get a \"OK, I sort of see where you are coming from, best wishes to you in your journey?\"\n\nIndeed, but I also want to warn you that you're going the wrong way, and give you the directions I believe are correct.\n", "gilded": 0, "created_utc": "1220095840", "subreddit": "atheism", "score": 1, "controversiality": 0}
