{"body": "Tree fiddy?", "gilded": 0, "created_utc": "1201902360", "subreddit": "reddit.com", "score": 11, "controversiality": 0}
{"body": "So let's see.\n\n1 a) Yes it's based at least partly on lack of available evidence. It's true that I don't know all of the evidence that there could be, but I know all of the evidence that I've seen and it's not particularly convincing. And yes I don't believe in screaming blue ants for exactly the same reason. What exactly is their argument meant to be here?\n\nb) I account for the laws of the universe without there being a god in the same way that religion accounts for there being a god in the first place. If the \"infinite regression\" can stop at a god that exists out of time, it can also stop at physical laws that exist out of time. The only difference is that my view doesn't require there to be any intelligence there.\n\nc) The universe was created. It was (it seems) created from waves of potential existing outside time. Why is this more absurd than it being created by a sentient being existing outside time.\n\n2 a) - My cat probably doesn't believe in the Loch Ness Monster either. Does that mean it must exist?\n\nAnd I don't go around attacking peoples' beliefs unless they try to force them on me.\n\nb/c) - Lack of evidence.\n\nd) - I don't state categorically that there isn't - simply that there's no particular evidence that suggests there is.\n\ne) - I've seen no proof that god exists.\n\nf) - Point me to some scientific evidence for god then.\n\ng) - If he's omnipotent and omniscient, he knew what he was doing when he created me, so why did he create an atheist?\n\nh) - OK. Skip the proof, at least try some evidence that doesn't have a more rational explanation.\n\n3) - OK. Let's start at the beginning with two different creation stories.\n\n4) - Evolution has been seen to happen. It's a fact. I have read articles that claim to contradict it, but they are about as sensible as ones denying gravity.\n\n5) Never heard an atheist claim this.", "gilded": 0, "created_utc": "1202032386", "subreddit": "reddit.com", "score": 9, "controversiality": 0}
{"body": "The Loch Ness Monster has escaped and is chomping anything long and tubular!", "gilded": 0, "created_utc": "1202067343", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "&gt;taking-away a childhood fantasy that I'm sure you enjoyed until you found out the truth from her that young is just \"wrong\" in my book.\n\nWhy?  Wouldn't it be better for the kid to know that she's getting presents because Mommy and Daddy love her, and not because some magic man with elf slave labor is watching her every move?\n\n&gt;I have a daughter who is ten and a son who is nine, and so far, my wife and I have managed to keep the magical part of Xmas, well... magical.\n\nA fourth or fifth grader who believes in Santa?  I'm surprised that they're not being secretly mocked by their classmates, since most kids that age know better.  In fact, they probably are.  Either that, or they already know and are playing along to keep you happy.\n\nWhy lie to children to make things \"magical\"?  Is the real world not \"magical\" enough already?  And if you *are* going to go that route, why stop at Christmas?  Why not tell them that electricity comes from electric eels being ridden around racetracks by leprechauns?  Why not convince them that rainbows are caused by fairy princesses riding flying unicorns who paint the sky with magic paintbrushes?  Hell, why not just give them one small gift every month and tell them that they're from Bigfoot or the Loch Ness Monster or something?  That would be super magical!  If you're against those suggestions, then please explain how they're qualitatively any different than lying to kids about Santa.\n\nI've never really understood why it's acceptable to blatantly lie to children about a select number of fairy tales, but not others.  It's like some sort of weird collective insanity.", "gilded": 0, "created_utc": "1202101933", "subreddit": "reddit.com", "score": 16, "controversiality": 0}
{"body": "Long ago, a super race of people lived on Mars, and built pyramids and faces and stuff, and they were happy. Humans on Earth were not as smart, and were in fact, quite dumb, spending most of their time clubbing people and stealing their caves. The advanced Martians, who were really a lot like us, traveled back and forth from Mars to Earth and were thought to be Gods, and since they were really a bunch of self-important jerks, they didn't bother to correct anyone. Then, the mysterious 10th planet (Planet X) of the solar system swung by in a highly elliptical orbit and caused a total calamity on both worlds. Mars was totally wiped out, it lost it's atmosphere and everything and became a dead planet, similar in appearance to certain parts of Idaho. Meanwhile, Earth, which had been a kick-ass paradise up until then, was destroyed and devastated. The crust of the planet shifted 90 degrees and so the tropic region became the arctic and vise-versa. Tidal waves and shit totally wiped out just about everything on the face of the planet, and Humans on Earth were sent pretty much back to the stone age, which, truth told, was only a loss of about 20 years of advancement anyway, so it wasn't a big deal. The Martians knew that Planet X was coming, so they prepared to abandon Mars and take shelter on earth, if they could. But they had to wait for the devastation to pass. Meanwhile, since a few of the Martians had fallen into the habit of sleeping with the Humans, often two or three at a time, some of them wanted to try to save the puny sex objects, so they warned Noah that a great flood was coming (Noah wouldn't really have understood the whole Planet X thing) and so he built an Ark and mankind was able to survive. The big catastrophe happened and the Earth was ripped apart, a huge section of it was knocked off the Earth and into orbit where, after a few hundred years, it combined with pieces of Planet X (which was also injured by this cosmic collision) and became the moon. Thus, in a blink of an eye, Atlantis was forever destroyed. Legends say it sank, but that's because the only survivors were the ones not actually on the pieces of Atlantis that were being tossed out into space, and they simply saw the waters of the oceans swarm into the newly-formed large gaping hole in the side of the earth, which made it look like a giant flood had wiped out Atlantis once and for all. Anyway. Once everything settled, the remaining Martians who had been living in a large spaceship came down to Earth, their new home. Their huge spaceship actually landed in the Bermuda Triangle, and the radiation which is given off by the remains of the vessel is what causes all the weird stuff that happens there. They were again treated like Gods, and again, they thought that was totally cool. They lived longer than Man, but found that on the new planet, they were dying. There was some weird disease (Ebola) that was slowly killing them all. But they had a number of years before they were done, so they spread around the world and pretty much started every major religion on Earth before they died. Not because they cared about us, but because they really wanted to be worshipped after they were dead. They thought that'd be cool. A large group of them ended up in Egypt and they were actually almost cool, and they created the Pyramids and the Sphinx in an attempt to create a warning and to tell their history to future generations. They also organized the little Humans in the area and gave them knowledge and stuff and that's why the Egyptian civilization is pretty much the oldest. Other Martians started stuff in Iraq and Asia and stuff, to explain those civilizations, but it really all started in Egypt. And so Humans began to grow, and the Martians died, until they finally found a cure to Ebola (but forgot to share it with us, which would be a big oversight 12,000 years later) and the last few remaining Mankind, seeing that the Humans were a violent and paranoid people who were beginning to eye their \"Gods\" with suspicion, hid themselves away from the public eye, but continued to guide the forces of Man from within. They formed the Illuminati, and their few legions of Human followers formed the Knights Templar. Which then eventually became the Freemasons. They tried numerous times over time to inter-breed humans with the few remaining Martians to create a hybrid race, and these failed experiments resulted in Bigfoot, the Abominable Snowman, and amazingly enough, the Loch Ness Monster. Meanwhile, another group of original Martians, who had left Mars before the devastation, but not come to Earth, ended up back on Mars and began to rebuild their world from the inside at the South Pole. The recent NASA Polar missions were too close to uncovering the truth, and had to be destroyed. Also, they still to this day enjoy traveling to Earth in their saucer-like ships and abducting Humans for a cheap thrill or some quick sex. Basically, they're a bunch of intergalactic hillbillies. Today, the Freemasons work with the Illuminati and numerous governments across the world to guide Humanity, and to try to stop the coming disaster when what's left of Planet X cycles through it's 13,000 year orbit and again side-swipes Earth and Mars. This will happen on December 23rd, 2012, as chronicled in the Mayan calendar.", "gilded": 0, "created_utc": "1202131631", "subreddit": "reddit.com", "score": 14, "controversiality": 0}
{"body": "not quite.  Saying something does not exist is subtly different than saying it does.  If i say there are no flying pink elephants, than the supporting evidence for that would be consistently not finding any.  I would not expect to find steaming piles of elephant poo falling from the sky, and i would not find raining bits of peanut husks.  Much the same way that when i say god doesn't exist, the evidence i find for that is a consistent absence of the aforementioned god (sure enough i have not encountered zeus, mars, krishna, vishnu, or even yahweh, anywhere i've been).  By default, we do not believe in the existence of things until we see evidence, this is why the case is still out on bigfoot, and the loch ness monster.  better to not believe until you have evidence on the positive side of things.", "gilded": 0, "created_utc": "1202182298", "subreddit": "reddit.com", "score": 7, "controversiality": 0}
{"body": "\"Our source... Our source... Our source...\"\r\n\r\nWould that be Jesus, Santa or the loch ness monster because \"our source\" repeatedly, means shit.  Maybe 2013?  It was maybe 1997.  Then maybe 2000.  Then maybe...\r\n\r\nPlease.\r\n", "gilded": 0, "created_utc": "1203001798", "subreddit": "reddit.com", "score": 7, "controversiality": 0}
{"body": "Glad to see the Illuminati and Loch Ness monster made the list. Boosts the credibility substantially.", "gilded": 0, "created_utc": "1203194857", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "$10M was at least a significant portion of the investment - and more to the point, an amount worth advertising. SPACESHIPONE WINS TEN MIL FROM DARPA is a headline. DATAMANCER INC WINS ABOUT TREE FIDDY FROM JOE SCHMOE is a punchline.", "gilded": 0, "created_utc": "1203354537", "subreddit": "programming", "score": 11, "controversiality": 0}
{"body": "Obviously, Bigfoot is involved, and why haven't we seen the Loch Ness monster in awhile?\n", "gilded": 0, "created_utc": "1203438099", "subreddit": "politics", "score": 11, "controversiality": 0}
{"body": "Tree fiddy!", "gilded": 0, "created_utc": "1204013416", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "You mean like Nessie, Bigfoot or Chud, right, but those aren't monsters either.", "gilded": 0, "created_utc": "1204050431", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
