{"body": "It's interesting to realize there's much more compelling evidence and reliable eyewitness accounts for UFOs, Bigfoot, the Loch Ness Monster, and ghosts than there is for any deity.", "gilded": 0, "created_utc": "1283363509", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Orgasm while on dxm while sweating like crazy with euphoria and adrenaline pulsing through your body.\n\nAs Nessie also said, that exhausted feeling in your legs you always just ignore when you're biking for long periods of time :)", "gilded": 0, "created_utc": "1283416257", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I will continue to believe that the Loch Ness monster is a hoax until viable evidence is presented that it's true.", "gilded": 0, "created_utc": "1283452378", "subreddit": "DebateAnAtheist", "score": 2, "controversiality": 0}
{"body": "Background, I met this girl through some mutual friends. We were all pretty big drinkers and would often tear up the dive bar scene as a group around the Twin Cities area. Our group was about 10 people that would often be hanging out together, some times all ten and other times maybe four or five at a time. I was always there. As was she -- Andrea. Fucking Andrea.\n\nTotally crazy nutcase with obvious daddy issues, but at the time I said fuck it -- she was smokin' hot. You know the type, 5'8\", maybe a buck-ten after nine beers and a Big Mac, looked fucking killer in heels and more fun than three lines of cocaine and a hooker. Anyway, we slowly hit off in our drunken stupors over the course of six or so months of being bar flies while the only thing we really had in common was our blood alcohol content levels. Eventually we were going to the bars just the two of us without anyone from the group. People would still tag along at times, but by this point we were fucking legit alcoholics and would stay out til all hours of the night. We were god damn townies.\n\nGod damn Andrea, I tell you what -- that girl sucked dick like she was a starving wolverine trying to rip your dick off with the back of her throat for sustenance. Needless to say, the girl could give head like a champ. Well here's where it gets really interesting. One night she was going down on me like she was at an international dick sucking competition. You know, saliva just rolling down the groin and into the buttcrack -- she was giving it her all. \"Do you want me to keep going?\" Fuck yes I want you to keep going. Christ. I think my dick was reaching negative atmospheres. Things had been getting a little weird and at this point in our \"relationship\" I knew it was most likely going to end any day. Anyway, about four or five minutes into her slobberfest, she raises her head off of my dick and says, \"I need about tree fiddy.\"\n\nFuck dude ... it was about this time that I noticed Andrea was eight stories tall and a crustacean from the Paleozoic Era. At this point I didn't really know what to do. Awkward experience to say the least.\n", "gilded": 0, "created_utc": "1283455289", "subreddit": "AskReddit", "score": 125, "controversiality": 0}
{"body": "I SAID GOT-DAMN LOCH NESS MONSTA, YOU AIN'T GETTIN NO TREE FITTY!", "gilded": 0, "created_utc": "1283475108", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1283513447", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "i usually get out of there with at least tree fiddy", "gilded": 0, "created_utc": "1283547949", "subreddit": "funny", "score": 7, "controversiality": 0}
{"body": "Brontosaurus doesn't exist... Looks more like Loch Ness Monster.", "gilded": 0, "created_utc": "1283572947", "subreddit": "trees", "score": 3, "controversiality": 0}
{"body": "&gt; This I think is your fundamental problem, life did not and does not 'rain down from the heavens'. Panspermia only says that it happens every once and a while, maybe it only happened one time(on earth), possibly with only a single microbe, in this entire solar system.\n\nThat places it in the realm of fantasy, not science. For you, an imaginary event is enough to move something from fantasy to reality.\n\n&gt; ... but we can't say it wasn't. \n\nThis is what makes you a True Believer. A True Believer believes something on the sole ground that it's not impossible. This is not how science works.\n\n* Bigfoot is not impossible, so you are free to believe in Bigfoot, indeed, you are required to.\n\n* The Loch Ness Monster is not impossible, so you are free to believe in the Loch Ness Monster, indeed, you are required to.\n\n* The moral superiority of white men is not impossible, so you are free to believe in the moral superiority of white men, indeed, you are required to.\n\nYour default stance frees you from the boring, overly strict standards of the Age of Reason, where evidence is the final arbiter.\n\n&gt; No educated person would reject it either because there is simply not enough evidence for or against it, to say otherwise is just wishful thinking.\n\nThis is false, and it's one of the many errors you're making. The [null hypothesis](http://en.wikipedia.org/wiki/Null_hypothesis) says if there is no evidence for something, *it is assumed to be false, not true*. For airheads, it's the other way around. The distinction between you and a scientist is the null hypothesis and a respect for evidence. You are the perfect embodiment of the New Age abandonment of reason.\n\n\"It pays to keep an open mind, but not so open your brains fall out.\" — Carl Sagan\n", "gilded": 0, "created_utc": "1283588710", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "&gt;This I think is your fundamental problem, life did not and does not 'rain down from the heavens'. Panspermia only says that it happens every once and a while, maybe it only happened one time(on earth), possibly with only a single microbe, in this entire solar system.\n&gt;&gt;That places it in the realm of fantasy, not science. For you, an imaginary event is enough to move something from fantasy to reality.\n\nRealm of fantasy? I suppose satellites are fantasy to you?\n\nI noticed you conveniently avoided an refutation of any of the basic parts of panspermia. And instead of dealing with the fact its quite possible to seed a planet with a single microbe you relagate it to the realm of fantasy so you don't have to stretch your mind and consider you may have been wrong.\n\n&gt;This is what makes you a True Believer. A True Believer believes something on the sole ground that it's not impossible. This is not how science works.\nBigfoot is not impossible, so you are free to believe in Bigfoot, indeed, you are required to.\nThe Loch Ness Monster is not impossible, so you are free to believe in the Loch Ness Monster, indeed, you are required to.\nThe moral superiority of white men is not impossible, so you are free to believe in the moral superiority of white men, indeed, you are required to.\n\nExcept there is one big difference here, we have no evidence of big foot or the loch ness monster and no reason to believe they exist. There are no baby big foot running around leading us to believe there might be parent big foot. However there are plenty of baby organisms on this planet and we don't know were they original formed or how they got here, the only thing we have are theory's, and until we explore more of the universe that is all we are going to have for some time.\n\n&gt;Your default stance frees you from the boring, overly strict standards of the Age of Reason, where evidence is the final arbiter.\n\nYour default stance frees you from the burden of considering some one else's position, instead immediately relegating things to the realm of fanatasy even if they are perfectly possible because some one told you once that's not how it happened.\n\n&gt;This is false, and it's one of the many errors you're making. The null hypothesis says if there is no evidence for something, it is assumed to be false, not true. For airheads, it's the other way around. The distinction between you and a scientist is the null hypothesis and a respect for evidence. You are the perfect embodiment of the New Age abandonment of reason.\n\nThank goodness we have good reason to believe it has happened (when we did it no less), therefore it would be even more of a folly to think it couldn't of happened in the past.\n\n&gt;\"It pays to keep an open mind, but not so open your brains fall out.\" — Carl Saga\n\nFailure to consider another position simply because you don't like it, while ignoring all the facts makes you an expert on the lack of brains.\n", "gilded": 0, "created_utc": "1283609981", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "&gt; Realm of fantasy? I suppose satellites are fantasy to you?\n\nThe realm of fantasy can be defined as believing anything that isn't impossible, on that ground alone. And you have taken that exact position:\n\n&gt; No educated person would reject it either because there is simply not enough evidence for or against it ...\n\nIn a nutshell, that is the basis of your false beliefs. If you were actually educated, you would realize that a proposition is *assumed to be false* unless and until there is evidence for it, rather than the default airhead New Age posture that something *is assumed to be true* unless there is conclusive evidence against it.\n\n&gt; Your default stance frees you from the burden of considering some one else's position\n\nScience is not about someone's position or opinion, *it is only about evidence*. How long is it going to take you to understand this scientific principle? No amount of opinion or persuasion changes the evidence, the direct observation of nature.\n\n&gt; Except there is one big difference here, we have no evidence of big foot or the loch ness monster and no reason to believe they exist.\n\nThat is the exact position of panspermia -- there is no evidence whatsoever, and copious counterevidence. You are deluded to think panspermia and bigfoot differ as theories.\n\nSaying \"I believe it because it hasn't been disproven\" is astonishingly moronic -- it admits anything whatsoever.\n\n&gt; Failure to consider another position simply because you don't like it, while ignoring all the facts ...\n\n1. There are no facts that support panspermia. Your jackass belief is based solely on the *absence of contradicting facts*, and that is only true because you don't have enough technical understanding of the issues to recognize contradicting facts.\n\n2. It is you who is ignoring the facts. Scientific training, training in logic, would instantly reveal your ignorance of its most basic principles. You are an automatic believer in anything that hasn't been conclusively disproven, i.e. an intellectual garbage disposal. Panspermia just happens to the the most recent bit of trash to float your way.\n\nPanspermia is one of the counterarguments used by the anti-evolutionists, who are obviously grasping at straws:\n\n[The Other Intelligent Design Theories ](http://www.skeptic.com/the_magazine/featured_articles/v12n02_other_ID_theories.html)\n\n", "gilded": 0, "created_utc": "1283623130", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "we will\nsuck yo dick  for tree fitty", "gilded": 0, "created_utc": "1283631051", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1283659912", "subreddit": "food", "score": 4, "controversiality": 0}
{"body": "Yep, my addictions are caused by depression and anxiety, no argument there.  And, I'm going to go with addiction being a bad analogy after some thought while I was at work.  Addiction is subtly different than something like belief in the Loch Ness Monster, there are several outside factors.   \n\nYour definition of delusion seems to be a little different than the one I was using, however.  Maybe the psychological definition implies a disease, I did not mean to imply one.  I'm no psychologist, so I was using this definition (taken from wiktionary.)\n\ndelusion - A false belief that is resistant to confrontation with actual facts.\n\nand this one for faith\n\nfaith - Mental acceptance of and confidence in a claim as truth without evidence supporting the claim. \n\nVery similar, which was my intent when I chose those words.  If I should have used another word please suggest one so this confusion can be avoided in the future.    \n\nIn any case, thank you for the discussion.  ", "gilded": 0, "created_utc": "1283683849", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "The Loch Ness Monster (if it existed) would occupy physical space. Existence of the LNM is a knowable thing. You can't *prove* the existence or not of God. You *can* prove the existence or not of the LNM (for example drain the whole lake, and see what lies beneath). The existence of God, existence of an afterlife, existence sense of self in other people etc are not provable or not provable. Therefore we rely on faith for these. Some people choose to believe there is no God, some that there is the God of the bible (verbatim), some that there is some Higher Being, some that everything is God etc.", "gilded": 0, "created_utc": "1283718390", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Some people were terrified of the Loch Ness monster thing in Mario 64. That doesn't make it a Horror game.\n\nYou could also argue that the Pink Elephants scene in Dumbo was genuinely frightening, but it's still not a Horror movie, etc.", "gilded": 0, "created_utc": "1283738015", "subreddit": "gaming", "score": 0, "controversiality": 0}
{"body": "My grandad died. Don't worry, it gets a bit better from here on.\n\nHe died on a Christmas day back in 2001, and his funeral was before new year's. I remember my nanna holding his bony hand just before he went, she said \"these hands could do most things,\" and it made me cry like a baby.\n\nHe was a man's man, a quiet sort of bloke and his mates who turned up at the funeral were all chiseled out of stone. One in particular, Nessie, was a very close friend, a bit of a tough guy. He was in charge of driving Pop's treasured Valiant behind the hearse from the funeral to the graveyard, and the eulogies at the funeral had clearly taken their toll on him. He was really struggling to keep it together.\n\nSo there we were, sitting outside the funeral on a stinking hot Aussie summer day with all the windows wound down and all stricken with grief. It was Nessie at the wheel, Nanna in the front seat, and me with my two brothers in the back. Nessie was losing it in a big way, but was mortified to be seen crying, so he said \"let's see what's on the radio, eh?\"\n\nHe flicked the switch and the radio came on. Now, poppy was a bit of a ratbag in his day, and he was hard of hearing toward the end, so the volume was maxed out on the stereo. And it immediately began playing the last cassette tape poppy had left in there.\n\nSo this song came bursting out at top volume: http://www.youtube.com/watch?v=5b65Zf6r-RE\n(NSFW audio, but it's a bit of an Australian classic)\n\nWith the windows open, everyone standing around outside the funeral could hear it playing. My mum came sprinting over to the car yelling \"turn it off!\" but Nanna grabbed Nessie's hand before he could flip the switch and cried \"leave it on! It's what he would have wanted!\" \n\nSo there we all were, laughing our guts out and crying buckets at the same time as Kev's Courtin' Song blasted out of the stereo. Some of his mates outside the car were doubled over laughing and crying so hard they needed assistance to stay on their feet. Knowing the old man, this little accident turned out to be a wonderful way to remember him - kinda like his last practical joke on us. \n\nSigh... We miss ya Poppy!", "gilded": 0, "created_utc": "1283758057", "subreddit": "AskReddit", "score": 23, "controversiality": 0}
{"body": "It can.  Show me a soul measuring device, how to use it, to take measurements that can be reproduced in a consistent fashion by independent observers.  All kinds of interesting ideas, theories, and new questions would be introduced by such measurements.\n\nUntil then, saying a thing could be measured is very different from saying it *has* been measured.  I could say you could measure the length of the Loch Ness monster or the invisible dragon living in my garage.  \n\nNow, that may sound condescending, that I'm inflexible and unwilling to change, but the exact opposite is true.  I know exactly what reproducible, independently verified evidence I would need to see to change my mind, and would gladly do so if presented with such evidence.  I am ready and willing to admit I'm incorrect in the face of such evidence, and would gladly attempt to demonstrate to others that your assertion, now backed up by evidence, is correct.  Can you say the same?\n\nI'll get back to you when you can get me that evidence, until then, it's sleepy time. :)\n\nAnd no, the argument doesn't work the other way around.  Just because I can't disprove an immeasurable, unobservable thing exists, doesn't mean I've \"lost\" the argument and that it's just as probable that it does exist.", "gilded": 0, "created_utc": "1283766575", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Its one of those rare things they have heard of, but aren't sure it actually exists.. like big foot or Nessie.", "gilded": 0, "created_utc": "1283796443", "subreddit": "canada", "score": 3, "controversiality": 0}
{"body": "I'll give you tree fiddy.", "gilded": 0, "created_utc": "1283830683", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Odd how people think that by not believing something exists turns them into mass murders.  Just because I don't believe the Loch Ness monster exists, I will turn into a mass murder, no?\n\n", "gilded": 0, "created_utc": "1283864532", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "So, what would you call a person that believes in ghosts, witches, reincarnation, the Loch Ness monster, Bigfoot, leprechauns... but not in any kind of god?", "gilded": 0, "created_utc": "1283877684", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "that's not a moose--the loch ness monster escaped!", "gilded": 0, "created_utc": "1283886493", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Let me tell you about one of my best friends from middle school and into high school. He is my definition of \"badass\" for a host of reasons. His name was Bryan.\n\nBryan came from a nice little family down on 20th street four blocks from my house. We had originally met in the 2nd grade, but didn't realize it at the time because we were pretty young and only met because we were both forced to dress up as Davy Crockett for some inter-class school project. I didn't really know how to dress up as Davy Crockett, so Bryan said he would bring some things he had from home. Dude shows up the next day with two fur hats with raccoon tails attached, leather tunics and fake wooden rifles (you probably can't pull this off today). This was in the second grade. Badass.\n\nAfter that specific school project we didn't really reconnect until the 9th grade -- our first year of high school. Keep in mind that we didn't realize we had met in our childhoods until we met again in the 9th grade in our AV class. Damn straight you read that right. We were assigned some project in that class that had to do with coming up with an original idea and filming it. We all had our little groups we were assigned to and when we were to present our films, Bryan pops in his VHS tape first. His film was more or less what Urban Explorers do, but with Jackass elements to it -- this was the pre-Jackass era. Picking locks to get on top of the local bowling alley, gaining access with his BMX with huge lights to some of our extensive sewer systems along the river and speeding down the highway at over 100mph in his dad's Corolla all on film. Dude was a certified badass.\n\nThe best moment comes after we had graduated. We remained really good friends throughout high school and did virtually everything together. It was the night of his graduation party that I promised him I was coming to and I was running late. I felt pretty bad about it, but I assumed he had a huge party going on with all sorts of people to keep him busy. Anyway, I get to his house and at this point there is cigarette smoke billowing out of the basement where his bedroom was. He didn't smoke. I walk down the stairs through what seems to be a clouds upon clouds of cigarette smoke and into his shifty unfinished basement. I see him sitting alone reclined with an un-ashed cigarette in the left hand. We make eye contact. I could tell something was very, very wrong. He waves me down to his face as if he's about to tell me a deep rooted secret, and he says, \"I need about tree fiddy.\" It was about this time that I noticed Bryan was eight stories tall and a crustacean from the Paleolithic Era. I kind of freaked out a little bit, but after I regained my composure I replied to him in a pretty stern tone, \"God damnit Bryan, I ain't given' you no tree fiddy!\"\n", "gilded": 0, "created_utc": "1283890262", "subreddit": "AskReddit", "score": 50, "controversiality": 0}
{"body": "Neither do I. I'm getting a vague connection to the Loch Ness Monster, but that's it.", "gilded": 0, "created_utc": "1283912493", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "The idea is: is there a superior life form that has created the universe...\n\nTo which, the answer is not simple. But it's a slippery slope:\nWho created the superior life form?\nWho created the superior life form that created that superior life form?\n\nSuch mental arguments can go on forever--therefore it's not worth arguing about whether there even is or isn't a God. \n\nIt's like arguing about the Loch Ness monster, or whether UFOs are aliens or physical phenomena we don't understand yet--it can be argued either way, but no one will ever know 100%. But do we ever know anything 100%? I don't want to delve into epistemology. The evidence we have indicates there is no such superior life form, so being an atheist should be considered \"normal\", and being a believer \"eccentric\".\n\nWhat is more productive, however, is arguing that religion has no reason to exist anymore. Religion is completely irrational. \n\nThe theory of whether there might be a superior life form, would be a hypothesis that lacks some serious evidence of which we cannot test or experiment.", "gilded": 0, "created_utc": "1283919979", "subreddit": "atheism", "score": 7, "controversiality": 0}
{"body": "Yeah, it comes to semantics debate.  You really can't 'know' anything because the brain and your perceptions aren't a flawless tool and everything could be a clever ruse.\n\nYou also generally can't prove a universal negative, which is to say I can't disprove whatever most ridiculous thing exists somewhere.\n\nBut I'd still say that I 'know' that faeries don't exist or that the loch ness monster doesn't exist, even if I can't prove a universal negative or even if I may have a faulty brain.", "gilded": 0, "created_utc": "1283925989", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "The problem is what people *do* because they believe in God. Nobody burns \"witches\" because of the Loch Ness Monster. ", "gilded": 0, "created_utc": "1283949059", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Nessie?", "gilded": 0, "created_utc": "1283950526", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "&gt;&gt; This is the precise opposite of the default scientific outlook -- that a proposition is assumed to be false until and unless there is evidence to support it.\n\n&gt; Are you saying that the scientific method is to assume something to be false unless there is enough evidence to prove it true? \n\nAre you able to decode common English prose? Above you quote me, then turn around and ask whether I meant something other than what I said, *after quoting me*. Well, I don't know how to make this any more clear -- the answer is no, I meant what I said: \"a proposition is assumed to be false until and unless there is evidence to support it.\" Nothing more, nothing less.\n\nWhich of these words are you having the most trouble with?\n\n&gt; Doesn't that infer that science is based on an \"argument from ignorance\" ?\n\nOnly if you disregard what I actually said. What I said was \"a proposition is assumed to be false until and unless there is evidence to support it.\" This encapsulates the [null hypothesis](http://en.wikipedia.org/wiki/Null_hypothesis) : \"The null hypothesis typically proposes a general or default position, such as that there is *no relationship between two measured phenomena* ...\"\n\nThis is how a scientist looks at Bigfoot, or the Loch Ness Monster, or alien abductions -- they are assumed to be false unless and until there is evidence to support them. To take any other position is to be fatally credulous.\n\nAlso, no scientific theory is ever proven true, only false. Philosopher John Stuart Mill summarized this best when he said , \"No amount of observations of white swans can allow the inference that all swans are white, but the observation of a single black swan is sufficient to refute that conclusion.\"\n", "gilded": 0, "created_utc": "1283991097", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "&gt;You seem to confuse \"non-scientific\" or \"not well defined\" with \"not yet known\".\n\nNo, I'm not the only one who does that ... all scientists do that. Scientists assume that something for which there is no evidence is false. This is the opposite of the usual outlook (things without evidence are assumed to be true).\n\nThis skepticism is critical to science, and it has a name -- [the null hypothesis](http://en.wikipedia.org/wiki/Null_hypothesis) : \"The null hypothesis typically proposes a general or default position, such as that *there is no relationship between two measured phenomena*.\"\n\nScience proceeds from this default assumption that there is nothing to a claim, unless and until there is actual evidence to support it. This means scientists don't automatically believe in Bigfoot, or the Loch Ness Monster, or alien abductions, *unless and until there is actual evidence.*\n\nThis skepticism lies at the heart of science, and it explains why science can produce the world you see around you.\n", "gilded": 0, "created_utc": "1283992682", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "&gt; \"Science is not supposed to be an opinion poll, but anyone who tells you that MWI is \"science fiction\" is simply ignorant.\"\n\nCan it be tested? No? Then it is science fiction. That is the default position scientists take about ideas with no evidence. It's why we don't accept Bigfoot, the Loch Ness Monster, or alien abductions, until and unless there is evidence.\n", "gilded": 0, "created_utc": "1283996481", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "&gt; An man can call himself an atheist and then say a short prayer if something goes wrong in life, is he still an atheist. No, he never was.\n\nAn atheist is someone that doesn't believe in the existence of gods. This seems like a rather obvious disqualification doesn't it?\n\nI mean, if I said that I didn't believe in Leprechauns, I can still appreciate a rainbow, right? I just can't excuse myself to running off in search of a pot of gold without seeming foolish. Not believing in god really takes away the need for prayers, trust me.\n\n&gt;  A man who holds up a bible and calls himself a Christian, then kills an abortionist, is NOT a Christian. \n\n**Deuteronomy 17**\n\nIf there be found among you, within any of thy gates which the LORD thy God giveth thee, man or woman, that hath wrought wickedness in the sight of the LORD thy God, in transgressing his covenant;\n\n17:3 And hath gone and **served other gods, and worshipped them, either the sun, or moon, or any of the host of heaven**, which I have not commanded;\n\n17:4 And it be told thee, and thou hast heard of it, and enquired diligently, and, behold, it be true, and the thing certain, that such abomination is wrought in Israel;\n\n**17:5 Then shalt thou bring forth that man or that woman, which have committed that wicked thing, unto thy gates, even that man or that woman, and shalt stone them with stones, till they die.**\n\nI can't imagine [anyone](http://en.wikipedia.org/wiki/Paul_Jennings_Hill) taking that to heart, could you?\n\n&gt;  I googled Atheist principles and found dozens of websites listing those \"fundamental\" principles. So you are wrong, I proved it with evidence.\n\nThis is the best evidence you could find? Telling me you found stuff on google? You didn't even provide any links. The point is somewhat moot though; do you know what kind of deranged lunacy I could find digging through google's links to Christian sites? This isn't the can of worms you want to be opening. Your evidence? When you actually produce links to the supposed holy texts I subscribe to let me know.\n\nMaybe you just hate to admit that atheists don't have holy books. What principles do you have in regards to Loch Ness Monster, Bigfoot, or Homeopathy? Do you have any centralized beliefs about the non-existence of Zeus, Athena, Apollo, Poseidon, or Jeebo? Do you feel at all impaired by your non-beliefs in those gods?\n\n&gt; Secularism; Freedom of religion and freedom from religion.\n\nFreedom from religion means religion not interfering with the lives of the non-religious. There are plenty of non-religious people in the world. Why should we be at all compelled to play by the rules of mystics? For that matter, presuming you're not a Muslim, would you welcome living in the United States if they started enacting Sharia Law for all citizens?\n\nFreedom from religion is a concept secularists pursue to prevent religious laws from taking hold in this country. It is the secularists that are fighting hard for people like me and you to not live by other people's religious laws or beliefs. Freedom of religion means you can inflict religious laws upon yourself only. In the United States these freedoms are worth preserving.\n\n&gt; I have provided evidence, you predictably rejected it. Just like your religious oriented cousins do.\n\nWhat exactly is your evidence then? Non-links to websites with the opinions of others I suppose? You didn't link to anything, so what exactly have you provided? Is this some game you play with people to see if they are reading your comments or something?\n\n&gt; you want to go round and round to prove that the principles you believe in are better than the principles others believe in. Arrogance is no substitute for intelligence.\n\nWhat principals are you referring to exactly? That I don't believe in the fables penned by desert nomads from iron age Palestine? What exactly is it that you believe in?", "gilded": 0, "created_utc": "1284035434", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Either these guys are trolling, or they're idiots. \n\n\\&gt; 2. Prevent the Refs from Speaking Directly to the Crowd.\n\nThey're not speaking to the crowd, technically. They're speaking to officials in the box, the record keepers. The NFL allows mic's for entertainment value - for broadcast. It's a minor point.\n\n\\&gt; 3. No more two-Minute Warnings. \n\nThere are reasons why it exists, such as to enact specialty rules regarding the final 2 minutes of the game or half.\n\nFrom wiki: http://en.wikipedia.org/wiki/Two-minute_warning#Rules\n\n\\&gt; 4. Remove the Mesh behind Goal posts.\n\nFrom a business standpoint, those balls are expensive. There are 36 balls for outdoor games, 24 for indoor, and 12 specially sealed from the manufacturer for the sole purpose of the kicking game. \n\nThe balls are made to exacting standards, and certainly cost upwards of the 80 bucks you'll see from walmart.\n\nEither way, it's not that big a deal to me. Just a point to note.\n\n\\&gt; 5. Encourage End Zone Dancing.\n\nThey do, somewhat. But then again, where is the line? Are we going to see baseketball-esque line dancing? \n\n\\&gt; 6. Allow Tackling of the Kicker and Make him play Other Positions.\n\nThe argument for this was a pretty weak one, as baseball isn't fucking football. \n\nThey don't allow tackling of him for his own damn safety. Dude has his foot so high it's almost touching his face, and then you want to allow some 6-6 tree fitty dude to come pile on him? Fuck that.\n\nAnd why should they let players tackle the opposing coach? No way. As it stands, if he's on the field during play, it's a huge penalty and the player can run him over if coach is in the way.\n\n\\&gt; 7. Allow the Number Zero on Jerseys.\n\nRather trivial, again, this isn't another sport. It's the NFL, not the NBA as the writer compares. I really don't care about nicknames for 00. /sigh.\n\n\\&gt; 8. Make the Players undergo a Criminal Background Check.\n\nI'm pretty sure they do that already, but I have no citation.\n\n\\&gt; 9. Make Coaches Wear Suits.\n\nActually, I kind of agree with this. To what degree, I'm not sure - but the Belechick sweater thing was pretty rediculous.\n\n\\&gt; 10. Eliminate the Overtime Coin Toss.\n\nPhone a fan? Really? No, no, did you *really* just suggest that? /sigh.\n\nWhile the opposing team does win 60% of the time, it's still a 50-50 split as to who's going to get the extra 10% boost. Also, in case the writer wasn't informed, [they're updating the rules.](http://www.nytimes.com/2010/03/24/sports/football/24nfl.html) No longer is that get the ball at the 30, drive the ball 40 yards and kick a 47 yarder. ", "gilded": 0, "created_utc": "1284049545", "subreddit": "sports", "score": 1, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1284060475", "subreddit": "trees", "score": 7, "controversiality": 0}
{"body": "So THAT'S why the Loch Ness monster keeps hitting me up, must've been his ounce of the dankies I stole.", "gilded": 0, "created_utc": "1284061352", "subreddit": "trees", "score": 4, "controversiality": 0}
{"body": "Yeah, but the \"younger as he regenerates\" theory is completely thrown off by Colin Baker being older than 5 and by Sylvester McCoy being much older than 5.  \n\nRegeneration was just invented as a way to keep the series going when Hartnell become too infirm, they've never FULLY established any rules and have even flat out contradicted some.  \n\nIt sort of sucks, but one cannot expect an intact canon when examining Doctor Who.  I mean, he's given like 2 examples of the Loch Ness Monster and I think 3 reason for why Atlantis has sunk.\n\n", "gilded": 0, "created_utc": "1284066883", "subreddit": "doctorwho", "score": 12, "controversiality": 0}
{"body": "I ain’t giving you no tree fiddy you goddamn Loch Ness monster! Get your own goddamn money!", "gilded": 0, "created_utc": "1284082876", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "Ahhh shit, as if showing up at dinner time three days ago wasn't enough.  DAMN YOU LOCH NESS MONSTER.", "gilded": 0, "created_utc": "1284083940", "subreddit": "trees", "score": 3, "controversiality": 0}
{"body": "The Loch ness monster. Just so I can have a friend take a legit video of me and reignite the crazies! ", "gilded": 0, "created_utc": "1284152709", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "**Issues in patch 1.0.9921:**\n\n* I think the 671 million mph speed limit is a bit too restrictive, especially in terms of interstellar travel. How is one supposed to reach other planets within their lifetimes? Or was this inability to move faster than light intended to stop humans from reaching other planets?\n* I think some diseases/conditions need certain nerfs. I mean ones like AIDS, alzheimers, permanent blindness, motor neurone disease, cancer etc. They require too high a research level to limit the effects of, let alone to actually cure.\n* I noticed that all Notorious Monsters on Earth are bugged and do not spawn at all. I have noticed no Kraken, Minotaurs, Loch Ness Monsters, Sirens, Chimeras, gigantic sea monsters or Mongolian Death Worms. Do they even exist? Are they extinct or do they just have a bugged spawn time?\n* The Telekinesis and Pyrokinesis skills are completely non-functional. Are they NYI? Scrapped from the beta? When will they be fixed if they need fixing at all?\n* Do you think testicles should be buffed to withstand more pain and be more durable? I mean hitting a man in the nuts causes overpowered amounts of pain to the point where nut kicking is almost unanimously discouraged by users themselves in combat. Don't you think its about time this feature got fixed.\n* Will tasers get a nerf at all soon?\n\nAs for suggestions of what to place in the 1.1 build. Can I suggest:\n\n* The ability to allow FTL (Faster than light) travel. If thats a bad idea, then the implementation of wormholes leading to other parts of the galaxy. If they already exist, may I suggest increasing the quantity of them?\n* Allowing a cheaper cost and science level to terraform a planet in order to allow lifeforms to inhabit it. Mars is just a barren rock with a dangerously low atmospheric pressure. An unpreventable (As it happened billions of years ago) comet completely fucked the magnetosphere. Venus and Mercury would probably incinerate a human alive if they tried to inhabit it, Europa is not viable without really huge investments in science due to the distance and massive radiation belt that could kill a human in 10 minutes. Titan is not viable because of the hydrogen cyanide in the atmosphere that could poison a human. Any other possibly viable planets are many light years away. It would not be viable for humans to colonise it.\n* Reducing the construction cost of solar panels and nuclear fusion reactors.\n* Balacing out large scale pvp more. I mean in terms of how its become a nuclear weapon stockpiling arms race where if one person attacks, the whole world is gone. Its been like that since the fall of Hitler and the end of World War II.", "gilded": 0, "created_utc": "1284203654", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "Even though I typed it and you had to read it you failed to recognize or acknowledge the need for evidence as a basis for an atheist not believing in god. Scientific tangible evidence if I need to get pedantic to get my point across to you.\n\nDo you believe in Bigfoot, the Loch Ness Monster, green faeries in the garden? If not the basis for your lack of belief is probably a lack of evidence that they exist. Do you believe in the god Zeus? If not you are an atheist with respect to him.\n\nAgain, if this is the first time you've been given this argument as to what an atheist is and why their beliefs, or lack of them, is the way they are then you are just entering this discussion and I think you need to do some reading because frankly it's like joining a discussion about American politics and your first question is \"what's a Democrat\"?\n", "gilded": 0, "created_utc": "1284224043", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "&gt;The idiocy of the atheists on this website have only gone to show me just wrong this post really is.\n\n(Grammer check?)\n\nI was mostly being facetious and kidding around, but seriously, i wasnt trying to offend you or anyone, i was just letting christians know what we atheists think. to us, a large majority of people in the world have literally gone crazy in our eyes. \n\nimagine if the whole world started believing in the loch ness monster. imagine they started making laws based on the loch ness monster. i.e. \"straight people cant get married because the loch ness monster says gays are awesome!\" imagine that there was absolutly no proof that there was a loch ness monster, but people still believed in it anyway. and you were one of a small minority of people that where non-believers in the loch ness. now just replace loch ness monster with christianity and that is where atheists stand. we see mutliple religions and think, \"my god, these people are crazy! why do they believe this stuff? and why are they giving these child rapists so much money? dont they realize that churches dont pay taxes?\" and yes, i put \"my god\" in there as a sarcastic pun. lets not argue about this, because, as Ryft pointed out, we both think the other side is crazy, so its all good! we're both a bunch of nutcases!!", "gilded": 0, "created_utc": "1284228870", "subreddit": "DebateAChristian", "score": 3, "controversiality": 0}
{"body": "Christ on a stick, stop being a logic warrior, you're taking it way too far. It's a work of fiction, whether or not people see it as actual validation to their superstitions is up to them, not the filmaker. Movies about the Loch Ness monster don't play on peoples stupid superstitions any further than making an entertaining movie about them, and considering that Eastwood is directing this flick, I doubt this one will either.", "gilded": 0, "created_utc": "1284258522", "subreddit": "movies", "score": 1, "controversiality": 0}
{"body": "God damn you loch ness monster!", "gilded": 0, "created_utc": "1284271536", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "People believe in the Loch ness monster, Bigfoot, and that Elvis is alive, but that doesn't make it true.", "gilded": 0, "created_utc": "1284274901", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1284300211", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Pretty much the exact evidence that every Religion goes on and they rule the world... are you surprised they do the same thing about Loch Ness monsters?", "gilded": 0, "created_utc": "1284302281", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I'd really like to know if any of the world's cryptozoological creatures really still exist. Things like Bigfoot, Nessie-like creatures, or if there's something crazy we haven't even seen yet.", "gilded": 0, "created_utc": "1284324591", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "no cause in south park its tree fiddy", "gilded": 0, "created_utc": "1284328806", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "&gt;Buddhism springs from Hinduism\r\n\r\nDepending on how you mean that. \r\n\r\nThere were a bunch of different philosophies and schools in India 2500 years ago, which modern scholars put in a box and label \"Early Hinduism\". \r\n\r\nBut this \"early Hinduism\" didn't conform 100% to what we're familiar with today as \"Contemporary Hinduism.\"\r\n\r\nWe might say that \"Contemporary Hinduism\", and Buddhism, and Jainism, and to some extent Sikhism, and probably other schools of thought as well are *all* descendants of \"Early Hinduism\".\r\n\r\n&gt;there is no original version of Buddhism that was all philosophy and not supernaturally rooted.\r\n\r\nThe Buddha was pretty clear that supernatural *beings* at least had no great importance to his school of thought. In his culture a lot of people believed in these, and apparently some didn't. \r\n\r\nHe said, \"You believe in gods, spirits and ghosts? Fine. You *don't* believe in gods, spirits and ghosts? Also fine. The issue just isn't important.\" \r\n\r\nI like to compare it to modern people believing in Bigfoot, alien visitors, or the Loch Ness Monster. Some modern people believe and some  don't, but for most people the issue has nothing to do with their religion. ", "gilded": 0, "created_utc": "1284331517", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Loch Ness monster is definitely a mythical creature. Sasquatch I would like to believe is real but more than likely just another hoax.", "gilded": 0, "created_utc": "1284340915", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "No, that's a Scottish accent, Nessie.", "gilded": 0, "created_utc": "1284341053", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "[](/troll \"about tree fitty\")", "gilded": 0, "created_utc": "1284346026", "subreddit": "fffffffuuuuuuuuuuuu", "score": 12, "controversiality": 0}
{"body": "Probably, for about tree fiddy!", "gilded": 0, "created_utc": "1284349074", "subreddit": "scifi", "score": 1, "controversiality": 0}
{"body": "you know, I haven't thought of that. I shall consult my friends the loch ness monster, santa claus, and jesus for their perspectives.", "gilded": 0, "created_utc": "1284362441", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "&gt; * Telling your children that astrology is nonsense is just the same as telling them that it works. It all comes down to your own personal belief set.\r\n&gt; * Telling your children there is no such thing as the loch Ness monster is just the same as telling them there is one. It all comes down to your own personal belief set.\r\n&gt; * Telling your children that alchemy is nonsense is just the same as telling them that it works. It all comes down to your own personal belief set.\r\n&gt; * Telling your children there is no such thing as a yeti is just the same as telling them there is one. It all comes down to your own personal belief set.\r\n&gt; * Telling your children that phrenology is nonsense is just the same as telling them that it works. It all comes down to your own personal belief set.\r\n&gt; * Telling your children there is no such thing as fairies is just the same as telling them there are. It all comes down to your own personal belief set.\r\n&gt; * Telling your children that faith healing is bogus is just the same as telling them that it works better than going to a doctor. It all comes down to your own personal belief set.\r\n&gt; * Telling your children there is no such thing as invisible dragons is just the same as telling them there are. It all comes down to your own personal belief set.\r\n&gt; * Telling your children that there is no such thing as witches is just the same as telling them that there are. It all comes down to your own personal belief set.\r\n&gt; * Telling your children there is no such thing as the ghosts is just the same as telling them there are. It all comes down to your own personal belief set.", "gilded": 0, "created_utc": "1284372187", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "The Loch Ness monster. ", "gilded": 0, "created_utc": "1284384272", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Atheism is to religion as Bald is to hair colour.\n\n\"organised body pushing a belief set\".... What belief set?\n\nThe very definition of Atheism is a **lack of belief** in god(s).\n\nUnless you want to call not believing in Santa, the Easter Bunny, Nessie etc. a religion too.", "gilded": 0, "created_utc": "1284405264", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Ok...Not a name suggestion but simply a pet peeve.  Do you think your car would have smoother lines and uninterrupted contour of you removed the 'Jerry Damson' advertisement plate form the front bumper?  Those and the stickers dealerships apply have always bugged me.  I get why they do it, but you don't have to keep it.  \nFWIW, I like the name 'Nessie.'  ", "gilded": 0, "created_utc": "1284405587", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "It's funny that people who want proof are the ones who are crazy.  Let's take something else that no one has seen, say the Loch Ness Monster.  Those same \"birthers\" would require proof of the Loch Ness Monster exists.  The ones who believe in the Loch Ness Monster are the crazies.  But if those same once sane people asking for proof now ask for Obama's birth certificate, something no one has seen publicly, then it's those seeking proof that are suddenly crazy?  Wait, not crazy.  But RACIST!!!\n\nSeriously, the left is retarded and hateful beyond comprehension.  All you have is your morbid hatred of others.  But you project this hatred onto others.  You just WANT to believe that conservatives are racist even if you have no justification for such an accusation.\n", "gilded": 0, "created_utc": "1284408226", "subreddit": "politics", "score": -7, "controversiality": 0}
{"body": "Gunna need about tree fiddy.", "gilded": 0, "created_utc": "1284421484", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "I figure this is worth about tree fiddy, give or take about tree fiddy.", "gilded": 0, "created_utc": "1284434717", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Really, Nessie should be sached.", "gilded": 0, "created_utc": "1284458373", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Tree fitty\n", "gilded": 0, "created_utc": "1284465259", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Abouta tree fiddy.", "gilded": 0, "created_utc": "1284490949", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Millions of people have seen God and the Virgin Mary too, that don't make them real. People have reported Bigfoot, Loch Ness Monster, Alien abductions, ghosts, all kinds of stuff. All this proves is that the human mind is easily fooled by what it doesn't understand. Explain me this fucktard, how did they get here in a spaceship before the radio waves from their planet. I am assuming they would have invented the radio hundreds of years before invented intersteller spaceships. ", "gilded": 0, "created_utc": "1284493883", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "That isn't hard evidence. There are thousands of pics and videos of the Loch Ness Monster, crop circles and bigfoot and none of them are real.", "gilded": 0, "created_utc": "1284495599", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "Well congrats then. There is hard evidence for bigfoot and nessie and neither of them have ever been real.", "gilded": 0, "created_utc": "1284496148", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "What about http://www.bluebookarchive.org/? www.seti.org?\r\nI have went through tons of stuff, watched countless hours of video, interviews, books, you name it. I saw a UFO as a kid and was hooked ever since. Then I figured out something one day, and it changed my outlook on a lot of things. I figured out I was in a delusional bubble. I wanted to believe, so I cherry picked data that seemed to prove this belief, and ignored or marginalized data that seemed to go against what I wanted. You are doing the same thing. 50 years ago you could make this case, but technology is so great today with satellite imagery, that most of the old UFO, Bigfoot, Loch Ness Monster stories are just silly now. A casual stroll through the lunatic asylum shows that faith does not prove anything. Friedrich Nietzsche \r\n\r\nIf you *really* want the truth, go [here](http://www.skeptic.com/)", "gilded": 0, "created_utc": "1284502101", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "[loch desk monster](http://officeplayground.typepad.com/new_products/2009/08/loch-desk-monster.html)\r\n\r\n\"I need about tree fiddy\"", "gilded": 0, "created_utc": "1284551824", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "The only thing worse then what happened, will be continuing to let it happen.... Nothing will be more heart wrenching then seeing her get a bf and do all the stuff you wish you could be doing...  Cut her out and move on... maybe when she gets out of her system (bad boy, idiot,asshole) she will rethink her position\n\nGroundskeeper willy said it best... \"Back to the loch with you Nessie\"", "gilded": 0, "created_utc": "1284578301", "subreddit": "self", "score": 1, "controversiality": 0}
{"body": "&gt; That there's not enough evidence to justify either answer and the answer should be deemed unknown.\r\n\r\nThat's not what I said. Once again, I have not been presented with evidence or arguments which sufficiently convince me that the claims theists make are true.\r\n\r\nYou'll note that I never said that there *isn't* enough evidence, only that I haven't *seen* any *convincing* enough. If you have some evidence to present that you think would be convincing, feel free to present it.\r\n\r\nYou'll also note that I don't think the answer should be strictly \"Unknown\". That is how *you* chose to word the weak atheist position. My position, if you could even call it that, is that I simply don't accept the claim that a deity exists. Similarly, I don't accept the claims that the Loch Ness Monster exists. I would certainly not say that whether or not the Loch Ness Monster exists is unknown though, even though that's technically true, because that makes it sound equally likely that it exists or doesn't exist.\r\n\r\n&gt; Nope. The very first part of the definition is \"it asserts that a proposition is necessarily true because it has not been proven false (or vice-versa).\"\r\n\r\nThe opposite of that would be \"Asserting that a proposition is necessarily false because it has not been proven true\". That's completely irrelevant, because I'm not making any such assertion. If you accuse me of doing so, then you are engaging in a complete strawman argument.\r\n\r\n* I'm not asserting that the claim \"A God exists\" is false.\r\n* I said I *dismiss* the claim, or *reject* the claim.\r\n* That is *not* the same as making a positive assertion that the claim is false.\r\n* Similarly, if somebody said to me \"I have a million dollars in my pocket\", and when I asked them to prove it, they refused, then I would dismiss their claim and be on my way.\r\n* I would probably *believe* that they didn't really have a million dollars in their pocket, but I wouldn't make the positive claim that they do not without solid evidence.\r\n* Simply failing to produce evidence of a million dollars is, as I'm sure you're well aware, not proof that the claim is false.\r\n* This is an important distinction.\r\n\r\n&gt; As long as you ignore the full definition, and focus solely on the first part of it, yes.\r\n\r\nInclude as much of the definition as you like. You still fail. At best, that argument can only be applied to atheists who make a positive claim that there are no gods. That is the claim of the strong atheist, not the weak atheist, or of the agnostic atheist, or of the kind of atheist who merely dismisses the claims of theists.\r\n\r\n&gt; It does not make their position rational. A rational position is supported by rational arguments, hence why I deem their position irrational.\r\n\r\nWhat's the most rational answer to the question I posed above about it raining on me at exactly 12:05 tomorrow? Is the most rational position to claim that this is true? Is the most rational position to claim that it is false? Is the most rational position to claim that the answer is not knowable? Go on, tell us...\r\n\r\n&gt; To admit otherwise would be to say that the most rational position is the position where no rational argument is required.\r\n\r\nTo claim that a position is true or false without convincing rational reasons to back up the claim would be irrational. If there is a lack of convincing and rational reasons to be able to make a claim either way, then the most reasonable thing to do is to withhold judgment and dismiss the claim until evidence or a rational argument becomes available. So yes, in the face of a claim that lacks evidence either way, the most rational thing is to dismiss the claim.\r\n\r\n&gt; It contradicts the very definition of what a rational position is, that is, a position supported by rational arguments.\r\n\r\nWhich is why I argue that it's not a position at all. You're the one who keeps trying to force the word \"position\" on to me. All I say is that I reject, or dismiss, the claims made by theists because I have not been sufficiently convinced that their claims are true.\r\n\r\nLet me ask you this then...\r\n\r\nIf somebody makes a claim but you lack the information to evaluate whether it is true or false, what, in your opinion, is the rational position to take?\r\n\r\n&gt; That's because your argument is invalid.\r\n\r\nExplain how. I took your *exact* logic and copied and pasted it, only with a slightly different proposition. You have not been able to explain to me why the logic still makes sense in that case, or why it is invalid to use the proposition I did with the logic you provided, but that the proposition you used was fine.\r\n\r\nYou are attempting to ignore it because you realize the absurdity of your own argument now, aren't you?", "gilded": 0, "created_utc": "1284644827", "subreddit": "DebateAChristian", "score": 1, "controversiality": 0}
{"body": "You should draw eyes on the cast, so it looks like a happy Loch Ness Monster.\r\n\r\nLike This: http://imgur.com/MHzxM.png", "gilded": 0, "created_utc": "1284727744", "subreddit": "pics", "score": 52, "controversiality": 0}
{"body": "about tree fiddy.", "gilded": 0, "created_utc": "1284729944", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1284744033", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "about tree fiddy.", "gilded": 0, "created_utc": "1284753647", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt; Even Atheists follow a faith. It isn't fact that god doesn't exist, it is faith.\n\nI don't believe in the Loch Ness Monster. Do you regard that as faith? ", "gilded": 0, "created_utc": "1284879497", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "What is the Loch Ness Monster?\n\nIf the Loch Ness Monster has some sort of abstract existential quality that can't be disproven, then I would regard that as faith.", "gilded": 0, "created_utc": "1284880906", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "For some (a tiny number) the Loch Ness Monster does have 'abstract existential quality\" (not sure what you mean exactly).\n\nSome believe this, the Monster is unique and not part of an ecosystem. It is (like the Cornish Owlman) a magical creature who's existence cannot be proven or dis proven.\n\nIs my lack of belief in that view faith?", "gilded": 0, "created_utc": "1284881293", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Also, if mankind was never intended to do x, then why did it ever start?\n\nx = eat meat, Why did we start in the Paleolithic Era, many many many years before any of us were born?", "gilded": 0, "created_utc": "1284940721", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "'bout tree fitty. ", "gilded": 0, "created_utc": "1284952761", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Have you read the article?\n\n&gt;The Paleolithic Continuity Theory [...] is a hypothesis suggesting that the Proto-Indo-European language (PIE) can be traced back to the Paleolithic era [...]\n\n&gt;The Slavic languages originated in the Balkans and became linked with the Neolithic expansion. \n\nCall them proto-Slavs if you wish but for other people apparently it makes sense to call them Slavs.\n\nIf Vinča signs are a writing system, they are obviously not a logographic writing system, since there are too few signs. However, who claims that it was a consonant alphabet, I have to admit that I have no idea. I only read the claims that it was a full alphabet.", "gilded": 0, "created_utc": "1284973263", "subreddit": "wikipedia", "score": 1, "controversiality": 0}
{"body": "Ok, make it tree fitty.", "gilded": 0, "created_utc": "1284998154", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "Science is not based on \"belief.\" It's based on evidence. Scientists didn't believe in something and THEN prove it. They may have had a hypothesis about something, but they reserved an assertion of fact until they found evidence. Understanding this is crucial. If someone tens of thousands of years ago believed in atoms, yet didn't have evidence, they were wrong to do so. You wait til there is evidence before you commit to an assertion of fact.\n\nIn a nutshell, religion and pseudo-sciences are based on the ability of people to convince others of something that has no real evidence. Part of the problem is that many people are incapable of discerning between actual evidence and \"evidence\" that amounts to logical fallacies. At that point, it comes down to slick yet faulty arguments, charisma and ultimately cult of personality.\n\nWe as humans are almost always vulnerable to this and science has proven to be pretty effective at cutting through the noise by imposing strict guidelines, namely experimentation and reproduction of results.\n\nSince science is done by humans, its results aren't perfect, and is still subject to abuse, but it's the best we have.\n\nI don't believe in gods for the same reason most people don't believe in the Loch Ness Monster. You either believe in something or you don't. Do I believe that it exists? No. Therefore I don't believe it exists. This is not to be confused with stating that it CAN'T exist, or stating that it doesn't exist.\n\nNot believing in something is a response to an assertion (god exists).\n\nStating that something does not exist is an assertion and therefore requires that you provide evidence.\n\nI don't believe in something without evidence. Ask them why they would.", "gilded": 0, "created_utc": "1285002140", "subreddit": "atheism", "score": 10, "controversiality": 0}
{"body": "I'll give ya tree fitty!", "gilded": 0, "created_utc": "1285008260", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "In general, I agree. But remember that until they found a panda, it was a ghost bear on a list with Nessie and Big Foot. Now they are part of our scientific understanding of the world. Dark Matter, Quantum strangeness, etc, etc. Mind boggling stuff that would seem like magic to scientists in the 1800's. Sure, if I had to put my money on the table, I'm making my bet for no ghosts, no \"residual energy.\" But, I'm also keeping my fingers crossed and having fun as my imagination runs wild at the bumps in the night.", "gilded": 0, "created_utc": "1285043782", "subreddit": "redditoroftheday", "score": 4, "controversiality": 0}
{"body": "I do have a question about the Loch Ness Monster, sorry. You've cleared up that you don't believe (I could have guessed that though).\n\n* What's the general feeling towards the idea of a monster in the lake to the locals of Loch Ness?\n\n* How often do you get loonies showing up looking for it?\n\n* Have you ever met a local who believes?", "gilded": 0, "created_utc": "1285069719", "subreddit": "ILiveIn", "score": 2, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1285074502", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "ThiefOfTime nailed it. You're using an impossible level of certainty to avoid the conclusion that the christian God does not exist, and you _only_ do this for the christian God, not for pink unicorns or Nessie or Zeus.\n\nThat's the core problem of agnosticism, it is either logically inconsistent or equal to a solipsism.", "gilded": 0, "created_utc": "1285077446", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "So, Nessie, are you still being mysterious?", "gilded": 0, "created_utc": "1285086366", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Loch Ness, aka Nessie....anyway.\r\n\r\nLook! a bird!", "gilded": 0, "created_utc": "1285092341", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "My Japanese teacher gave us a quick overview of our [town's/prefecture's](http://en.wikipedia.org/wiki/Kashima,_Ibaraki) dialect once. \n\nHe had moved here sometime in the late 1960s from somewhere in Shizuoka for a new job and was riding the train. The man he was talking to was casually using \"俺\" way too much for his liking (something i'm told is common to 田舎 people but especially common for Ibaraki-Ken). \n\nThen the guy announced that it was his stop and that he was going to fall off the train now. ここから落ちます。It's just the way you say \"disembark\" here. \n\nFurther to what Nessie said, the \"desu\" or \"desyo\" is often said as だっぺ here. I think that the accent here is spoken as if you're a little bit pissed off and bragging.\n\nPeople have told me much of the dialect here comes from Yakuza and Bosozoku culture, I'm not sure if that's true - but you can watch the movie [Shimotsuma Monogatari](http://www.imdb.com/title/tt0416220/), which takes place about an hour from here in Ushiku - one of the main characters is a really funny caricature of a Bosozoku/Yankee Rider - and you will hear a lot of Ibaraki dialect in that film. ", "gilded": 0, "created_utc": "1285105070", "subreddit": "LearnJapanese", "score": 3, "controversiality": 0}
{"body": "Why do plesiosaurs need tree fiddy?", "gilded": 0, "created_utc": "1285108594", "subreddit": "windowshots", "score": 2, "controversiality": 0}
{"body": "If I give you tree fiddy will you go away, or keep coming back?", "gilded": 0, "created_utc": "1285140161", "subreddit": "ILiveIn", "score": 1, "controversiality": 0}
{"body": "I agree.  I'm not saying \"Jesus was real\".  I'm saying, there a few tiny bits of evidence that say he might have been a real person.  That is enough to not say \"he never existed at all, and was completely made up.\"  \nIt's not the same as \"well, lots of people claimed to see aliens, bigfoot, nessie, dragons, fairies, etc.\"  Because we know for a fact that humans exist.  We don't know for a fact those other things exist.  We are debating on whether or not a specific human, who in his lifetime wasn't very famous, existed 2,000 years ago.  I'm simply saying, don't be so sure he didn't exist.  I'm not so sure he did or didn't, but since there are a few things that reference him, I have no reason to call bullshit.  \nI've now spent way too much time commenting on something I couldn't care less about.  ", "gilded": 0, "created_utc": "1285158251", "subreddit": "scifi", "score": 1, "controversiality": 0}
{"body": "Well, it was about that time that I notice that girl scout was about eight stories tall and was a crustacean from the protozoic era.\n\nThe Loch Ness monster\n\nI said, Dammit monster! Get off my lawn! I ain't giving you no tree-fitty!", "gilded": 0, "created_utc": "1285164653", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Do you reply that since you don not believe in god, by extension you also don't believe in satan? Because there is no reason to be insulted when someone asks, just as you should not be insulted when someone asks if you support Loch Ness monsters. It is only offensive if you actually believe in a Loch Ness monster.", "gilded": 0, "created_utc": "1285220003", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Had a few, but this one easily takes the cake.\n\nA friend of mine set me up with one of her girlfriends, with the warning that this girl could be a little crazy (as in, partying crazy and crazy crazy).  Me, being a dumbass 22-year old with no real interest in anything but some sex, saw these things as perfectly cool (and in fact, somewhat positive).  \n\nSo, I agree to meet this girl.  We actually talked before, and she seemed pretty cool; we decided to meet at a bar downtown for a few drinks and some pool, just to keep things low-key.  \n\nWell, she gets there, and she's pretty damn good-looking.  Not model-hot, mind you, but clearly takes care of herself and has absolutely beautiful eyes.  She walks up, smiles, and introduces herself (we'll say \"Mary\" for this story).  I grab her a drink, and we immediately hit it off.  \n\nSo, we're playing pool, and \"Mary\" is just pounding drinks.  She asked for a jack and coke for her first drink, and just pounded it like a shot. \"Alright,\" I'm thinking to myself, \"this girl is nuts, I am *definitely* getting laid tonight.\"  \n\nSo, night goes on, and we're both pretty ripped.  We decide to go for a walk, and she asked where I parked.  I was in a garage near the bar, and she asked to see my car.  Needless to say, I obliged.\n\nWe get out there, and just start going to town on each other.  She tears (and literally tears, I had buttons pop off) my shirt off, and undoes my pants within about 30 seconds of getting into the car, and just starts going wild on me downstairs.\n\nNow, this girl was a pro.  She was after me like she was *hungry* for it, and I was more than willing to take care of her.  So, embarrassingly, I realize that I'm about to cum after just a few minutes of her going down on me.  I say fuck it and just go with it, and riiiiight as I'm about to cum, she stops abruptly.\n\nI look down and say, \"What is it?\"\n\nShe looks up at me with those gorgeous blue eyes, and just says, \"I need about tree fitty.\"\n\nWellll it was right about this point that I noticed this bar skank was actually an eight-foot tall monster from the late cretaceous.  ", "gilded": 0, "created_utc": "1285292703", "subreddit": "AskReddit", "score": 157, "controversiality": 0}
{"body": "Mind you, the average life expectancy in the Paleolithic Era was 33 years.  \n", "gilded": 0, "created_utc": "1285309584", "subreddit": "Fitness", "score": 6, "controversiality": 0}
{"body": "The true death of ghosts, bigfoot, and the loch ness monster: High-res photography and HD video. Until people upgrade their shit, we're going to have to keep looking at grainy old black and white ambiguity.", "gilded": 0, "created_utc": "1285337806", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "&gt; Anyone have anything in particular you think needs to be captured on camera?\n\n1. John Stewart\n2. Stephen Colbert\n3. An Ent wearing a trees tee\n4. A sign with the alien logo\n5. A redditor going wild\n6. A UFO\n7. Bigfoot\n8. The Loch Ness monster\n9. The funniest pro-reason sign you can find\n10. The funniest pro-fear sign you can find", "gilded": 0, "created_utc": "1285345995", "subreddit": "ColbertRally", "score": 1, "controversiality": 0}
{"body": "&gt; THIS\n\n&gt; IS\n\n&gt; TREE FITTY!\n\nFTFY", "gilded": 0, "created_utc": "1285379057", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I've got one better for you using your logic and reasoning.  I don't need to prove Santa Claus exist, you need to prove he doesn't exist.  All I have to do is point to references of him with no actual evidence, and then *you* have to definitively prove his non-existence.  Here we go...\n\n* Santa must exist, even Norad tracks him, and they are an official part of the US govt.\n\nhttp://www.noradsanta.org/\n\n* Santa has various public facing sites, the stories, his appearance, and theme of his sites are all consistent.\n\nhttp://www.claus.com/village.php\n\nhttp://www.northpole.com/\n\n* I can even get physical proof in a letter from Santa, or a I can get recording or phone call between myself and Santa\n\nhttp://www.santa-claus.com/\n\n\nSo, now you have to disprove his existence in each point and site that I linked to.  I can pull up dozens of more links for you to refute as well.  And, we can also play this game with the Loch ness monster, bigfoot, assassinations, elves, leprechauns, any ufo sighting, or 9/11.  Proof is not, 'someone said..', 'anonymous sources have told me..', etc. Otherwise you have to disprove every time someone presents a lie as a valid info.  The burden of proof is not to disprove the existence of things, it's the burden to prove existence with evidence that's more than he said / she said.  Because, I can find thousands of people, mostly younger, who will testify and tell you that they believe Santa exists.  ", "gilded": 0, "created_utc": "1285448175", "subreddit": "conspiracy", "score": 0, "controversiality": 0}
{"body": "I think I'll go with the [Monday Demonstrations](http://en.wikipedia.org/wiki/Monday_demonstrations_in_East_Germany) 20 years ago.\n\nEdit: Also, there were finds from the Paleolithic Era and Roman graves in the village I grew up in, first written mention was in the 8th century.  \nThe city where I went to uni has seen some good and bad history as well, like Bauhaus, Buchenwald Concentration Camp, the founding of a short-lived republic and a couple of [famous residents](http://en.wikipedia.org/wiki/Weimar#Famous_residents_of_Weimar).", "gilded": 0, "created_utc": "1285486706", "subreddit": "history", "score": 3, "controversiality": 0}
{"body": "Get away from me, Loch Ness Monster!", "gilded": 0, "created_utc": "1285489186", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "Can i borrow that tree fiddy?", "gilded": 0, "created_utc": "1285506929", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "Janine Melnitz: Do you believe in UFOs, astral projections, mental telepathy, ESP, clairvoyance, spirit photography, telekinetic movement, full trance mediums, the Loch Ness monster and the theory of Atlantis? \n\nWinston Zeddemore: Ah, if there's a steady paycheck in it, I'll believe anything you say. \n\nGhostbusters, 1984", "gilded": 0, "created_utc": "1285529252", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "I'm not falling for *that* one again, Loch Ness Monster!", "gilded": 0, "created_utc": "1285549430", "subreddit": "relationship_advice", "score": 2, "controversiality": 0}
{"body": "That's no whale, it's the god-damned Loch Ness Monster!", "gilded": 0, "created_utc": "1285570666", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "That'll be tree fiddy. ", "gilded": 0, "created_utc": "1285570831", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Let me start out by saying that I don't follow the Paleo diet, haven't really read about it specifically, I'm not an expert, etc. But this is sort of a fun question, so I thought I'd give it a go.\n\nBasically -- and this applies to both grains and legumes -- the time in which we've been using these food sources so pales in comparison to the vast periods in which we were *not* using them, that even though we've been consuming them for millenia, they can still be justly viewed as \"new\" additions to the human diet. Bear in mind that the paleolithic era reaches back 2.5 *million* years, and its end was marked by the arrival of agriculture about 10 thousand years ago. So the entire period that we've been consuming grains and legumes is equal to only 1/250th of the total period *before* we began using them. And that's only the time frame during which our ancestors were pretty much modern humans -- prior to the ascent of the genus *homo* (that's us), you've got another 65 million-ish years of previous pre-hominid primate evolution. So that ratio is more like 1:6500. So if all of human evolution was scaled to equal one year, we've only been consistently eating grains and legumes for about the last hour and 20 minutes. Which is pretty recently, comparatively speaking.\n\nI can't speak to the physiological specifics of our ability to use those sources of food healthfully -- obviously we can use them, since they form the staple foods of most of the world's diets. But I suppose it's reasonable to argue that as a species, we may not have fully adapted to these food sources yet. As a comparison, look at dairy foods -- we domesticated goats and cows in roughly the same era as we developed agriculture, and yet we know that 75% of adult humans alive today have problems digesting milk, up to and including total inability to digest lactose. So just in terms of the time needed to fully adapt to a new food source, it would seem that the 10 thousand year range is still recent enough to potentially cause problems for a significant percentage of people. \n\nSo I suppose the rationale is that while we clearly *can* eat grains and legumes, we might not be as fully suited to them as we are to much older sources of food of the kinds we would have spent tens of millions of years hunting and foraging.\n\nOf course, one could also argue that practically none of the foods available to us now have much resemblance to anything we'd ever have hunted or gathered. Modern pigs are pretty far removed from wild boar, and no *homo habilis* ever saw a raspberry. \n\nI have no idea about the chicken skin thing. Maybe someone else knows. :) ", "gilded": 0, "created_utc": "1285587884", "subreddit": "loseit", "score": 7, "controversiality": 0}
{"body": "Opposing groups have disputed the accuracy of the findings, claiming insead that AIDS and cancer are caused by the Loch Ness Monster. \n\nIt seems like neither party has all the answers. Clearly more work is needed to resolve this controversy. ", "gilded": 0, "created_utc": "1285593361", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "The other day I took a picture of my shit... Does this count? It was huge.  I nicknamed it \"Nessie\"", "gilded": 0, "created_utc": "1285682305", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Sir, I'm prepared to offer you about tree fiddy to keep the present format.", "gilded": 0, "created_utc": "1285696872", "subreddit": "nfl", "score": 2, "controversiality": 0}
{"body": "The media also invented AIDS and crack cocaine. Err, wait, that was the CIA. Either the CIA or the Illuminati, for sure. And as we all know, the 9/11 attacks were perpetrated by the Loch Ness Monster, who was trying to cover up the fact that the Moon landing was staged.", "gilded": 0, "created_utc": "1285700148", "subreddit": "guns", "score": 1, "controversiality": 0}
{"body": "Your naïveté is shown by the fact you believe in something that has yet to be proven to be real.  By your crazed, twisted logic, you **must** believe in the Loch Ness Monster, Bigfoot, Santa, and my pet T-Rex I keep in my pocket.  There is as much evidence suggesting those are real as there is evidence for the soul.  Just because it's something that makes you feel warm and fuzzy doesn't mean it gets a free pass when it comes to logic.", "gilded": 0, "created_utc": "1285700760", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "You are correct.  I came on a little strong, but I've explained that I was playing a little devil's advocate.  It didn't go well.  I attempted to describe a natural, as in non-metaphysical, situation in which the presence of an entity attributed to individuals (described by the link as a soul) which could exist beyond the physical body which could not be disproved.  In turn I was accused of believing in the Loch Ness Monster, which I do not, but I have seen some pretty big feet.", "gilded": 0, "created_utc": "1285701743", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Tell them that you're the Lochness Monster and you need about Tree Fiddy.", "gilded": 0, "created_utc": "1285720372", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I completely nuked your loch ness monster.", "gilded": 0, "created_utc": "1285735347", "subreddit": "funny", "score": 20, "controversiality": 0}
{"body": "&gt; Who really knows about anything in life, if there is a god, which, if any religion is true.\r\n\r\nWho really knows if fairies and Santa are real, if the loch Ness monster exists, if there is a big foot, if Carl Sagan really did have an invisible dragon in his garage, if Russell's teapot really is out there orbiting the Earth...\r\n\r\nIf only we have some method of figuring out which of these things we should accept and which we should reject!", "gilded": 0, "created_utc": "1285756386", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "got dayumn loch ness monsta! you aint gettin my tree fitty!", "gilded": 0, "created_utc": "1285764431", "subreddit": "funny", "score": 13, "controversiality": 0}
{"body": "&gt; tree fitty\n\nFtfy", "gilded": 0, "created_utc": "1285767616", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Just like there are no bands out there who openly claim the Loch Ness Monster doesn't exist.  God doesn't matter to atheists.  I guess it does happen from time to time, but most folks know only a believer can stop themselves from believing.", "gilded": 0, "created_utc": "1285772514", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "the abominadable snOOOOOwman! and you know what he want? YOU KNOW WHAT HE WANT?! tree fitty.", "gilded": 0, "created_utc": "1285788033", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Also, it's not gremlins, it's the loch ness monster again, tryin to get mah tree fitty.", "gilded": 0, "created_utc": "1285791799", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt; \"The War of the Worlds\" radio broadcast... \"Could something similar happen today, and why?\" ... I can't imagine anything further from the truth. We are no more skeptical than they are.\n\nAre you kidding?  We're probably the most skeptical generation in recent history, thanks to two things: photoshop, and the information on the internet.  Abundant cheap travel helps, too.\n\nLoch Ness monster.  The Cottingley Fairies.  These are phenomena that the vast majority of people would immediately dismiss today, as we recognize that any photograph can be altered.  We're subjected to so much falsehood on the internet on a daily basis, you *have to* develop bullshit filtering skills.  It's a far cry from the days where your main source of information was the radio and the newspaper.\n\nWar of the worlds radio broadcast today?  Twitter would be awash in \"That's funny, I don't see any alien war machines here...\" posts.\n\nThe internet has a million pairs of eyes, able to communicate their observations with the rest of the world instantly.  Information flows more freely now than it ever has before.", "gilded": 0, "created_utc": "1285821035", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "This part is true:\n\n\"The internet has a million pairs of eyes, able to communicate their observations with the rest of the world instantly. Information flows more freely now than it ever has before.\"\n\nAnd that is why we would laugh at the broadcast. But I already said that.\n\nBut I disagree with this part:\n\n\"you have to develop bullshit filtering skills. It's a far cry from the days where your main source of information was the radio and the newspaper.\"\n\nI'm going to guess you're intelligent. I'm going to guess you spend a lot of time online. And most likely, you don't spend a lot of time with the bottom half of the world in terms of skepticism and intelligence. Which is why I think you have a false view of the average person's skepticism and intelligence.\n\nYou're correct that we are more skeptical of images, but I think you are using that to draw more conclusions than you should. That is one specific area, and I argue that it is not a product of a change in our way of thinking, but simply a product of a change in technology. I agree with you-- we see so much image manipulation that most of us are more skeptical of images, but do people apply that same skepticism to other areas of life?\n\nBelief in things like astrology, homeopathy, alien sightings, and so forth are not decreasing, at least not to my knowledge. (Admittedly I'm going off of basic impressions here, and I have no hard facts.) Almost half of our country believes Obama is a Muslim and that he faked his birth certificate. People still pass on chain mail and spend millions on fad diets, ineffective weight-loss pills, and so forth.\n\nAnd even in that one area of image manipulation where we should be particularly skeptical, the truth is we often aren't. I don't know how familiar you are with the whole \"ACORN\" scandal, but just in case, I'll give you a brief rundown. Basically, a couple of people filmed themselves dressed as an over-the-top prostitute and a pimp, walking up to the steps of the offices of a community organizing group (they try to get people registered to vote.) They then dressed in respectable, professional clothes, and went into the ACORN office and told a story about the man being here with his sister, a former prostitute who was trying to find a place to stay. The ACORN people worked with her to provide government-discounted housing. That pair then spliced all of this footage together to make it appear that ACORN was giving discounts to a prostitute to run her brothel.\n\nDid this work? Hell yes, it worked. It destroyed ACORN entirely, despite the fact that courts ruled against the charges pressed against ACORN and the people involved ended up getting hit with major fraud charges. But ask around-- not your friends and relatives, but ask 20 random people around town what they know about ACORN. Call random names in the phone book. Turns out, a huge percentage of the population still believes that ACORN makes a habit of giving houses to prostitutes to use as brothels.\n\nAgain, I don't argue that we can be fooled by the same things we were fooled by before. Of course we benefit from experience and collective knowledge. A scam that happened in recent history is less likely to trick people again, and a scam that is commonly used will lose (some of) its effectiveness. HOWEVER, I really don't think that we are any more likely to carefully scrutinize it or intelligently evaluate claims today than we were before, and it is only through accident or circumstance that we might be more discerning, if we are at all.\n\nBy the way: do you believe fewer people today believe in the loch ness monster than believed it in the past? I'd like to see evidence of that. I actually don't think it's true. I think it's always been sensational, and in the news, but always regarded with skepticism by the silent majority.", "gilded": 0, "created_utc": "1285825579", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "3 guys each wearing the frame off a camping backpack. front guy had a head, middle guy had a hump, back guy had a tail. together, the loch ness monster was swimming through a crowd of runners. i think they were actually scottish dudes raising money for some charity at the chicago marathon... last year? maybe '08?", "gilded": 0, "created_utc": "1285825653", "subreddit": "running", "score": 1, "controversiality": 0}
{"body": "I completely agree with you about the downvoting. I don't like the anonymous downvoting that goes on here, either. \n\nNow, about those cloud seeding things: Cloud seeding has been around a long time, and it's done in very specific ways under specific circumstances, and it doesn't look like a contrail. \n\nI really question the logic of associating cloud seeding with these *trails we see. These \"chemtrails\" don't look like cloud seeding, but *do* look and behave exactly like the contrails that have been around for decades. \n\nWhat does it prove, that cloud seeding happens? That chemicals indeed are released by aircraft? Isn't that kinda like pointing to your pet goldfish as proof the Loch Ness monster is real? \n\nI wouldn't doubt that other atmospheric experiments have been conducted. In fact, I saw one years ago that produced very dramatic effects in the sky -- but it didn't look anything like a contrail. \n\nThat's the thing that gets me about this social phenomenon: They are seeing something that has been going on for decades, and acting as if it's a new, sinister thing. They must have an incredible lack of awareness of what's been going on for decades to get excited about it and to spin it into something like a really big deal. \n\nOne of the videos asks, \"Have you looked at the sky lately?\". Incredible. I have to ask them, \"Did you just now discover it?\". ", "gilded": 0, "created_utc": "1285868105", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "I live near DC and you can't get SHIT for $250k.  You need at least tree fiddy.", "gilded": 0, "created_utc": "1285882417", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
