{"body": "I'd give $100 back, I only need about tree fiddy.", "gilded": 0, "created_utc": "1275370959", "subreddit": "AskReddit", "score": 116, "controversiality": 0}
{"body": "I'd just given him tree fiddy the week befo!", "gilded": 0, "created_utc": "1275395395", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "'bout tree fiddy", "gilded": 0, "created_utc": "1275408317", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "bout tree fiddy", "gilded": 0, "created_utc": "1275531106", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "...and it was about that time I realized the arm was the damn Loch Ness Monster.  I said \"Damn it monster!\"", "gilded": 0, "created_utc": "1275614689", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "You get outta here, you Loch Ness Monster!  I'm keepin' my tree fity!", "gilded": 0, "created_utc": "1275652128", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I'm pretty sure TR is the entire reason underwater levels creep me out to this day. I remember playing II when I was 7ish or so, and I was just, \"Swimming along, swimming along, ooh do I spy a health pack over theOH MY FUCKING GOD SHARK JESUS CHRIST HELP ME.\"\n\nNot to mention Nessie in III. *shudder*", "gilded": 0, "created_utc": "1275663776", "subreddit": "DoesAnybodyElse", "score": 4, "controversiality": 0}
{"body": "&gt; There is a difference between writings about Goblins and writing about God, people who write about Goblins know they are writing about fictional beings so part of being a goblin is being mythical and not real. People who write about God often believe it to be a real construct so the God they are writing about has a property of existing in some form (and they could just be wrong in their claim but they are still making a claim).\n\nMany people thought (some still do) that creatures like goblins, elves and fairies were real. Even modern mythical creatures like Bigfoot and the Loch Ness Monster have suprisingly many believers.", "gilded": 0, "created_utc": "1275672721", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Sharks, giant squid, loch ness monster, sea serpents...I'm just spit-balling here. \n\nAnd yeah, fuck this and everything about it. I'm pretty sure my nightmares just got more fodder. ", "gilded": 0, "created_utc": "1275706044", "subreddit": "reddit.com", "score": 10, "controversiality": 0}
{"body": "I ain't givin you no god damn tree fiddy! Godammn loch ness monster.", "gilded": 0, "created_utc": "1275731241", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "They weren't calling him an idiot for disagreeing, it was the complete disregard for what they were try to explain to him. They made two main parallels in the two part video.\nInnocent/Guilty and the Loch Ness Monster. Both parallels they all agreed on but when they switched it back over to theism he instantly rejected the parallels that were just made in favor of making atheism seem like it was making a positive claim. I would say their insults were justified.", "gilded": 0, "created_utc": "1275736536", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "'bout tree fiddy.", "gilded": 0, "created_utc": "1275862156", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "Tree fiddy you say?", "gilded": 0, "created_utc": "1275886431", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "Get outta here, Loch Ness Monster.", "gilded": 0, "created_utc": "1275896017", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "I couldn't agree more. It's probably something to do with the little green men on the moon and the Loch Ness monster. I would be willing to bet ANYTHING that the cigarette smoking man is involved.", "gilded": 0, "created_utc": "1275935427", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "can you have the dinosaur say, \"dis aint no muthafuckin triceratops\" but you read it in the same voice as \"i need about tree fiddy\"", "gilded": 0, "created_utc": "1275938574", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I don't need one fuck, I need about tree fiddy", "gilded": 0, "created_utc": "1276094144", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "You want a conspiracy theory? I'll give you one:\nJfk was in ties with bigfoot and the Loch Ness Monster, under the command of the Lizard people and King Kong, to kidnap the Twin Towers and sell them to the Nazi aliens of Pluto (Which is now not a planet thanks to them) who would use them to make hidden nuclear weapons and place then on the moon to blow it up, Why? 3 days man... 3 days...", "gilded": 0, "created_utc": "1276290490", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "Did he look like the Loch Ness monster?", "gilded": 0, "created_utc": "1276376161", "subreddit": "AskReddit", "score": 9, "controversiality": 0}
{"body": "He got about tree fitty.", "gilded": 0, "created_utc": "1276377439", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "You gave him tree fitty? No wonder he keep coming back here.", "gilded": 0, "created_utc": "1276378808", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "tree fiddy.", "gilded": 0, "created_utc": "1276407030", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "http://en.wikipedia.org/wiki/Cat_intelligence\n\nThat seems to suggest otherwise.  In particular, the fact that the cat brain is more similar to a human's than a dog is to a human's.\n\nYou can find support for just about anything (even things wrong many times over) with a google search.  I can find sites that have 'proof' that UFOs exist, or Bigfoot/Yetis, or the Loch Ness Monster, etc.  It's more important where that information is coming from, than whether or not you found it.\n\nAdditionally, your view of intelligence is probably biased based on the culture you've adopted.  A lot of America tends to be pro-dog, with little or no reasoning behind it other than the typical \"man's best friend\" crap.  You may idolize the \"follower\" behavior of a dog, but don't particularly like the individualized, more independent nature of a cat, which to me signifies greater intelligence than something that merely \"does what it's told\".", "gilded": 0, "created_utc": "1276446540", "subreddit": "science", "score": 7, "controversiality": 0}
{"body": "Seems as real as the Loch Ness monster, the healing effects of homeopathy, your life on astrology, or \"the secret\". ", "gilded": 0, "created_utc": "1276521660", "subreddit": "cogsci", "score": 2, "controversiality": 0}
{"body": "Check out a show called \"In Search Of\" hosted by Leonard Nimoy. It's kind of like Ghost Hunters, except it was mainstream - on a major network during prime time. \n\nFolks in the 70's were into ouija boards, ghosts, ESP, the Loch Ness Monster (before he stole that tree fitty), Bigfoot, subliminal marketing - all this stuff was treated as unproven fact by most folks. \n\nI think today's kids are more skeptical. ", "gilded": 0, "created_utc": "1276556826", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I'm with Nessie, shinsei bank only charges 4,000 and you can do it over the phone anytime, super handy although it seems Lloyd's is cheaper. ", "gilded": 0, "created_utc": "1276587757", "subreddit": "japanlife", "score": 1, "controversiality": 0}
{"body": "No, one must not assume that the simplest answer is correct, first of all. Also, what about poltergeist or ghost events that have been witnessed by several people? I'm not making any claims as to what poltergeists or ghosts are--it could be anything from the improbable scenario of aliens fucking with us for kicks to a more scientific crossover from other dimensions or parallel universes, but just because we can't explain something doesn't mean that it can't have happened. There are things that are \"supernatural\" that *have* been scientifically tested, like the crazy shit Buddhist monks can do. We still don't know how they do it, but they do it.\r\n\r\nSkepticism is the way to go, but open-minded skepticism, not just insisting it can't possibly be just because you haven't seen it yet. Gorillas used to be considered as unreal as Nessie.", "gilded": 0, "created_utc": "1276630360", "subreddit": "entertainment", "score": -5, "controversiality": 0}
{"body": "Loch Ness monster balls I've been shot!", "gilded": 0, "created_utc": "1276659690", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "If I save your life...you could repay me about tree fiddy.", "gilded": 0, "created_utc": "1276715445", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "'Cabela's Mythical Hunts'  A hunting game where you hunt for different regions' legends and myths.  For example, Bigfoot, Hodag, Loch Ness Monster, El Chupacabra...  Possibly 'MonsterQuest's mythical Hunts'.  ", "gilded": 0, "created_utc": "1276728153", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "That whole episode where said past nastifcation took place was several different shades of awesome. My favorite: \"Oh, a lesson in not changing history from mister 'I'm My Own Grandfather'\"\n\nOr possibly the conspiracy nut taking a picture of the ship that developed into one of the loch ness monster.", "gilded": 0, "created_utc": "1276731260", "subreddit": "AskReddit", "score": 35, "controversiality": 0}
{"body": "even the friendly plesiosaur (loch ness monster) in that cave creeps me out. I have a huge fear of underwater things larger than me.", "gilded": 0, "created_utc": "1276779154", "subreddit": "gaming", "score": 10, "controversiality": 0}
{"body": "Yeah, I guess we don't see eye to eye on this one.  \n\nThe IWC finally got their heads out of their asses in time to enact a ban on commercial whaling.  They were within a hair of wiping out Humpback whales (thanks to the corrupt Soviets), and many others as well.  The whalers themselves have called the IWC an anti-whaling organisation.  \n\nWe're happy to use the sanctuary and the ban in our actions to save whales, but there are many other reasons.  I guess you got us on that one. \n\nWe're one of the most non-violent groups of human beings in the history of the world.  We've never caused or sustained a serious injury or death.  Even Greenpeace can't claim that.  If our actions are so damned illegal then why aren't I in jail?  Or captain Watson?  (Mr. Bethune is another matter, admittedly).  We return to Australian ports all the time and we're sipping beer in the nearest pub an hour later.  \n\nA lot of our detractors call us violent and our methods illegal.  We could care less if we tried, but haven't bothered.  Eco-terrorist?  That's a good one.  That's almost as vague and undefinable as terrorist.  \n\nTell me this, Nessie, what would you do if you were in our shoes?  You're out on a ship in the Southern Ocean and you find the whaling fleet.  What would you do?  \n\nDon't say hang a banner or this conversation is over.   \n\n\n\n", "gilded": 0, "created_utc": "1276818226", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1276825785", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Coincidence you fool!\n\nWell, you *could* spin it in your favor...\n\nI'll let it slide this time Nessie. \n\n\nAlso, whoever has the GOD DAMN Irony_Police account, give it to someone who uses it.", "gilded": 0, "created_utc": "1276872735", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Alright then, one last question: Nessie. Have you seen her? Any selkies?", "gilded": 0, "created_utc": "1276995378", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "We've all seen Nessie. She's a sleekit beastie.", "gilded": 0, "created_utc": "1276995454", "subreddit": "IAmA", "score": 8, "controversiality": 0}
{"body": "Tree fiddy?", "gilded": 0, "created_utc": "1276996198", "subreddit": "IAmA", "score": 10, "controversiality": 0}
{"body": "I said I ain't giving you no tree fiddy!", "gilded": 0, "created_utc": "1276996267", "subreddit": "IAmA", "score": 4, "controversiality": 0}
{"body": "Didn't Merdonna* have to apologize for saying someone was being French?\n\n*Thanks to Nessie", "gilded": 0, "created_utc": "1277095069", "subreddit": "soccer", "score": 2, "controversiality": 0}
{"body": "Nessie wasn't correcting the student; he/she was correcting the tutor (the student never mentioned the word \"race\" in the description given above while the OP used the word \"racist\" in his submission title.\n\nMexican isn't an ethnicity either (I think). It's a nationality.", "gilded": 0, "created_utc": "1277112025", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "There's tree fiddy in the moat.", "gilded": 0, "created_utc": "1277179531", "subreddit": "WTF", "score": 6, "controversiality": 0}
{"body": "about tree fitty", "gilded": 0, "created_utc": "1277193962", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "It was the Loch Ness monster.", "gilded": 0, "created_utc": "1277201693", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "You can't really tell because of the angle of the photos, but the sea serpent is posed in the \"Nessie\" fashion, with loops coming out of the \"water\".\n\nIt was my first try with a sea serpent though; I'll do better next time. I'll also give him a better face (seen [the close-up of the sausage dude getting devoured](http://imgur.com/rznq4&amp;dXdEH&amp;vXvkh&amp;syqyrl?full)?) because the one he's got is a bit ugly.", "gilded": 0, "created_utc": "1277212049", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Actually, it's tree fiddy!", "gilded": 0, "created_utc": "1277272872", "subreddit": "funny", "score": 38, "controversiality": 0}
{"body": "tree fiddy?", "gilded": 0, "created_utc": "1277295094", "subreddit": "geek", "score": 3, "controversiality": 0}
{"body": "Don't go givin' that soul no tree fiddy woman!", "gilded": 0, "created_utc": "1277297693", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "Tree fitty.", "gilded": 0, "created_utc": "1277317387", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "If you PM me on Monday at 15:00 Tokyo time, I can go to the supermarket and check if they have any; there is also a nearby snack shop I can check out, but Japan is very seasonal with food products and, as Nessie pointed out, it may be available only in New Year.", "gilded": 0, "created_utc": "1277446449", "subreddit": "snackexchange", "score": 1, "controversiality": 0}
{"body": "And the UFO/crop circle people. And the Loch Ness monster.", "gilded": 0, "created_utc": "1277500616", "subreddit": "science", "score": 8, "controversiality": 0}
{"body": "leave Nessie out of this! she's very sensitive!", "gilded": 0, "created_utc": "1277517144", "subreddit": "science", "score": 12, "controversiality": 0}
{"body": "Uh, Imma bite here, you best not be trollin'\n\nMe Gusta is spanish for \"I like\" or \"This pleases me\" or something, and used in an exceptionally perverted situation to show that the user likes something they really shouldn't.\n\nThat'll be tree fiddy, plz.", "gilded": 0, "created_utc": "1277536601", "subreddit": "fffffffuuuuuuuuuuuu", "score": 8, "controversiality": 0}
{"body": "When shovelingtom talks about the paleolithic people he's talking about much much earlier than the 1st and 2nd century though. The all knowing wikipedia says the paleolithic era stretched from 2.6 MILLION to 12,000 BCE. ", "gilded": 0, "created_utc": "1277564391", "subreddit": "science", "score": 4, "controversiality": 0}
{"body": "Yeah, strange that...  all the 'believers' I ever encounter seem to be completely unable to provide even an iota of evidence yet keep asking me to DISPROVE their beliefs.  Uh, that's not how it works...\n\nBased on evidence, there is much more reason to believe in the Loch Ness monster, bigfoot, ghosts and Roswell, then Jesus (as a spiritual or historical figure), God or any story in the Bible, Koran or other holy text.", "gilded": 0, "created_utc": "1277681386", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "omg. my dad loved watching Unsolved Mysteries. I always thought everything on it was real, from bigfoot to the loch ness monster. And he always watched America's Most Wanted. I grew up a very scared child. ", "gilded": 0, "created_utc": "1277692143", "subreddit": "AskReddit", "score": 20, "controversiality": 0}
{"body": "I had to put down one of my two cats with liver failure last wednesday. She was only six years old. The vet said there's nothing really that could be done.\n\nHere are two of the last pictures of Nessie (the dark one; the reddish one is her sister Zora) when everything still seemed alright from about two months ago:\n\nhttp://i.imgur.com/3v3bd.jpg\n\nhttp://i.imgur.com/NDy5P.jpg\n\nRIP Nessie. Missing the little rascal :-(\n", "gilded": 0, "created_utc": "1277718193", "subreddit": "funny", "score": 19, "controversiality": 0}
{"body": "Nah. 'Bout tree fiddy.", "gilded": 0, "created_utc": "1277719347", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "And that's when you realized your cat was really the Loch Ness Monster?\n\nDamn, Nessie looks like my Shiva... Now I'm all sad...", "gilded": 0, "created_utc": "1277743131", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1277836498", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "let me get about tree fiddy", "gilded": 0, "created_utc": "1277905325", "subreddit": "programming", "score": 1, "controversiality": 0}
