{"body": "Do you believe in UFOs, astral projections, mental telepathy, ESP, clairvoyance, spirit photography, telekinetic movement, full trance mediums, the Loch Ness monster and the theory of Atlantis? ....Ah, if there's a steady paycheck in it, I'll believe anything you say.", "gilded": 0, "created_utc": "1214875053", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "&gt;The technique, called “ghost imaging,” has potential military or space applications, such as using aerial drones to survey of battlefields obscured by clouds, or the smoke that follows airstrikes.\n\nThe aerial drones will only be able to target ghosts, bigfoot, and nessie.", "gilded": 0, "created_utc": "1215000168", "subreddit": "science", "score": 15, "controversiality": 0}
{"body": "I'm sure I'll outlast the Paleolithic Era", "gilded": 0, "created_utc": "1215826094", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "Well, it's 8 o'clock here, so what is it, 6 o'clock there, huh, huh? It's summer here, so what is it, winter there? It's the Industrial Revolution here, so is it the Paleolithic era there?", "gilded": 0, "created_utc": "1215831704", "subreddit": "xkcd", "score": 0, "controversiality": 0}
{"body": "lots of musicians and singers have their hands and throats insured, the one that got to me was taking insurance on payment for capturing the loch ness monster and tom jones chest hair *gross", "gilded": 0, "created_utc": "1216226049", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "OH YEAH?  Well if I saw the loch ness monster I'd challenge him to a swimming match!  Then I'd kick his ass!  yeeeeeeeeeeeeehaaaaaaaa", "gilded": 0, "created_utc": "1216504904", "subreddit": "atheism", "score": 12, "controversiality": 0}
{"body": "And those same people call me foolish for acknowledging the possiblitity that the loch ness monster might exist.", "gilded": 0, "created_utc": "1216834873", "subreddit": "atheism", "score": 12, "controversiality": 0}
{"body": "They're like chupacabras and the Loch Ness Monster.", "gilded": 0, "created_utc": "1216914283", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Military men have also been known to present strange sightings of the Virgin Mary, Jesus Christ, Yaweh, Allah, Bigfoot and the Loch Ness Monster.", "gilded": 0, "created_utc": "1216920546", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "&gt; Military men have also been known to present strange sightings of the Virgin Mary, Jesus Christ, Yaweh, Allah, Bigfoot and the Loch Ness Monster.\n\nAFAIK Allah didn't leave radar traces and the Loch Ness Monster hasn't been clocked at 5000 mph.\n", "gilded": 0, "created_utc": "1216922804", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "i propose an area code system for poo: first, since it's a number two, it starts with a 2, the 2nd letter is the stool type according to the aformentioned bristol stool chart, and the third number is a 0 for 'hurt', 1 for 'it was good', or 2 'it was awesome'.  so a 250 would be hurtful soft blobs and a 222 would be a transcendentally wonderful toilet cramming nessie", "gilded": 0, "created_utc": "1216963963", "subreddit": "wikipedia", "score": 2, "controversiality": 0}
{"body": "He wanted tree fiddy??", "gilded": 0, "created_utc": "1217118590", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "I ain't givin' you no tree fiddy, you goddamn loch  ness monster!", "gilded": 0, "created_utc": "1217118913", "subreddit": "pics", "score": 13, "controversiality": 0}
{"body": "Stop being so hostile towards the paleolithic era.", "gilded": 0, "created_utc": "1217356856", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "I don't see Nessie.", "gilded": 0, "created_utc": "1217361088", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt;However, as it got close to me, the car pulled up into an empty parking spot and the driver came out. He shouted at me saying \"I know you want to take pictures but I don't want to be in them.\"\n\nUmmm... what is the driver supposed to do if people sitting in their front yards yell that to the google car?\n\n\nMy other question is why aren't the massive fleet of google streetview cars being used for something really useful - like photographing bigfoot, nessie, or E.T?\n", "gilded": 0, "created_utc": "1217422870", "subreddit": "geek", "score": 1, "controversiality": 0}
