{"body": "THE LOCH NESS MONSTER.  Why didn't you go for an action shot?  The smoke traveling through the tubes is basically the coolest part.  That and the green smoke chamber.", "gilded": 0, "created_utc": "1254359725", "subreddit": "Marijuana", "score": 2, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1254392823", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1254403244", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Ghosts: Nope.\r\nESP: Nope.\r\nSynchronicity: Coincidence nothing more.\r\nUFO's: Nope, dont think aliens are visiting us for anal probe sessions or cutting up cows and stealing their hearts.\r\nDowsing: Nope.\r\nAuras: Nope.\r\nReincarnation: Hell no.\r\nParanormal/supernatural: Nope, no bigfoot's, Nessie, Mummies, Vampires, Demons, Zombies, Shape shifters, imortals, flying people etc. etc. etc.\r\n\r\nAm i open to the existance of any of the above?\r\n\r\nYes, show me proof that cannot be debunked and ill give the above more consideration.\r\n\r\n", "gilded": 0, "created_utc": "1254431772", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "If he ran it with Chef, it would cost... about tree fiddy.\n\nTHAT DAMN LOCHNESS MONSTA.", "gilded": 0, "created_utc": "1254452126", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Sainsbury's delivers right to my door for only tree fiddy. ", "gilded": 0, "created_utc": "1254603305", "subreddit": "DoesAnybodyElse", "score": 2, "controversiality": 0}
{"body": "Well here is my problem - the set I downloaded doesn't have subs included or embedded (.mkv) and my luck in finding them is as successful as the search for the loch ness monster. I've used VLC, WMP (with shark codecs), and GOM (shivers), but no dice. This show looks promising, yet I feel that it's not something I can watch if I can't follow on anything.", "gilded": 0, "created_utc": "1254648673", "subreddit": "anime", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1254651538", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "No, I bought a real one off ebay for tree fiddy.", "gilded": 0, "created_utc": "1254669018", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Constant attack? Ridiculous accusations such as those deserve zero thought and effort. If he had said that all Israelis were in fact the Loch Ness monster, I would not feel compelled to offer a complete proof of how he was wrong. None of the shit on that list qualifies as \"terrorism\", it's all just mindless namecalling.", "gilded": 0, "created_utc": "1254682493", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Tree fiddy?  Didn't I tell you not to give that bad old Loch Ness Monster no tree fiddy?", "gilded": 0, "created_utc": "1254684414", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Well no wonder the monster keeps coming back to our house! You keep giving it tree fiddy!\r\n", "gilded": 0, "created_utc": "1254704363", "subreddit": "AskReddit", "score": 23, "controversiality": 0}
{"body": "Well it was about that time that noticed that girl scout was about 8 stories tall and was a crustacean from the plezazoic era. I said 'damnit monster get off my lawn! I aint givin you no tree fiddy!' It said 'how bout just two fiddy?' I said 'oh now it's only two fiddy! What is there a sale on loch ness munchies or something?'", "gilded": 0, "created_utc": "1254714726", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "I admit I just tried all of these, the Loch Ness Monster is truly genius.", "gilded": 0, "created_utc": "1254749791", "subreddit": "IAmA", "score": 8, "controversiality": 0}
{"body": "If you can stand by your belief in Creationism on a well-argued philosophical basis like that, then go for it. Just don't be like most Creationists who argue by misrepresenting the science behind evolution and fumbling through scripture at every opportunity. Yesterday some guys were standing there at church in a little circle talking about how silly evolution is. They were going on about all sorts of stuff:\n\n* How the [circle of the earth](http://www.asa3.org/ASA/PSCF/2001/PSCF9-01Schneider.html) *really* meant sphere, and how this was an amazing revelatory scientific insight given to the ancient Hebrew's by God\n* Along the same lines, how it was an amazing scientific revelation that the Psalmist wrote about being knit together in his mother's womb\n* Sheep must have been created at the same time as humans, because if they evolved then they would be helpless in the wild\n* For evolution to be true, bees and flowers would have to have evolved at exactly the same place and time (classic Ray Comfort stuff there)\n* Mixing up the various attributes of behemoth and leviathan, and connecting it to the Loch Ness monster, etc.\n\nDon't be those guys. They're getting it all wrong at nearly every opportunity. A big problem for Creationism is the plain ignorance going on. It's sometimes philosophical or theological, but usually just scientific ignorance. The vast majority of the \"authorities\" behind creationism are masquerading as scientists when they are largely not involved in any real research. Most of the \"doctors\" involved in promoting Creationism are medical doctors, not doctors of biology or geology. One (of a very slight few) doctor of geology working with AiG still advises clients on the side in the terms of an old Earth and the very \"millions of years\" that he insists are mere fabrication when he works for AiG.\n\nHave integrity and get your facts straight, and you're fine with me.", "gilded": 0, "created_utc": "1254767214", "subreddit": "Christianity", "score": 3, "controversiality": 0}
{"body": "I blame True Believers Syndrome. Some people will never stop believing in this sort of stuff. Reminds me of the Loch Ness Monster photo--which the guy admitted he faked 40 years ago.", "gilded": 0, "created_utc": "1254781915", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "That guy only did that to throw people off of the real truth- he *is* the Loch Ness Monster!", "gilded": 0, "created_utc": "1254786248", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Did I ever tell you about that story when I met the loch ness monster?", "gilded": 0, "created_utc": "1254794671", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Did I ever tell you about that story when I met the loch ness monster?", "gilded": 0, "created_utc": "1254794716", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Airports? Sure, but electric hoists have been used for even cooler things, like lifting Elphaba in the hit Broadway musical Wicked when she sings \"Defying Gravity\" at the end of Act 1 - the essence of the entire play! And they're apparently also used in canine hydrotherapy. And weren't they used to put the big table and chairs on the bridge downtown Grand Rapids, MI for ArtPrize? Or Nessie in the Grand River? I heart electric hoists.", "gilded": 0, "created_utc": "1254839001", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "  Ooh, it must've been about seven, eight \n                         years ago. Me and the little lady was \n                         out on this boat, you see, all alone \n                         at night, when all of a sudden this \n                         huge creature, this giant crustacean \n                         from the paleolithic era, comes out \n                         of the water.\n", "gilded": 0, "created_utc": "1254848162", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Archery is a cool sport for the girls to include in their  hen weekend.  It will be a fun thing for the girls to get a slice of the Paleolithic era. You get to hold those cute bows and arrows and hit the target. Though it was initially  used for the sole purpose of hunting, now it has evolved into a pleasure sport. You can  turn it into a little competition and compete with your friends. ", "gilded": 0, "created_utc": "1254898050", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I went to mah son's room. And sho 'nuff. There was the loch ness monster.", "gilded": 0, "created_utc": "1254956509", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Heh, I was going to make a \"master debator\" type joke, but I see that it wouldn't have turned out very well. Thanks for \"taking one for the team\", Nessie :)", "gilded": 0, "created_utc": "1255229143", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "OMG! I clicked on the link and I don't think I can finish my lunch.\n\nBack to the Loch with you, Nessie!", "gilded": 0, "created_utc": "1255312741", "subreddit": "IAmA", "score": -2, "controversiality": 0}
{"body": "Now lets not be bashful Nessie.  We all know its only 14\" when you fold it in half.", "gilded": 0, "created_utc": "1255350978", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "There is evidence that the Loch Ness monster exists, but that doesn't mean it's reasonable to declare that it does without first meeting the burden of proof.    You cannot honestly answer the question \"why is there existence\" any other way than \"I don't know.\"     Everything else is belief: assumption, presupposition and wishful thinking.   \n \n&gt;Now, downvote this and prove my point.\n\nHow droll.    You didn't provide any evidence for me to reject, so how would it prove your point?   ", "gilded": 0, "created_utc": "1255353638", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "Proof in practical science consists of pushing all currently known competing theories to extremely low plausibility, while the \"proven\" theory has extremely high plausibility. Creationism is vastly, immensely less likely than the Loch Ness monster. You should spare proportionately less time thinking about it.", "gilded": 0, "created_utc": "1255354131", "subreddit": "science", "score": 4, "controversiality": 0}
{"body": "Fuck yes, I finished that level and never played it again for quite some time because of that eel.\n\nAnyway, mine is the loch ness monster thing down in that pond (still in the old super mario 64 here), I forget which level it was on. Anyway, I was playing through the game competing with friends to see who could finish it first and one of them told us that the monster tried to eat you. \nIt may not sound that scary, but I was only seven or so at the time, and when I got up to there, having to ride that thing thinking the whole time it was just about to throw me off it's head and eat me has easily been the scariest thing I've experienced in any video game.", "gilded": 0, "created_utc": "1255393118", "subreddit": "gaming", "score": 10, "controversiality": 0}
{"body": "Hey, \n\nHere are some reggae, ska, dub, rocksteady and 2 tone artists you might wanna have a \"look\" (listen) into\n\nskatalites (old skool ska),\nthe ethiopians ,\nalton ellis (grandfather of rocksteady) ,\nsly and robbie (dub dub dub, very good dub),\nthe specials ,\nmadness,\nKing horror (one of a kind),\n\nIf you're after tracks try these:\nLoch ness monster - king horror(this got me into reggae),\nlong shot kick de' bucket,\nIt's raining,\nwild honey - skatalites,\nskinhead moonstomp,\nengine 54 - ethiopians,\n\nAnd the best reggae album/compilation that I've heard of is \"Birth of Trojan\"", "gilded": 0, "created_utc": "1255408008", "subreddit": "Music", "score": 2, "controversiality": 0}
{"body": "about tree fiddy.", "gilded": 0, "created_utc": "1255453153", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I gave them a tree fiddy", "gilded": 0, "created_utc": "1255485703", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "The Loch Ness Monster.", "gilded": 0, "created_utc": "1255521700", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "it's odd that there's even a word like atheism.  there isn't a word for not believing in the loch ness monster, or santa claus.  \n\nof course, i'm not being entirely serious I know why such a word exists I just think it doesn't make sense nowadays.", "gilded": 0, "created_utc": "1255584619", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "YO BALLOON BOY, I\"M REAL HAPPY FOR YOU AND IMMA LET YOU FINISH--BUT THE LOCH NESS MONSTER WAS THE GREATEST HOAX OF ALL TIME! **OF ALL TIME**!", "gilded": 0, "created_utc": "1255669905", "subreddit": "WTF", "score": -1, "controversiality": 0}
{"body": "Ah, the same Nessie from JapanToday -- cheers!", "gilded": 0, "created_utc": "1255711149", "subreddit": "japan", "score": 2, "controversiality": 0}
{"body": "1) DU would not cause people to die from radiation ... it's called depleted for a reason.\n\n2) DU is a heavy metal and is very dangerous to the body\n\n3) People have been claiming that DU becomes aerosolized and is being breathed in ... thus leading to health problems.\n\n4) The human body cannot process out heavy metals, so if you get it in your body, it tends to stay there.\n\n5) All that would need to be done to show this link would be to run tox-screens on the individuals who claim to have health problems due to DU.  If there are high levels found in the body then a link can be pretty clear.\n\n6) Lots of people enjoy believing in things without evidence, like god, ghosts, and the loch ness monster.  I'm not one of those people.  Show me the evidence and maybe we can talk.  Until then you've got as much credibility as the \"Ghost Hunters\" and you should talk to the History Channel about a job.", "gilded": 0, "created_utc": "1255775975", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "What about Bigfoot? The Loch Ness monster?", "gilded": 0, "created_utc": "1255791359", "subreddit": "IAmA", "score": 13, "controversiality": 0}
{"body": "If you're smart enough to not believe in a deity, then you should soon realize the same rules of critical thinking apply to ghosts, bigfoot, nessie, astrology, magic, etc\n\nUnless someone wants to provide real evidence they exist, then keep saying \"Fuck you, prove it.\"", "gilded": 0, "created_utc": "1255807435", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "I aint giving no lochness monster no tree fitty!", "gilded": 0, "created_utc": "1255943171", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "&gt;Today, Photoshop has a UFO button; just add it in!\n\nYep!  It's right next to the Nessie button :)", "gilded": 0, "created_utc": "1256085153", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "&gt; Not every good cop knows a bad cop\n\nI'm asking you to find ONE cop who doesn't know a bad cop.  That's it.  Just ONE.  While you're at it, bring me Bigfoot and the Loch Ness Monster.", "gilded": 0, "created_utc": "1256241819", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Um, this is where I need to check that we're on the same page. \"Mental\" is aussie slang for \"crazy\". So Nessie's innocent typo (\"mental disciple\") seemed entirely pun-worthy. I simply fleshed out the pun and threw in the ever-popular jab at Scientology to complete the package.", "gilded": 0, "created_utc": "1256305406", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Heh. Another guy also claimed he took that Nessie picture... it was a circus elephant, according to him, underwater with his trunk sticking out. Elephants do that indeed.\r\n\r\nWe shouldn't believe anyone who claims to have hoaxed something.\r\n\r\nSame for the crop circles. Doug and Dave claim to have made them.. but at that time there were far too many already for just two persons. Additionally, they couldn't reproduce existing circles. The test was done in broad daylight, and all they could reproduce was a carelessly trampled single circle, which took them hours. And then we ought to believe they made designs consisting of multiple circles, with a lot less errors, in a much shorter time, *in the middle of the night*?\r\n\r\nMaking a crop circle is not simple, and the techniques used to make them are more sophisticated than \"trample the grain within the circle\". Accepting the word of two old farts that they did it is gullible at best. Regardless of which society, club, cult or group did it, it ain't Doug and Dave. Their hoax was claiming that they did it.\r\n\r\nThere are still some interesting phenomena around crop circles (bent but not broken plants, traces of heat, electric anomalies, silicon deposits,...) that make them a valid target for serious investigation.", "gilded": 0, "created_utc": "1256305513", "subreddit": "skeptic", "score": 2, "controversiality": 0}
{"body": "*White Paper on My Opinion but Feel Free to Disagree,* 2009, Nessie Press.", "gilded": 0, "created_utc": "1256309951", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "They broke my reality index years ago.\n\nI had to put them in the separate fiction index but they didnt last too long there either because Donald Duck and the Loch Ness monster said they'd quit if they had to listen to Beck cry again.", "gilded": 0, "created_utc": "1256537892", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Damn, that Loch Ness Monster will do anything for tree-fiddy.", "gilded": 0, "created_utc": "1256567812", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "sorry to burst your bubble, but that's most likely a *Glory or possibly a diffraction pattern caused by the several layers of plexiglass between you and the outside.\r\n\r\n* http://en.wikipedia.org/wiki/Glory_(optical_phenomenon)\r\n\r\nps; did you happen to see nessie down there in the lower right?\r\n", "gilded": 0, "created_utc": "1256604467", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "You know that's a new one. No I haven't. I know quite a few nessie hunters though, they're as eccentric as they are nice. ", "gilded": 0, "created_utc": "1256666410", "subreddit": "IAmA", "score": 22, "controversiality": 0}
{"body": "Because they refer to them as their \"Little Nessie?\"", "gilded": 0, "created_utc": "1256671654", "subreddit": "IAmA", "score": 26, "controversiality": 0}
{"body": "Well you'll never find a Nessie in the zoo", "gilded": 0, "created_utc": "1256673558", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Really, Big Nessie would have worked fine.", "gilded": 0, "created_utc": "1256676429", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "If you're by Urquhart Castle, don't go into the woods. My brother dropped his own Loch Ness Monster somewhere in there.", "gilded": 0, "created_utc": "1256676576", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "You should really know this, Nessie.", "gilded": 0, "created_utc": "1256678204", "subreddit": "science", "score": 6, "controversiality": 0}
{"body": "Has the Loch Ness Monster ever come to your door asking you for tree-fitty?", "gilded": 0, "created_utc": "1256706950", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "Regularly. When I realised he wasn't a girl scout I told him\n\n\"Damn it monster get off my lawn. I aint' givin' you no tree fiddy\"", "gilded": 0, "created_utc": "1256723903", "subreddit": "IAmA", "score": 5, "controversiality": 0}
{"body": "If I had a nickel for every quick one-liner I spurted out and then regretted saying, I'd have about tree fiddy.", "gilded": 0, "created_utc": "1256774728", "subreddit": "entertainment", "score": 44, "controversiality": 0}
{"body": "Dammit, ya know what I was doin? I was just a sittin' here in the library doin' some homework fer ma epistemology class. Ya know? And outta nowhere an eight hunda pound gorilla came up and asked ta borrow some money for a latte. I lookt ad him and, you know what I said? I says ta him, \"Look son, why doncha' just get some coffee, you could probably afford that. Itsalot cheaper.\" and he's like, \"well, they've only got the fair trade and that there stuff is still pretty expensive.\" so I was all like \"fine fine fine, I might be able to help you out, how much do you need?\" and do you know what he replies?! I tell you what he said, he said, \"I'd need about tree fiddy.\" \"**TREE FIDDY!**\"\n\n*\"tree fiddy, that's what he said to him\"*\n\nDammit woman I'm telling the story! So it's about that time that I wonder why some eight HUNDRAD POUND goreella is in ma liberry. Cuz, they can't read ya' know, well, I herd some can do that sign langwage but that's differnt, that's readin' hands not words and sentnces.\n\n*\"Them gorillas are gettin purdy smart\"*\n\nI know that woman! Let me tell the story! So as I'm thinkin' there about this gorilla being here in the library I notice he ain't no gorilla at all! **he's a EIGHT STORY TALL LOCH NESS MONSTER from the paredezoic era!!** ", "gilded": 0, "created_utc": "1256830855", "subreddit": "entertainment", "score": 4, "controversiality": 0}
{"body": "At least it wasn't tree fiddy.\n\nI remember this one time....", "gilded": 0, "created_utc": "1256873199", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Michael Karnow: [on the topic of the Loch Ness Monster being fiction or real] They say show me the evidence. I say show me the non-evidence. http://www.imdb.com/title/tt0374639/", "gilded": 0, "created_utc": "1256936411", "subreddit": "IAmA", "score": 1, "controversiality": 0}
