{"body": "According to reddit science, specifically biology in relation to evolution, is a means to disprove religion.\n\nAnything beyond that is interesting but not really necessary.\n\nedit: this is strangely relevant, I found the link from conservapedia (which I visisted purely for the lulz, I swear!): http://www.wnd.com/index.php?fa=PAGE.view&amp;pageId=79515\n\n&gt;A study carried out at Baylor University has shown that Americans who do not attend a place of worship are far more likely than churchgoers to have a belief in such things as the Loch Ness Monster, Atlantis, communication with the dead, and astrology. **Evangelical Conservative Christians are the least likely to have such irrational beliefs.**\n\nI'm a religious person myself but I know most redditers aren't and they 'enjoy' these kinds of erm, reading materials to troll or whatever... which is why I posted it here I suppose :P (if anyone is looking for some karma I suggest you submit the story either to the WTF or atheist subreddits).", "gilded": 0, "created_utc": "1225556705", "subreddit": "science", "score": -6, "controversiality": 0}
{"body": "Three fitty.  Wait, you not a McDonald's employee!  You da Loch Ness monster!", "gilded": 0, "created_utc": "1225594818", "subreddit": "offbeat", "score": 3, "controversiality": 0}
{"body": "But I didn't shoot ol' Loch Nessie", "gilded": 0, "created_utc": "1226258806", "subreddit": "comics", "score": 1, "controversiality": 0}
{"body": "In the same way you can't prove there is a God, you also can't prove there is no Santa Clause, Tooth Fairy, Leprechauns, Bigfoot, or Loch Ness Monster. These are all things were people can say \"I don't believe\" and aren't criticized for it just because they can't prove 100% those aren't real. If God can be real, any of those above can be real.", "gilded": 0, "created_utc": "1226389858", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Ok, this is a good point.\n\nI don't believe the Loch Ness monster or Bigfoot exist - because I think there certainly would be evidence to the fact if they did.\n\nThey other guys, God, Santa Claus, the Tooth Fairy and Leprechauns - are metaphysical. I may think it is more likely that they don't exist (and I do), but I don't claim to believe they don't because I have no real grounds for it.\n\nDoesn't that make me an agnostic rather than atheist?", "gilded": 0, "created_utc": "1226400502", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "&gt;Maybe THAT particular behavior is not universal, but that does not disprove the preferred universality of other behaviors.\n\nI didn't say it did. I've only claimed it disproves this argument, not the possibility that UPB exist. \n\nIncidentally, it's impossible to prove that something *doesn't* exist. For example: I can say that there exists a giant plaid pigeon. Unless you have a method to collect and analyze every pigeon that exists, you can't disprove it. Even if you could, you'd only have amassed considerable evidence. I could still say \"You missed one.\" \"No I haven't,\" you'd say. Then I'd ask, \"Then where's the giant plaid pigeon?\"\n\nSo, no, I don't claim that I can prove there is no such thing as UPB any more than science can prove there is no Bigfoot or Loch Ness Monster or, for that matter, God.\n\nThat said, the author's job of this tract claims to prove that universally preferable behavior exists. He *does not* accomplish this.\n\n&gt;Besides, there is such a thing as universally preferable behavior, observed by sociologists and anthropologists. \n\nOnce again, I'd be happy to see examples of this.\n\n&gt;Of course, naysayers can say whatever they want. But if naysayers are arguing against UPB for reasons like hating Molyneux, then by definition they are not arguing about UPB's validity.\n\nThat's not logical. The motivation which inspires the arguer does not define the argument. I can make a valid argument against something for any number of reasons. Even liars also tell the truth, but they aren't confined by the supposed UBT of truth.\n\n&gt;Have you found any other logical holes besides the one you said you found?\n\nYes. But at this point, maybe it's best to agree to disagree. I don't think we're ever going to see eye-to-eye on this one. You seem quite convinced by this tract and I know that it is not going to convince me. But I do appreciate you pointing it out to me.", "gilded": 0, "created_utc": "1226455576", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Hey, it's a Reddit headline with an accurate quotation.\n\nIn other news, Elvis was sighted crashing a UFO into the Loch Ness monster.", "gilded": 0, "created_utc": "1226737793", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "I ain't giving you no tree-fitty you goddamn Loch Ness monster! ...", "gilded": 0, "created_utc": "1227027144", "subreddit": "offbeat", "score": 2, "controversiality": 0}
{"body": "&gt;fiscal conservatives who want to spend less money\n\nYou cryptozoology fans are a hoot.  Next you'll be telling me about bigfoot and the Loch Ness Monster.  Fiscal conservatives, heh.", "gilded": 0, "created_utc": "1227554000", "subreddit": "politics", "score": 1, "controversiality": 0}
