{"body": "And for excellence in using a misspelling for a pun, we award 5 internets to.............Nessie!", "gilded": 0, "created_utc": "1251771028", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "the loch ness monster is indeed real; like herpes and eskimos.", "gilded": 0, "created_utc": "1251773181", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "There is no footage of Nessie tapping that, but people still believe the myth.", "gilded": 0, "created_utc": "1251790795", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "That's no duck. It's ol' Nessie!", "gilded": 0, "created_utc": "1251833360", "subreddit": "aww", "score": 4, "controversiality": 0}
{"body": "While we're all aware of what deregulation is in theory, in practice it simply does not exist. You might as well argue the existence of Sasquatch or the Loch Ness monster.\n\nWhat we see is misregulation... where the volume of regulations remains the same (or more often grows larger) and the details are merely tweaked to better serve some lobbyist's interests.", "gilded": 0, "created_utc": "1251900555", "subreddit": "Libertarian", "score": 6, "controversiality": 0}
{"body": "Having watched X-files, where the characters have real personality... Fringe was unwatchable for the acting alone.\n\nBut worse than that, the government in X-Files was largely incompetent and ignorant, except for the occassional small conspiracy. Fringe has it being super-competent and putting together a team to deal with some terrorist plot involving the Loch Ness monster. It's the worst sort of post-911 bullshit out there, only GI Joe rivals it.", "gilded": 0, "created_utc": "1251915376", "subreddit": "scifi", "score": 5, "controversiality": 0}
{"body": "Nessie et al., \"Locking my three-year-old in the basement to prove the non-heritability of blue eyes*\"\r\n\r\n    *in progress. ", "gilded": 0, "created_utc": "1251938760", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "Thanks, another example of Christians spamming the atheism subreddit with Christian theology.\n\nI'd like to congratulate you on being polite and sounding constructive as you post previously answered questions and arguments.  \n\n1)  That's nonsense.  one could argue that belief in god is an extension of belief in consequences, in that certain actions will bring detrimental results later.  It is the mutant offspring of the higher brain functions that let humans consider a situation and predict potential outcomes.\n\n2)  Please provide some evidence to back up your claim.\n\n3)  How could a being capabe of creating the universe out of nothing first come from nothing and then rise to a level of intellectual developement sufficient to exercise its universe-from-nothing creating powers when it would exist in the absense of any stimuli when only said being exists?\n\n4)  That is also nonsense.  You are suggesting that god is all-powerful which prevents him being observed or interacting with anything...in which case he would have *no* power, not be all powerful.\n\n5)  Why not?  Because it's evil and abhorent.  I don't want to murder all the people the bible says I should like homosexuals, people of other religions, people who work on the holy day, people who read a different version of the bible, eft handed people, people from other races, people whose parents weren't christian, unwed mothers, women who suffer miscarriages...and so on.  I'd rather go to hell than be follow biblical law and lead such an abhorent, immoral, hateful and evil life.\n\n6)  On one hand it's hard to believe that the universe just so happened to exist and work out.  On the other hand it's impossible to believe that a being capable of making such a universe just popped into being from nothing.  Especially considering all the blatant fuck-ups said being would have needed to make.  Study thermodynamics or anatomy and you'll realize what I mean.\n\n*(edit)*\nAlso \"what Nessie said\".\nBy the way I voted you up for being polite, which is a welcome change for this type of post.  ", "gilded": 0, "created_utc": "1251942245", "subreddit": "atheism", "score": 7, "controversiality": 0}
{"body": "Is that the Loch Ness monster&gt;", "gilded": 0, "created_utc": "1251979101", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "I was trying to find a similar time line going back to the paleolithic era but couldn't find one.  ", "gilded": 0, "created_utc": "1252050573", "subreddit": "technology", "score": 2, "controversiality": 0}
{"body": "Are you the same Nessie from Japan Today? ^o)", "gilded": 0, "created_utc": "1252075558", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "I enjoyed 2ci. Pretty serious visuals; the dirt looked like water and I swore to my friends that the Loch Ness monster was under the ground.\nBut, all in all, it was fun. Definitely my favorite in the 2c family.", "gilded": 0, "created_utc": "1252161090", "subreddit": "Drugs", "score": 2, "controversiality": 0}
{"body": "That's not good enough. What if someone *does* have a Nessie story? Or something similar? Are you just going to be an ass? Why even come in here if that's your intention?", "gilded": 0, "created_utc": "1252193589", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "This is actually very interesting.  So often, proponents of Bigfoot/UFO/Nessie/whatever will say that \"*This has to be real, so many people have seen it, and they have nothing to gain*\".  I'm so tired of this argument.  It's so simple to see how these silly stories spread and take over people's minds.  ", "gilded": 0, "created_utc": "1252203703", "subreddit": "skeptic", "score": 6, "controversiality": 0}
{"body": "Let's see who the fool is - reviewing your post history reveals you as a hate-mongering troll, with parallel abuse to several other people.  Let people judge for themselves your intolerance when they see your comments, which speak entirely for themselves.\r\n\r\nLet's look at your \"quality\" posts.\r\nhttp://www.reddit.com/user/kbilly\r\n\r\n\"That's not good enough. What if someone does have a Nessie story? Or something similar? Are you just going to be an ass? Why even come in here if that's your intention?\"\r\n\r\n\"Ass hat. Oh, you are a pro on what an \"ass hat\" is? I guess you've had it applied to you for quite some time now. If you are too stupid to understand what I did with the word then fuck off, ass hat.\"\r\n\r\n\"Dont defend yourself against that ass hat. He's trolling this submission bashing everyone about their experiences. What's interesting though is that he likes to \"use\" his imagination sometimes as well.\"\r\n\r\n\"Seriously, I dont understand why these people even come into threads like this where people just want to have some fun and get a little weirded out. You ass holes dont believe it, fine! Get the fuck out!  I think a small case of selective (or inventive) memory might be at hand for some of the stories here. No shit! Why are you here then?\"\r\n\r\n&gt;Anyway, time for bed. It was fun!\r\n\r\nYour \"fun\" essentially pollutes Reddit - take it elsewhere.\r\n", "gilded": 0, "created_utc": "1252219317", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "Gaaaaah. Star Trek? You're a traitor to the Rebel Alliance :)\n\nEdit: Changed trader to traitor, because Nessie pointed out that I am, in fact, a tard.", "gilded": 0, "created_utc": "1252300218", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I've said it before here, I'll say it again. I remember you History Channel and I used to like you.\r\n\r\nYou were this place that used to broadcast documentaries and informative programs based on things that happened in the past. Things that happened previous to the present moment.\r\n\r\nInterestingly, all of human experience is located there. In the past. Previous to the present moment. In history.\r\n\r\nCuriously, you called yourself \"The History Channel\".\r\n\r\nBack there in the past, I used to flick to your channel when I felt like knowing about the Roman Empire, or World War I trench warfare, or the age of chivalry in the time of Agincourt, or numerous other events that occured in the past.\r\n\r\nI flicked over to you recently...\r\n\r\nUFO's, Loch Ness monster research, Ice Road truckers, dimwit guys who cut down forests, are you serious that that is your programming? What corporate executive conference based on Nielsen reports recommended this departure? In a way, I suppose, it says more about the demographics of advertising than it does about anything else. Apparently, in order to reach the most viewers, you must dumb down your content to the lowest common denominator in order to score a ratings bonanza.\r\n\r\nFine. That's your business model and I will never watch you again.\r\n\r\nHowever, my fear is for the wider implication of The History Channel's fall from \"history\". That of the market driven need. Unfortunately, 90% of humans couldn't care less about what happened before they 'mysteriously arrived' here and how we got to where we are now. (That thing called History you named your channel after might help explain it). Apparently, your market instead demands Nostramus, the Loch Ness monster, and UFOs.\r\n\r\nSitting back and watching actual 'history' play itself out, I see clearly how we humans are doomed.\r\n\r\nYou've decided that none of the History Channel's audience/growing demographic is actually interested in history. 'History' is not entertaining enough. We humans are doomed because a majority of us do not care about what came before. We do not care to learn from our mistakes because the reality of our past, our history, does not sell product.\r\n\r\nBut UFOs, Ice Road Truckers, and Nostradamus do.\r\n\r\nDumbed down content attracts dumb people.\r\n\r\nAnd sadly, for humanity's sake, dumb people are the majority.\r\n\r\nEDIT: Spelling", "gilded": 0, "created_utc": "1252307585", "subreddit": "WTF", "score": 314, "controversiality": 0}
{"body": "Say, would you crackers like to hear about the time we met the Loch Ness Monster? ", "gilded": 0, "created_utc": "1252317153", "subreddit": "WTF", "score": 44, "controversiality": 0}
{"body": "That was the third time we saw the Loch Ness monster.", "gilded": 0, "created_utc": "1252345850", "subreddit": "WTF", "score": 9, "controversiality": 0}
{"body": "That's the most poetic, beautiful post I've seen on reddit since the days of Necrophiliac. You have been friended, Nessie. I wish to be aware of your further contributions to the reddit community. :)", "gilded": 0, "created_utc": "1252405690", "subreddit": "atheism", "score": 9, "controversiality": 0}
{"body": "They have pictures of Nessie. it's not testable though they keep trying.  ", "gilded": 0, "created_utc": "1252510598", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "The loch ness monster is in that pic, middle of the screen...just to the right.  If you zoom into Nessie he appears to be eating a cloud shaped like Britain: Though it could be candyfloss.  ", "gilded": 0, "created_utc": "1252666842", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Old Man : Damn it Loch Ness Monster! I told you you ain't getting no tree-fiddy.\n\nOld Lady : I gave him a dollar.\n\nOld Man : Damn it woman, that's why he keeps coming back.", "gilded": 0, "created_utc": "1252683052", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "Q: How many pancakes does it take to shingle a doghouse?\n\nA: Blue, because there's no bones in ice cream.\n\nAlso accepted: tree fiddy", "gilded": 0, "created_utc": "1252703019", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "\"The jury awards the parents monetary compensation from the car owner to the amount of about tree fiddy.\"", "gilded": 0, "created_utc": "1252787194", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "&gt; i apologize for the misuse of Reddit, i have recently converted to commentator after a long while of being a lurker.\n\nNo worries - I was just letting you know.  Welcome to the conversation. ;-)\n\n&gt; in my conversations with atheists that i have yet to hear a single reason that is more rational than the belief in a imaginary friend who helps you\n\nIt depends - we all work off Occam's Razor almost all the time, so we should all be happy agreeing that assertions should be supported, or they're worthless.  If I claim there are fairies under my bed, it's not up to you to *disprove* that - it's up to me to prove it, or I should expect to be dismissed.  Likewise, if someone asserts there's an omniscient, omnipotent super-being who violates all known laws of physics and yet somehow still has a close, personal relationship with individual people, it's up to the claimant to provide evidence or arguments in their favour, or it shouldn't rationally be taken any more seriously than my claim of fairies.\n\nEven if you disagree with that, and assert that unsupported assertions should instead be *disproven*, then you instead have to explain why you believe in one particular god, and not Odin, or Set, or Xenu, or the Flying Spaghetti Monster as well.  As they say, we're both atheists - I just don't believe in one more god than you. ;-)\n\n&gt; but my question remains: can you respect a person who comes to religion consciously, through deep thought and not a knee jerk reaction of emotions?\n\nFWIW I don't particularly respect the opinion of someone who comes to religion through emotion - it's a comfort belief born of emotional immaturity - the very antithesis of evidence-lead beliefs and rationality.\n\nThe question you raise is a much more interesting one.  In principle, if someone came to religion through rational thought then they should be able to explain that reasoning to others, at least in principle - that's practically one of *the* key differences between rational thought and subjective emotion.\n\nIf they can explain rationally why a belief in god is correct, and I couldn't fault their logic, then I would immediately start believing in god.\n\nThis might sound glib, but that's how it works with evidence-based beliefs.  If someone tells me there are fairies under their bed I laugh, but if they *show* me the fairies and I can't see how it could be a trick, I instantly start believing in fairies.\n\nAs I've never heard of anyone ever doing this in two thousand years of Christianity (and countless thousand years of other religions before that), I doubt it's possible.  The only arguments we have which are remotely comparable are lame ones full of holes like [Pascale's wager](http://en.wikipedia.org/wiki/Pascal%27s_Wager), or sophomoric mediaeval tautologies.\n\n&gt; for example, many scientists who, after years of study, decide that it is more mathematically improbably for the universe to have been created randomly than for a designer.\n\nI'd take issue with this example - first off, the idea that - for example - someone has mathematically demonstrated that it's simpler for god to exist than the universe to have evolved on its own is complete gibberish.  I don't mean to offend, but we don't have even one tiny fraction of the knowledge required to calculate the \"chances\" of the universe existing, and it's flatly impossible to calculate the chances of existence of a being who *by definition* violates all known mathematical and physical laws.  It's like claiming that you've proven Bigfoot is smarter than the Loch Ness Monster - comparing two completely unknown (perhaps even *unknowable*) terms and claiming to have a hard, correct answer at the end.\n\nThis kind of argument would instantly destroy the credibility of the offerer, as they obviously wouldn't know the *meaning* of the words \"mathematically\" or \"rationally\", and so can safely be dismissed as a possibility.  Obviously if anyone ever claimed to have done so I'd be curious to hear their reasoning, but as a serious possibility it's right up there with \"a unicycling unicorn juggling penguins cycled past and told me\". &lt;:-)\n\nHowever, in the final hypothetical case (where someone spends years of contemplation, can't rationally explain to another *why* they believe in god but still does), I'd say this is pretty clearly a case of that person being irrational.  As mentioned above, people can flick from rational to irrational thought for many reasons - a specific tragic incident is only one cause; they might also have an ongoing philosophical crisis, be slowly brainwashed/persuaded out of their rationality by associates, develop a mental illness, etc.  People can even be rational in almost all aspects of life and irrational only on certain subjects - religion, nationalism, sports fandom, etc.\n\nThe fact that this is possible is evidenced by the large numbers of religious scientists out there - many are happy to admit that they believe for no rational reason, but they still do good science in *other* areas every day of their lives.\n\nIn fact, what many people *specifically object to* about religion is that the meme appears to have the power to selectively turn off rationality where it's concerned, weakening the person's overall rationality and giving them a psychological \"weak spot\" where irrationality can penetrate and (under the right circumstances) even spread to other opinions and areas of their life.\n\nBasically, it all comes down the the same thing - arguments which can't be rationally explained aren't rational, and hence are irrational (and hence ignorable) by definition.  If anyone had a good, rational argument for the existence of god then he would have made it, it would be famous, and any evidence-lead believer would believe in god.  As we don't, and not one of us has ever even *heard* of one, it's pretty safe to assume it doesn't exist... or at least to continue to suspend belief until it's put forward.\n\nApologies for the ridiculously long post, but your comment touched on several important points I felt I needed to address - hopefully it wasn't too long-winded. ;-)", "gilded": 0, "created_utc": "1252797756", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "ok you vote for him. Vote for the guy that is making passes at Ron Paul and who sees UFOs constantly. Me, I am going to vote for the guy who at least approaches sanity.\n\nFYI I really dont know how many people have claimed to see Bigfoot, the loch ness monster, ghosts, demons, and god in human history I am betting a great deal. I have no intention of voting for any of them if I can avoid it.", "gilded": 0, "created_utc": "1252834727", "subreddit": "politics", "score": -3, "controversiality": 0}
{"body": "I was at PAX as well - I didn't have a chance to play it, but saw someone call out the Loch Ness Monster.  I mean, just the prospect of calling out so many things sounds like alot of fun in itself.  I'm curious how long the novelty will last from having deities battle each other.", "gilded": 0, "created_utc": "1252960563", "subreddit": "gaming", "score": 3, "controversiality": 0}
{"body": "Oh about tree fitty", "gilded": 0, "created_utc": "1252986587", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I don't care, I think it's a real word.\n\nBecause it will be useful in Scrabble! Thanks Nessie!", "gilded": 0, "created_utc": "1253016843", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "This is my new background. I used to have a charcoal painting of Jesus riding the Loch Ness Monster.", "gilded": 0, "created_utc": "1253024449", "subreddit": "Marijuana", "score": 2, "controversiality": 0}
{"body": "The LACK of evidence actually.\n\nThe same lack of evidence there is for fairies, bigfoot, and the loch ness monster.", "gilded": 0, "created_utc": "1253077096", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "About tree fitty.", "gilded": 0, "created_utc": "1253098178", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I'd say do what Nessie suggests, start with a test batch.\n\nIf it totally fails just cover yourself in whipped cream with a cherry on top, I can pretty much guarantee you won't receive any complaints.", "gilded": 0, "created_utc": "1253136603", "subreddit": "food", "score": 1, "controversiality": 0}
{"body": "Wrong. Flipper got Lassie, who then enlisted the support of our underwater allie, Nessie. This resulted in an orgy that produced Alf and Miley Cyrus.", "gilded": 0, "created_utc": "1253220330", "subreddit": "AskReddit", "score": 26, "controversiality": 0}
{"body": "LOL!!!! \"He looked me in the eye and said, 'Uh. I need about tree-fitty.' ..well, it was about that time that I noticed that Thai policeman was about eight stories tall and was a crustacean from the protozoic era... The loch ness monster. I said, 'Dammit monster! Get off my lawn! I ain’t giving you no tree-fitty!'\"", "gilded": 0, "created_utc": "1253302022", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "tree fitty?", "gilded": 0, "created_utc": "1253454053", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Loch Ness Monster achievement - love it ;p", "gilded": 0, "created_utc": "1253509800", "subreddit": "tf2", "score": 5, "controversiality": 0}
{"body": "DON'T DO IT PURELY FOR THE MONEY!\n\nI know I'll get voted down for this but it has to be said. If you go about accounting looking at purely the financial aspect then you're setting yourself up for burnout and disappointment.\n\nI was a former Big 4 Accountant and I can vouch for the feeling like a prisoner phenomenon. Joining a big firm is like joining the military. For all intents and purposes they own you for at least 3 years. During those 3 years you'll be working 50-70 hours a week, driving all over the place to clients, and dealing with office politics which can become cut throat in nature. Basically your career is at the mercy of all those factors. Another thing that accountants at Big 4 complain about is the fact that you don't learn much of anything on the job. You deal with such small slivers of the big corporate picture that until you make manager you're just a cog in the machine.\n\nIf you genuinely do not like doing repetitive work or staring at spreadsheets or paper files all day, don't bother going into accounting. \n\nThe pay when I was in Big 4 was above what other organizations were offering, but I was doing the job of 2 people for the pay of 1.25 people. The long hours far out weigh any pay increase you'll benefit from. Work life balance is a myth like Big Foot and the Loch Ness Monster, don't believe them!\n\nFinally, in this economy you'll need your CPA license to get a decent paying job. Accounting is the new fad career and everyone and their mom wants in. So you're already in a low bargaining position due to the fact that this is a buyers market coupled with the influx of  new people. People with university degrees now are coming out of school getting Big 4 jobs paying $40,000 a year in California if they're lucky. Which isn't much if you have student loans and live in a place where the cost of living and taxes are high.\n\nI'm trying to get a job at a small or medium sized firm. In those environments people get more experience performing audits and preparing tax work from start to finish. It is also easier to build connections that will help your career.", "gilded": 0, "created_utc": "1253551944", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "and muddy, sludgy waters...we've got to set the record straigh on nessie!", "gilded": 0, "created_utc": "1253646445", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I'm going to probably get downvoted like a mofo here but this is freaking me out. I once watched a movie called Buchenwald-A dumb dumb portrait of evil, which turned out to be a holocaust denial video.\r\n\r\nBeing a natural skeptic, I watched it. It touches on a few things such as the shrunken heads and human lampshades.\r\n\r\nThe part that freaks me out however is Billy Wilder.\r\nOk, this is where things get a little weird.\r\n\r\nWatch the 24 minute mark of this Hitchcock film.\r\nNow watch the 2 minute mark of this film:\r\n\r\nhttp://video.google.com/videoplay?docid=-6933545879703999426&amp;ei=Dmm8SpjcMJr8qAOh4qmCBg&amp;q=buchenwald#\r\n\r\nIs this the same guy?\r\nIf so, it's Billy Wilder, American Film director.\r\nAnd if it's the same guy, it shows that this Hitchcock film is a propaganda based lie which means the holocaust was for all intents bullshit. The reason I suggest this is that if it's the same person, then that person would have been at the Belsen camp instead of Buchenwald. If it's the same person at both places, then he'd be part of a film crew, yet Hitchcock uses him as an actual reference model to support the idea of the holocaust.\r\n\r\nIt also begs me to wonder why investigating the holocaust is criminal in some countries. Perhaps I'm completely wrong, and I truly honestly hope that I am, or the worst atrocity ever commited by man, might just be as real as the Loch Ness Monster.", "gilded": 0, "created_utc": "1253865132", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Do you believe in Alien Abductions?\nDo you believe in faeries?\nDo you believe in miracles?\nDo you believe in dragons?\nDo you believe in the loch ness monster?\n\nAll loaded questions?", "gilded": 0, "created_utc": "1253933179", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "Bermuda Triangle, Loch Ness Monster, and for the hell of it, crystal Skulls", "gilded": 0, "created_utc": "1253952803", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "http://www.reddit.com/r/AskReddit/comments/9k7at/just_bought_my_first_decent_camera_looking_for/\n\nKmeth's last post was about buying a $50 camera and going to the beach, clearly he's found the loch ness monster. \n\nYou're fucked I'm calling nessie patrol", "gilded": 0, "created_utc": "1253963040", "subreddit": "AskReddit", "score": 37, "controversiality": 0}
{"body": "Nice try Nessie, we know you're in there.", "gilded": 0, "created_utc": "1253980508", "subreddit": "AskReddit", "score": 15, "controversiality": 0}
{"body": "Looks more like Nessie.", "gilded": 0, "created_utc": "1253995926", "subreddit": "reddit.com", "score": 41, "controversiality": 0}
{"body": "What do you think Nessie is, a fish?\n\nNext you're going to tell me you think bigfoot was some giant sloth or something.", "gilded": 0, "created_utc": "1253996814", "subreddit": "reddit.com", "score": 20, "controversiality": 0}
{"body": "Yeah. Just in case anyone missed it though I'm going to explain my own joke.\n\nGiant sloths were thought to be one of the reasons the myth of the bigfoot started. It's thought that early humans in South America were around at the same time that these creatures were dying off. Because these creatures could stand on two feet it would look like a very large hairy man if you didn't get the best view of it.\n\nOne could say something similar about Nessie and some sort of fish.", "gilded": 0, "created_utc": "1254018705", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "**Results 1-0 for *Nessie's Brain* torrent**\r\n\r\n* Nessie's Brain [full version]\r\n* Nessie's Brain 2040 \r\n* [HIGH SPEED] Nessie's Brain (Hi-Def; Russian subtitles)\r\n\r\nSeed...1\r\n\r\nLeech...0\r\n\r\nhealth: [xx........]\r\n\r\n    related searches: brain, nessie, loch ness, consciousness, girls gone nessie", "gilded": 0, "created_utc": "1254055435", "subreddit": "science", "score": 16, "controversiality": 0}
{"body": "I do live in GR, but my janky-ass knee has had all the walking around downtown that it can take.  Did you see the nessie project?", "gilded": 0, "created_utc": "1254113849", "subreddit": "news", "score": 0, "controversiality": 0}
{"body": "\"I need about tree fitty.\"", "gilded": 0, "created_utc": "1254195164", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "My brother and I both took a giant handfull of Skittles and threw them straight at the camera of the Loch Ness Monster in Busch Gardens Williamsburg. The camera was right as you exit a loop so the timing was pretty tricky, but we ended up with an awesome picture with little colored dots all over the place. The next time he was holding up a park map and I was pointing at it, Lewis-and-Clark-style.", "gilded": 0, "created_utc": "1254239289", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "I'd say the devil goes beyond zeroes and ones. He's on par with the [Loch Ness monster.](http://i6.photobucket.com/albums/y228/SWDenverjuggalo/i-need-about-tree-fiddy.jpg)", "gilded": 0, "created_utc": "1254254807", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "nessie!! What are you doing there?", "gilded": 0, "created_utc": "1254276266", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "about tree fitty?", "gilded": 0, "created_utc": "1254325624", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Mmmm ... [Nessie](http://beeradvocate.com/beer/profile/285/1831)", "gilded": 0, "created_utc": "1254329621", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "How do you know that the Loch Ness monster doesn't exist?", "gilded": 0, "created_utc": "1254347163", "subreddit": "atheism", "score": 12, "controversiality": 0}
