{"body": "I am just one person. I love content like this; content that is explained by experts who have dedicated years to their study. Randolph Nessie is a great communicator; it is excellent. I think in relation to the content of the video (in a nutshell) that this is what should be taught in schools, in middle schools to be exact. What I mean by that is not something as advanced as the video's content but a beginning to Evolutionary Biology. It is sad however that Christians in this country are reluctant to teach it because they are emphatic that we are descendants of Adam and Eve. As Richard Dawkins explains...you wouldn't teach kids about sex education by saying, Well basically, people fuck = babies and then also say stork flight patterns = procreation. That would be redundant and since we know which one is true dont keep the other lingering around. I'm guessing a stork having a lay over in Dallas causes an affliction like cerebral palsy.", "gilded": 0, "created_utc": "1233573678", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I already gave him tree fiddy.", "gilded": 0, "created_utc": "1233867605", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Well, I did state that it was a photo from Loch Ness...not Nessie.  This is as vague as it comes I'm afraid.", "gilded": 0, "created_utc": "1233955219", "subreddit": "Animals", "score": 1, "controversiality": 0}
{"body": "tree fitty?", "gilded": 0, "created_utc": "1234105872", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Agnosticism seems contrary to good epistemological hygiene. How many agnostics are equally agnostic about equally unlikely things, like Voodoo and fairies, and comparatively near-convinced of hugely more realistic boggles like the sasquatch and the loch ness monster? Picking just one thing to be agnostic about bumps it out of its position in the scale of plausibility", "gilded": 0, "created_utc": "1234124277", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I was going to watch that the other day, but when I saw that it was a Korean Loch Ness monster movie, I decided against it. Maybe I should watch it after all.", "gilded": 0, "created_utc": "1234387841", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Or Yetis?  Or Nessies?  The potential conspiracies on this one seem endless...", "gilded": 0, "created_utc": "1234588759", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "So...he confessed to a police officer? Is there a written and signed statement that incriminates him? Even if there is, he can't recant it? Can you or even he state with 100% certainty that there was pot in the bong he was holding? Come on. Everything you know about this issue is what the news agencies have doled out. Oh, and a fuzzy photo from a 3/4 back angle. I bet you couldn't even prove it was him in that photo. Oh, yes, the wristwatch. So he's the only one in the world with that watch? There are more photos of the Loch Ness monster.", "gilded": 0, "created_utc": "1234631799", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "God damn Loch Ness Monster...", "gilded": 0, "created_utc": "1234945343", "subreddit": "AskReddit", "score": 11, "controversiality": 0}
{"body": "Also and I saw a Nessie swimming in their. Or maybe it was and bigfoot instead seriously. And not because I stupid or gullibled or smoke lot's doap ether", "gilded": 0, "created_utc": "1235304198", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "\n*It is widely believed that you can’t prove a negative. Some people even think that it is a law of logic—you can’t prove that Santa Claus, unicorns, the Loch Ness Monster, God, pink elephants, WMD in Iraq and Bigfoot don’t exist. This widespread belief is flatly, 100% wrong. Among professional logicians, guess how many think that you can’t prove a negative? That’s right: zero. Yes, Virginia, you can prove a negative, and it’s easy, too.*\n\nhttp://departments.bloomu.edu/philosophy/pages/content/hales/articles/proveanegative.html", "gilded": 0, "created_utc": "1235548502", "subreddit": "philosophy", "score": 11, "controversiality": 0}
{"body": "Tree fiddy!", "gilded": 0, "created_utc": "1235587441", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
