{"body": "Nessie you turn me on!", "gilded": 0, "created_utc": "1277955246", "subreddit": "gonewild", "score": 1, "controversiality": 0}
{"body": "I ain't givin' you no tree-fiddy, you goddamn loch ness monster!  Get your own goddamn money!", "gilded": 0, "created_utc": "1277957157", "subreddit": "gonewild", "score": 26, "controversiality": 0}
{"body": "ach! back to the loch with you nessie.", "gilded": 0, "created_utc": "1277971098", "subreddit": "gonewild", "score": 1, "controversiality": 0}
{"body": "[Meta-Confirmation](http://www.creationtips.com/nessie1.html)", "gilded": 0, "created_utc": "1277981336", "subreddit": "gonewild", "score": 3, "controversiality": 0}
{"body": "Outside the plane for $tree fiddy.  50% refund if it rains or snows.", "gilded": 0, "created_utc": "1278006036", "subreddit": "worldnews", "score": 2, "controversiality": 0}
{"body": "She *was* a space station of a woman.  Towards the end of high school, she single-handedly dragged three of us punks out of the restaurant when I asked her if her great-grandma was the Loch Ness Monster.", "gilded": 0, "created_utc": "1278016333", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "[It's a little bit little](http://www.bcscc.ca/nessie.htm)", "gilded": 0, "created_utc": "1278023491", "subreddit": "gonewild", "score": 1, "controversiality": 0}
{"body": "I came here to try and \"see\" a Royals fan.\n\nUnfortunately, they must remain in the same category as Bigfoot and Nessie.", "gilded": 0, "created_utc": "1278112002", "subreddit": "baseball", "score": 2, "controversiality": 0}
{"body": "tree fiddy five", "gilded": 0, "created_utc": "1278193748", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "*Tree Fiddy", "gilded": 0, "created_utc": "1278204930", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Looks like bigfoot, maybe Nessie...chupacabra? ", "gilded": 0, "created_utc": "1278245635", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1278267563", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "they're just that clever. Sort of like the bigfoots that are massive animals which never leave behind physical evidence or the loch ness monster which is so clever it lives in an ecosystem that doesn't even have the biomass to support it. It has learned to be photosynthetic just like that indian yogi guy. See that? clever.", "gilded": 0, "created_utc": "1278307017", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Hey baby, wanna see the Loch Ness monster? - Whale pick up line", "gilded": 0, "created_utc": "1278452826", "subreddit": "WTF", "score": 6, "controversiality": 0}
{"body": "I wonder what Nessie might turn out to be.", "gilded": 0, "created_utc": "1278455183", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "I met a butterfly the other day. I was just hanging out in the backyard, about to mow the lawn, when a monarch butterfly flew and landed on my finger. I asked him what he wanted, and he said: \"I'mma need about tree fiddy\". Now it was about that time I noticed this butterfly was 80 stories tall and looked like a creature from the black lagoon: it was dat damn loch ness monsta!!", "gilded": 0, "created_utc": "1278511379", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "You gonna get no tree fiddy from him, Monsta.", "gilded": 0, "created_utc": "1278513140", "subreddit": "pics", "score": 89, "controversiality": 0}
{"body": "I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!", "gilded": 0, "created_utc": "1278525319", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "www.paleodiet.com\n\nIt's basically a diet that's in conformance with your genome. 99% of the human genome was selected during the paleolithic era - before fire was discovered. Basically cut out grains, beans and potatoes entirely.", "gilded": 0, "created_utc": "1278525479", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Nearly everything I've read about the paleo diet specifically mention potatoes, sweet potatoes as being non-paleo.   I have yet to find a page that explains why though.  You'd think tubers of some kind were around during the paleolithic era, my guess is that since they are buried in the ground, man hadn't noticed them yet or didn't realize they were edible (they are not good raw, and 'grok' wasn't known for his cooking skills)\n\nTubers are generally high in carbs and starch, which should be avoided if you are overweight or diabetic.   One site actually does say that if you're not fat, and you enjoy potatoes, go ahead and have 1 once in a while.   Starches metabolize into glucose (as far as I understand), which in itself is a good thing, but too much glucose causes weight gain, it's much healthier to allow your body to produce its own glucose as it's needed.", "gilded": 0, "created_utc": "1278548967", "subreddit": "Paleo", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1278561423", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1278562071", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "They usually give me about tree fiddy; so I like them.", "gilded": 0, "created_utc": "1278563213", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I'll try to make note of the noises. So far I've heard what sounds like a chipmunk ( water puzzle ), loch ness monster type things, and of course the golden beetle.", "gilded": 0, "created_utc": "1278597940", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "Edward basically has to bite the womb open so Nessie (their crotchfruit) can be born, yes. It's like a gruesome vampire C-section.\n\nOh, and don't forget Bella puking a fountain of blood! :D", "gilded": 0, "created_utc": "1278612270", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "Nessiediño. When in fact I am a plesiosaur, not a dinosaur.", "gilded": 0, "created_utc": "1278665026", "subreddit": "soccer", "score": 1, "controversiality": 0}
{"body": "Dat'll be tree fiddy.", "gilded": 0, "created_utc": "1278710249", "subreddit": "geek", "score": 7, "controversiality": 0}
{"body": "About tree fiddy [](/happy)", "gilded": 0, "created_utc": "1278712360", "subreddit": "fffffffuuuuuuuuuuuu", "score": 3, "controversiality": 0}
{"body": "The Loch Ness Monster?", "gilded": 0, "created_utc": "1278723531", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "You don't give no loch ness monster no tree fiddy!", "gilded": 0, "created_utc": "1278724658", "subreddit": "geek", "score": 2, "controversiality": 0}
{"body": "Yes. He is penfriends with the Beast of Bodmin and once dated Nessie for an entire summer.", "gilded": 0, "created_utc": "1278784672", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I could use about tree fiddy.", "gilded": 0, "created_utc": "1278790367", "subreddit": "AskReddit", "score": 76, "controversiality": 0}
{"body": "[Nessie](http://imgur.com/ZF8oP.jpg)\n\nI also love my medium-sized yellow bong called Sweet Jesus (don't have any pictures of it though).", "gilded": 0, "created_utc": "1278796692", "subreddit": "trees", "score": 8, "controversiality": 0}
{"body": "I AINT GIVIN YOU NO TREE FIDDY YOU STUPID LOCH NESS MONSTER!", "gilded": 0, "created_utc": "1278802130", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Nessie the milk demon?", "gilded": 0, "created_utc": "1278807010", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "don't be ridicolous, whales don't live in loch ness, and if they did Nessie would eat them up", "gilded": 0, "created_utc": "1278809501", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "You get the Loch Ness monster\n\nhttp://www.cryptomundo.com/cryptozoo-news/ss-penis/", "gilded": 0, "created_utc": "1278812946", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "&gt;In 2001 Hovind started Dinosaur Adventure Land (DAL), a young earth creationist theme park...The park depicts humans and dinosaurs co-existing in the last 4,000–6,000 years and also contains a depiction of the Loch Ness monster.  \n  \nfacepalm. or look of disapproval. both ridiculously relevant.", "gilded": 0, "created_utc": "1278840136", "subreddit": "Economics", "score": 1, "controversiality": 0}
{"body": "That sound the Demoman makes while on fire. Sounds like a fucking dying Loch Ness monster. In fact, I wouldn't be surprised if the demoman *was* the Loch Ness monster. He is Scottish, after all. ", "gilded": 0, "created_utc": "1278895807", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "You can define anything you want into existence. \n\nI believe in the Loch Ness Monster, which I define as meaning cheddar cheese. It was sighted in my sandwich yesterday.\n\n", "gilded": 0, "created_utc": "1278916219", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Your personal health is obviously the metric to use. The paleolithic era is just a starting point for getting an idea of human dietary needs; lots of things aren't strictly paleo, including penicillin and indoor plumbing. \n\nI think it's worth pointing out, also, that human evolution did not cease in the paleolithic era. The emergence of the enzyme lactase in certain populations was probably within the last 30,000 years. If you're lucky enough to have this enzyme (some estimates have it at only about 10-15% of Earth's population), by all means, use it!", "gilded": 0, "created_utc": "1278945843", "subreddit": "Paleo", "score": 8, "controversiality": 0}
{"body": "In what I consider to be ascending order of plausability: ghosts, homeopathy, 9-11 conspiracies, miracles/fate, UFO conspiracies, religion, bigfoot, astrology, the loch ness monster, psychics, psychic cats, telepathy, certain kinds of ESP, God, and most plausibly, extra-terrestial life. \r\n\r\nedit: added psychic cats", "gilded": 0, "created_utc": "1278962879", "subreddit": "skeptic", "score": 1, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1278974871", "subreddit": "aww", "score": 2, "controversiality": 0}
{"body": "Here is the parody from *Kentucky Fried Movie* **\"[Bullshit or Not?](http://www.youtube.com/watch?v=CKGicNPeKtw)\"** - In search of The Loch Ness Monster and Jack Ripper", "gilded": 0, "created_utc": "1279035956", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "bout tree fiddy is alright", "gilded": 0, "created_utc": "1279039383", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "\"Flim Flam\" was very formative for me. Before \"Flim Flam\" I assumed everything I read was true (Loch Ness monster, bigfoot, etc); Randi taught me to be skeptical and realize that just because something is in print, it's not necessarily true.\n\n(I was 16 when I read it). ", "gilded": 0, "created_utc": "1279069914", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Had a vague idea in my head of people looking for a picture of the Loch Ness monster, or something.  Sounded better *in* my head.  Most things do. ;)", "gilded": 0, "created_utc": "1279088541", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Tree fiddy?", "gilded": 0, "created_utc": "1279115026", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "Okay; honestly that AMA is about the far Right lunatics who believe FOX news. But in my opinion, I make fun of all religious people, including my inlaws because I would do the same for other false outdated views. If someone believes in: a flat earth, hollow earth, UFOs, ghosts, Bigfoot or Yeti, Loch Ness Monster, Crop Circles, the earth resting on the backs of infinate turtles, a flipping 6000 year old earth, etc.  I will mock them. ", "gilded": 0, "created_utc": "1279134775", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "It is not the job of an atheist to disprove the existence of a god.  Similarly, no one has to disprove the existence of the Loch Ness Monster or Bigfoot.  Until there is sufficient evidence to believe in a god or Nessie or Bigfoot, then, for all intents and purposes, they don't exist.", "gilded": 0, "created_utc": "1279138946", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "\r\n&gt; I can't see how that is practical, can you explain.\r\n\r\n\r\nWith pleasure. Can I prove the existence or non existence of the Loch Ness monster? Not really. I hold it to be highly unlikely, but I recognize that the possibility. \r\nIf asked \"Do you believe in the Loch Ness Monster?\" I will say no. I will not say I'm not sure. I treat gods in the same fashion.\r\nI'm happy with the agnostic atheist label but that normally requires a discussion around etymology that nobody actually needs to hear. Atheist gets the main point across (i.e a lack of belief in gods) with little fuss.", "gilded": 0, "created_utc": "1279198391", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "I'm not sure but i just think i saw Smeagol ride a Nessie? ", "gilded": 0, "created_utc": "1279234142", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "'bout tree fiddy.", "gilded": 0, "created_utc": "1279293458", "subreddit": "funny", "score": 11, "controversiality": 0}
{"body": "Goddamn Loch Ness monster's on Reddit now!", "gilded": 0, "created_utc": "1279304031", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "&gt;I do not think atheists are bad people, however. Just misled.  \n  \nI don't understand how atheists are \"misled\". I do not believe in a god because there is no evidence. How is that being \"misled\"?\n\n&gt;Atheists seem to be closed off to many possibilities and therefore do not want to acknowledge that they are not the highest power in the universe.  \n  \nI think most atheists would disagree with you on that point. I am open to any and all possibilities as long as you have proof. If you have no proof then I see no reason to accept your argument. I also think we have different definitions of \"power\". An elephant is far stronger than myself; does that mean it is more powerful? If so, then I concede that an elephant is a more powerful being than myself. What about if I have a 50 caliber machine gun and therefore the ability to tear apart the elephant? Am I now more powerful? I think the sun is probably more powerful than myself, unless you consider power as thought, in which case I am more powerful because the sun cannot think. You should do an edit to your post so that we have some clear operating definitions. Otherwise you're talking about apples and I'm talking about something completely unrelated...like...the Loch Ness Monster.", "gilded": 0, "created_utc": "1279341336", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "That'll be about tree fiddy. ", "gilded": 0, "created_utc": "1279343579", "subreddit": "pics", "score": 72, "controversiality": 0}
{"body": "Damnit, monsta, I ain't givin' you no tree fiddy!", "gilded": 0, "created_utc": "1279345938", "subreddit": "pics", "score": 23, "controversiality": 0}
{"body": "\"Science, Reason, and Critical Thinking\"...unfortunately this does a good job of showing how mental midgets do their best to turn \"Science!\" (as opposed to just science) into a religion in its own right. If they're going to throw Buddhism and Taoism, which are essentially just philosophies, in with the the Loch Ness Monster, it shows their critical thinking abilities are subsumed to their own dogmatic faith in the absolute unerring Truth of their own beliefs.", "gilded": 0, "created_utc": "1279382516", "subreddit": "science", "score": 121, "controversiality": 0}
{"body": "Personally I think that period should go Bigfoot, Chupacabra, Nessie, then the rest.  Then it's roughly ordered by plausibility.\n\nIt's the little details that make a parody like this really shine.", "gilded": 0, "created_utc": "1279388392", "subreddit": "science", "score": 8, "controversiality": 0}
{"body": "Scotland = Nessie", "gilded": 0, "created_utc": "1279424327", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "So, they admit they believe in the Loch Ness monster? Well, as long as they're consistent...", "gilded": 0, "created_utc": "1279473905", "subreddit": "atheism", "score": 13, "controversiality": 0}
{"body": "Theology: the study of the colors of the flippers of the Loch Ness Monster.", "gilded": 0, "created_utc": "1279474204", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Sadly, it isn't signed. But if we could stop mincing words and move past this, it would have to be. Look down, then back up, where are you? You're in my apartment, with the man your man could be. What's in your hand? back at me. I have it. It's an oyster with two consent forms for that thing we love. Look again, the consent forms are now signed! Anything is possible when your man lives in Scotland and has to jump through these legal hoops. I'm on a Nessie.", "gilded": 0, "created_utc": "1279485053", "subreddit": "worldnews", "score": 73, "controversiality": 0}
{"body": "I do believe, hehe, that the Loch Ness monster was proven to be a hoax. Therefore! *Sigh* Logic doesn't agree with their interpretation because you need to have proof to prove something. No proof either way on God.", "gilded": 0, "created_utc": "1279486173", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "I'm on a Nessie, oh god, milk on keyboard.", "gilded": 0, "created_utc": "1279492240", "subreddit": "worldnews", "score": 4, "controversiality": 0}
{"body": "The Moonies are using it to develop an AI for the purpose of strategic manipulation.  All those Koreans who dedicate their lives to playing Starcraft are acting as a huge tutor to the system which will bring about the New World Order, aided by Wow, chemtrails, and the Loch Ness monster.\n\nNow I realize that evidence is fairly scarce for Nessy's involvement, but I think that's *exactly* what they want.  If Nessy was involved, this is exactly how she'd do it.  Following this line of thought, Nessy is clearly head of the Moonies and the founder of Blizzard, which uses Starcraft to train its AI and WoW to keep the people complacent.", "gilded": 0, "created_utc": "1279498586", "subreddit": "worldnews", "score": 2, "controversiality": 0}
{"body": "Japanese scientists explaced... placed plastic explosives on the bottom of Lake Loch-Ness to blow Nessie out of the water.", "gilded": 0, "created_utc": "1279502212", "subreddit": "science", "score": -1, "controversiality": 0}
{"body": "When I saw the third painting by Steve Mills I thought to myself *well there's the left overs from when Nelly gave the Loch Ness Monster a dollar when it asks for [tree fiddy](http://www.youtube.com/watch?v=bi2Dv7TgCko). What better way to comment on realistic art than with South Park?", "gilded": 0, "created_utc": "1279524283", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "To dumb down theists and rednecks that get all their info from daytime tv (all the holy grail bullshit, 2012, Nostradamus, ghost hunts) and to make them look stupid by convincing them that \"UFOs are aliens\", \"Bigfoot is real\", the \"Loch Ness monster is real\". When they starts spouting off all that crap to other people nobody takes them seriously. It leaves them even more confused and misinformed.", "gilded": 0, "created_utc": "1279534020", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "The ghost hunter haunts my dreams. He found Jonbenet Ramsey's orbs, after all. Also, about tree fitty.", "gilded": 0, "created_utc": "1279551595", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "A framed certificate from *Dumbrella* (Topatoco) saying that I'm part of the *Loch Ness Monster Adventure Club*, and that my formal title is \"The Minister of Pillows\". For those who know nothing of our club, its motto is \"*Finding Answers, Ignoring Facts.*\"", "gilded": 0, "created_utc": "1279570118", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I got tree fitty", "gilded": 0, "created_utc": "1279651584", "subreddit": "self", "score": 7, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1279680237", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "Get outta here, loch ness monster.", "gilded": 0, "created_utc": "1279697427", "subreddit": "fffffffuuuuuuuuuuuu", "score": 2, "controversiality": 0}
{"body": "Damn Loch Ness Monster! (old man voice)", "gilded": 0, "created_utc": "1279706564", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "I ain't givin' you no tree fiddy you god damn Loch Ness monster!", "gilded": 0, "created_utc": "1279706884", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "Now, my job is a good job, and I work hard at it, but even hard jobs got times where nothin's happening.  Those are the times I like to visit reddit.\n\nReddit, it's a good site with lots of folk and I like to read it, but it's got problems.  One of them problems is that it's got too *much* folk.  The servers are stressin and strainin and tryin to get the pages out, and they ain't having much luck.\n\nWell, the good folks who run reddit, they had an idea for 'reddit gold', which would get ya all *kinds* of new things.  Now, I weren't born yesterday, I know nothin's free, but I go to their page and see what they wanted for their golden service.\n\nThey need about tree fiddy.\n\nWell it was about that time I noticed that this website I been visiting every day for the past few years was eight stories tall and a crustacean from the protozoic era.  I said \"God damn, loch ness monster!  I ain't givin you no tree fiddy!\"\n\nThey banned me for life, and I ain't never been back there, 'cept to make a few rage comics.", "gilded": 0, "created_utc": "1279728132", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Maybe I am just unable to see the point.  All of those points could have been clearly expressed by explaining his position to his audience, not a being he doesn't believe exists.  I have never written a letter to bigfoot or Nessie.\n\nBut then again, I was never big on art or fictional literature.", "gilded": 0, "created_utc": "1279728694", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "...dammit monster get off my lawn I aint givin you no tree fiddy. \n~Well then how about two fiddy?\n~What is there a sale on loch ness munchies or something?", "gilded": 0, "created_utc": "1279731511", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Good start.  As I said, you'd have to show that everything else is a lesser threat, too.  That is, you now need to address Martial Law, the New World Order, peak oil, climate change, peak water, The Loch Ness Monster, acne, the cavity creeps, etc.", "gilded": 0, "created_utc": "1279735508", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "In Scotland we have the classic Loch Ness monster, haunted castles and an assortment of wee fairy folk, eg kelpies, selkies, brownies. The devil is the \"clootie\". Possibly the cutest name for satan ever :D", "gilded": 0, "created_utc": "1279745969", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "I'm Scottish. Loch Ness monster can observe if he wishes.", "gilded": 0, "created_utc": "1279747727", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "This is just as bad as that Loch Ness monster joke in some christian propaganda video that was posted here a few days ago.", "gilded": 0, "created_utc": "1279827174", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Atheists don't claim to \"have an answer\" anymore than someone who says they don't believe in the Loch Ness monster does. Someone tells me something exists. I withhold belief (that is, I don't BELIEVE) until someone provides proof. Atheist = waiting for proof.", "gilded": 0, "created_utc": "1279827387", "subreddit": "atheism", "score": 8, "controversiality": 0}
{"body": "Everyone knows the Loch Ness Monster is a girl.  This must be her twin sister.", "gilded": 0, "created_utc": "1279830481", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Defying all expectation, a group of Scottish marine biologists capture a live Loch Ness Monster. In an almost unbelievable coincidence, a bear hunter in the pacific northwest shoots a Sasquatch in the thigh, thereby allowing zoologists to take the furry monster into captivity. These events happen on the same afternoon. That evening, the president announces he may have thyroid cancer and will undergo a byopsy later that week. **You are the front-page editor of The New York Times: What do you play as the biggest story?**  \n  \n**Edit:** [Source](http://books.google.com/books?id=8bvFIHE0u4kC&amp;printsec=frontcover&amp;dq=sex+drugs+and+cocoa+puffs&amp;hl=en&amp;ei=getITMaNHoOC8gak0JHNDg&amp;sa=X&amp;oi=book_result&amp;ct=result&amp;resnum=1&amp;ved=0CCwQ6AEwAA#v=onepage&amp;q&amp;f=false)", "gilded": 0, "created_utc": "1279847657", "subreddit": "AskReddit", "score": 9, "controversiality": 0}
{"body": "But the question says that the President *might* have cancer. So, it's not actually confirmed yet if it's true or not. I'd choose ol' Nessie for the front page.", "gilded": 0, "created_utc": "1279849629", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Run a joint article on Nessie/ Sasquatch on the front page.  Put the president's story on the front page of the politics or world news section. ", "gilded": 0, "created_utc": "1279859389", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Bella's daughter Nessie is a vampire-human hybrid. It is specifically stated that all growth and maturing occurs within the first 7 years. This occured with Nahuel, the vampire-human hybrid that Alice and Jasper brought back from Africa. ", "gilded": 0, "created_utc": "1279860117", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Does the Loch Ness Monster count?  \r\n\r\nI've always liked her ever since I read \"The Mysterious Tadpole\".", "gilded": 0, "created_utc": "1279902512", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "ftfy\n\n&gt; The first seed (no pun intended) was planted when I did Bella's computer research in chapter seven of Twilight. Bella reads about several real vampire legends—the Danag, Estrie, Upier, etc. In the novel, I only mentioned a few of the many legends I read through. One that I didn't mention at this point was the entry on the Incubus. The unique feature about that legend was that the incubus could father children. Hmmm, I said, and I filed that kernel of an idea away for later. When I decided to write the first sequel to Twilight (Forever Dawn), I knew it was going to revolve around a hybrid baby from the outset.\n\n&gt; When my editor and I decided to go back and really develop Bella's last year of high school, I did so with the knowledge that it was all going to end up with the events in Breaking Dawn. Everything I wrote was pointed in that direction.\n\n&gt; I was always very careful when I answered the \"Can vampires have babies?\" question, because I didn't want to say anything incorrect, but I also didn't want to make the future super-obvious. I focused my answers on the female half of the equation—female vampires cannot have children because their bodies no longer change in any aspect. There is no changing cycle to begin with, and their bodies couldn't expand to fit a growing child, either. I purposely evaded answering the question, \"Can a male vampire get a human female pregnant?\" to preserve a tiny bit of surprise in the last book. There were many statements on this subject purported to have come from me, but I never made those comments because, obviously, I knew where this was going.\n\n&gt; Now, on to the \"how is this possible?\" question. First of all, of course it's not possible. None of this story is possible. It's a fantasy story about creatures that don't actually exist. Within the context of the fantasy, however, this is how it works:\n\n&gt; Vampires are physically similar enough to their human origins to pass as humans under some circumstances (like cloudy days). There are many basic differences. They appear to have skin like ours, albeit very fair skin. The skin serves the same general purpose of protecting the body. However, the cells that make up their skin are not pliant like our cells, they are hard and reflective like crystal. A fluid similar to the venom in their mouths works as a lubricant between the cells, which makes movement possible (note: this fluid is very flammable). A fluid similar to the same venom lubricates their eyes so that their eyes can move easily in their sockets. (However, they don't produce tears because tears exist to protect the eye from damage, and nothing is going to be able to scratch a vampire's eye.) The lubricant-venom in the eyes and skin is not able to infect a human the way saliva-venom can. Similarly, throughout the vampire's body are many versions of venom-based fluids that retain a marked resemblance to the fluid that was replaced, and function in much the same way and toward the same purpose. Though there is no venom replacement that works precisely like blood, many of the functions of blood are carried on in some form. Also, the nervous system runs in a slightly different but heightened way. Some involuntary reactions, like breathing, continue (in that specific example because vampires use the scents in the air much more than we do, rather than out of a need for oxygen). Other involuntary reactions, like blinking, don't exist because there is no purpose for them. The normal reactions of arousal are still present in vampires, made possible by venom-related fluids that cause tissues to react similarly as they do to an influx of blood. Like with vampire skin—which looks similar to human skin and has the same basic function—fluids closely related to seminal fluids still exist in male vampires, which carry genetic information and are capable of bonding with a human ovum. This was not a known fact in the vampire world (outside of Joham's personal experimenting) before Nessie, because it's nearly impossible for a vampire to be that near a human and not kill her.\n\n&gt; I didn't get into all of these details at my signings because it's a long, complicated mouthful. Also, it's hard to be clearly heard with all the screaming. Mostly, though, I waited to do this in writing because I have an immature, Homer Simpson-like tendency to giggle when I say the words \"seminal fluids\" in public.\"", "gilded": 0, "created_utc": "1279990183", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "homeopathy, UFOs, bigfoot, easter bunny, loch ness monster, triffids, knockers, fairies, ghosts, goblins, demons, Clangers.\n\nHand him (somebody else who is seemingly an xtian doubter) a printed list with yes/no check boxes, say its a survey of what is true to believe in if xtain...", "gilded": 0, "created_utc": "1279996227", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I assume he means: they report inane trivia, and fetishize otherwise uninteresting people as sources of that trivia. I assumed that by \"tabloid\" he meant the celebrity gossip-rags that fill most of the checkout racks, not the oddball ones about alien abductions and the Loch Ness monster.", "gilded": 0, "created_utc": "1280068407", "subreddit": "DoesAnybodyElse", "score": 6, "controversiality": 0}
{"body": "what can i get for \"tree fitty\"", "gilded": 0, "created_utc": "1280105827", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Oh no, they're already making \"X in review\" lists in July? Well, they're going to feel silly when the Loch Ness monster is captured in September, Bin Laden is seized in October, and in November Jesus makes his 2nd and 3rd returns, followed quickly by his 4th, 5th, 6th, and 7th comings as every time he steps into the mortal realm his foot lands in a position that just doesn't feel right, and so has to go back and touch the doorknob a few more times and make sure his shoulder clears the Marvelous Gateway at exactly the right height and that this time he's certain the coffee maker is definitely, *definitely* unplugged.", "gilded": 0, "created_utc": "1280122372", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "It should be tree fiddy.", "gilded": 0, "created_utc": "1280153451", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Tree fiddy.\n\nSeriously though, I still get that from time to time, though it's usually immediately after I submit a link to the wrong subreddit and then delete it so I can post it where it belongs.\n\n*edit - oh, you said posting comments, I was referring to posting links. D'oh @ me.", "gilded": 0, "created_utc": "1280158390", "subreddit": "reddit.com", "score": 7, "controversiality": 0}
{"body": "I'd sell out for bout tree fiddy.", "gilded": 0, "created_utc": "1280162873", "subreddit": "atheism", "score": 14, "controversiality": 0}
{"body": "You better not be no Loch Ness Monster.", "gilded": 0, "created_utc": "1280171301", "subreddit": "atheism", "score": 6, "controversiality": 0}
{"body": "About Tree Fiddy.", "gilded": 0, "created_utc": "1280176119", "subreddit": "web_design", "score": 0, "controversiality": 0}
{"body": "Loch Ness Monster...sightings are so infrequent and far fetched, its existence is often doubted. ", "gilded": 0, "created_utc": "1280186005", "subreddit": "sex", "score": 2, "controversiality": 0}
{"body": "Not even treefitty.  He's no Loch Ness Monster.", "gilded": 0, "created_utc": "1280207357", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "It's not about taking a stand.  It's about accepting a claim.  If there isn't enough evidence to accept a claim, then you can dismiss the claim. So, if you don't accept the claim that there is a god, then you are not a theist.  You are an atheist.  This is all independent of whether there is enough evidence to know whether or not a god exists. In this fashion, science is not agnostic about the existence of the Loch Ness Monster or the Yeti.  It's unreasonable to claim they exist without providing sufficient evidence. ", "gilded": 0, "created_utc": "1280247327", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1280254851", "subreddit": "nsfw", "score": 7, "controversiality": 0}
{"body": "Well, I omitted that part- but in point of fact, finding out about the illogical aspects of Christianity started me down the path to Atheism. It took a few years, but gradually bits of my belief started falling off. I was led to look critically at my religion. Innocent at first (Hey, Jesus was critical of the established religion of *his* day, what I'm doing is *like Jesus*.). \n\nBut I kept going, and... slowly, I realized that I figured God, and the literal or historic basis for the Gospels was as likely as the existence of Big Foot, or the Loch Ness monster, and I was effectively an atheist.", "gilded": 0, "created_utc": "1280263026", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I'm not getting your point here, because Big Foot and the Loch Ness monster are both clearly real. ", "gilded": 0, "created_utc": "1280263993", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Nessie, you don't need to make counter points :) . Culture and historiography is very complicated and shouldn't be summed up in response about \"soup meat.\"", "gilded": 0, "created_utc": "1280268351", "subreddit": "JapaneseFood", "score": 1, "controversiality": 0}
{"body": "One time something that looked just like that knocked on my door and asked me for tree fiddy.", "gilded": 0, "created_utc": "1280278726", "subreddit": "WTF", "score": 35, "controversiality": 0}
{"body": "I wish Bigfoot/Loch Ness Monster/Jersey Devil type cryptids were all real, but as I grow up I start to loose faith.", "gilded": 0, "created_utc": "1280290770", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I'm gonna need about tree fiddy", "gilded": 0, "created_utc": "1280336215", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "It's that god damn loch ness monster again!", "gilded": 0, "created_utc": "1280404590", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "nessie", "gilded": 0, "created_utc": "1280449908", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Now that they have 7 fuckin' years they should have to mythbust shit like UFOs, the Loch Ness Monster, Bigfoot, Jack the Ripper, JFK's assassination, 9/11, etc. And I mean they should END the discussion on each of these things. If it takes them 10 episodes for each myth then it takes 10 but now that they've got the time they should do their fuckin' job! And they can always figure out some excuse to blow something up, I don't have a problem with that.", "gilded": 0, "created_utc": "1280523530", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Picture of Sasquatch and Yeti teaming up to solve mysteries... while riding the Loch Ness monster", "gilded": 0, "created_utc": "1280531464", "subreddit": "comics", "score": 1, "controversiality": 0}
{"body": "Show me the money.  I mean, the undeniable evidence.  Not blurry photos, not second hand accounts or shots of mom's pie plate in orbit.  Aliens and their space ships.  Cough'em up.  After decades of reports, blurry photos and bad videos there's not one scrap of physical evidence.  Nothing that conclusively says, this is from another world, be it machine or living being.  I'll admit, I've seen videos of things I have no rational explanation for but that doesn't mean, fure sure, it's a UFO or an alien anything.  I'm sure this guy's seen a few things in his day that defy explanation but if it's UFO's and aliens then cough the shit up.  There is as much physical evidence to support it as their is for bigfoot and the loch ness monster.  I'm sure there's lots of things you can show me and say, \"Then explain this...\" and I won't be able to but you explain it and present the physical evidence to support it.  Otherwise we might as well be debating the existience of God.  I'd love to see actual evidence of aliens and whatnot, bring it on!  I have an open mind but that same open mind says, show me the money.  Used car salesmen come in all forms.\r\n", "gilded": 0, "created_utc": "1280542507", "subreddit": "UFOs", "score": 2, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1280585455", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "Did anyone else expect this to be about the Loch Ness monster?", "gilded": 0, "created_utc": "1280604396", "subreddit": "environment", "score": 0, "controversiality": 0}
{"body": "Ill buy it for tree fitty.", "gilded": 0, "created_utc": "1280604686", "subreddit": "Music", "score": 1, "controversiality": 0}
