{"body": "&gt;using sound-controlled CGI and 3D compo\n\nCan they also make Bigfoot visible using the same methods?   What about Nessie?\n", "gilded": 0, "created_utc": "1212496228", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "The best joke on Americans I can think of is The Loch Ness Monster.\r\n\r\nThat sucker has paid for 2 generations of mortgages and shoes for those sneaky bastards up North.\r\n", "gilded": 0, "created_utc": "1212581404", "subreddit": "reddit.com", "score": 28, "controversiality": 0}
{"body": "Sure she is, and I'm the Loch Ness monster.", "gilded": 0, "created_utc": "1212622018", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "&gt;And if any of the premises are untrue, then the conclusion remains true. Further and less obviously, there are no other possibilities to consider. It is logically impossible for me to be wrong.\n\nIs it fair to suspend the rules of logic for the sake of this argument?  You offer a list of fallacies, but I wonder if Non sequitur makes an appearance on that list.  How can you state that the conclusion remains true even if any of the premises are untrue and not see that this is argument is a fallacy?  The next line follows swiftly with another telling sign of a fallacious argument, “There are no other possibilities to consider.”  This is little more than an argument from ignorance.\n\nSince you have considered a short essay’s worth of possibilities and determined that there are no other alternatives, I imagine you want me (or anybody else) to illuminate other possibilities.  In fact, you state that naming a possibility that you have not considered will prove you wrong.  Before I make an attempt at pointing to unconsidered possibilities, I would like to say something about the futility of trying to engage in discourse with somebody who makes statements such as the one quoted above.\n\nTo state that a conclusion is true regardless of the condition of the premises is not an argument but merely an assertion of a conclusion. A suspension of reasonable rationality or,  “Intellectual tennis without a net”, if you will.  If we want to lower the net for statements such as the one you made, shall we play without a net altogether?  For, if I say that your theory on consciousness is a theory that only applies only to the Loch Ness Monster, how can you be warranted in asking me to logically justify that statement?  Might I be able to reply that the condition of the premises used to reach that conclusion are irrelevant because the conclusion remains true even if the premises are untrue?  I prefer to have the net up for your serves as well as my returns.\n\n&gt;If you evolved and you are conscious, then consciousness is either free or confers some specific fitness advantage.\n\nThis is where I would like to start with challenging your form of argument.  It is not the only starting point, but I do not yet have the will to wage a multi-front attack on your essay (for all I know, you may be interested in playing without a net).  Since all you ask for is naming a fallacious form or an unconsidered possibility, this shall do.\n\nBy saying that consciousness is either free or confers some specific fitness advantage, you present a fallacy of false dichotomy.  A possibility you fail to consider is that consciousness may be a spandrel or an exaptation of adaptations that confer specific fitness advantages.  \n\nWhen you speak of specific advantages, you fail to mention for whom might the advantages be advantageous.  It is a possibility that consciousness is not advantageous for the individual, but may in fact be advantageous for the replication of memes.  The improbable changes that led to appearance of consciousness do not have to be exclusively genetic.  In other words, the fitness gains could conceivably be made in the cultural realm rather than in the genetic realm.  \n\nI am going to leave off here for now since I wish to not be bogged down with arguing multiple points in parallel.  I am sure there is plenty to disagree with in what I have written thus far.  \n\nLooking forward to continuing the exchange.\n", "gilded": 0, "created_utc": "1212679975", "subreddit": "cogsci", "score": 1, "controversiality": 0}
{"body": "Selma, the so-called “Sea Serpent” that lives in Lake Seljord (Seljordsvatnet) obviously would have to be a Lake Monster, akin to the Loch Ness Monster. The location is near the inland town of Seljord, a municipality in the county of Telemark, Norway", "gilded": 0, "created_utc": "1212688972", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "The development of monotheism is closely tied to specific historical, socio-political and linguistic events. \r\n\r\nDivorcing your belief in God from the very foundations of the concept is akin to clinging to a belief in the Loch Ness monster even after the original photo has been shown to be fabricated.", "gilded": 0, "created_utc": "1212892704", "subreddit": "entertainment", "score": 2, "controversiality": 0}
{"body": "&gt; Although, I do have two atheist siblings and one of them lose paranormal investigation shows where they use \"science\" to look for ghosts.\n\nI watch shows on Bigfoot and the Loch Ness Monster, but that doesn't make me a bigfootist or lochnessmonsterist.", "gilded": 0, "created_utc": "1213383855", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "The History Channel broadcasts 'documentaries' on ghosts, big foot, and the Loch Ness monster.  What did you expect?", "gilded": 0, "created_utc": "1213386199", "subreddit": "atheism", "score": 22, "controversiality": 0}
{"body": "I found some in my Cheerios box and I also had the Loch Ness monster try to sell me some more for about $3.50.", "gilded": 0, "created_utc": "1213558650", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Until I see pictures, I'm sticking these hot nerdy girls in the same basket as the Loch Ness monster.\n\nThese are the nerd girls I see in the wild: \nhttp://farm3.static.flickr.com/2247/2095479163_b91579a344.jpg", "gilded": 0, "created_utc": "1213589212", "subreddit": "programming", "score": 0, "controversiality": 0}
{"body": "I had a dream when I was 3, it goes something like this: I was walking through this forest in winter, and there was a native guy in full tribal gear pointing, so I went where he was pointing, and everything suddenly turned to Autumn. I kept walking and came across a small city made of adobe, with a large pool. At the bottom of the pool was a Macy's and my brother and mother were trapped inside. I kept walking. I eventually came across a large metal circle, with a duct in the center. My dad was sweeping dog food into the duct with a large push broom. He didn't say anything, but I knew he was feeding the Loch Ness monster. Then I woke up, and ever since I've remembered that dream.", "gilded": 0, "created_utc": "1213661763", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Anyone else notice the Loch Ness monster in the last pic?", "gilded": 0, "created_utc": "1213932835", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Look at the word a-theist: [atheos \"to deny the gods, godless,\" from a- \"without\" + theos \"a god\"](http://dictionary.reference.com/browse/atheist). \n\nIt only applies to the belief in a deity or deities. You can be an atheist and believe in reincarnation, fairies at the bottom of your garden, the Loch Ness Monster, [Russell's teapot](http://en.wikipedia.org/wiki/Russell%27s_teapot), that Uri Geller can bend spoons, Dick Cheney is a nice guy or anything else you want to. A *skeptic* might doubt these things...\n\n ", "gilded": 0, "created_utc": "1214142558", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I wouldn't bet an Octopus tree fiddy, especially not in a [shell game](http://en.wikipedia.org/wiki/Shell_game) -- he lives in the water, and has 8 arms, for chrissake!", "gilded": 0, "created_utc": "1214264060", "subreddit": "science", "score": -5, "controversiality": 0}
{"body": "&gt; \"Sadly for Nessie hunters, I don't think there is anything hiding in the lochs and lakes of the world any more.\"\n\nBut in the sewers, a large and mysterious beast watches us, though few are watching him....(*distant neighing sound echoes through sewer pipe*)", "gilded": 0, "created_utc": "1214265023", "subreddit": "science", "score": 35, "controversiality": 0}
{"body": "&gt; it's possible to prove or disprove God's existence, but we do not currently have enough evidence\n\nIt's possible that I'm the Loch Ness Monster and am writing this on Elvis' computer from our secret base on Mars, but at some point you have to call a lie a lie and stop hemming and hawing about things that are obviously manufactured.", "gilded": 0, "created_utc": "1214265606", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "One tole me it'd be about tree fiddy", "gilded": 0, "created_utc": "1214274326", "subreddit": "science", "score": 8, "controversiality": 0}
{"body": "Go, Loch Ness Monster-mon!\n\nLoch Ness Monster-mon uses *Water Gun*\n\nIt's *Super Effective!*", "gilded": 0, "created_utc": "1214276134", "subreddit": "science", "score": 7, "controversiality": 0}
{"body": "And the Trilateral commission, don't forget them, and the gray aliens, and Sasquatch. Also, I hear that the Illuminati have sent their special envoy, the Loch Ness Monster to see to it that their man Obama is elected.", "gilded": 0, "created_utc": "1214316411", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "WTF you talking about gray aliens, Sasquatch and the Loch Ness Monster?  Are you delusional?\n\nThe Bilderbergs, CFR and PNAC are real entities.\n\n", "gilded": 0, "created_utc": "1214323047", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "I like my conspiracy theories juicy.\n\nWhen I picture the Bohemian Grove gathering I like to think about Dick Cheney with his arm around a Gray Alien sharing a beer with Sasquatch as the Loch Ness Monster looks on approvingly from the other side of the campfire. Elvis is there, having arrived via the Bilderberg Blimp @TM.\n\nWhen the meeting is done they all retire to their spacious accomodations in the real WTC which they had transported to their headquarters after they fooled us all into believing that it was blown up.\n\nWith all this going on it is amazing that the sheeple won't wake up, isn't it?  ", "gilded": 0, "created_utc": "1214331014", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "You forgot about the how the Reverse Vampires and the Loch Ness Monster used their Freemasonry connections to ... oh, whatever.", "gilded": 0, "created_utc": "1214331682", "subreddit": "politics", "score": -7, "controversiality": 0}
