{"body": "&gt; social deterrent for public acts of adultery\n\nHuh? You are aware that adultery is an extramarital affair, not public sex. Assuming that you actually mean a public extramarital affair: Why should \"society\" care that a man takes a women out to a restaurant if he's already married? That's between him and his wife. \n\n&gt; There is no proof or evidence that God does not exist.\n\nHave you read anything on this subject before? You argue like someone who has not. You are making the claim therefore the burden of proof is yours. I don't claim that a god exists, I don't even claim that a god does not exist. I only claim that your evidence for a god is insufficient.\n\nYou probably don't believe that the Loch Ness Monster exists. However you also probably don't make the active claim that the Loch Ness Monster does not exist. You simply have a non-belief in the Loch Ness Monster because the presented evidence is insufficient.\n\n&gt; Hitler was a naturalist.\n\nNo he wasn't. Hitler was a roman catholic. Proof: http://scienceblogs.com/pharyngula/2010/09/list_of_hitler_quotes_in_honor.php\n\n&gt; moral evolutionary duty\n\nBeing an atheist does not demand that you believe in social darwinism or even evolution. ", "gilded": 0, "created_utc": "1288572150", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt;Huh? You are aware that adultery is an extramarital affair, not public sex. Assuming that you actually mean a public extramarital affair: Why should \"society\" care that a man takes a women out to a restaurant if he's already married? That's between him and his wife.\n \nBecause Muslims care about the social integrity of marriage. Duh! If you want to publicly commit adultery (i.e. have sexual relations in public with another women who is not your wife, not merely take her out to a restaurant) you should find another society where it is permitted. There is no Law in Islam that says that one cannot leave a Muslim society if its not too ones liking. Islam allows freedom of association.\n\n&gt;Have you read anything on this subject before? You argue like someone who has not.\n\nCompletely baseless claim without a hint of evidence. \n\n&gt;You are making the claim therefore the burden of proof is yours.\n\nI have already backed up my claim as to why atheism is irrational. \n\n&gt;I don't claim that a god exists, I don't even claim that a god does not exist\n\nThen you aren't an atheist. You're an ignorant agnostic. \n\n&gt;I only claim that your evidence for a god is insufficient.\n\nCompletely baseless claim without a hint of evidence or substantiation.\n\n&gt;You probably don't believe that the Loch Ness Monster exists. However you also probably don't make the active claim that the Loch Ness Monster does not exist. You simply have a non-belief in the Loch Ness Monster because the presented evidence is insufficient.\n\nI think its unlikely that the Lochness monster exists based on my understanding of biology. One cannot make the same claim about God since God is outside the natural order.\n\n&gt;No he wasn't. Hitler was a roman catholic. Proof: http://scienceblogs.com/pharyngula/2010/09/list_of_hitler_quotes_in_honor.php\n\nHe was only pandering to the religiosity of the German population. In reality he was an atheist mystic. That is clear from his personal writings. \n\n&gt;Being an atheist does not demand that you believe in social darwinism or even evolution.\n\nThat's why I said he was an atheist mystic. In any case atheism doesn't demand that one should not be a social Darwinist or perpetrating genocide.", "gilded": 0, "created_utc": "1288572855", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Can you PLEASE stop posting this! honest to god, this is like a joke for an imbecile with the IQ of a gadfly! this got old about the paleolithic era and hasnt aged very well.", "gilded": 0, "created_utc": "1288674816", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I forgive you this once. Don't let it happen again or I will send \"Bigfoot\" ( aka The Loch Ness Monster) to haunt you. ", "gilded": 0, "created_utc": "1288698310", "subreddit": "skeptic", "score": 1, "controversiality": 0}
{"body": "I spit my coffee out. Thank you Nessie.", "gilded": 0, "created_utc": "1288704161", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "HAHAHAHA!!!!  My favorite part from the Dinosaurs page: \n\nThey are trying to say that dinosaurs existed with humans and some still do even...  \"Although exceedingly rare, living dinosaur and related species can still be found world wide. Some famous examples are the Loch Ness Monster, a Scottish plesiosaur (or leviathan); Mokele-Mbembe, an African sauropod; and the Chupacabra, a South American velociraptor. This obviously proves that man and dinosaur have existed -- and continue to exist -- contemporaneously\"\n\nYes.  Loch Ness Monster and the Chupacabra are being used as \"proof\" of creationism...", "gilded": 0, "created_utc": "1288712730", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "I play mostly SNGs. The games have gotten significantly tougher. There are still fish floating around. Even some regulars are fish, remember. Biggest day was probably a couple grand. Biggest losing day was probably a grand or maybe 1500.\n\nLost bout tree fiddy.", "gilded": 0, "created_utc": "1288724243", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Bout tree fiddy.", "gilded": 0, "created_utc": "1288725980", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "Of all the weird things out there people believe in -- crazy religions, UFOs, the Loch Ness monster, etc., this is the one thing I really hope somebody eventually comes up with scientific data to confirm it.  I mean, there's a lot of \"could be\"'s in there.  You have lots of open wilderness, similar reports of similar animals all over the world from cultures that are generally unconnected from one another.\n\nI don't believe it's out there, but it's the one thing that would shock me the least I guess if it turned out to be true.", "gilded": 0, "created_utc": "1288732678", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "And I demand about tree fiddy.", "gilded": 0, "created_utc": "1288761372", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy!", "gilded": 0, "created_utc": "1288800227", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt; That has a negative slant to it, but that's the right idea, kind of. Repent and be saved for the kingdom of God is near. Think it's clear I'm only talking about the God of the Bible.\n\nThen your God is immoral and does not deserve to be worshipped. \n\n&gt; Yep. In the same way they perish during tsunamis, earthquakes, and other 'Acts of God.' Which is the legal term for them.\n\nJust because it's the \"legal term\" does not mean that it's actually an \"Act of God\". We know why earthquakes happen and it's not because God decides to kill every man, woman, and child in a certain city. \n\nGod made a conscious and deliberate decision to kill innocent children when, being an all-powerful being, he didn't have to.\n\n&gt; The main people who turn to God are those who are in desperate need in this life.\n\nThat's a point against your side. It indicates that people turn to God not because of evidence, reason, or proof but because it makes them feel better.\n\n&gt; So, worship Satan then\n\nI don't believe Satan exists. But here's what I see that he's done in the Biblical story:\n\n* Stood up to a dictator and demanded that he be able to live the way he wants to live. \n* Tried to convince humans to open their minds and embrace knowledge. \n\nHe doesn't deserve to be worshipped but I see nothing that makes him evil.\n\n&gt; People are going to die anyway.\n\nNice sense of morality. People are gonna die anyways so why don't I just start killing people? \n\n&gt;  Jewish slavery in the Bible is vastly different than the American slavery system.\n\nTrying to justify slavery? Claiming ownership of other humans beings, treating them like property, is always evil. \n\n&gt; It was either eat or be eaten.\n\nNo it wasn't. The Israelites slaughtered the Midianite men and women- except for the virgins. God, supposedly the source of your morals, told them to rape the Medianite virgins:\n\n\"Now therefore kill every male among the little ones, and kill every woman that hath known man by lying with him.\t      (31:17-18) \n\n\"Kill every male among the little ones, and kill every woman that hath known man by lying with him. But all the women children, that have not known a man by lying with him, keep alive for yourselves.\"\n31:18 But all the women children, that have not known a man by lying with him, keep alive for yourselves.\"\n\n&gt; In this case, there's plenty enough resources for people to become convinced of God without a vision in the sky.\n\nApparently there isn't because I don't believe. Apparently there wasn't enough for Paul either because he didn't believe.\n\n&gt; most encounters with God as described in the Bible are terrifying events. \n\nHe's all-powerful and all-knowing... I'm sure he can figure out a way to prove himself without terrifying me. Even if he couldn't I would prefer having a Paul experience and having the existence of God proven then being tortured in hell for eternity. 5 minutes of discomfort vs. an eternity of discomfort. \n\n&gt; It tells the stories as they happened. Sometimes the moral of the story is, \"don't do this.\"\n\nAnd the moral of the story about of the Medianite virgins? \n\n&gt; Well that's convenient.\n\nNothing to do with convenience. \n\n&gt; In any case, the four gospels were by eye witnesses.\n\nUFO abductees are eye witnesses, people who see the Loch Ness Monster are eyewitness, there people in cults right now who can tell you of the \"miracles\" their leader has performed....\n\nDo you believe all of these \"eyewitness\" accounts?\n\n&gt; Not sure where it would be mentioned that we would have access to it.\n\nPerhaps one of the histories of the era? Or Roman records? Jewish records? Jewish religious texts?\n\n", "gilded": 0, "created_utc": "1288801036", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1288839239", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Had a few, but this one easily takes the cake.\n\nA friend of mine set me up with one of her girlfriends, with the warning that this girl could be a little crazy (as in, partying crazy and crazy crazy). Me, being a dumbass 22-year old with no real interest in anything but some sex, saw these things as perfectly cool (and in fact, somewhat positive).\n\nSo, I agree to meet this girl. We actually talked before, and she seemed pretty cool; we decided to meet at a bar downtown for a few drinks and some pool, just to keep things low-key.\n\nWell, she gets there, and she's pretty damn good-looking. Not model-hot, mind you, but clearly takes care of herself and has absolutely beautiful eyes. She walks up, smiles, and introduces herself (we'll say \"Mary\" for this story). I grab her a drink, and we immediately hit it off.\n\nSo, we're playing pool, and \"Mary\" is just pounding drinks. She asked for a jack and coke for her first drink, and just pounded it like a shot. \"Alright,\" I'm thinking to myself, \"this girl is nuts, I am definitely getting laid tonight.\"\n\nSo, night goes on, and we're both pretty ripped. We decide to go for a walk, and she asked where I parked. I was in a garage near the bar, and she asked to see my car. Needless to say, I obliged.\n\nWe get out there, and just start going to town on each other. She tears (and literally tears, I had buttons pop off) my shirt off, and undoes my pants within about 30 seconds of getting into the car, and just starts going wild on me downstairs.\n\nNow, this girl was a pro. She was after me like she was hungry for it, and I was more than willing to take care of her. So, embarrassingly, I realize that I'm about to cum after just a few minutes of her going down on me. I say fuck it and just go with it, and riiiiight as I'm about to cum, she stops abruptly.\n\nI look down and say, \"What is it?\"\n\nShe looks up at me with those gorgeous blue eyes, and just says, \n\n\"I need about tree fitty.\"\n\nWellll it was right about this point that I noticed this bar skank was actually an eight-foot tall monster from the late cretaceous.", "gilded": 0, "created_utc": "1288907805", "subreddit": "sex", "score": 42, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1288915438", "subreddit": "Frugal", "score": 14, "controversiality": 0}
{"body": "Now don't go offering it tree fiddy woman! No wonder he keeps coming back.", "gilded": 0, "created_utc": "1288916175", "subreddit": "Frugal", "score": 6, "controversiality": 0}
{"body": "I take your tree fiddy and raise you SHFIFTY FIVE", "gilded": 0, "created_utc": "1288916603", "subreddit": "Frugal", "score": 3, "controversiality": 0}
{"body": "My main ringtone is \"Super Rad\" by the Aquabats, and my text message tone is Chef's Dad from south park saying \"I need about tree fiddy\".", "gilded": 0, "created_utc": "1288921395", "subreddit": "iphone", "score": 2, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1288966859", "subreddit": "politics", "score": 31, "controversiality": 0}
{"body": "&gt; nothing like that appears to be out of the realm of possibility\n\nDo you also believe in Big Foot or the Loch Ness Monster or UFO's? Or multiple universes, evil twins, movable suns, etc..\n\nIf not then why not?", "gilded": 0, "created_utc": "1288969867", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Goddamn Loch Ness monster I ain't givin you no tree fiddy!", "gilded": 0, "created_utc": "1288970627", "subreddit": "politics", "score": 17, "controversiality": 0}
{"body": "Hmm... It could be the lawnmower races in Brookshire. They had souped up riding lawnmowers racing around a track, NASCAR style. For the occasion, they brought a jet-powered lawnmower that had been on Home Improvement, shooting out flames, though nobody could ride it because it was a death trap. \r\n\r\nOr it could be the April Fool's stunt we pulled in Marlin where we had the Loch Ness Monster in the city lake, using a toy dinosaur. This was before Photoshop and we had to do our shenanigans in the darkroom. People all over town believed it. Some went out to the lake with binoculars. Newspapers generally don't do April Fool's pranks anymore, because of the potential for lawsuits.", "gilded": 0, "created_utc": "1288987188", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "Is that the show where Leonard Nimoy explains UFOs and the Loch Ness Monster?", "gilded": 0, "created_utc": "1289024655", "subreddit": "circlejerk", "score": 1, "controversiality": 0}
{"body": "&gt; Then your God is immoral\n\nThis is beating a dead horse now. A convenient way of not taking responsibility for one's actions is to blame someone else. In this case blame God.\n\n&gt; Just because it's the \"legal term\" does not mean that it's actually an \"Act of God\".\n\nDuh. The point isn't why they happen it's that they typically happen without our foreknowledge and indiscriminately affect all people in an area. The destruction of Soddom &amp; Gommorah fit this mold, excepting that it was ordained by God.\n\n&gt; That's a point against your side. It indicates that people turn to God not because of evidence, reason, or proof but because it makes them feel better.\n\nI'm not really into sides here. I'm comfortable with the validity of the Bible regardless of whether you or anyone else is. Regarding why the poor recognize the need for God, it's because they recognize that they're poor and need something else. The Rich, are also poor, they just don't recognize it. They have everything they want. Then one day they get old and die. We're all poor in the end.\n\n&gt; Satan\n\nIn general, God's promises are difficult to accept but are genuinely rewarding in the long run. Take a person who is sacrificially giving to those around them. They may have less money, but more joy. Of course non christians can experience that too. The ultimate promise is that of salvation, to sacrifice one's life on earth in order to serve God. It's tough to not live for one's own desires, as the promised reward isn't tangible.\n\nThe promises of Satan are the opposite. You can gain the whole world, yet in the end you lose it. People see nothing wrong with it until they come up empty.\n\n&gt; Nice sense of morality. People are gonna die anyways...\n\nThat's not a guiding principle for morality. It's just a fact. Just because you don't accept God's divine right to do what He wants, doesn't mean He doesn't have that right. Just because you don't believe in Him doesn't mean He doesn't exist. He either does, or He doesn't, regardless of whether you or anyone else believes in it. God as described in the Bible is the giver of life, and has the right to take life away. Nobody is promised a certain amount of years or level of enjoyment.\n\n&gt; Claiming ownership of other humans beings, treating them like property, is always evil.\n\nAccording to the Bible, no, it's not. American slavery was so out of control and evil that it's been declared a scourge upon the earth. Jewish slavery as it's described in the Bible is (supposed to be) like being under the security of the family. It's not permanent, unless by choice of the slave, and it's not divided based upon any particular race. Brutally suppressing people with force is the evil, not the slavery itself. The Jews were slaves in Egypt for 400 years and are constantly reminded to treat their own slaves with respect. Some slaves elected to continue on for the rest of their lives. If they found it evil or unpalatable, they could choice to not continue.\n\n&gt; Save the Midianite virgins, kill the rest.\n\nI looked this up. Numbers 25,31. Israel was a people rescued by God and commissioned by Him to live in purity and ultimately make His name known upon the earth. The Midianites enticed the Israelites to worship their God, Baal, be immoral. As a result God sent a plague the killed 24,000 people. Some theorize that the plague was VD related. Which makes sense to eradicate the Midianites except the virgins. The wikipedia entry makes numerous inferences to [highly unsanitary habits](http://en.wikipedia.org/wiki/Baal-peor#Talmudic_traditions) of worship. In any case, the Midianite influence had a decimating effect on the Jews and detracted them from God's purpose for them. The Jews were a nation under a covenant with God. If they obeyed, they would enjoy prosperity, if not, they would be scattered throughout the land.\n\n&gt; Apparently there isn't because I don't believe. Apparently there wasn't enough for Paul either because he didn't believe.\n\nThis is the same sticking point over and over again. God's not going to make you worship Him. He's not going to make you choose Him. He's not going to make you obey Him either. His promise is that if someone seek Him with all their heart, they'll find Him. Those who are ardently against Him are more likely to convert since they wrestle with the concept every day. Paul had witnessed the commitment of the early Christians first hand, having killed many of them himself. Eventually God called him to serve Him. He then made it his life's commitment to let everyone know about Christ. You know the story of the gospel, you choose not to believe it. That's your choice, not God's or anyone else's.\n\n&gt; I'm sure he can figure out a way to prove himself without terrifying me. Even if he couldn't I would prefer having a Paul experience and having the existence of God proven then being tortured in hell for eternity. 5 minutes of discomfort vs. an eternity of discomfort.\n\nOne hot topic of the Bible is whether people choose God, or God chooses them. There are verses that imply both. The predestination camp might suggest that God didn't call you. Romans 9:15 \"  “I will have mercy on whom I have mercy, and I will have compassion on whom I have compassion.\" Which is to say, if you don't know God, maybe he doesn't want you. Paul, who is the 'mammal' who wrote that wasn't selective about who he shared the gospel with though. He made every effort to convince all people to repent.\n\n&gt; And the moral of the story about of the Medianite virgins?\n\nHere's [the covenant](http://www.biblegateway.com/passage/?search=Deuteronomy%2029-30&amp;version=NIV) God made with His people. I made comments above on it. The overall moral is that God is a jealous God, not happy when people worship other Gods and engage in immorality. Another moral of the story is that those who God saved in the past will always be turning away from Him in the future. Once He saves them from whatever mess they were in, they look for greener pastures that are more fun in the here and now.\n\n&gt; UFO abductees are eye witnesses,\n\nNothing to say about abductee 'witnesses.' I believe UFOs are government related projects. Just exploring new technologies not released to the general public.\n\n&gt; people who see the Loch Ness Monster are eyewitness\n\nPeople who saw the giant squid, mountain gorilla, and giant panda were also eye witnesses, and they incurred scorn and derision for it. Until those species were discovered and verified. Most major lakes throughout the world have centuries old reports of lake monsters. These are across culturial and social classes. Science demands a specimen, so the search continues. The eye witness reports and some of the digital evidence is compelling.\n\n&gt; There people in cults right now who can tell you of the \"miracles\" their leader has performed.\n\nHere's an example of that.\nhttp://www.youtube.com/watch?v=c9U_lWmAsYM\n\nJust because one person or group has false beliefs doesn't mean all of them do.\n\n&gt; Do you believe all of these \"eyewitness\" accounts?\n\nAfter examination, yes I believe the eye witness accounts in the Bible. It's from multiple people from multiple walks of life, many of whom went to their deaths for the sake of it. The NT is consistent with the OT prophecies. The view of the world and human nature as described in the Bible makes sense to me.\n\n&gt; Perhaps one of the histories of the era? Or Roman records? Jewish records? Jewish religious texts?\n\nI dug up a few, which you quickly brushed aside as erroneous. The main Jewish records and religious text are the Bible. Which is why it was so well preserved. The dead sea scrolls corroborate the information in much of the Bible. I've read that the NT and parts of the OT can largely be reconstructed based upon them. Which tells us that at least it didn't change in the past 2000 years. Given that the Jews were a religious nation state it probably incurred more scrutiny in the years before that.\n", "gilded": 0, "created_utc": "1289029132", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Fuck la Chupacabra, Bigfoot, and Nessie. I wanna see some dedicated cryptozoologists searching for this guy.", "gilded": 0, "created_utc": "1289040568", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Can I get tree fiddy then?", "gilded": 0, "created_utc": "1289046339", "subreddit": "WTF", "score": 19, "controversiality": 0}
{"body": "tree fiddy? Good LORD, that's a lot of money", "gilded": 0, "created_utc": "1289049612", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "God DAMN loch ness monster ", "gilded": 0, "created_utc": "1289070607", "subreddit": "fffffffuuuuuuuuuuuu", "score": 3, "controversiality": 0}
{"body": "Suck it science nerd. This is suppose to be slightly a joke, I'm sitting here making a reference to it wearing grundge. Do you really think I believe that this is some sort of monster?\r\n\r\nI do. Its a fuckin Nessie.", "gilded": 0, "created_utc": "1289071421", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "I'll keep insisting it's not suppose to be a religion at all until someone gives a shit.  What Jesus taught was not a new religion.  The point of the cross was remove the religion from people's path to God.\n\nAs far as the original post: Translation, context, yadda yadda ya.... It doesn't matter what anyone says to you or what the actually truth or the reality of the situation *may* be.  You've already made it up in your mind that it's a bunch of bullshit.  Posting shit like this does nothing to open up a real discussion.  It simply points a finger and calls shenanigans.  Fine, we get it.  Christians are idiots who believe stupid shit.  \n\nI really don't get this drive to constantly tear apart things one doesn't believe in.  Is there a Greek-mythology-is-bunk subreddit where I can make fun of the ancient Greeks for believing in minotaurs and sirens? Maybe an alien adduction or bigfoot subreddit.  God, those people are so retarded for believing the Loch Ness monster is real.  Let me dedicate all my time to making sure they know how stupid they are.  Go me!", "gilded": 0, "created_utc": "1289147748", "subreddit": "DebateAChristian", "score": 2, "controversiality": 0}
{"body": "&gt;How is that possible?\n\n[Transhumanism.](http://en.wikipedia.org/wiki/Transhumanism)\n\n&gt;Someone above and beyond this thing you call revenge which is well, just plain fucking stupid because it defeats all human instincts that fall into the highest of all evolutionary laws: self-preservation\n\nYeah, humans don't have any ability to over-ride evolutionary imperatives. If we've done something on instinct, we should always do that and never try to evolve through culture and thought.\n\n&gt;That's right, you're essentially stating that **something your ancestors enacted upon for survival is no longer essential.**\n\nFuck yes I am. Here's another thing our ancestors depended upon to maintain their personal and genetic survival. \n\n[Many Neolithic groups routinely resorted to infanticide in order to control their numbers so that their lands could support them. Joseph Birdsell believed that **infanticide rates in prehistoric times were between 15% and 50% of the total number of births**,[6] while Laila Williamson estimated a lower rate ranging from 15% to 20%.[1] Both anthropologists believed that these high rates of infanticide persisted until the development of agriculture during the Neolithic Revolution.[7] Comparative anthropologists have calculated that 50% of female newborn babies were killed by their parents during the Paleolithic era.[8] **Decapitated skeletons of hominid children have been found with evidence of cannibalism.**](http://en.wikipedia.org/wiki/Infanticide#Paleolithic_and_Neolithic)\n\nFemale kids where killed (likely) because they weren't good as hunters/protectors, and they needed more men than women to better their chance of survival.\n\nKilling kids was a great way to secure the survival of your genes. One of your ancestors has definitely killed his own, or other peoples kids.\n\nGo join your Neanderthal cousins in extinction if you aspire to instinct and survival, not cognition and enlightenment.", "gilded": 0, "created_utc": "1289152891", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt;You've already made it up in your mind that it's a bunch of bullshit.\n\nThe raw material (the text) is not bullshit. But the way it is perceived is frequently bullshit.\n\n&gt;Is there a Greek-mythology-is-bunk subreddit where I can make fun of the ancient Greeks for believing in minotaurs and sirens? \n\nIs there a society who's politics and culture are significantly influenced by those who believe in the ancient Greek pantheon, alien abduction, bigfoot or the Loch Ness monster?\n\n", "gilded": 0, "created_utc": "1289157910", "subreddit": "DebateAChristian", "score": 3, "controversiality": 0}
{"body": "For narcissists, it is the attention itself that is exciting; the idea that they really are as fantastic and special as they think they are. When I read them I tried (and failed) to get the nonexistent passion too. It ticked me off to no end that Stefanie Meyer name-dropped great romances like Anne/Gilbert and Elizabeth/Darcy while propping up her sham of a romance on Cookie Monster finding the only cookie he wouldn't ever eat.\n\nPlus, I have a dog named Nessie (she's 11 and actually named after the monster, not the stupid character), so that made the last book even worse.\n\nI do enjoy the first movie because if you take it as a comedy, it's hilarious. The acting is pretty heinous and you can tell that the actors (with the exception of Bella) all realize how terrible the plot is. Pattinson does some of the funniest facial expressions that I've ever seen in my life.", "gilded": 0, "created_utc": "1289196643", "subreddit": "movies", "score": 1, "controversiality": 0}
{"body": "&gt;“well, I don’t know”\n\nI'm going to preempt this [AGNOSTICISM CORRECTION HEDGEHOG](http://i.imgur.com/BxqTm.png)\n\nI'd also contend that I don't know that Allah exists on roughly the same level that I don't know whether Osiris exists.\n\n&gt;Is it not the basis of science to separate belief from truth?\n\nThe function of science is to analyze evidence and draw belief conclusions based on it.  We can't know that a meteor killed the dinosaurs, but with the available evidence we can believe it.\n\n&gt;The belief in no God, has as much weight as saying that there is a God. You cannot \"prove\" it either way, it lies with string theory in that it's not testable.\n\nIt depends on which God, which traits, or which actions you're talking about. As per [here](http://www.reddit.com/help/faqs/atheism#Strongvs.Weakatheism).  Some things can be ruled out by observation a posteriori and some can be reasoned out a priori.\n\n&gt;So claiming that there is no God is nothing more than a belief, which oddly, is what Atheist fight so strongly against.\n\nAtheism can be as simple as an absence of belief, not a belief in the absence.  You seem to be arguing more against positive atheism specifically.  Positive atheism has its own arguments and evidence (that I've already listed).  \n\n&gt;So why even have the debate?\n\nIf you ask me, it's important to criticize religion for the following 5 reasons:\n\n1) There's nothing wrong with trying to progress the discussion.\n\n2) It affects you. People vote and act based on their religion.\n\n3) It affects people who are not part of their religion. Homosexuals, atheists, members of competing religions, etc. all can be affected by the thoughts and thereby actions of the one who holds on to a religious ideology.\n\n4) They hurt themselves. They convince themselves that they're not whole without Jesus or that they're filthy with sin. They coerce their children into belief with threats like hell and bribes like heaven. Which is not to mention the more extreme of the groups who believe in religious charlatans and sacrifice their health and money to the cause.\n\n5) They have a potential for much greater evil than is currently produced by religion.\n\n&gt;Is it not more important that we discuss and learn from each other rather than mock and provoke? The flat out hate on the other hand, is down right counter productive.\n\nhttp://www.reddit.com/help/faqs/atheism#Theatheiststereotype\n\n&gt;The atheist have come to their conclusions the same way the religious have, through their experiences in the world since they popped into existence one day. Denying another’s experiences and beliefs because of what you believe to be true is hypocritical.\n\nThere's a lot more to the discussion than argument from experience.  Even in their own groups, people arrive at their conclusions at completely different ways.  Some people might only believe based on experience, but others do it through analyzing arguments and evidences.\n\nThat the religious experience can equally lead to a 6 armed elephant god and a ressurecting jewish carpenter would seem to suggest that it isn't worth much.\n\n&gt;Denying another’s experiences and beliefs because of what you believe to be true is hypocritical.\n\nSome people claim to have experiences with the loch ness monster.  Since the lake isn't large enough to support a sustainable population of pelsiosaur like animals, this obviously isn't true.  There's nothing hypocritical is saying that someone is either mistaken or lying.\n\n&gt;Note: I am not looking for specific examples of either religion, or atheism causing a direct consequence. Yea, there are always crazy people, blowing themselves up, trying to bring religion where it doesn’t belong, trying to force their beliefs on others, but I’m not talking about the outliers here as they are the vast minority. Both sides of the “debate” are responsible for these same behaviors.\n\nThe population without outliers has its own problems:\n\nScience denial, only [40% believe in evolution](http://www.gallup.com/poll/114544/darwin-birthday-believe-evolution.aspx), 1/5 is a [modern geocentrist](http://en.wikipedia.org/wiki/Modern_geocentrism)\n\n[40%](http://www.telegraph.co.uk/news/newstopics/religion/7847625/Jesus-will-return-by-2050-say-40pc-of-Americans.html) of americans believe Jesus will return by 2050.  You can imagine the impact of that on environmentalism, politics, etc.\n\n[40%](http://www.gallup.com/poll/128291/americans-opposition-gay-marriage-eases-slightly.aspx) oppose same sex marriage.\n\n[14%](http://news.discovery.com/human/obama-the-muslim-antichrist-survey-says.html) suspect that obama is the antichrist.\n\nKeep in mind that the US is 82% christian (other religions make up 2-3%), so 40% is actually the half way mark.\n\nEven without statistics, you still have the religious doing the following (I'll focus on christianity, but if you want I can switch to Islam or Judaism):\n\n1) Mutilating their children's genitals (circumcision) \n\n2) Coercing their children into belief with the psychological torture that they will go to hell if they don't believe.\n\n3) Convincing people that they're filthy with sin or otherwise that their life is meaningless and empty without Jesus.\n\n4) Targeting the poor, uneducated, and the young for conversion.  All who would be susceptible and not able to approach the topic objectively.\n\n5)  Throwing money away by tithing, and even support an institution which [keeps 50% of priests](http://en.wikipedia.org/wiki/John_Jay_Report) with substantiated sexual misconduct allegations as priests.  (Only 2% face any jail time)\n\n6) Defending the same axioms of 'faith' or the same books as extremists\n\n&gt;I should be listening, not criticizing. After all, we are seeking the same thing, knowledge, why? What is this reality that I am so oddly a part of?\n\nIf you have an argument not refuted [here](http://www.randomhouse.com/pantheon/authors/goldstein/36%20Arguments.pdf) or evidence which is actually evidence, I'd love to see it.", "gilded": 0, "created_utc": "1289233426", "subreddit": "atheism", "score": 6, "controversiality": 0}
{"body": "“Baffled, I crept away from the sleeping Loch Ness monster.  The beast was real, but I would tell no one.  Dollar beer night is dangerous.”", "gilded": 0, "created_utc": "1289240099", "subreddit": "books", "score": 2, "controversiality": 0}
{"body": "&gt;Why can we not? There is nothing that explicitly says he isn't.\n\nThis is some giant lump of theological noncognitivism and screwing up 'proven' vs. 'not falsified'.  Might want to check out [Russell's teapot](http://en.wikipedia.org/wiki/Russell%27s_teapot) and [Not Even Wrong](http://en.wikipedia.org/wiki/Not_even_wrong)\n\n&gt;Just because it doesn't make sense for him to be, doesn't mean he isn't. To me it doesn't make sense for a god to be an anthropomorphic elephant with four arms, but if Hinduism is right, then Ganesha exists, and there is a god who is a multi-armed elephant. Recall that in Job, when asked why he did what he did, God's essential answer was \"I am the God of the Universe, who are you to question me?\" Which I personally think is a totally badass response to anything.\n\nIf your God is a maine lobster, you are a crazy person or at least a pantheist.  You're also mixing up believing with understanding.  A dog could never understand the concept of the loch ness monster.  It can still make belief judgments based on the information that is provided, and then formulate beliefs (or lack of) based off of that.\n\nAs a matter of fact, it's all we can hope to do.  If we deprive ourselves of analyzing evidence we revert to solipsism.\n\n&gt;I don't know what they were trying to do. But I've found that attacking someone's religion and beliefs is never, ever a good idea. I don't know, maybe that's what you've been taught as an atheist. Perhaps that is all about what the atheism subreddit is about. It seems to me that atheists take too much pleasure in attacking other people's beliefs.\n\nQuit playing the victim.  Can you imagine if scientists considered it an 'attack' when someone disagreed with them?\n\n'Big Bang Theory?  Are you attacking my cherished belief of a steady-state universe?  You should be ashamed! Can you imagine how people would feel if this meant that the 1st law of thermodynamics hasn't always been maintained?\"\n\n&gt;I don't know, maybe that's what you've been taught as an atheist.\n\nGet more snooty.  Also, what I've learned is that there's nothing wrong with progressing the conversation and furthering the common thought pool of humanity.\n\n&gt;Perhaps that is all about what the atheism subreddit is about. It seems to me that atheists take too much pleasure in attacking other people's beliefs.\n\nYou came to a subreddit based around rejecting the notion of gods and you were expecting what exactly?  Maybe after this you can investigate why they keep talking about Jesus in /r/christianity\n\n&gt;And especially if this is coming from someone's friend. Attacking anything they really care about is a terrible, terrible idea.\n\nI didn't mean to have it come off as what he should respond (though it admittedly does), only as a way of picking apart the arguments within so that he can use the information I provided as the OP feels he should.", "gilded": 0, "created_utc": "1289247407", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I need tree fiddy!", "gilded": 0, "created_utc": "1289268521", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Tree Fiddy!", "gilded": 0, "created_utc": "1289278028", "subreddit": "apple", "score": 5, "controversiality": 0}
{"body": "She's not the loch ness monster ;-) ... its Nessa Devil, or Nikola Jiraskova, and she has the weirdest proportions ever... yet somehow looks like a fantastic sex machine.", "gilded": 0, "created_utc": "1289339489", "subreddit": "nsfw", "score": 6, "controversiality": 0}
{"body": "All I'm saying is that claiming \"there is no Loch Ness Monster\" is highly illogical and lacks any form of proof.", "gilded": 0, "created_utc": "1289350312", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Yeti  \nLoch Ness Monster  \nYour mum.", "gilded": 0, "created_utc": "1289355196", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I have eaten many a plate of Panda Express at that place. I heard that the conspiracy crazies think there are tunnels underneath the airport where they do experiments on aliens or something. Or they breed Loch Ness monsters. Whatever they do it's SECRET and EVIL!", "gilded": 0, "created_utc": "1289371557", "subreddit": "Minecraft", "score": 1, "controversiality": 0}
{"body": "Holy shit! Nessies everywhere!", "gilded": 0, "created_utc": "1289392845", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "In theist culture, there's no such thing as separation of church and state. Many famous atheists as well as atheists here have said that you can have your beliefs so long as you don't push them on other people or try to change laws based on them. The theists have continued to push their beliefs on others by using television, going door to door, skewing votes by recommending a certain vote to be based on \"God's will\", or forcing their children to believe in something they have no evidence for. We will scoff at the insane beliefs of theists, or people that believe in ghosts and Bigfoot and the Loch Ness Monster. These people are all the same to us in the fact that they believe in something without empirical evidence. If a ghost believer were to go door to door preaching that someone who doesn't believe like them is evil, then I'm sure you would think they're insane too.\n\nTheism has a knack for ignoring evidence and replacing reality with their own. This messes with progress and understanding, and is inevitably bad for society. Look at the burning of Alexandria and the dark ages as a basic example of this - watch the movie Agora to see the ridiculousness of any religion. ", "gilded": 0, "created_utc": "1289407918", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I thought it was generally understood that the Loch Ness monster would reside in the place that it was named after. ", "gilded": 0, "created_utc": "1289416565", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "DAE dislike the taste of coffee in a metal or plastic travel mug? \n\nI preheat my ceramic mug with hot water, which prolongs things a bit. A saucer as a cover helps too. \n\nAlso, smaller and more frequent cups, if you have the means. (I love you, [nessie](http://www.google.com/search?q=nespresso+essenza&amp;hl=en&amp;tbs=shop%3A1&amp;aq=f))", "gilded": 0, "created_utc": "1289418524", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "I ain't given no loch ness monstra tree fitty!", "gilded": 0, "created_utc": "1289423132", "subreddit": "pics", "score": 7, "controversiality": 0}
{"body": "&gt; If you don't believe in god, here's a big question you have to answer: how did everything, including us, get here?\n\nWhy?  Why do I *have* to answer this?  There are plenty of other questions nobody knows the answer to that I'm not told I *absolutely must answer right now* that you're not all on my ass to answer:\n \n* Why does [anyone listen to Nickelback?](http://www.reddit.com/r/ThrowAbuseOnAPerson/comments/e4heh/i_dont_think_there_is_anything_necessarily_wrong/)  \n* How does Michelle Bachman keep getting elected to Congress?  \n* Are Sasquatch and Nessie real?  \n* Why would a god care if humans loved him?  \n\nJust because I don't know the answer to these doesn't mean that I *have to* start believing in your god, right now, or else.", "gilded": 0, "created_utc": "1289482451", "subreddit": "atheism", "score": 15, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no damn tree fiddy. Now go away!", "gilded": 0, "created_utc": "1289497557", "subreddit": "AskReddit", "score": 18, "controversiality": 0}
{"body": "I'd end up giving it to that asshole dragon that always comes by, askin for tree fitty.", "gilded": 0, "created_utc": "1289497873", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I gave him tree fiddy last week when you was at work.", "gilded": 0, "created_utc": "1289498043", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "It was aliens and bigfoot trying to raise the devil so the illuminati can reanimate JFK so he can fly an Aurora jet to Loch Ness to rendezvous with Nessie and the Pleidians?\n\nSeriously, though, you raise excellent points.  Every single characteristic of the fall of the towers can be explained by physics.  The \"the towers fell at free fall speed\" claim has been demonstrated, repeatedly, to be false.  The towers took nearer 20 seconds to fall, not 9, and the cores were not instantly destroyed, but protruded tens of storeys above the collapsed floors when the towers fell.  This notion that the cores were blown out and the whole thing somehow vaporised on the way down is fucking laughable, and clearly constructed by someone who neglected to take physics at school.  But I'll be down-voted for saying this, too, and the world will keep on being just that bit more retarded than it has to be.", "gilded": 0, "created_utc": "1289516731", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "This reminds me of the guy in India who didn't have to eat and the Loch Ness monster. I can spell out this secret! It's called T-O-U-R-I-S-M.", "gilded": 0, "created_utc": "1289542860", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "\"Me and the little lady was out on this boat you see, all alone at night, when all of a sudden this huge creature, this giant crustacean from the paleolithic era, comes out of the water\"", "gilded": 0, "created_utc": "1289590964", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "**LEAST LIKELY**\r\n\r\nGhosts\r\n\r\nFairies\r\n\r\nBigfoot\r\n\r\nLoch Ness Monster\r\n\r\nGirlfriends excited about anal\r\n\r\nThe Christian god\r\n\r\nAny god\r\n\r\nLife after death\r\n\r\nMembers of Congress actually care about their constituents\r\n\r\nUFOs\r\n\r\n**MOST LIKELY**", "gilded": 0, "created_utc": "1289592363", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1289601771", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "tree fitty?!", "gilded": 0, "created_utc": "1289609511", "subreddit": "reddit.com", "score": 188, "controversiality": 0}
{"body": "I ain't giving you no tree fiddy you goddamn Loch Ness monster!", "gilded": 0, "created_utc": "1289610566", "subreddit": "reddit.com", "score": 91, "controversiality": 0}
{"body": "Eye witness accounts cannot be disputed?\n\nGuess that means Aliens have definitely abducted people, Loch ness monster definitely exists, as well as big foot and ghosts.", "gilded": 0, "created_utc": "1289611291", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Actually, there are some young earth creationists who claim that dinosaurs are in the bible.\n\nIn the bible, there are references to the behemoth (hippo), the leviathan (whale or large fish), and dragons (borrowed form other cultures).\n\nThis are often identify these as dinosaurs, to explain fossils.\n\nHowever, since they are mentioned in the bible, that must mean they still existed in those times, which of course there is no evidence for.  \n\nThat is was creationists often tout the Loch Ness monster on other legends that dinosaurs are still around. ", "gilded": 0, "created_utc": "1289612732", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt; Some folks get a little education and think they know it all. But you know as well as I it takes awhile [sic] for some of them to grow up.\n\nSome people never grow up, clearly. Dismissive, rude, holier-than-thou and closed minded, what a great example to make for taking the high ground. What does it say that those with higher education tend to abandon faith in their experience?\n\n&gt; I have friends who don't believe--I know that its [sic] their choices but it saddens me too.\n\nBelief is not a choice. I challenge you to make the choice to believe in The Loch Ness monster. Not so easy, is it? But you're just denying the evidence!\n\n&gt; How can someone not look around and KNOW that there is God?\n\nOh, look at the trees! Sorry, this is called the argument from personal incredulity, and it's a nonsense logical fallacy. You look at the world and see another bad argument, *Irreducible Complexity*, and decide it's too complicated to come about any way but the way you were indoctrinated in to believing. By the way, which god?\n\n&gt; I just think that some will never get the mental capacity to absorb what God is saying.\n\nThen shouldn't be phrase it in a way us humans can understand without thousands of denominations of churches with different viewpoints and hundreds of millions or billions of different understandings from the same source? Bad argument anyway. He's arguing that everyone *else* doesn't understand God the same way he does. That's called the *No True Scotsman* fallacy. In reality it's quite easy to 'absorb' what god is saying, and it's barbaric.\n\n&gt; Some people just don't get the total and complete importance of faith!\n\nName one other subject in which faith is an important factor. Religion is the only thing that supports intentional gullibility and forced acceptance of irrational drivel on its members while simultaneously opposing any evidence to the contrary. Faith is also used by every other major religion, and yet they would say the others are wrong to have faith. What makes this religion better?\n\n&gt; If you don't have faith you don't understand the bible. This sort of reasoning pisses me off.\n\nRightly so. You have to *want* to believe it's true in order to *see* that it's true. Or in other words, unless you're predisposed to blind faith in something because it makes you feel good, you won't understand it. If you're looking at it from an unbiased, critical perspective you won't *get it* because you didn't *want* it to be true. That speaks volumes on the truth of the subject. Humans don't have to want gravity to be true for it to be demonstrable, and here we are.\n\nMessaging your sisters to tell them how proud he is [they aren't like you] is an extremely low blow. What a pathetic man to do that to his son. Delete from facebook if at all possible.", "gilded": 0, "created_utc": "1289632216", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "In deep oceans, I want fuckin' krakens and loch ness monsters. On more shallow but still deep, I want sharks. On shallows I want just fish and dolphins, with option to ride dolphins.", "gilded": 0, "created_utc": "1289653467", "subreddit": "Minecraft", "score": 2, "controversiality": 0}
{"body": "I need about tree fiddy", "gilded": 0, "created_utc": "1289659493", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "I wish sometimes people would follow up by showing tha awesome blunt/joints as they are being smoked just too see that nessies inside getting ALL BURNT UP", "gilded": 0, "created_utc": "1289689320", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "&gt; One consequence of this theory [M theory] is that our universe is not the only one – untold numbers of cousin universes exist with different physical laws and properties.\n\nPlease read more carefully:\n\n* *M theory is not a theory*, it is a conjecture about a future theory that no one knows how to create. It has no structure or properties. Its only existence is as a name for a future theory.\n\n* Neither the non-theory \"M theory\" nor any current theory says that there are any number of universes, or even one more universe, they simply don't exclude the possibility. *There is no evidence whatsoever for multiple universes*.\n\n* \"Multiverse\" is not a scientific theory or hypothesis, it is speculation with no connection to either theory or evidence. It is not science, it is science fiction.\n\nWhen you hear someone say \"multiverse,\" no matter who they are, remember -- this idea has the same scientific standing as Bigfoot or the Loch Ness Monster.\n\n&gt; A little digging suggests the formula (a2 + b2 = c2, which describes the relationship between the three sides of a right triangle)\n\nPlease try to copy these things correctly  into your Web page: the equation is a^2 + b^2 = c^2 . Modern Web page editors have no problem rendering superscripts.\n", "gilded": 0, "created_utc": "1289692196", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Can I borrow tree fiddy ?", "gilded": 0, "created_utc": "1289693773", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "You're such a bitch.\r\n\r\nIm so fucking tired of these \"bel-air\" and \"tree fiddy\" posts.\r\n\r\n", "gilded": 0, "created_utc": "1289701144", "subreddit": "trees", "score": 6, "controversiality": 0}
{"body": "It's not like he was going to give it tree fiddy.  ", "gilded": 0, "created_utc": "1289709761", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "When I was 10, I really wanted to be a cryptozoologist and study the loch ness monster.\n\nNow I just want to invent something truly remarkable and live off the royalties, essentially having no job at all.", "gilded": 0, "created_utc": "1289728151", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "All he wants is tree fitty.", "gilded": 0, "created_utc": "1289757820", "subreddit": "pics", "score": 15, "controversiality": 0}
{"body": "I was raised in a non religious household.  My Dad is presumably an atheist or agnostic, my mother is Christian.  I think religion was never talked about at home as a compromise.  When I left home and went to university, I considered myself an agnostic.\n\nAround the time I was 31, I came upon an online quiz that tested the consistency of your belief system.  A question about the relative probability of existence of god and the loch ness monster tripped me up badly.  A month later I picked up a copy of The God Delusion, and Dawkins' chapter on agnosticism sealed the deal.  I've considered myself an atheist for 5 years now.", "gilded": 0, "created_utc": "1289759053", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Big Foot/Yeti/Loch Ness Monster. When I was younger I went through a phase where I wanted to be a cryptozoologist.", "gilded": 0, "created_utc": "1289763641", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Many things have been seen by people who then related their experiences to other people, bigfoot, UFOs and the Loch Ness monster to name only three. ", "gilded": 0, "created_utc": "1289767338", "subreddit": "Christianity", "score": 2, "controversiality": 0}
{"body": "*Made this account just to post this.\n\n**[November 12 1933 : First Loch Ness Photo Appears - MysteryHistory.TV Sea Monster Special](http://mysteryhistory.tv/2010/11/nov-12-1933-first-loch-ness-photo-appears-sea-monster-special/)**\n\n* High Resolution photo of the first Loch Color Monster, rarely seen by the public.\n\n* Similar Sea Monster including Leviathan, Gods Loch Ness Monster, Ogo Pogo, Van Lake Monster, Chinese &amp; Japanese Sea Monsters &amp; more.\n\nHope you enjoy it.", "gilded": 0, "created_utc": "1289781560", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Then he asked me for tree fiddy.", "gilded": 0, "created_utc": "1289793156", "subreddit": "pics", "score": 9, "controversiality": 0}
{"body": "I id reply in the other post.  :-P  I have no idea... I watched that part like 20 times just now.  Its like a loch ness monster of a bigfoot video.  Its just a glimpse, and after I ended up going, \"wait.. no... really?  Wait, lemme see that again...\"\r\nIt looks like a little tiny person.  Like a little gnome or a smurf or something.  :-P", "gilded": 0, "created_utc": "1289802105", "subreddit": "IAmA", "score": 10, "controversiality": 0}
{"body": "My bacon used to be crazy enough to believe it was Nessie but I had it cured.", "gilded": 0, "created_utc": "1289831021", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "It's not what I said and here is why you're an idiot.  Saying that the universe is so vast and complex and beyond our understanding is false.  We learn more and more about the universe every single day.  I can say I see no evidence of god because there is NO evidence of god.  None, zilch, zero.  Not one shred of evidence.\n\nSaying, I have no evidence to prove there isn't a god is ridiculous.  Let me ask you, do you believe in leprechauns, unicorns, the Loch Ness Monster and bigfoot?  No one has yet to prove their existence but do you consider them to be real for the same reason you believe in the possibility of a creator?\n\nSaying that there is a god is essentially saying that there is an invisible man with unlimited magic powers that sometimes grants wishes.  It's no different that believing in things like I mentioned above. There is plenty of evidence to show that there isn't a god and none that shows that there is.\n\nI do know a small fraction of how things work because scientists have bothered to find out.  It's why we have so much of what we have now.  Modern medicine...oh, and that computer that you're on now.  If man had simply decided to say, \"god did it\" and leave it at that we would still be hunter/gatherers and life would suck.\n\nMe personally, I find the universe far more amazing and complex without god than with god.", "gilded": 0, "created_utc": "1289833616", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "\"So there I am, cookin up my mornin breakfast, when suddenly a piece of bacon looks up and me and says...\n\n...Ima need about tree fitty.\"", "gilded": 0, "created_utc": "1289847063", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Would it be a herd?  Seeing as the Nessie is a sea creature, I would think it would be called a Pod.. or a School perhaps.", "gilded": 0, "created_utc": "1289847613", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "And here I was thinking you might need to put an extra hour of sleep between weekends and mondays, but lookey there, that most certainly is a herd of nessies", "gilded": 0, "created_utc": "1289857718", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I ain't giving you no treefiddy you goddam Loch Ness monster! Get your own goddam money!", "gilded": 0, "created_utc": "1289862106", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "I thought they were called a **\"Murder\"** of Nessies.", "gilded": 0, "created_utc": "1289866577", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "hm.\n\nwhat i meant, dear nessie, was that, lacking a jewish host, the church was a sufficiently inappropriate venue.\n\nthere was a reference to bonus points. i *will allow* the church to stand *in lieu* of jewface.", "gilded": 0, "created_utc": "1289887926", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Dammit monstah! Get off my lawn! I ain't givin' you no tree fiddy!", "gilded": 0, "created_utc": "1289893428", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "Tree fiddy? That's how I know it ain't no artist, it's that Goddamn Loch Ness Monster again!  We work for out damn money in this house you damn monster from the paleolithic era!  Now go away!", "gilded": 0, "created_utc": "1289935831", "subreddit": "AskReddit", "score": 18, "controversiality": 0}
{"body": "Demons exist dammit! Just like the Loch Ness Monster and God's Forgiveness!", "gilded": 0, "created_utc": "1289959292", "subreddit": "technology", "score": 2, "controversiality": 0}
{"body": "&gt;Well yeah, you can prove that, but existence is not equal to efficiency of prayer. I'm with you that the correlation is good enough to convince me at this point, but I can't ignore that it's not really deducible from that fact alone as it could just be a really ignorant god or a preoccupied one.\n\nPart of this lies on your definition of God.  If it is mandatory in your definition for God to have a response to prayer, then the God is disproven.\n\nIn the same way if my definition of 'The Loch Ness Monster' precludes that the animal be at least 12 feet long, and I prove that an animal that size couldn't have a breeding population in the Loch, then I have disproven the Loch Ness Monster.\n\nReworking your definition to '2 foot monster' can be done but its a little pointless.\n\n&gt;I do see your former point as well and, while I do agree with it, I can't help but feel that it's a little bit flawed when you consider youth indoctrination. Children aren't exactly equipped to make smart decisions without being properly educated. They aren't screwed up, but later on when they've invested so much of their life in a belief system they'll definitely then be screwed up enough not to be able to make smart or rational decisions without some form of belief that a deity is intervening with their rationalization process.\n\nWhile a certain degree of confidence in humanity is warranted, I think you'd find that people aren't as reasonable or knowledgeable as you might hope.\n\nAs far as knowledgeable, [this will make you sad](http://www.sciencedaily.com/releases/2009/03/090312115133.htm)\n\nAs far as reasonable, consider Y2K or the whole [end of the world in 2012](http://abcnews.go.com/International/story?id=5301284&amp;page=1) bit.", "gilded": 0, "created_utc": "1289995365", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt;I know perfectly well this proves nothing.\n\nSo you posted it...why?\n\nFor reference, the show \"[In Search Of...](http://en.wikipedia.org/wiki/In_Search_Of..._%28TV_series%29)\" was one of the most pseudo-scientific pieces of TV fluff to hit the airwaves in the last half-century.\n\nIn just *season one* it chased after\n\n* Plant telepathy\n* Allegations that the Egyptians built stuff in North America thousands years ago\n* The Bermuda Triangle\n* Bigfoot\n* Curses on Egyptian Mummies\n* Atlantis\n* Psychic Detectives\n* ESP\n* Dracula\n* Ghosts\n* Life after death\n* Loch Ness Monster\n* UFOs\n* Voodoo\n* \"Magic powers\" of Stonehenge\n\nIt was just one of the first \"[paranormal television](http://en.wikipedia.org/wiki/Paranormal_television)\" shows: Entertainment vaguely cloaked in pseudo-scientific verbiage.\n\nIt has as much relevance to science of *any* kind as [Lost](http://en.wikipedia.org/wiki/Lost_%28TV_series%29).", "gilded": 0, "created_utc": "1290005793", "subreddit": "climateskeptics", "score": 4, "controversiality": 0}
{"body": "I have one. It's pretty long so bear with me here.\n\nI was a junior in college at this point and had just moved into a shitty house in our college town with two of my friends. The house was just falling apart at every seam and I think you could physically see through the cracks in the wall to the outside. Anyway, one weekend shortly after we had moved in we planned to throw a big ol' housewarming party. We were all pretty big drinkers at this point in our lives, so we bought three kegs for our shitty little house.\n\nFast forward to the party. We have about 25 people crammed into our house with a full-size beer pong table in the middle and everyone milling about. It's at this point that my friend Steve calls me aside and whispers, \"dude, guess what I brought? ...Wild Turkey.\" At this point I've been hitting the kegs pretty hard and have played a few games of beer pong, so I was in no shape to be hitting the 100 proof Wild Turkey at this point. I said, \"fuck it\" and took a *huge* pull from the bottle -- probably gulped four times. Not pretty. The party continues as normal and I had consciousness for about the next hour until I vomited. I was so drunk I just vomited while standing up and looking at people in conversation. Glazed over eyes -- I'm sure it was hilariously gross for everyone else to see. This isn't even the worst part. I'm pretty sure I just laid down right next to the couch and passed out sleeping next to my own ralph. \n\nAnyway, cue 4:30 AM. I regain relative consciousness while standing as my pants are on my knees. I'm just pissing all over the couch. Steve is sleeping on the couch -- he's just covered in urine. I realize what I'm doing at this point and totally freak out. I fumble with my pants until they are up enough so I can run out the fucking door of my own house. As put my hand on the door knob, Steve wakes up and I'm just absolutely petrified at this point. He sits up on the couch and says in a stern voice, \"...I need about tree fiddy.\" It was at this point I realized Steve was a two-story tall crustacean for the Paleozoic Era and I then shat my pants.\n\nTL;DR: I shat my pants. ", "gilded": 0, "created_utc": "1290010449", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I have one. It's pretty long so bear with me here.\n\nI was a junior in college at this point and had just moved into a shitty house in our college town with two of my friends. The house was just falling apart at every seam and I think you could physically see through the cracks in the wall to the outside. Anyway, one weekend shortly after we had moved in we planned to throw a big ol' housewarming party. We were all pretty big drinkers at this point in our lives, so we bought three kegs for our shitty little house.\n\nFast forward to the party. We have about 25 people crammed into our house with a full-size beer pong table in the middle and everyone milling about. It's at this point that my friend Steve calls me aside and whispers, \"dude, guess what I brought? ...Wild Turkey.\" At this point I've been hitting the kegs pretty hard and have played a few games of beer pong, so I was in no shape to be hitting the 100 proof Wild Turkey at this point. I said, \"fuck it\" and took a huge pull from the bottle -- probably gulped four times. Not pretty. The party continues as normal and I had consciousness for about the next hour until I vomited. I was so drunk I just vomited while standing up and looking at people in conversation. Glazed over eyes -- I'm sure it was hilariously gross for everyone else to see. This isn't even the worst part. I'm pretty sure I just laid down right next to the couch and passed out sleeping next to my own ralph.\n\nAnyway, cue 4:30 AM. I regain relative consciousness while standing as my pants are on my knees. I'm just pissing all over the couch. Steve is sleeping on the couch -- he's just covered in urine. I realize what I'm doing at this point and totally freak out. I fumble with my pants until they are up enough so I can run out the fucking door of my own house. As put my hand on the door knob, Steve wakes up and I'm just absolutely petrified at this point. He sits up on the couch and says in a stern voice, \"...I need about tree fiddy.\" It was at this point I realized Steve was a two-story tall crustacean for the Paleozoic Era and I then shat my pants.\n\n`TL;DR: I shat my pants.`", "gilded": 0, "created_utc": "1290015256", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "So Nessie, Bigfoot, sea monsters, the abomable snowman, those all have a *modicum of thruthfulness*, no? Since they're documented, right?\r\n\r\nNo. I would not say that. That is highly illogical.", "gilded": 0, "created_utc": "1290017118", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I TOLD YOU LOCH NESS MONSTER I AINT GIVEN YOU THREE FIDDY", "gilded": 0, "created_utc": "1290031570", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Guess what? There aren't many for Jesus either. In fact, only the Bible. One could say the accounts of Nessie are numerous and historical. ", "gilded": 0, "created_utc": "1290033154", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt;(and most people) disbelieved the Richard Gere (I had to google it since you wouldn't tell me) story from the get go.\n\nI never saw a poll indicating that. I think that, as with the gospel story, the fact that the gerbil story spread and we know about it, indicates that many people were and are happy to entertain the possibility that the gerbil event really happened. \n\n&gt;I'm saying people in 60 CE would have been similarly skeptical unless they could actually talk to credible people who had been there,\n\nLike the friend of a friend who worked in the ER.\n\n&gt;unless they could actually talk to credible people who had been there,\n\nWhich we cannot do. And even if we could, so what? There are many people who will swear up and down they have seen ghosts, UFOs, bigfoots. chupacabras, Loch Ness monsters, etc. etc. etc.\n\n", "gilded": 0, "created_utc": "1290050450", "subreddit": "DebateAChristian", "score": 1, "controversiality": 0}
{"body": "What's a tree fiddy?", "gilded": 0, "created_utc": "1290065119", "subreddit": "comics", "score": 2, "controversiality": 0}
{"body": "Clearly the culprit is Nessie.", "gilded": 0, "created_utc": "1290069172", "subreddit": "science", "score": 3, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy. ", "gilded": 0, "created_utc": "1290119827", "subreddit": "blog", "score": 3, "controversiality": 0}
{"body": "I was looking for the stories about the supernatural, not the supernatural itself.  \r\n\r\nI was not setting out to capture Dracula on film giving a high-five to sasquatch while riding on the back of the Loch Ness monster.  Some people do that, but that wasn't what I was going for.  If \"ghosts\" exist I don't think they could be filmed anyway.\r\n\r\nI wanted to preserve beliefs that are dying out and to record interesting stories.  \r\n\r\nWhy would someone who is probably not a Christian make the documentary \"Jesus Camp\"?  Because people's beliefs are often strange, illogical yet entertaining.", "gilded": 0, "created_utc": "1290124289", "subreddit": "IAmA", "score": 10, "controversiality": 0}
{"body": "I'm right with you there. It was watching shows about nessie and sea monsters and stuff like that as a kid that left me scarred. The one PC game that genuinely terrified me was 'Shark! Hunting the Great White', ugh, swimming around in the murky water, dart gun in hand, and the final level was a Megalodon!", "gilded": 0, "created_utc": "1290133755", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I pay tree fitty in a college town outside of St. Louis. I live by myself and have a cat. ", "gilded": 0, "created_utc": "1290151920", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Thanks Nessie.  I can always count on good tips from Hokkaido. ;)", "gilded": 0, "created_utc": "1290151965", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "I've never gotten the \"Well God believes in you!\" (or the tongue-in-cheek variation, \"Well then God doesn't believe in your either!\") I don't need evidence that I exist (by mere virtue of contemplating the issue, I prove my existence to myself) and I accept that other people who I can perceive with some sense also exist. God is worse at demonstrating his existence than Nessie, Bigfoot, and the Grays.", "gilded": 0, "created_utc": "1290203926", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Digital storage is comprised of bits--ones and zeroes. Now, if you know the first thing about the supernatural, it's that they HATE math. Have you ever seen a ghost do trig? The Loch Ness monster do long division. NO. YOU HAVEN'T.\n\nBecause of this, digital media simply can't capture the supernatural. The ones and zeroes get disfibrogastulated to the point where even trichoflam corrections can't even recover the quidostulates necessary for the image.\n\nIt's pretty simple, really.", "gilded": 0, "created_utc": "1290204662", "subreddit": "self", "score": 106, "controversiality": 0}
{"body": "I'll give you tree fitty.", "gilded": 0, "created_utc": "1290206929", "subreddit": "codbo", "score": 1, "controversiality": 0}
{"body": "Don't give em that tree fitty!\n", "gilded": 0, "created_utc": "1290208794", "subreddit": "codbo", "score": 2, "controversiality": 0}
{"body": "Amen to that.  Remember how fun it was to believe in something called THE LOCH NESS MONSTER? ", "gilded": 0, "created_utc": "1290210156", "subreddit": "self", "score": 2, "controversiality": 0}
{"body": "The Loch Ness monster can't even count past about three fitty.", "gilded": 0, "created_utc": "1290234327", "subreddit": "self", "score": 15, "controversiality": 0}
{"body": "Tree fiddy?", "gilded": 0, "created_utc": "1290242894", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Sooo... some guy I've never met... writes some words in a blog... That are otherwise unsubstantiated...\n\nI BELIEVE IT ALL!\n\nSorry. I'm being sarcastic in tone but this is a perfectly reasonable response to someone making a supernatural claim with no other evidence besides 'Trust me!' Otherwise, if a personal claims were all it took I would also believe in UFOS, Men In Black, the Loch Ness Monster, and every single revalatory religion from Mormonism to Islam.\n\nPersonal claims without back-up do not constitute evidence. Full stop.", "gilded": 0, "created_utc": "1290246997", "subreddit": "self", "score": 8, "controversiality": 0}
{"body": "\"YOU GODDAM LOCH NESS MONSTER I AIN'T GIVING YOU NO TREE FITTY!\"", "gilded": 0, "created_utc": "1290253477", "subreddit": "self", "score": 9, "controversiality": 0}
{"body": "Did you even read what I said? \n\nDozens of witnesses don't make evidence, either. Thousands of people report to see UFOs, bigfoot, loch ness monster, chupacabra, yowies, yetis, bunyips etc. Does that mean each and every one of them is real? Millions of people believe in dozens of contradictory religions, etc. \n\nI'm not debating what you claim, because I didn't read it (and I admitted it in my post), because I am about to go to bed. \n\nI'm not saying your claim is wrong or anything, because I haven't read it. That webpage could just say on it \"The sky is blue. I know because I lived under the sky for a year and so did the king of England\". \n\nMy objection was to you saying \"you should take me seriously because I'm a good person\", not what your argument was. If your webpage has information on it that constitutes proof, that information will stand up on its own. It won't need your status to defend it.\n\nIt goes both ways. You can be a bad person and still be right. By all apocryphal accounts, Isaac Newton was a real dickhead who nobody wanted to be friends with. He was still right about gravity, though.\n\nI will reiterate: I haven't read your webpage, and don't intend to (mostly because it's pissing you off, and I love to piss people off because I'm a bad person). I'm not saying it's wrong or that you're a liar. All I'm saying is, it doesn't affect the quality of your argument if you're the greatest human being to ever live or the most scummy.\n\n\ntl;dr The quality of your evidence is what people SHOULD look at, not the quality of your character.\n\nEDIT: Also, azav, just so you know - I haven't been downvoting you. You're adding to the discussion, so I've just gone and given you a few upvotes - people, remember your reddiquette! ", "gilded": 0, "created_utc": "1290259919", "subreddit": "self", "score": 10, "controversiality": 0}
{"body": "He's like that god-damned Loch Ness monster!  I just gave him three fitty! I go to the Wikipedia and there he is again!  Staring at me with them beady little eyes.  And I say to him, Jimmy Wales, what do you want there on my Wikipedia???  Guess what he says.  Guess. What. He. Says.  He says, \"about three fitty.\"  Three fitty!!!   And I say, \"Dammit Jimmy Wales, I already gave you three fitty, now get off my Wikipedia!!!\"", "gilded": 0, "created_utc": "1290268436", "subreddit": "funny", "score": 14, "controversiality": 0}
{"body": "It's pterodactyls, and it's on the list of fabled creatures still being reported in remote corners of the earth. As are plesiosaurs aka. [Loch Ness monster.](http://www.reddit.com/r/atheism/comments/e8z3c/creationism_seemed_fishy_even_when_i_was_a_kid_my/c16abw0)\n\nThe field of Cryptozoology is much critiqued, but not without merit. On the list of animals that were once myths were mountain gorillas, giant pandas, and giant squids. It's human nature to deride things that aren't immediately tangible, or are fearsome or strange. Also, it doesn't help that most scientists would be quite upset to learn that some dinosaurs are still alive since it would upset their current explanation of the earth's history and beginnings.\n\nPeople research these things, but don't have conclusive evidence.\nhttp://www.livepterosaur.com/modern-pterodactyl-sightings/\nhttp://www.ropens.com/\n\nSightings are worldwide, including in the US. They also go by the name ropen.\n\nHere's another vid of the loch ness monster. Interestingly, copies of it used to be crystal clear but they get grainier with time...\nhttp://www.youtube.com/watch?v=j48Mvw8V0qc\n\nAnyhow, there are reasons why these stories keep propagating and it's not just those looking for attention.", "gilded": 0, "created_utc": "1290279029", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "if she was any good at being a creationist babbler she would have suggested that plesiouwhatevers are nessie. it would have been bullshit, but I thought of it right away, and I agree with you.", "gilded": 0, "created_utc": "1290299251", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Well, I'm glad some more knowledgeable redditors helped you out.\n\nI hope I didn't come across as a dick.  I've just gotten to the point that my not believing in god is the same as not believing in Santa or the Easter Bunny or the Loch Ness Monster or whatever, in that, it doesn't define me.  I've been a lot happier since I reached that point.", "gilded": 0, "created_utc": "1290315880", "subreddit": "atheism", "score": -1, "controversiality": 0}
{"body": "Doctor Who has never been big on continuity.  I mean, I think they've given 2 different reasons for the Loch Ness Monster.  They've screwed up the entire history of human beings in space multiple times and there are 2 different reasons for why Atlantis sank.  \n\nI love both the old and the new series, but if you go looking for continuity (other than the charm of the occasional old school reference) you'll shoot yourself in the face.\n\nHell, even the Daleks originally couldn't move if they didn't have these electromagnetic walkways beneath them.  And in one serial Terry Nation flat out forgot that they had organic creatures inside them and referred to them as completely robotic.\n\n", "gilded": 0, "created_utc": "1290337784", "subreddit": "doctorwho", "score": 2, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1290362874", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "Got-damn, woman!  Don't be goin round tellin everbody you're sellin your coochie for tree-fiddy.  Next thing ya know, the got-damned Loch Ness Monster gwon be knockin on your door.\n\n", "gilded": 0, "created_utc": "1290364087", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Tree Fiddy.", "gilded": 0, "created_utc": "1290431967", "subreddit": "xbox360", "score": 1, "controversiality": 0}
{"body": "She said \"I'm gonna need about tree fiddy\"", "gilded": 0, "created_utc": "1290441559", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "I came here to make a joke about the loch ness monster.\r\n\r\nThen I saw a pretty picture and forgot all about it.\r\n\r\nThen I remembered what I came here to do.\r\n\r\nThen I wrote a comment about my story.", "gilded": 0, "created_utc": "1290462029", "subreddit": "itookapicture", "score": 2, "controversiality": 0}
{"body": "You just described my experience.  I used to believe conspiracy theories, then one day I was reading something about rational thought, and realised I'd been fooling myself for years.  In a heart-beat I gave up *believing* in UFOs, Bigfoot, Nessie, et al., and it was a very difficult thing to come to terms with - I'd been wrong, my world-view was wrong, my methodology was wrong, and I realised as long as I neglected critical thinking, I'd never **know** anything, ever.\n\nAnd I admit, I was caught up in the 9/11 conspiracy thinking, too.  Due to laziness and a desire for a fantastically interesting story, I was believing things I read without studying.  Again, when I realised, my world0-view collapsed.  I've learned the literal error of my ways, and I'm resolved to never engage in such a superficial attempt to understand.\n\nOn another note:  I was on the second flight back into US airspace on 9/14, an American Airlines flight, and I sat in the cabin as the staff observed a 2-minute silence for all their colleagues, their passengers, and the rest of the ~3,000 people who lost their lives that day.  It was profoundly touching, and I then proceeded to spit in the face of their collective memories by half-heartedly looking for *what I wanted to find* in their demise.  How utterly, disgustingly selfish is that?", "gilded": 0, "created_utc": "1290466379", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "&gt; Although I acknowledge that I am not an expert in the field, I don't acknowledge that you are, quite frankly.\n\nIf you were a scientist, you would know better than to take this turn. There are no experts in science, there is only evidence. And there is no evidence that Asperger's is anything but someone's hypothesis, and the hypothesis has failed.\n\nDon't take my word for it  -- read the literature on this topic and find out for yourself. [Start here.](http://www.nytimes.com/2009/11/03/health/03asperger.html?_r=1)\n\nPsychologists don't throw perfectly good diagnoses out in the street, because diagnostic categories are a psychologist's bread and butter. The only reason the profession is throwing Asperger's out is because it is a liability, just like Recovered Memory Therapy, Facilitated Communication, Prefrontal Lobotomy and a dozen other practices that have backfired over the years, and each of which the field of psychology has reluctantly abandoned after trying to justify its continuation.\n\nI emphasize that none of what I have presented is in any way my idea, it is all from the current literature. All I am doing is presenting information to people who famously refuse to read and comprehend the current state of the field for themselves.\n\nYou only think you are debating with an individual. In fact, you are debating with the present state of psychology and its choices.\n\n&gt; I read all the articles you linked to and none of them deny the existence of \"the-condition-formerly-known-as-Aspergers\"\n\n\\* *sigh* \\* [Read this](http://www.nytimes.com/2009/11/03/health/03asperger.html?_r=1) : \"'Asperger’s means a lot of different things to different people,' Dr. Lord said. 'It’s confusing and not terribly useful' ... '*It’s not an evidence-based term*.'\"\n\nDo you understand what \"it's not an evidence-based term\" means for a field that is desperately struggling to adopt modern standards, to become scientific? Here are some more terms that are not evidence-based:\n\n* Bigfoot\n\n* The Loch Ness Monster\n\n* The myth that the mentally ill are possessed by demons\n\n* Witchcraft\n\n* UFO abductions\n\nDo you think my last example goes too far, that my associating psychology with UFO abductions is over the top? Are you aware that a psychology professor at the Harvard Medical school [conducted a multi-year study that accepted UFO abduction reports at face value](http://en.wikipedia.org/wiki/John_E._Mack)?\n\nLater, the study was abandoned -- it was manifestly not \"evidence-based\" -- but only because the professor passed on.\n\nOne more example -- there is [an ongoing study](http://www.healthsystem.virginia.edu/internet/personalitystudies/) an the University of Virginia Psychology Department that offers therapy so people can get over the conflicts from their *past lives*. They haven't quite accepted that this is also not \"evidence-based.\"\n\n&gt; I can't help but think that there is an agenda here which I do not subscribe to ...\n\nYes there certainly is an agenda ---- but it is not my agenda, it is the agenda of psychology to be recognized as a science *by scientists*, and scientists are a tough audience.\n\nHere is the challenge that psychology faces right now. In the April 2010 Scientific American, Thomas Insel, director of the National Institutes of Mental health, [describes the first steps toward forcing scientific standards on reluctant psychiatrists and psychologists](http://www.scientificamerican.com/article.cfm?id=faulty-circuits). Insel ends his article by saying, \"From the scientific standpoint, it is difficult to find a precedent in medicine for what is beginning to happen in psychiatry. The intellectual basis of this field is shifting from one discipline, based on subjective 'mental' phenomena, to another, neuroscience. Indeed, today’s developing science-based understanding of mental illness very likely will revolutionize prevention and treatment and bring real and lasting relief to millions of people worldwide.\"\n\nIn case you missed the point, NIMH director Insel is saying that psychiatry and psychology will *either adopt scientific standards or be abandoned*. This is why psychology is cleaning house -- it has no choice. This is why Asperger's is being recognized as ... \"not an evidence-based term.\"\n\n", "gilded": 0, "created_utc": "1290496833", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "My parents almost never dragged me to church. Luckily they seem apathetic about it, probably from a youth of being dragged by their parents. Throughout most of my young life I didn't really care, but accepted it as true. It was just one of those things that was \"real\", but you'd never actually see it, like most mythical beasts. The weird thing, in my mind, is that I was one of those kids that liked the idea of those creatures, and thought people who claimed they didn't exist were silly, since they had no proof. I never asserted the existence of a higher power, though, just things like Bigfoot or The Loch Ness Monster.\n\nOnce I got to High School a friend dragged me to some religious club thing with the promise of free pizza. They told a story about how someone was miraculously cured or some crap. Even though I had never questioned religion, I knew that miracles were hokum. They insisted the doctors had \"given up\", so on and so forth, she had no hope, etc. That forced a series of events that led me to question religion and become an atheist. \n\nThe scary part is, my mother has hinted in the past that my father is also an atheist, or at least has a strong dislike of church. This is odd primarily because I never knew this about him previously, and generally strive to be as unlike my father as possible. He's not the brightest star in the galaxy, either.\n\n**TL;DR:** I had a lot of room as a child to make decisions for myself, and eventually questioned religion, though later than I'd like.", "gilded": 0, "created_utc": "1290512584", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "He said, \"I need about [tree fiddy](http://www.urbandictionary.com/define.php?term=tree%20fiddy).\"", "gilded": 0, "created_utc": "1290538675", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1290567534", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "&gt; but at it's core atheism is a belief that there is no God\n\nRookie mistake. Theism is the belief in a god while Atheism is the non-belief in a god. Atheists don't make a claim of their own but simply respond to the specific claim that Theists make. \n\nIs your disbelief in the god Zeus unverifiable or is it just the default position you take before you are presented with valid evidence? What about UFO abductees? Or Big Foot? The Loch Ness monster?\n\n&gt; I was raised Catholic and would like to believe that there is a purpose, if not a God\n\nI know you're not trying to start a debate but please be aware that what you \"would like to believe\" does not always correspond with reality. Don't be afraid to face the real world, you might find that you like it. ", "gilded": 0, "created_utc": "1290567960", "subreddit": "atheism", "score": 13, "controversiality": 0}
{"body": "I dare you to proof to me that Nessie lives.", "gilded": 0, "created_utc": "1290603618", "subreddit": "DMA", "score": 4, "controversiality": 0}
{"body": "Chuck Klosterman:\n\n7. Defying all expectation, a group of Scottish marine biologists capture a live Loch Ness Monster. In an almost unbelievable coincidence, a bear hunter in the Pacific Northwest shoots a Sasquatch in the thigh, thereby allowing zoologists to take the furry monster into captivity. These events happen on the same afternoon. That evening, the president announces he may have thyroid cancer and will undergo a biopsy later that week.\n\nYou are the front page editor of The New York Times: What do you play as the biggest story?", "gilded": 0, "created_utc": "1290607258", "subreddit": "DMA", "score": 2, "controversiality": 0}
{"body": "I guess the Loch Ness monster. It is the biggest, so it needs al the room it can get.", "gilded": 0, "created_utc": "1290611465", "subreddit": "DMA", "score": 1, "controversiality": 0}
{"body": "aww man I was expecting some images of bigfoot or the loch ness monster", "gilded": 0, "created_utc": "1290632427", "subreddit": "offbeat", "score": 3, "controversiality": 0}
{"body": "But *anyone* could've edited that in! Possibly Nessie itself!", "gilded": 0, "created_utc": "1290802215", "subreddit": "DMA", "score": 2, "controversiality": 0}
{"body": "Yeah, to be clear you should have posted correctly rather than trying to ride Nessie's comment to the top.", "gilded": 0, "created_utc": "1290877994", "subreddit": "IAmA", "score": 5, "controversiality": 0}
{"body": "It is not childish to note the similarities between mythological tales.  I bet if I made a similar comparison between Zeus, Xenu, Ra and the Loch Ness Monster, you probably wouldn't take offense would you?", "gilded": 0, "created_utc": "1290977469", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1290981891", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "Nessie!", "gilded": 0, "created_utc": "1290989029", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "That'll be about a Tree Fitty.", "gilded": 0, "created_utc": "1290998929", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Got-damned Loch Ness Monsta!  I ain't gonna give you no tree fitty!", "gilded": 0, "created_utc": "1291014156", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "did she ask for tree fitty?", "gilded": 0, "created_utc": "1291047140", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I'll charge you tree fiddy for a portrait of my genitals in a windswept and interesting position", "gilded": 0, "created_utc": "1291055558", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "My thoughts are these. First of all, what you are illustrating here is the [\"no true scotsman\" fallacy](http://www.logicalfallacies.info/presumption/no-true-scotsman/). Person B is constantly changing the thing he is trying to prove. Second, even if this wasn't a fallacy, person B cannot assert his position because offers no evidence to support it. And finally, a 2-foot Loch Ness monster isn't much of a \"monster\" now, is it? ", "gilded": 0, "created_utc": "1291081962", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I'm not sure that it's the no true scotsman so much as a form of [moving the goal post](http://en.wikipedia.org/wiki/Moving_the_goalposts)\n\n&gt;Second, even if this wasn't a fallacy, person B cannot assert his position because offers no evidence to support it.\n\nYes and no.  Like with Gods, there are three basic positions.\n\n1) I believe the lochness monster exists\n\n2) I believe that the lochness monster does not exist\n\n3) I believe neither propisition that the lochness monster does or does not exist.\n\n#3 is the only one not making a claim to knowledge and thereby not holding the burden of evidence.\n\n&gt;And finally, a 2-foot Loch Ness monster isn't much of a \"monster\" now, is it?\n\nPerhaps the strongest point of the parallel.  'God' and 'monster' are words which have barely if any real meaning.  God can be loki or the entirety of existence (pantheism).  A monster can be a dragon or the cookie monster.  That's part of what makes it so easy to switch the definitions.", "gilded": 0, "created_utc": "1291085111", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "If you're going to prove a negative, I'd like to see it, because that would be groundbreaking. The Loch Ness monster is probably an exception, though, since the whole of its existence is just a single, searchable lake.", "gilded": 0, "created_utc": "1291088116", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "The difference is, it is possible, in principle, to disprove the existence of the Loch Ness monster.  It is a falsifiable theory.\n\nIf you were to ask a believer what proof would they need to change their mind, most would admit if you drained the loch and there was no beastie, they would have to accept it.  \n\nAnd the few that remained unconvinced would have to invoke the super natural, conspiracy theories, or other unfalsifiable propositions.  At that point, the Loch Ness monster is on the same level as god...cannot be disproven by design.", "gilded": 0, "created_utc": "1291091667", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "tree fiddy would suffice.", "gilded": 0, "created_utc": "1291113831", "subreddit": "fffffffuuuuuuuuuuuu", "score": 3, "controversiality": 0}
{"body": "[Tree Fiddy?](http://www.youtube.com/watch?v=B4C96ZTJIhU)", "gilded": 0, "created_utc": "1291133602", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "I dreamed I was at a camp and it was during swim time, but in a weird indoor pool. There were seals in there that weren't friendly, in fact you could call them evil mutant seals. They had long necks and heads like Nessie. I thought I could stop them from biting and attacking everyone if I could cover their heads, the only thing I could think of to cover them with was a box of tissues. Then I woke up.", "gilded": 0, "created_utc": "1291138510", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "well it sounds like you're a problem solver in life - i mean you did TRY to stop the Biting Nessies", "gilded": 0, "created_utc": "1291140425", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
