{"body": "My debunking of the Loch Ness Monster:\n\n\nSeriously, could there really be a bunch of sea monster like creatures living there without anyone ever catching a sick one or seeing a dead body or even bones? Please!\n\n\nMission accomplished.", "gilded": 0, "created_utc": "1235944356", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "I'd like to see a ghost just because I think the world would be a cooler place if ghosts really did exist. Ditto UFOs, bigfoot, the Loch Ness monster, fairies, angels, demons and God.\n\nOf course the world is actually void of all these things, it would just be a more interesting place with them.", "gilded": 0, "created_utc": "1236207526", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "They have the order of explanation backwards; over-anxious people are somewhat more likely to become atheists.\n\nBut it's irrelevant.  Conducting or even referencing studies like this is beyond idiotic.  \n\nYou would have to be an absolute moron to look at the question \"Is there a God?\" and think that, to answer it, you'd better conduct psychological studies to look at differences between believers and non-believers; these are entirely irrelevant.  And though few would admit it openly, the people referencing these studies (possibly even some of those conducting them) are using them in just this way, as if the results - whatever they might be - could possibly have some bearing on an ontological question.  Moronic.\n\nNext MythBusters:  Does the Loch Ness Monster exist?  Instead of looking in the lake, we'll show you the results of some psychological tests done on believers and unbelievers, finally solving the mystery!\n\n", "gilded": 0, "created_utc": "1236270678", "subreddit": "religion", "score": -1, "controversiality": 0}
{"body": "you wouldn't happen to be a giant crustacean from the Paleolithic era?", "gilded": 0, "created_utc": "1236813967", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "Your judgment is biased towards non-existence of things. It would be better to take the stance of being agnostic in principle, while acknowledging that the chance that all of this kind of stuff is true is nihil. But one of these days, Nessie just might show up and then you'll be glad to have kept an open mind. There's always a Platypus that could show up, just when you think you have that classification nailed.", "gilded": 0, "created_utc": "1236863628", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "&gt; congregating\n\nThat word was carefully chosen.  :)\n\nI read your entire rebuttal out of respect for the time you took to write it.  I take you at your word, though I think that many would find your eloquent, reasoned, and well thought out argument somewhat ironic considering that you're trying to convince them of an absence of belief.\n\nMany people believe in chupacabras.  I'm not one of them.  I don't believe in chupacabras.  But when I say \"I don't believe in chupacabras\" I'm kind of playing the believers' game.  So if I go one better and say I have an absence of belief in chupacabras and bigfoots and Loch Ness monsters, I separate myself completely from the insufferably superstitious herd.\n\nI have a buddy of mine who makes the same claims about religion.  Rather than simply declaring he does not believe in God, he argues that next step of separation: the denial of religion to the point that, since there's *nothing*, there's nothing not to believe in.\n\nSeems a bit convoluted but I can understand it somewhat.", "gilded": 0, "created_utc": "1236927901", "subreddit": "Freethought", "score": 1, "controversiality": 0}
{"body": "Let's see, a year is about 365.25 days.\n\nHumans and creatures from the age of dinosaurs on earth at the same time? Probably so. There is Nessie, who is likely a plesiosaur, and Mokele Mbembe of the Congo who is some sort of sauropod. Both alive today.\n\nAbout 3/4 of the earth's surface is covered in water, almost all salt water, which can be converted to fresh water with nuclear desalination plants and drive back the deserts of the earth, except that people are paranoid about nuclear.", "gilded": 0, "created_utc": "1236977769", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Sorry, \"TREE FIDDY\".", "gilded": 0, "created_utc": "1237148561", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "that's the Loch Ness Monster. \nthe joke's from an old South Park episode\nhttp://www.southparkstudios.com/episodes/103561/", "gilded": 0, "created_utc": "1237159519", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I've always had an obsession with the Loch Ness Monster.", "gilded": 0, "created_utc": "1237257930", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "You're on the right track, but don't look at islands for dinosaurs, look at anti-islands: large, deep lakes.  Let's review the evidence:\n\n* Nessie, the Loch Ness monster\n* New Brunswick Lake Utopia monster\n* Manipogo of Lake Manitoba, Canada\n* Lake Erie monster\n* Flathead Lake Monster, Montana\n* Nahuelito, Patagonian Lake Monster\n* Champ, the Lake Champlain Monster\n* Sweden's Lake Storsjön Monster\n* Ogopogo of Lake Okanagan, Canada\n\nThey can't *all* be fake.  Clearly, humans and dinosaurs not only once coexisted - they still do.\n", "gilded": 0, "created_utc": "1237435971", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "i have never seen a nessie in the zoo.", "gilded": 0, "created_utc": "1237586107", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Cheetah's are called nessies?", "gilded": 0, "created_utc": "1237586672", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "You know what I don't believe in? The Easter Bunny, Yetis, Jackalopes, The City Of Atlantis, The Loch Ness Monster, The Tooth Fairy, Ghosts, Unicorns, Mermaids, Goloms, Elves, Mutant Super Powers, Flying Saucers, Big Foot, Santa, The Boogie Man, The Sand Man, The Man In The Moon and The Men In Black. But you know what, my lack of belief in these things I think are ridiculous also means that this passage of writing you're reading right now is the longest passage I've ever written featuring any of these things. \n\nWhy do Atheists spend SO much time talking and writing about a thing they believe to be an absurdity? If they believe religion is as absurd as a man walking down the street with a \"magic\" rock that wards off bears, why don't they spend as much time writing about such things also?\n\nedited: the spelling mistakes that are more important than what I had to say.", "gilded": 0, "created_utc": "1238509871", "subreddit": "atheism", "score": 3, "controversiality": 0}
