{"body": "People arguing that the emails aren't a fraud (or even an embarrassment) should perform the following logical experiment in their heads.\n\nAssume the emails weren't about global warming.. but about the existence of the Loch Ness monster. Forget the models themselves, and consider only the email correspondence and code comments.\n\nWho is willing to suggest they'd respond the same way?\n\n", "gilded": 0, "created_utc": "1259632130", "subreddit": "science", "score": -3, "controversiality": 0}
{"body": "Obvious you wouldn't respond the same way, because using computer models to predict the Loch Ness monster *makes no sense whatsoever*, much like your analogy there.", "gilded": 0, "created_utc": "1259632407", "subreddit": "science", "score": 4, "controversiality": 0}
{"body": "finding and preserving the loch ness monster.", "gilded": 0, "created_utc": "1259708634", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "There's also no evidence supporting the *non-existence* of fairies, leprechauns, goblins, Nessie, or gold standard.\r\n\r\nYes, you'd be agnostic. Congratulations we've confirmed that you don't know. \"Am I agnostic? I don't know!\"\r\n\r\nI have no problem stating that gods are just fictional characters in a poorly formulated narrative conceived entirely by *simple human brains*. They exist in the same sense as do Romeo and Juliet, Homer Simpson, or Albert Einstein.\r\n\r\nYour drift stinks. You should really focus on what you **are**.", "gilded": 0, "created_utc": "1259783326", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "Nope. \n\nSee also: witches, magic, sleep paralysis, culture-specific monsters of all kinds (nessie, bigfoot) etc. People are pretty damn unreliable, especially when it comes to thing that they *really* want to be true. ", "gilded": 0, "created_utc": "1259839524", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Please cite a survey that states that 3,000,000 people have seen a Witch Same with magic. Sleep paralysis? What? Bigfoot and Nessie are unarguable because all testimonies are seen from one person. The problem with UFO's is that there are MASS SIGHTINGS. Simply throwing it aside and saying that people didn't think they saw what they saw is stupid, there is a phenomena occurring, and you're doing a great disservice to humanity by ignoring it.\n\nNow, would you like me to link you to about a dozen mass sightings of UFOs? How about 1,300 pilot testimonials, which are backed up by ground witnesses, other planes, and radar?", "gilded": 0, "created_utc": "1259840927", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Spend about xmas-tree fiddy.", "gilded": 0, "created_utc": "1259861246", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I'm in the works of drawing a Nessie tattoo.", "gilded": 0, "created_utc": "1259863822", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "That would be the Loch Ness Monster, you'll have to hold out until it is approved in newest edition of Unicode.", "gilded": 0, "created_utc": "1259873350", "subreddit": "pics", "score": 20, "controversiality": 0}
{"body": "[Damn Loch Ness Monster you da flakiest mythological beast.](http://imgur.com/7bbaO.jpg)", "gilded": 0, "created_utc": "1259912206", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Settle!  Go for it and get it over with.  It sucks to be made fun of because you can't say how a chick reacts as you sex up.  You've waited 19 years, time to jump in the creampie.  \n\nDon't wait out, that's the myth of the chick flick.  It's a geek myth like the Sasquatch and loch ness monster.", "gilded": 0, "created_utc": "1260157385", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "Dammit you're just trying to get my tree fitty.", "gilded": 0, "created_utc": "1260243106", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "yo picture so blurry, i've seen better images of the loch ness monster!", "gilded": 0, "created_utc": "1260253109", "subreddit": "conspiracy", "score": 1, "controversiality": 0}
{"body": "Just like my college biology teacher wasn't fired for being religious and refusing to teach about evolution.  He was fired for telling us that he was willfully violating the lesson plan he was contracted to teach us and instead teaching us about the Loch Ness Monster, which he did believe in.  But he was wasn't really fired...cause it's Oklahoma.  \n\nAlso,  my health care co-workers told me it was illegal to force employees to get flu shots.  Is that a lie or Oklahoma specific?", "gilded": 0, "created_utc": "1260331139", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "It was at this moment that I realized that this particular girl scout was a 6 story tall creature from the Paleolithic era. ", "gilded": 0, "created_utc": "1260373314", "subreddit": "Marijuana", "score": 2, "controversiality": 0}
{"body": "I knit my SS an octopus http://redditgifts.com/gallery/gift/octopus/ I've always wanted to try knitting a toy of some sort, so I used this as an opportunity. I got the book of patterns right around the 1st, so it worked perfectly. I had a hard time deciding between the octopus and the loch ness monster, but I decided on the octopus because it would be fun to play with the tentacles. It was a serious pain in the butt knitting all eight together in the round, but the finished project was totally worth it.", "gilded": 0, "created_utc": "1260409718", "subreddit": "secretsanta", "score": 1, "controversiality": 0}
{"body": "I believed it even when I was really sad that it was true.  I realize this is a silly thing to be concerned about, but when I was 12 I was obsessed with Atlantis.  I did a little term paper on it and gave a speech about it and everything.  When I asked him about it he totally laughed me out of court, especially when I suggested that maybe it had been a part of Pangea.  The funny thing is that he also absolutely INSISTED that there was a dinosaur living in Lake Champlain.  Atlantis=hooey, but \"Champ\"=Gods truth.  I went home that day totally disappointed, taking him at his word that Atlantis was bunk, and sort of nonplussed about the whole Champ thing since to me it sounded really stupid, like America trying to piggyback on the Loch Ness Monster.\n\nI attended because my parents LOVED Mr. Hovind.  They had his lectures on tape and they were part of the homeschool group that got together to fund the classes.  Also, as a kid, anything that got me out of a regular school day was a plus!", "gilded": 0, "created_utc": "1260411775", "subreddit": "IAmA", "score": 28, "controversiality": 0}
{"body": "&gt;Also that there is a monster in Lake Champlain.\n\nThis is awesome. Whenever I run into someone crazy, whether it's creationism, \"climate-gate,\" or what have you, I make it a point to quickly change the subject to ask them what they think about UFOs, the Loch Ness Monster, or The Yetti.\n\nTheir answer is almost always great and rarely are they sharp enough to realize you're making fun of them.\n\n", "gilded": 0, "created_utc": "1260431031", "subreddit": "science", "score": 9, "controversiality": 0}
{"body": "'bout tree fiddy!", "gilded": 0, "created_utc": "1260437601", "subreddit": "promos", "score": 3, "controversiality": 0}
{"body": "Braveheart - Lead your team into battle with first blood in an arena mode game\n\nWatch out for Nessie - Kill an enemy with the grenade launcher while underwater\n\nKilting Spree - Kill X enemy demomen in one life\n\nStick it to 'em - Previously mentioned, kill X number of enemies with one sticky trap\n\nOne if by land, two if by sea - something about killing scouts.  Actually this probably works better for pyros...\n\nFly Scotter - Kill X enemy scouts with grenade launcher air shots\n\nScottish Highlands - Kill an enemy after launching yourself into the air with a sticky jump", "gilded": 0, "created_utc": "1260471148", "subreddit": "tf2", "score": 3, "controversiality": 0}
{"body": "Loch Ness Monster?", "gilded": 0, "created_utc": "1260492862", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "Nessie is right-- apples are a good source of [pectin](http://en.wikipedia.org/wiki/Pectin#Sources_and_production), as are citrus peels. Citrus peels might change the flavor of the jam too much (although lemon is quite tasty with cranberry), but if you shred a small, unripe apple into your jam while cooking, you'll see some better results. Granny Smith apples are known to carry the most pectin.", "gilded": 0, "created_utc": "1260555981", "subreddit": "food", "score": 1, "controversiality": 0}
{"body": "Whoever downvoted this clearly doesn't get the joke. \n\nDownvotes? Okay. Let me spell it out for you. Nessie is a FEMALE NAME.\n\nFucking virgins.", "gilded": 0, "created_utc": "1260609253", "subreddit": "reddit.com", "score": -2, "controversiality": 0}
{"body": "That's not similar. In fact, its completely different.\n\nThe Dantzig case, as described by snopes, is related to having one's name as a co-author in a paper.  What arichi was talking about, and what Nessie said 'happens', is that a Phd granting institution considers something that someone did as a undergraduate as equivalent to a dissertation. I submit that that never happens. What does happen, is that people utilize some of their previous work--whether as a graduate student or as an undergraduate student, and build on that in their dissertation. Thats actually somewhat common. ", "gilded": 0, "created_utc": "1260757285", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Believing that something is actually true is not a choice. If you disagree, then you're right, we have little more to discuss. It would seem there are further barriers to religious understanding of this issue than I first thought, which makes the entire issue all the more fascinating. \n\nYou know what it's like to be unable to believe that something is true, when your brain will not allow it. For the life of you, you cannot believe that there's an invisible Loch Ness monster following you around - you cannot, and there's nothing that you can do about it. \n\nIt appears we have reached my aforementioned dead end. ", "gilded": 0, "created_utc": "1260805337", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "Actually, I don't believe it's impossible there is an invisible Loch Ness monster following me around. If it's invisible and hiding itself from me, how am I to know? :-P\n\nYou are projecting. No, I don't believe there's an invisible Loch Ness following me around. But I choose to not think it impossible.", "gilded": 0, "created_utc": "1260805577", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "What I said was, you cannot believe there is. Can you? Try. Try right now. Try to believe there's actually an invisible Loch Ness monster following you around. Try to believe that this is true. Can you do it? \n\n&gt;You are projecting.\n\nNo, I'm not. You misunderstood.", "gilded": 0, "created_utc": "1260805681", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "&gt;You make a number of quite illogical progressions in your post. You base a supposition (that you will never believe) on a premise that does not preclude the outcome (that you do not currently believe).\n\nI've brought this up in another post, and I'll bring it up again here. Think of it like this. Do not let the fact that I am using \"silly\" beliefs here deter you from what I am saying - actually, take that into account if you want to truly understand the unbeliever.\n\nCan you believe there is an invisible Loch Ness monster following you around? Can you truly, actually believe it? Can you try? Will it work? Can you believe it is as true as dying, due to jumping off a very tall building? \n\nI would think you cannot. And this is not theoretical. Your brain will not allow you to believe that this is true.\n\nLike it or not, your beliefs are as silly as this, to me. They really, really are. Really. Let me emphasize this: really.\n\nMy brain cannot allow me to believe this is true. It is reasonable for me to say I will never believe. But, the most important part in all of this is this: I cannot do anything about it. \n\nJust as you cannot do anything about your unbelief that an invisible Loch Ness monster is following you around, I cannot believe that your religion is true, that a god exists, and that Jesus is his son. \n\nThis is the heart of the predicament.\n\nIf we are using the word \"belief\" as I have described above, then this is a true predicament in every sense of the word, and it has implications not for me as an unbeliever, but for you, as believers. \n\nYou need to accept that for people like me, this belief is, for all intents and purposes, impossible. Now, where do you go from there? If you truly accept what I am saying, you must see the predicament surely? ", "gilded": 0, "created_utc": "1260826995", "subreddit": "Christianity", "score": 2, "controversiality": 0}
{"body": "I need about tree fitty.", "gilded": 0, "created_utc": "1260833880", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "Say, would you crackas like to hear about the time we met the Loch Ness Monster?", "gilded": 0, "created_utc": "1260837182", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "On the [TF2 Demoman page](http://www.teamfortress.com/demoman.htm) it says that the Demoman is adopted (multiple times over, in fact, due to accidents). I guess it's lucky he eventually found adoptive parents who were into blowing stuff up.\n\n\n&gt;A fierce temper, a fascination with all things explosive, and a terrible plan to kill the Loch Ness Monster cost the six year old Demoman his original set of adoptive parents. Later, back at the Crypt Grammar School for Orphans near Ullapool in the Scottish Highlands, the boy's bomb-making skills improved dramatically. His disposition and total number of intact eyeballs, however, did not.", "gilded": 0, "created_utc": "1260920174", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "No. Image distortion and choppiness is the common tool of the trickster. See, Loch Ness Monster and Big Foot photos.", "gilded": 0, "created_utc": "1260938142", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Loch Ness Monster.  Damn thing kept asking for $3.50.  Keeps coming around because my damn wife gave him some change a while back.", "gilded": 0, "created_utc": "1260984747", "subreddit": "self", "score": 2, "controversiality": 0}
{"body": "I don't believe in God, but I blieve in Loch Ness monster, Bigfoot, aliens, ghosts and all that. \nReason for Nessie: We have only discovered a very small percent of ours seas, there is a possible chance that there is some kind of bigger sea living \"monster\" that perhaps raise their babys in lakes and places with few predators.\nReason for Bigfoot: Same as above. We don't know everything about our animals and we haven't discovered everything either. There is a chance that there is a Bigfoot/Yeti/other bigger primate living in our world.\nAliens: Because the Universe will never and has never contained just one planet of intelligence life. Don't know, and don't care, if they've been here.\nGhosts: Because there's a lot of crazy shit going on.", "gilded": 0, "created_utc": "1261078076", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "For the knitted animal book, you should totally go for [Amigurumi Knits](http://www.amazon.com/gp/redirect.html?ie=UTF8&amp;location=http%3A%2F%2Fwww.amazon.com%2FAmigurumi-Knits-Patterns-Cute-Mini%2Fdp%2F1589234359%3Fie%3DUTF8%26s%3Dbooks%26qid%3D1240457463%26sr%3D8-1&amp;tag=feaandfan-20&amp;linkCode=ur2&amp;camp=1789&amp;creative=9325). It's a great book, best of its kind I've seen, with really cute and interesting animal patterns. And there are patterns ranging from very easy beginner patterns (e.g. a knitted earthworm) to advanced (knitted Loch Ness monster, hermit crab, Jackalope...)", "gilded": 0, "created_utc": "1261119839", "subreddit": "knitting", "score": 1, "controversiality": 0}
{"body": "i think nessie forgot to paste the portion that mentioned that the acrylamide is created at very high temperatures. like somewhere close to the smoke point of soybean oil. deep fry at 350 and all foods in moderation. i love that tittyfucking jesus on a tricycle where's that from?", "gilded": 0, "created_utc": "1261192131", "subreddit": "food", "score": 1, "controversiality": 0}
{"body": "'bout tree fiddy.", "gilded": 0, "created_utc": "1261221961", "subreddit": "AskReddit", "score": 10, "controversiality": 0}
{"body": "Goddammit Loch Ness Monster! How'd you get on reddit?", "gilded": 0, "created_utc": "1261226565", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "TREE FITTY?? GODDAM LOK NESS MONSTAH!", "gilded": 0, "created_utc": "1261275457", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "Great idea! We could teach kids about all the genocide, terrorism, rape, torture and murder that religion promotes.  \n  \nThen after that, we could teach them some real ethics that don't rely on being scared of the big sky daddy waiting to burn them for being naughty.  \n  \nBut seriously, if we teach religion in schools, then we also need to teach about astrology, homeopathy, ufos, the loch ness monster and all those other ideas that lack any reliable proof.", "gilded": 0, "created_utc": "1261304756", "subreddit": "australia", "score": 2, "controversiality": 0}
{"body": "If it's from 50 Cent, I'd charge tree fiddy.", "gilded": 0, "created_utc": "1261442431", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "[I'd do it for tree fiddy.](http://www.youtube.com/watch?v=Q8iHPC-dGKY)", "gilded": 0, "created_utc": "1261448633", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Faker than Bigfoot riding Nessie into WTC-7", "gilded": 0, "created_utc": "1261457858", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "No, when you say you're an atheist, you're saying that you don't believe in god or gods. There is no further requirement or qualification. You can be an atheist and still theoretically believe in ghosts or the Loch Ness Monster.", "gilded": 0, "created_utc": "1261487538", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "It's the Loch Ness monster. Oh yeah, it can fly.", "gilded": 0, "created_utc": "1261601565", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "You are missing the point of what I am saying entirely.  I did not make the analogy in an effort to make an argument for the existence of God.  Existence or non-existence is not the issue I was making a point about... I don't know how I can be any clearer.  The following is a list of things that either exist or do not exist:\n\n1. rock\n2. tree\n3. dragon\n4. dog\n5. loch ness monster\n6. God\n7. car\n\nWhether a car exists or does not exist has nothing to do with whether a tree exists or does not exist.\n\nWhether a dragon exists or does not exist has nothing to do with whether the loch ness monster exists or does not exist, nor does it have anything to do with whether a car exists or does not exist.\n\nNone of those things existing or not existing has anything to do with any of the others existing or not existing.  They exist or do not exist independently of all the others.  Therefore, it is erroneous to ask for someone to prove that one exists while simultaneously disproving another.  The existence or non-existence of one has absolutely nothing to do with the other. \n\nExplaining this basic point is proving trying enough, I *REALLY* have no interest in getting into any depth on the subject of the existence of God at this point... perhaps another time.\n\nAnyway, if you still don't understand my point I give up, and will have to hope someone else understands and can explain it.... I am going to go sleep.", "gilded": 0, "created_utc": "1261637870", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I wish.\n\nI wanted the fun of supernatural out there when I was a kid; God, haunted houses, Loch Ness monster, whatever. I eagerly explored every new supernatural claim I could find, and as each fell away, a logical world was left in place. By my late teens I was over it and got on with my own life in our real world.", "gilded": 0, "created_utc": "1261704952", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I don't know if anyone would get that from the video having not seen the story first. If you've been told that there's an allegation that his hand was injured, you'll probably see him \"checking for blood.\" But would you see that if you were shown the video with no context? I don't think so. It's sort of like a Loch Ness monster video. With no context you see a log floating in a lake, but told that it's \"LOCH NESS MONSTER CAUGHT ON TAPE!!!\" the viewer looks for evidence that the log is actually a living creature.\r\n\r\nThere are only about 2 seconds of the video that really matter. Wish someone would grab them and slow them down a little bit. Zoom  + enhance?", "gilded": 0, "created_utc": "1261865259", "subreddit": "Equality", "score": -4, "controversiality": 0}
{"body": "I didn't catch it.\n\nBut you reminded me of \"It's about a-tree fiddy.\"", "gilded": 0, "created_utc": "1261900745", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "The existence of a Creator could be easily proven, just like the existence of aliens, Bigfoot, the Loch Ness Monster, or unicorns could be easily be proven. If they'd all just stop hiding so well and let us get a good look at them maybe we'd have some evidence.", "gilded": 0, "created_utc": "1262103848", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "I believe in the Loch Ness monster.  because its fun.  When Nessie starts telling me to kill people in exchange for virgins i may reconsider that belief.  Maybe.  ", "gilded": 0, "created_utc": "1262142021", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "[The Journal of Scientific Exploration](http://www.scientificexploration.org/journal.html) has articles with titles such as [Common Knowledge About the Loch Ness Monster](http://www.scientificexploration.org/journal/jse_01_1_bauer.pdf) and [The Strange Properties of Psychokinesis](http://www.scientificexploration.org/journal/jse_01_2_schmidt.pdf).  I will be honest and say I have not investigated these particular papers thoroughly, only reading through the abstracts and references, but I think these alone will give you an idea of how poorly applied scientific rigor can masquerade with even the most batshit claims.", "gilded": 0, "created_utc": "1262199798", "subreddit": "science", "score": 3, "controversiality": 0}
