{"body": "i want ur persian persuader, battalions backup, nessie's nine iron, your eternal reward, ubersaw, candy cane...", "gilded": 0, "created_utc": "1322705645", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy. ", "gilded": 0, "created_utc": "1322706228", "subreddit": "funny", "score": 7, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1322712432", "subreddit": "guns", "score": 0, "controversiality": 0}
{"body": "Well that isn't very mu...wait a minute, YOU GOD DAMN LOCH NESS MONSTER!!! YOU CAN'T HAVE MY TREE FIDDY!!!!", "gilded": 0, "created_utc": "1322715064", "subreddit": "xbox360", "score": 3, "controversiality": 0}
{"body": "But I just gave him tree fiddy last week!", "gilded": 0, "created_utc": "1322718944", "subreddit": "funny", "score": -1, "controversiality": 0}
{"body": "I aint given you no three fiddy you god damn loch ness monster get your own god damn money!", "gilded": 0, "created_utc": "1322730962", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "Rare view of what the Loch Ness monster looks like from behind.", "gilded": 0, "created_utc": "1322761531", "subreddit": "nsfw", "score": 2, "controversiality": 0}
{"body": "I would at least go for tree fiddy.", "gilded": 0, "created_utc": "1322769506", "subreddit": "shittyadvice", "score": 2, "controversiality": 0}
{"body": "'bout tree fiddy", "gilded": 0, "created_utc": "1322778723", "subreddit": "AskReddit", "score": 12, "controversiality": 0}
{"body": "I ain't giving you no tree fiddy monster!  ", "gilded": 0, "created_utc": "1322779933", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "I haven't moved the goalposts. I said in my first post here that most of the cases against big fish were civil, not criminal. The real masterminds -- the guys at the tops of TBTF banks -- have not been punished.  \n  \n1. Taylor, Bean, and Whitaker was not a particularly large player. In its biggest year, 2007, [it sold $35 billion in loans to GNMA](http://en.wikipedia.org/wiki/Taylor,_Bean_%26_Whitaker), [in the context of $1.2 trillion of agency MBS originated that year] (http://www.mortgagebankers.org/files/Conferences/2010/NationalSecondary/SMKT10AgencyMBSTrends.pdf). This case was not responsible for the 2008 meltdown. If it hadn't happened we would still be in the same place we are today. I'm glad Farkas and Allen are in prison but I know you don't believe they were the biggest malefactors out there.  \n  \n2. If we're going to settle this with fines, the fines should be many multiples of the economic damage caused. Take the Goldman Sachs Abacus case you linked to. The SEC alleges Goldman caused investors to lose $1 billion dollars, but [Goldman managed to settle the case for only $550 million](http://www.sec.gov/news/press/2010/2010-123.htm). If fines stay this low, the rational thing to do is commit financial crimes. You'll only get caught for a small fraction of them (Does anyone believe Abacus was the *only* time Goldman misbehaved?) and your profits will easily pay for your fines.  \n  \n3. Farkas may have paid, but Lloyd Blankfein sure didn't pay anything for the Abacus settlement. None of the TBTF executives have personally suffered in the least.  \n  \n4. I suppose it's theoretically possible they're building a top-secret case, in the same sense that it's theoretically possible the Loch Ness monster exists. I think it's far more likely that [any attempts to even begin to investigate the kingpins is being headed off by the top management of the SEC.](http://www.rollingstone.com/politics/news/why-isnt-wall-street-in-jail-20110216?print=true) Money quote:  \n&gt;Aguirre, an SEC foot soldier, is trying to interview a major Wall Street executive — not handcuff the guy or impound his yacht, mind you, just talk to him. In the course of doing so, he finds out that his target's firm is being represented not only by Eliot Spitzer's former top aide, but by the former U.S. attorney overseeing Wall Street, who is going four levels over his head to speak directly to the chief of the SEC's enforcement division — not Aguirre's boss, but his boss's boss's boss's boss. Mack himself, meanwhile, was being represented by Gary Lynch, a former SEC director of enforcement.\n\n&gt;Aguirre didn't stand a chance. A month after he complained to his supervisors that he was being blocked from interviewing Mack, he was summarily fired, without notice. The case against Mack was immediately dropped: all depositions canceled, no further subpoenas issued. \"It all happened so fast, I needed a seat belt,\" recalls Aguirre, who had just received a stellar performance review from his bosses. The SEC eventually paid Aguirre a settlement of $755,000 for wrongful dismissal.", "gilded": 0, "created_utc": "1322785273", "subreddit": "politics", "score": 15, "controversiality": 0}
{"body": "With this logic, I can say that Bigfoot, Nessie, and Atlantis are real. But I can't.  You can't make assumptions like \"it's silly not to believe in God\" with the reasoning that \"we can't know everything in the universe, so God must be wherever we haven't looked yet\".  You're basically looking for evidence that supports your claims, instead of making claims based on the given evidence.\n\nEDIT: I'd like to add that your logic would qualify for an agnostic point of view.  You're saying that a God COULD exist, because we don't have all data possible.  But you're using an argument that states that God COULD exist and leading it to the statement God MUST exist, which is a logical error.", "gilded": 0, "created_utc": "1322786926", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "We have one in Scotland.  Wtf?  I don't even know what this could refer to.  Maybe Nessie left the Loch and has turned out to be some kind of alien species, infecting people?  ", "gilded": 0, "created_utc": "1322793928", "subreddit": "conspiracy", "score": 3, "controversiality": 0}
{"body": "I already gave him tree fiddy last week", "gilded": 0, "created_utc": "1322793953", "subreddit": "AskReddit", "score": 9, "controversiality": 0}
{"body": "Damn scumbag loch ness monster! Don't give him tree fiddy he will just come back for more. \n", "gilded": 0, "created_utc": "1322795265", "subreddit": "trees", "score": 6, "controversiality": 0}
{"body": "Well it was about this﻿ time that I noticed that the Girl Scout was 8 stories tall and was a crustacean from the paleolithic era.", "gilded": 0, "created_utc": "1322822480", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "It depends on what kind of beer we're talking about. If we talking about the macro breweries than definitely not. As Nessie said, their goal is uniformity in every can every year. Change is not welcome. The simple fact that they can make such a uniform beer at such a large scale is simply impressive.\n\nOf course the microbreweries are a different story. Many of them are constantly refining their product from year to year; making changes to see what works and what doesn't. This is what makes craft beer so interesting. Sometimes they'll try something and it won't turn out they way they hoped and that year's batch of that beer will suffer. But sometimes they'll hit beer gold and find something so unique and interesting that people will travel from across the country to just to try it.", "gilded": 0, "created_utc": "1322832190", "subreddit": "beer", "score": 3, "controversiality": 0}
{"body": "Based on this logic, why do you not believe in the Loch Ness monster or Big Foot? I can assume that you have never seen it but I can also assume that you have heard stories about them before. So if this is the logic you follow then you can see why your argument is flawed. The idea that we should believe something just because we have stories from other people is not only ridiculous, but, I must say, it is also incredibly gullible. Also, there are stories about Zeus, Allah, the Flying Spaghetti Monster, Aliens et cetera, et cetera. This argument seems like it was taken straight from a Christian apologetics book. ", "gilded": 0, "created_utc": "1322836064", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "I imagine that we'll probably find the Loch Ness Monster and it's many offspring at some point.\n\nI call dibs on taming them and riding them around like a badass.", "gilded": 0, "created_utc": "1322842977", "subreddit": "science", "score": 4, "controversiality": 0}
{"body": "If you're not paying attention on Loch Ness Monster at BGW coming out of the first loop in the back of the train you get some monster whiplash. I usually don't sit back there because of that. If I do that first, I have a headache the rest of the day.\n\nAlso Rip Ride Rocket isn't really painful, but it seems so rough for a brand new coaster. I wonder if it has to do with it being such a short train.", "gilded": 0, "created_utc": "1322844930", "subreddit": "rollercoasters", "score": 2, "controversiality": 0}
{"body": "I think you mean tree fiddy.", "gilded": 0, "created_utc": "1322846159", "subreddit": "funny", "score": 7, "controversiality": 0}
{"body": "&gt; (Nessie springs to mind)\n\nNOT COOL!", "gilded": 0, "created_utc": "1322856293", "subreddit": "nosleep", "score": 3, "controversiality": 0}
{"body": "Or a Loch Ness monster demanding \"Tree Fitty\".\n\nDammit I'm gonna have to start watching the whole series over *again* because I want to catch every joke.  This game seems too good to be true.", "gilded": 0, "created_utc": "1322917228", "subreddit": "Games", "score": 29, "controversiality": 0}
{"body": "All I got is tree fitty.", "gilded": 0, "created_utc": "1322926851", "subreddit": "skyrim", "score": 1, "controversiality": 0}
{"body": "No, the main point is that in order to have a gnostic conversation about God/gods, you need a firm definition of the word. The graphic is not critical of gnostic atheists (which I believe cituke himself is), it is critical of the theist boobie. The boobie claims the loch ness monster exists but then redefines his definition to avoid any contrary evidence. Such behavior is not conducive to having a conversation about anything.", "gilded": 0, "created_utc": "1322935654", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "6 dollars for Marlboros? Here in Kentucky they're only like tree fiddy.", "gilded": 0, "created_utc": "1322946973", "subreddit": "trees", "score": 6, "controversiality": 0}
{"body": "goddamn you loch ness monster!!!", "gilded": 0, "created_utc": "1322950601", "subreddit": "trees", "score": 4, "controversiality": 0}
{"body": "tree fiddy. \n\nhaha, upvotes for the laugh! ", "gilded": 0, "created_utc": "1322964444", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "\"And he was like.........tree fiddy\"", "gilded": 0, "created_utc": "1322964780", "subreddit": "trees", "score": 3, "controversiality": 0}
{"body": "Nice try, loch ness monster.", "gilded": 0, "created_utc": "1322976146", "subreddit": "southpark", "score": 3, "controversiality": 0}
{"body": "It was exceptionally well-written and, for those who are wondering, from someone who has read the series carefully: surprisingly factually correct.\n\nThe crux of his or her analysis, though, is neither true nor fair:\n\n&gt; Bella Cullen pursues two innocent human hikers through a forest, intent on ripping them to pieces to satisfy her bloodlust - and stops only because Edward calls out to her. Not because she perceives murder as wrong. (Breaking Dawn, p.417). \n\nIn her bloodlust, Bella *does* pursue human hikers intent on killing them; and it is true that the only reason she stops is because Edward distracts her. But from that moment, she turns away of her own volition, *not* out of obedience to Edward; in fact she sprints in entirely the opposite direction, leaving him behind. It's a huge plot point: Bella is the only vampire (aside from Carlisle, and I'd be willing to negotiate on Esme) who is able to see, post-transformation, that murder is wrong *in se*. Bella Cullen's empathy is a HUGE crossover from Bella Swan-- to the extent that the Cullens speculate that it might be a \"gift\" rather than a character trait. \n\n&gt; She also attempts to kill Jacob and breaks Seth's shoulder because she didn't approve of what Jacob nicknamed her daughter (Breaking dawn, p.452). She no longer has morals .\n\nShe does attempt to kill Jacob, I guess (though I'd argue that \"try to kill\" is a bit strong, and \"attack\" is probably more accurate). But it's not purely because Jake nicknamed Nessie; it's because he *imprinted* on her: Bella just found out that Jacob plans to spend his entire life courting and protecting the infant daughter she hasn't even been able to hold yet. She thinks that he is thinking of her one-week old in a sexual way. (The whole thing, by the way, is a whole nother box of crazy: Imprinting and the Edward pedophilia is fucking weird, but I won't go there.) If she flies into a jealous rage, well then, yeah okay, maybe not super moral (although honestly, I'd grant any human the right in that situation). But to represent it as entirely because of the Nessie thing is completely misleading-- it was just the straw that broke the camel's back.\n\nSo yeah, in sum: I think it's a great analysis (and in line with Robert Pattinson's theory on the series: \"I try to play him as this manic-depressive who hates himself\"). But there's not need to resort to hyperbole in the conclusion when the rest of your argument is well-argued and well-evidenced.", "gilded": 0, "created_utc": "1323021988", "subreddit": "bestof", "score": 180, "controversiality": 0}
{"body": "This was exceptionally well-written and, for those who are wondering, from someone who has read the series carefully: surprisingly factually correct.\n\nThe crux of your analysis, though, is neither true nor fair:\n\n    Bella Cullen pursues two innocent human hikers through a forest, intent on ripping them to pieces to satisfy her bloodlust - and stops only because Edward calls out to her. Not because she perceives murder as wrong. (Breaking Dawn, p.417).\n\nIn her bloodlust, Bella does pursue human hikers intent on killing them; and it is true that the only reason she stops is because Edward distracts her. But from that moment, she turns away of her own volition, not out of obedience to Edward; in fact she sprints in entirely the opposite direction, leaving him behind. It's a huge plot point: Bella is the only vampire (aside from Carlisle, and I'd be willing to negotiate on Esme) who is able to see, post-transformation, that murder is wrong in se. Bella Cullen's empathy is a HUGE crossover from Bella Swan-- to the extent that the Cullens speculate that it might be a \"gift\" rather than a character trait.\n\n    She also attempts to kill Jacob and breaks Seth's shoulder because she didn't approve of what Jacob nicknamed her daughter (Breaking dawn, p.452). She no longer has morals .\n\nShe does attempt to kill Jacob, I guess (though I'd argue that \"try to kill\" is a bit strong, and \"attack\" is probably more accurate). But it's not purely because Jake nicknamed Nessie; it's because he imprinted on her: Bella just found out that Jacob plans to spend his entire life courting and protecting the infant daughter she hasn't even been able to hold yet. She thinks that he is thinking of her one-week old in a sexual way. (The whole thing, by the way, is a whole nother box of crazy: Imprinting and the Edward pedophilia is fucking weird, but I won't go there.) If she flies into a jealous rage, well then, yeah okay, maybe not super moral (although honestly, I'd grant any human the right in that situation). But to represent it as entirely because of the Nessie thing is completely misleading-- it was just the straw that broke the camel's back.\n\nSo yeah, in sum: I think it's a great analysis (and in line with Robert Pattinson's theory on the series: \"I try to play him as this manic-depressive who hates himself\"). But there's not need to resort to hyperbole in the conclusion when the rest of your argument is well-argued and well-evidenced.\n\nEdit: cross-posted from the best-of thread.", "gilded": 0, "created_utc": "1323022418", "subreddit": "funny", "score": 125, "controversiality": 0}
{"body": "The Loch Ness Monster!", "gilded": 0, "created_utc": "1323023435", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "You raise some good questions.  I'd need to go back and re-read Breaking Dawn to answer them properly (and I may not be able to make a case even then).  Regrettably, I lack the time to do so.  \n\nIn truth, it's been over a year (maybe two?) since I've read the books.  I broke out a copy that was on the shelf for the page citations.\n\n&gt;It's a huge plot point: Bella is the only vampire (aside from Carlisle, and I'd be willing to negotiate on Esme) who is able to see, post-transformation, that murder is wrong in se. \n\nShe doesn't seem (to me) to be especially upset or remorseful that she was going to eat two people.  She does demonstrate unnatural levels of self control for a vampire - but that does not necessarily mean that she retains human empathy.  The other remain concerned that she's going to eat her own father when he shows up (though to her credit, she doesn't).  \n\nI think it is safe to say, either way, that her capacity for empathy is severely diminished in the wake of her transformation - and that this is not in keeping with the nature of her human character.  (We wouldn't expect it to be - these are things that are stated to predictable accompany transformation.  The characters acknowledge that newborns love to eat people.  My position is that this represents the destruction of their moral capacity.)\n\n&gt;But it's not purely because Jake nicknamed Nessie; it's because he imprinted on her.\n\nWould need to review that section in its entirety.  I was admittedly skimming.  This far out, the order of things gets fuzzy - but what you're saying makes sense.\n\nThe attack happens at the end of a chapter.  Bella shrieks something along the lines of, 'You nicknamed her after the loch ness monster?' and the final line in that chapter is,\n\n\"And then I went for his throat.\"\n\nThe next chapter talks about how she had to be restrained, and that she broke Seth's shoulder trying to get at Jacob.\n\n", "gilded": 0, "created_utc": "1323025276", "subreddit": "funny", "score": 63, "controversiality": 0}
{"body": "Can I borrow bout tree fiddy?", "gilded": 0, "created_utc": "1323027858", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "I say the mother's The Loch Ness Monster! I'm just trying to be \"out there\" and make a wild prediction.", "gilded": 0, "created_utc": "1323031257", "subreddit": "HIMYM", "score": 4, "controversiality": 0}
{"body": "You're a fucking moron.\n\nThe point I was trying to make is that the spent the better part of the first few seasons hyping up the whole Ted/Robin relationship. I would feel robbed if they didn't end up with each other.\n\nBut yeah, the Loch Ness Monster is totally another option, because we all remember that Ted is absolutely head-over-heels in love with it. Oh no wait, that's Robin. He's in love with Robin. ", "gilded": 0, "created_utc": "1323031492", "subreddit": "HIMYM", "score": -3, "controversiality": 0}
{"body": "But what about the clues? We know that [Marshall captures Nessie](http://images1.fanpop.com/images/photos/1400000/Nessie-how-i-met-your-mother-1408083-1280-720.jpg). What if that happens at the wedding? We know it's raining at the wedding where Ted meets the Mother, and Nessie must surely love water, right?   \n\nFurthermore, in 214 - *Monday Night Football* Marshall calls Nessie a \"gentle creature\". Does he know something we don't? Has his plan been to hook Ted up with Nessie all along?", "gilded": 0, "created_utc": "1323031941", "subreddit": "HIMYM", "score": 9, "controversiality": 0}
{"body": "Holy wall of text. Sorry.\n\n&gt; She doesn't seem (to me) to be especially upset or remorseful that she was going to eat two people. She does demonstrate unnatural levels of self control for a vampire - but that does not necessarily mean that she retains human empathy. The other remain concerned that she's going to eat her own father when he shows up (though to her credit, she doesn't).\n\nYou make a good point here. My main argument is that she *is* moral, but what I really need to prove to counter you is that she is empathetic. \n\nOn being moral: Bella isn't even remotely tempted to harm other humans, on an intellectual level. She never truly believes that she'll harm Jacob, or Charlie, or Nessie, or other humans. The fact that everyone is worried that she will (because damned near every new vampire *would*), is just further proof of her moral fiber. Though none of the Cullens expect her to be able to resist (only Carlisle and Rosalie, it is suggested, have never drank human blood; and Rosalie murdered five people), Bella thinks that she could not live with herself if she gave in. Even Edward rebelled against the “vegetarian” lifestyle, and not because he lost himself in bloodlust.\n\nOn empathy: Still, I think that this shows at least to some degree the Bella Swan we knew of as painfully, irritatingly empathetic; the match-maker among her friends who moved across the country so her mom could live happily with her boyfriend. (By the way: this is, in my opinion, themostfuckingirritating thing *about* Bella; but that’s for another thread.) One line in particular, after she had stopped herself attacking those humans in the forest, is \"It might have been someone I know!\" At first, this seems somewhat ridiculous (oh, but if you didn’t know them, then it’d be fine?), but it also shows that Bella Cullen thinks a lot like Bella Swan did; she has a tendency to think about everyone as an individual, to put herself in others’ shoes and make decisions based off of that, rather than sweeping moral claims (“killing people is wrong”). \n\nWhen she is faced with Jacob, the first warm-blood she’s seen after her transformation, she says “Was he really so selfless that he would try to protect me - with his own life - from *doing something in an uncontrolled split second that I would regret in agony forever?*” After she hurts Seth, she’s in serious distress (“I buried my face in my hands and shuddered at the thought [that I could have bitten Seth/Jacob], at the very real possibility… ‘I’m a bad person.’”) and apologizes quite a lot for quite a while.  \n\nI think the reason we don’t see as much empathy as we expect is because she takes it as such a given that she couldn’t possibly attack people that there’s not much anguish over it. (“‘I can't understand how you ran away.’ […] ‘What else could I do?’ I asked. His attitude confused me - what did he want to have happened? ‘It might have been someone I know!’”) \n\nBut over the small stuff… she’s definitely still empathetic. Within minutes of waking up from her transformation, she’s already worrying about Jacob and how he’s taking having “lost” her. The first thing she thinks about when she sees him is whether he’s okay with seeing her as freaky-vampire-chick. Within an hour of her transformation, she’s already making plans for putting Charlie’s mind at ease. She forces herself to be okay about everyone else being more of a mom to Nessie than she is (even, eventually, Jacob). As soon as she receives her present from Alice (the house), she’s annoying Bella right away (\"Am I really that bad? They didn't have to stay away. Now I feel guilty. I didn't even thank her right. We should go back, tell Esme - \"). Etc. etc. She’s more confident, but I don’t think she lost that particular annoying trait.\n\nThe keystone for this argument: her powers when the Volturi threaten. You call her “among the strongest and most warlike of the vampires,” but what exactly does her power do? It *protects* people. It is by its very definition defensive. She works ceaselessly to expand her power so that she will be able to protect everyone—to the point that everyone tells her to calm down and lay the fuck off. She has that savior’s complex right through the end of the series. I don’t think it can be said that Bella Cullen does not feel the need to protect other people, vampire, werewolf, or mortal… and I’m gonna call that near enough empathetic for my purposes.\n\nOn Jacob: Yeah, she “lunged for his throat.” But she’s a protective mother, a newborn vampire, and she’s got pedo-wolf in love with her three-day old daughter. Even Seth says “anyone would have done the same.” Seth got in the way of who she wanted to attack—she didn’t just start mauling people. She feels badly (“Not that the best friend didn't have a few things to answer for, but, obviously, nothing Jacob had done could have mitigated my behavior.”) and spends an annoying amount of time apologizing to Seth, and even apologizes to Jacob. And, you know, not that it excuses it—but he’s a werewolf. He healed in like, half an hour. \n\nYou can argue that it’s a Bella Cullen departure from Bella Swan, but you can’t say that Bella Swan wasn’t violent. She broke her hand on Jacob’s face. It’s just that she was a lot less *effective* with her violence as a human.\n\nSo that’s my spiel. The whole story is ridiculously as a morality tale—there is so much more fucked-up-ed-ness in those four books than in any normal book that just might endorse pre-marital sexuality. But though I read the books the same way you did the first time though, I’m more likely to give Bella a little more credit now. Even if she is a fucking annoying Mary Sue.\n", "gilded": 0, "created_utc": "1323034857", "subreddit": "funny", "score": 39, "controversiality": 0}
{"body": "They are awesome. The only people that have actually managed to corner Russel from the NASL for an interview. It's like capturing a unicorn or nessie, but is rarer.", "gilded": 0, "created_utc": "1323040096", "subreddit": "starcraft", "score": 3, "controversiality": 0}
{"body": "I'm going to need about tree fiddy.", "gilded": 0, "created_utc": "1323055793", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "frankenstein boots, the sniper's hat, s. pistol, some other strange(sorry, I forgot), nessie's nine iron and the holy mackerel..  ", "gilded": 0, "created_utc": "1323058097", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "Last week, [Japanese scientists](http://www.moviewavs.com/php/sounds/?id=bst&amp;media=WAVS&amp;type=Movies&amp;movie=Napoleon_Dynamite&amp;quote=lakelochness.txt&amp;file=lakelochness.wav) explaced... placed explosive detonators at the bottom of Lake Loch Ness to blow Nessie out of the water. Sir Cort Godfrey of the Nessie Alliance summoned the help of Scotland's local wizards to cast a protective spell over the lake and its local residents and all those who seek for the peaceful existence of our underwater ally.", "gilded": 0, "created_utc": "1323083089", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "I gave em the whole tree fiddy", "gilded": 0, "created_utc": "1323100384", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "\"What is it you want, monster?\"\n\"About tree fiddy.\"", "gilded": 0, "created_utc": "1323100621", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "I still listen to Slipknot. They're enjoyable. I used to be a huge Korn fan when I was about 12 but I never listen to them anymore. I also used to be big Limp Bizkit and Linkin Park fan but now I don't like the two. On my playlist there are chosen Korn and SOAD songs but I still like Slipknot.\n\nA friend of mine from school introduced me to metal when I was 14. I'm forever grateful and because of him I turned my best friend onto metal as well. He liked Slipknot at the time but he listened to so much more. He showed me what Metallica and Iron Maiden was. Even though I had barely listened to metal he still gave me one song here and there. I instantly liked March of the Fire Ants and Ol' Nessie by Mastodon. Still listen to Eve of the Apocalypse by Malevolent Creation.\nI'm mostly into melodic death or thrash or progressive metal of all sorts now. I really pity people who only listen to what the radio tells them to listen to. Sure people are welcome to like anything they want but I reckon much of it they listen to only because it's been played over and over again and they can't help it.", "gilded": 0, "created_utc": "1323107197", "subreddit": "Metal", "score": 1, "controversiality": 0}
{"body": "We had this argument last night:\n\n&gt;her: Why don't you at least listen to people's arguments?\n\n&amp;#13;\n&gt;me: because the only reason anyone's arguments about religion make sense is because they already believe what they believe. It's like me trying to convince people to be my friend by sending out friend requests on facebook to people who are already my friends.\n\n&amp;#13;\n&gt;her: I'm willing to listen to anyone's arugments.\n\n&amp;#13;\n&gt;me: So, you would be willing to change your views?\n\n&amp;#13;\n&gt;her: Well, if they weren't crazy.\n\n&amp;#13;\n&gt;me: What do you mean crazy?\n\n&amp;#13;\n&gt;her: well, you know, if thousands of people followed their beliefs, and they weren't screaming that I would go to hell or something, I would listen politely and consider their views.\n\n&amp;#13;\n&gt;me: So, do you believe in bigfoot? Loch Ness Monster? Aliens? There are thousands of eye witnesses to all of them. And millions of people believe in them - and none of them will say you are going to hell (for not believing in aliens, et al).\n\n&amp;#13;\n&gt;her: I guess I see your point.\n\n&amp;#13;\n&gt;me: and that's why I'm an atheist.", "gilded": 0, "created_utc": "1323107705", "subreddit": "atheism", "score": 8, "controversiality": 0}
{"body": "Three fifty, a joke, referencing an old south park episode where the Loch Ness monster is stalking Chef's parents trying to trick them into giving him Three dollars fifty. It was a joking suggestion that you could bribe me into changing my mind, but it bombed flat on it's face. Probably best if we let the festering corpse of that one lay there are a warning to future joke tellers, there are limits!\n\nRegarding the suggestion, no it would not. The reason being that the former has no bearing on whether an action is right, merely whether it is legal. The second merely deals with the motivations for doing a thing, not whether it is effective or not. The motivation for firefighters is often money, but no one would claim it was bad simply because of that.", "gilded": 0, "created_utc": "1323110339", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "bout tree fitty", "gilded": 0, "created_utc": "1323112285", "subreddit": "AskReddit", "score": 184, "controversiality": 0}
{"body": "You know who it was? It was that damn loch ness monster tryin ta get mah dree fiddy.\n\nI gave him a dollar.", "gilded": 0, "created_utc": "1323112947", "subreddit": "AskReddit", "score": 62, "controversiality": 0}
{"body": "Joe Jr. is the Loch Ness Monster", "gilded": 0, "created_utc": "1323117494", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "I know, it sounds pretentious. But for every Saola you read about, there are 10 loch ness monsters, big foot, and chupacabras. You can't just take everything the locals claim to have seen in the forest at face value.\n", "gilded": 0, "created_utc": "1323126270", "subreddit": "wikipedia", "score": 21, "controversiality": 0}
{"body": "I don't know why you're lumping chupacabras in with fictional entities like big foots and loch ness monsters.", "gilded": 0, "created_utc": "1323129292", "subreddit": "wikipedia", "score": 13, "controversiality": 0}
{"body": "a giraffe and a manatee and get something like the loch ness monster but a mammal", "gilded": 0, "created_utc": "1323139613", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Ill bite. Is it Nessie? ", "gilded": 0, "created_utc": "1323141666", "subreddit": "itookapicture", "score": 2, "controversiality": 0}
{"body": "I still tell tales of how awesome these were. Folks who've never heard of them look at me like I'm telling stories about the Loch Ness Monster. \"Oreo O's? That's...that's impossible! Nobody would make a cereal made entirely of oreos...\"\n\nOh, how wrong they are. ", "gilded": 0, "created_utc": "1323147946", "subreddit": "pics", "score": 11, "controversiality": 0}
{"body": "Loch Ness monster needs to be the recurring boss character.", "gilded": 0, "created_utc": "1323153024", "subreddit": "gamernews", "score": 2, "controversiality": 0}
{"body": "OMG, I'm older than dirt in internet time (I'm 32) and I remember back when webcams first became accessible to people like me (mind you the first webcam I ever bought had the same 128x128 resolution, b/w and cost about $150+ IIRC.  It was practically useless anyway, I had dial-up at the time).  I heard this story about the \"coffee pot webcam\" told over and over on various usenet groups, etc, but never bothered to look it up (obviously wikipedia didn't exist back then and I'd forgotten about that story over the years).  Even then (1997-1998?) it was totally pimp to own a camera that plugged into a computer...\n\nI can't believe it's actually true, I thought it was some kind of myth or something.  To me, this is like someone actually catching a yeti, or the loch ness monster or something...  So cool...\n\nEDIT:  Also, I should mention that when DSL first became available my room mates and I setup a webcam that showed our living room 24/7 on camarades so our friends would know when we were home and playing Goldeneye64.  If they couldn't see us on cam, they didn't come over, if they saw us, they would pop by...  I have never felt as innovative since TBH...", "gilded": 0, "created_utc": "1323155143", "subreddit": "todayilearned", "score": 8, "controversiality": 0}
{"body": "Coulda saved about tree fiddy.", "gilded": 0, "created_utc": "1323169948", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "And I said \"Damn it Loch Ness Monster, you leave my family alone!!\"", "gilded": 0, "created_utc": "1323188296", "subreddit": "technology", "score": 6, "controversiality": 0}
{"body": "bout tree fitty", "gilded": 0, "created_utc": "1323192212", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "Don't be givin' no tax monster no tree fitty!!", "gilded": 0, "created_utc": "1323194008", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Why should anyone be tolerant of irrationality? Do we treat people who believe in Bigfoot and the Loch Ness Monster or who think the moon landing was faked with tolerance and respect?", "gilded": 0, "created_utc": "1323199598", "subreddit": "atheism", "score": 6, "controversiality": 0}
{"body": "Somewhere between 3 and 4.  Bout tree fitty", "gilded": 0, "created_utc": "1323203270", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "There are probably mutant variations of common animals existing in nature, that have been mistaken for *monsters*. I don't believe anyone has seen Nessie. They have seen things moving in the water but I doubt they were monsters. Probably opposing tides causing fish-like ripples, large fish or shoals of fish, etc, etc.", "gilded": 0, "created_utc": "1323204175", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "&gt; qualifications\n\nSorry, but regardless of his qualifications something that has eluded photographs and video (or any other physical evidence at all) for decades does not exist. It's like claims of miracles, which somehow always manage to occur outside of controlled or even observed settings.\n\nAn astronaut could one day claim to have seen the loch ness monster and their flight experience would be irrelevant.", "gilded": 0, "created_utc": "1323204545", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "It really depends on what genres you're interested in and whether or not you're looking for current TV or any TV.\n\nCommunity is great, as far as a series that exists in a self referencing world.  Much like HIMYM, there are tons of little continuity jokes and great characters that exists right outside of the realm of reality.  Troy and Abed are the best \"bro\" characters I have seen in a long time.  Imagine Marshall's feelings about something like Nessie and Bigfoot and apply that attitude to a pair of characters.  It's wonderful.\n\nParks and Rec has good characters and is doing what The Office used to do well.  The Office was amazing for the first few seasons, and while still a good show, it's not nearly what it used to be.\n\n2 Broke Girls has the sitcom feel and is basically Whitney Cummings' way of making fun of people she hates (hipsters, fake people, etc).  While not what you may call respectable, it still can bring some laughs for a sitcom.\n\nThe Increasingly Poor Decisions of Todd Margaret got picked up for a second season and may be the funniest show on television that few have heard of.\n\nIt's Always Sunny in Philadelphia is fucking hilarious.  There are no characters on TV right now that can compete with the uniqueness that the gang brings together.  Its comedy can get dark, but that only makes it better.\n\nThe Walking Dead has great character depth, although some people have started disliking the pace because they want their zombie content to be constant GO GO GO GUNS GUNS POW POW GO! and it slows down to really give some insight into characters.\n\nFringe really grabbed me in terms of the story arc and some of the interesting character depth they can bring with multiple dimensions.  It's like a new X Files, if that's your thing.\n\nBreaking Bad is just plain brilliant.  If you can tell me that show's writing doesn't deserve respect, I don't know what does.  And the acting is just amazing.\n\nAMC has done some great things.  Mad Men is really good, but it's heavy.  I don't know a better way to put it.\n\nContinuing TV dramas that are great, Dexter is pretty damn great at messing with your head and your morals.\n\nI've also heard The Wire is amazing, but haven't had a chance to get into it.\n\nAs far as non current TV goes, check out Spaced, Black Books, and Father Ted for some good British humor... excuse me, \"humour\".\n\nAnd if you really want brilliantly amazing, self referential, perfection and you haven't seen Arrested Development yet, you don't know what respect is.  Seriously, nothing can even compare.  It's been off the air for years and people are still finding jokes on their 3rd, 4th, etc times through it.  It is so meticulously crafted and well thought out its insane.\n\nAnother show the internet would get on my ass about for not mentioning is Firefly.  Yeah, it's really good.  No much more to say than that.\n\nJoss Whedon made another, not as popular show that I think gets too little respect in Dollhouse.  Just stick with it until the middle of the first season when the story arc really kicks in and it's worth it.\n\nAgain, though, it really just depends on what genre you're looking for.  I love good TV, and I try and give most shows a chance and like to think I have pretty good taste and I try to remain objective about a lot of shows.  Let me know specifically what you like and I'll see if there's anything I recommend more than anything else.\n\nThere is a lot of shitty TV, but there's a lot of good TV too.  That *does* in fact, deserve respect.  It's just that you often have to wade through shit to find quality.", "gilded": 0, "created_utc": "1323207547", "subreddit": "HIMYM", "score": 0, "controversiality": 0}
{"body": "would the correct r/answer be tree fitty?", "gilded": 0, "created_utc": "1323226401", "subreddit": "DealsReddit", "score": 1, "controversiality": 0}
{"body": "I liked the second book because of Jacob. The only parts of the final book I enjoyed were the parts written in Jacob's perspective. I couldn't relate to Bella at all and she is supposed to be who I'm finding connections with. I was actually really excited at the start of the book where she decided to go to college and live some more before turning. and then the whole preggo thing happened. What killed the last book for me was Bella's pregnancy, the whole Nessie and Jacob thing, and the final \"battle\". There was no climax. Just a lot of worthless buildup. I finished the book and stopped being a fan.", "gilded": 0, "created_utc": "1323233698", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "My friends and I used to swim in a lake in college and we made up a story about Nestie, Nessie's cracked out cousin that rubs up against you and pops its head up to whisper:  \"Hey, you got any crack?\"", "gilded": 0, "created_utc": "1323242258", "subreddit": "fffffffuuuuuuuuuuuu", "score": 2, "controversiality": 0}
{"body": "\"I said no god damn loch ness monster, we work hard for our money in this house.\"", "gilded": 0, "created_utc": "1323244897", "subreddit": "southpark", "score": 1, "controversiality": 0}
{"body": "&gt; What else are they going to talk about?\n\nWell that's the odd thing isn't it? Most atheists don't believe in unicorns or the loch ness monster either - but they don't have entire forums dedicated solely to discussing unicorns and nessie.", "gilded": 0, "created_utc": "1323246499", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "Downvote because your broke ass dont even gots tree fitty.", "gilded": 0, "created_utc": "1323252319", "subreddit": "WTF", "score": -5, "controversiality": 0}
{"body": "It was inspired by what we thought a human from the Paleolithic era would have done. Again, as I said it's suppose to be laid back/fun quiz.\nDon't take it too seriously I guess.\n\nWhat questions would You put it then?", "gilded": 0, "created_utc": "1323314992", "subreddit": "Paleo", "score": 2, "controversiality": 0}
{"body": "FUCK THAT. The problem with your idea is that it assumes that religion and atheism deserve equal respect, as if atheism is a sort of \"science religion\" with it's own dogma, fundamentalists, and a set of shared beliefs. This is not the case. Hitchens and Dawkins do not apply their considerable intellects to convince others to think as they do - they do it to get others to think for themselves, to not rely solely upon ancient texts at the expense of the totality of human knowledge and experience gained since. We cannot apologize for giving offense to those who would disregard the advances of humanity and give all credit to an unseen creator, who, if his word as laid down in any holy book is to be believed, is an immoral being (how can so many claim to adhere to a religion when they cherry pick from the rulebook? \"Oh God meant this and I believe it to the core of my being, but he didn't really mean to say this\"). Faith is a **bad** thing. It does **not** mean the same thing as hope or love. Faith is believing something in the face of evidence to the contrary. It is the opposite of reason. It is the enemy of common sense. I do respect the right of an individual to believe in the loch ness monster as their lord and savior if it helps them sleep at night. But I make no apologies for pointing out their foolishness. The problem is that religion (not personal spirituality, which is never bashed) and deference to it, is the #1 thing that keeps this planet from advancing into a secular, scientific, tolerant (tolerant of differences in humanity, not of ignorance) age. This shift in mindset is a requirement for the advancement of the human race as a whole. As long as people consider themselves a part of one religion, they see themselves as believing in an absolute truth, that they have the final word and all the answers. The religious see the atheist population as arrogant and elitist. It is because atheists see how religion encourages the perpetuity of ignorance and the acceptance absolute authority as the path to true happiness and everlasting life. They see people delude themselves out of a fear of death. I do disrespect religion. It is not deserving of respect. The morality we respect today (equality of women, the right to decide what happens to one's own body, respect for animals, etc.) is absent from religious texts. Many people who claim to be religious are in reality, humanist, but fail to understand where their principles actually come from. So question everything, even (especially?) what I say, because **no one** has all the answers - but for the love of GOD(!) - look into it for yourself.  Ask yourself why you believe what you believe. All the good you see as coming from your faith, does not actually require the faith. It only requires love and respect for life, which are not religious in nature.\n\n****tl;dr  Atheists must fight religion, it hurts us all****", "gilded": 0, "created_utc": "1323319821", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Heyyy, can I get tree fiddy?\n\nAll I need is tree fiddy.", "gilded": 0, "created_utc": "1323332973", "subreddit": "TwoXChromosomes", "score": 14, "controversiality": 0}
{"body": "I need about tree fiddy", "gilded": 0, "created_utc": "1323342671", "subreddit": "footballmanagergames", "score": 11, "controversiality": 0}
{"body": "I aint given you no tree fiddy you god damn Loch Ness Monster! Get your own damn money!", "gilded": 0, "created_utc": "1323345691", "subreddit": "footballmanagergames", "score": 9, "controversiality": 0}
{"body": "GODDAMN YOU LOCH NESS MONSTER", "gilded": 0, "created_utc": "1323347611", "subreddit": "TwoXChromosomes", "score": 5, "controversiality": 0}
{"body": "I ALREDDY GABE DAT MONSAH TREE FIDDY! ", "gilded": 0, "created_utc": "1323358864", "subreddit": "TwoXChromosomes", "score": 3, "controversiality": 0}
{"body": "Tree fiddy?", "gilded": 0, "created_utc": "1323362634", "subreddit": "Jokes", "score": 1, "controversiality": 0}
{"body": "Like the Loch Ness monster or North Dakota.", "gilded": 0, "created_utc": "1323364554", "subreddit": "ShitRedditSays", "score": 8, "controversiality": 0}
{"body": "Speaking of which, I need about tree fiddy", "gilded": 0, "created_utc": "1323365877", "subreddit": "ShitRedditSays", "score": -1, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1323375307", "subreddit": "personalfinance", "score": 1, "controversiality": 0}
{"body": "Also if I'm in a blurry picture I can pretend I'm Big Foot or the Loch Ness Monster.  You can't prove I don't exist!", "gilded": 0, "created_utc": "1323402685", "subreddit": "TwoXChromosomes", "score": 3, "controversiality": 0}
{"body": "tree fiddy. Works every time.", "gilded": 0, "created_utc": "1323403163", "subreddit": "Cooking", "score": 4, "controversiality": 0}
{"body": "Jesus = Loch Ness Monster.  Both have evidence that has been exposed as clearly fraudulent.\n\nEvery single word printed in the bible is total garbage.  So the credibility of anything stated within it is at a level of absolute zero.\n", "gilded": 0, "created_utc": "1323406109", "subreddit": "DebateAnAtheist", "score": 1, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1323410807", "subreddit": "WTF", "score": 9, "controversiality": 0}
{"body": "prolly cost you tree fiddy.", "gilded": 0, "created_utc": "1323422940", "subreddit": "trees", "score": 6, "controversiality": 0}
{"body": "And unicorns, ghosts, Bigfoot, Nessie, leprechauns, Harry Potter, etc, etc, etc.", "gilded": 0, "created_utc": "1323430855", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "\"tree fiddy\" FTFY", "gilded": 0, "created_utc": "1323440551", "subreddit": "WTF", "score": 5, "controversiality": 0}
{"body": "Lots of things are possible, but until I see evidence, I don't believe unicorns, dragons, leprechauns, bigfoots (bigfeet?), the loch ness monster, or alien abductions are very *probable*.\n\n", "gilded": 0, "created_utc": "1323446086", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt; blatantly obvious call back gag. \nAnd you say referencing Nessie is subtle then ? \n\nAs for the Community references - been there, seen that. If you wanna talk about HIMYM: what would you prefer. The pineapple ? The gummi bear salad ? Lily eating the Nachos ? The horn ? The umbrella ? Who's doppelganger hasn't been shown yet ?\n\nDude; I have been watching Segel and Franco from \"Freaks and Geeks\". Huge fan - have watched HIMYM from day one. And I still say that if you think HIMYM is more 'layered' than Community, then you haven't watched Community enough.", "gilded": 0, "created_utc": "1323453048", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "&gt;blatantly obvious call back gag. And you say referencing Nessie is subtle then ? \n\nIn something that's visible in only a couple of frames in the background, references a character trait that isn't explicitly stated about Marshall unless you already watch a lot of episodes. Yes it is the very definition of a subtle background gag, and layered writing. \n\nThe pineapple doesn't have some mysterious implication, the episode it's featured in explicitly states they never found out where it came from, and the writers have confirmed this is true. It's done.\n\nThe Eriksen salad isn't a ... layered joke at all? It's a little running gag but that's it.\n\nNone of these things you mentioned from HIMYM are background things, or layered writing. Maybe the umbrella, but it's still a major plot device. You have only talked about the most obvious towards the camera major episode themes. \n\nYou want another actual subtle running gag from HIMYM that's an example of layered writing? The Fish List.\n\nEarly in season 4, Marshall performs a standup routine where he just reads a list of fish names. 4 episodes later, it's mentioned again out of context by Marshall giving an impromptu performance to stall for time.\n\n3 *seasons* later, Marshall does the same thing to stall for time in a meeting for Garrison Coots.\n\nOther examples include Robin frequently uttering \"but um....\" years and years before the episode that reveals its a drinking game, and the Duckie Tie being shown in flash-forwards a year before the episode that reveals the ducky tie bet.\n\nThe constant flash forward and backward gags are a cornerstone of the show -- It's literally built around layered writing.\n\nI've watched Community just as many times as I've watched HIMYM. If you think it's more layered, you need to watch HIMYM more. In order. I doubt you've seen every episode even once, especially because you don't think all the dopplegangers have been shown...", "gilded": 0, "created_utc": "1323455122", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "Good lawd that's alot of money... how about.. I give you tree fitty, and you give me one Spaceball?", "gilded": 0, "created_utc": "1323456543", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "But it was really the Loch Ness Monster!!!!", "gilded": 0, "created_utc": "1323477366", "subreddit": "aww", "score": 5, "controversiality": 0}
{"body": "So, if we have to assume a god of a very specific definition to complete the argument. With no way to prove there is a god, much less one of your definition, what have you proven?\n\nYou are either assuming that moral objectivity exists and working to find the god that would make that possible. Or, you are assuming a specific god exists then claiming it proves moral objectivity.\n\nStart here then. Explain why moral objectivity must exist.\n\nEdit: I'm out. This argument  seems a bit like discussing how the Loch Ness Monster effects the fishing in the lake and what that means about it's eye color.", "gilded": 0, "created_utc": "1323488381", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "Methinks you have too high an opinion of the faith that it cannot be dismissed so simply. Christianity deserves no more serious a consideration than Bigfoot or the Loch Ness Monster. Truthfully speaking, nessie and bigfoot are far more probable than the literal Christ.", "gilded": 0, "created_utc": "1323512770", "subreddit": "Christianity", "score": -2, "controversiality": 0}
{"body": "I'm gon need bout tree fitty.", "gilded": 0, "created_utc": "1323537227", "subreddit": "AskReddit", "score": 21, "controversiality": 0}
{"body": "I ain't gonna give you no tree fiddy!", "gilded": 0, "created_utc": "1323537771", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Turns out it wasn't a homeless man at all. It was the gawd damn loch ness monster. And you know what he want now?", "gilded": 0, "created_utc": "1323543502", "subreddit": "AskReddit", "score": 20, "controversiality": 0}
{"body": "It's like giving that damn Loch Ness Monstah Tree Fiddy!!!", "gilded": 0, "created_utc": "1323544687", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1323546513", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "how about tree fiddy?", "gilded": 0, "created_utc": "1323548500", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "GAWD DAMN IT women I'm telling this story. He said he needed about tree fiddy.", "gilded": 0, "created_utc": "1323548522", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1323568827", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I forgot to tell y'all about tha time my wife heard a knockin' at tha door. She answered it and saw dis ginga man standin in tha doorway. He was tellin her he was about to release a comedy stand-up show. My wife loves to laugh, so she had to ask how much it was goin ta be. It was about dat time when the ginga man turned to her and said, \"It'll be about tree fiddy.\" WELL I'LL BE DAMNED IF I DIDN'T WALK IN ABOUT FIVE SECONDS LATA AND THERE WAS A GIANT LOCH NESS MONSTAH AT THE DOOR! I SAID, \"YOU GET OUTTA HERE YOU GOD DAMN LOCH NESS MONSTAH AND YOU NEVER COME BACK TRYIN' TO TRICK MY WIFE INTO GIVIN YOU TREE FIDDY.\" The Loch Ness Monstah started to walk away, but before he left, he said \"I could probably get five fo it anyway.\"", "gilded": 0, "created_utc": "1323569469", "subreddit": "funny", "score": 284, "controversiality": 0}
{"body": "Well I need about tree fitty", "gilded": 0, "created_utc": "1323573930", "subreddit": "funny", "score": 48, "controversiality": 0}
{"body": "it was at that time that i realized it wasnt the comedian louie ck but the goddamn loch ness monster ", "gilded": 0, "created_utc": "1323579906", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "That loch ness monster is getting crafty.", "gilded": 0, "created_utc": "1323581231", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "God damn Lock Ness Monster dressed up as a girl scout tryin' to steal my tree fitty!", "gilded": 0, "created_utc": "1323582332", "subreddit": "funny", "score": 15, "controversiality": 0}
{"body": "I'm gonna need about tree fiddy.", "gilded": 0, "created_utc": "1323582670", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "&gt; Tree fitty.\n\nFtfy.", "gilded": 0, "created_utc": "1323586714", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "'bout tree fitty.", "gilded": 0, "created_utc": "1323586828", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Bout tree fiddy", "gilded": 0, "created_utc": "1323588338", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "I'll take a short circuit, original, big earner, and a nessie's nine iron.", "gilded": 0, "created_utc": "1323593619", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "Just about Tree Fitty", "gilded": 0, "created_utc": "1323595954", "subreddit": "trees", "score": 3, "controversiality": 0}
{"body": "my highest rated comment is 'bout tree fitty' and i said it without knowing the context at all, and based it off a bum that asked me for change once. i then got replies about a loch ness monster that i had no idea had anything to do with my comment. i'm also very drunk and searched for 'bout tr' and your comment came up first so i decided to write this and no i will post it\n\ntl;dr also, i took a really long poop this morning because i was playing zelda on my gameboy, so you should try that! morning poop gameboy time!", "gilded": 0, "created_utc": "1323597171", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "I need about tree fitty.", "gilded": 0, "created_utc": "1323598682", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "You find me a millionaire who has ONLY 1 million dollars, and I'll show you someone who this conversation isn't really about.\n\nTheres a difference between people who make investments and make multiple millions, and people who work hard their whole life to save for 1 million dollars. Honestly if someone has done the hard work and saving approach to earn 1 million dollars saved up by retirement, that's probably not someone who should be making risky investments. That's someone who should stick to safe money. Otherwise if its someone who made a million dollars over the course of a couple years, then they will most likely have another million dollars in a comparable amount of time.\n\n\n**Edit:** BTW it sounds like you must personally know quite a few millionaires, do me a favor and ask em if i can borrow about tree fiddy", "gilded": 0, "created_utc": "1323601934", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I'll give you about tree fiddy.", "gilded": 0, "created_utc": "1323610044", "subreddit": "neopets", "score": 10, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1323610391", "subreddit": "funny", "score": -1, "controversiality": 0}
{"body": "What don't you want to give the loch ness monster? ", "gilded": 0, "created_utc": "1323625713", "subreddit": "AskReddit", "score": -3, "controversiality": 0}
{"body": "How much did the Loch Ness monster ask me for?", "gilded": 0, "created_utc": "1323627420", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Damn that loch ness monster!!  Always pulling these shenanigans.", "gilded": 0, "created_utc": "1323627959", "subreddit": "4chan", "score": 12, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1323628308", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "What kind of madman thinks the Loch Ness monster is supposed to be a crustacean?", "gilded": 0, "created_utc": "1323629868", "subreddit": "4chan", "score": 0, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1323629944", "subreddit": "gonewild", "score": 37, "controversiality": 0}
{"body": "No 5 dolla?  Ok how about tree fiddy?", "gilded": 0, "created_utc": "1323631918", "subreddit": "funny", "score": 62, "controversiality": 0}
{"body": "Right when \"tree fiddy\" came up, I starting reading in Mr. Chef's voice.\n\nDAMMIT MONSTAH! I AINT GIVEN YOU NO TREE FIDDY", "gilded": 0, "created_utc": "1323633212", "subreddit": "4chan", "score": 105, "controversiality": 0}
{"body": "This is awkward.. Just made a comment on 'tree fiddy' like an hour ago just out of nowhere.. now I read this.", "gilded": 0, "created_utc": "1323634855", "subreddit": "4chan", "score": 0, "controversiality": 0}
{"body": "I was on my way back from warped tour a few years back, and we decided to stop at this white-castle in Flint, Michigan. We walk in and everything seems fine, we start making our orders, and a group of three black men walk over. They notice my friends tattoo, of a wrist watch on his wrist, with the time set at tree fiddy. Anyways they talk to him about it, say it looks kinda cool, when suddenly a random scream is heard from behind.\n\nThere is another group of afro-americans behind us, and they seem to be having the time of their lives. Well all of them but one of the women. This woman looked at one of the men accompanying her (we will refer to him as mike) and screamed,\"WHAT'S SO FUCKING FUNNY MIKE!\" The whole group just laughed harder. The only thing running through my head was, what kind of drugs did this bitch take? \n\nShe asks mike whats so funny a few more times, still screaming the whole time. She then asks \"I WANT SOME FUCKING WATER\", she never got it. Then she walks outside, and the White-castle employees are absolutely loosing their shit, as were all my friends and the three gentlemen that were talking about my buddies watch. \n\nThen u here a pound on the one of the glass walls, and hear a familiar scream, still asking for water. Her friends dragged her away all smiling from ear to ear. Now they only reason I'm sure this woman wasn't bat shit crazy, is because she was dressed up all nice. She had a long formal looking dress, as well as heels and, her hair was done up nice.\n\nWeird shit.", "gilded": 0, "created_utc": "1323638028", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "She didnt giv em 5 dolla, that was the god damn loch ness monster.", "gilded": 0, "created_utc": "1323638293", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "We've all been in this exact same spot when we were young.\n\nDamn you for playing with my heart strings, Nessie.  Damn you to HELL.", "gilded": 0, "created_utc": "1323638483", "subreddit": "4chan", "score": 2, "controversiality": 0}
{"body": "God damn Loch Ness Monster! You ain't gettin' no tree-fiddy!", "gilded": 0, "created_utc": "1323640124", "subreddit": "funny", "score": 196, "controversiality": 0}
{"body": "Nessie", "gilded": 0, "created_utc": "1323640457", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "What did the loch ness monster ask you for?", "gilded": 0, "created_utc": "1323641419", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Bigfoot, the Loch Ness monster, ghosts, and psychics. Not a bit of solid evidence for any of them.", "gilded": 0, "created_utc": "1323642256", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "You saw it coming that his cousin was the Loch Ness Monster? Wtf are you smoking?", "gilded": 0, "created_utc": "1323642465", "subreddit": "4chan", "score": 8, "controversiality": 0}
{"body": "I ain't giving you no tree-fitty you goddamn Loch Ness monster! Get your own goddamn money!\" ", "gilded": 0, "created_utc": "1323644379", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "Oh I love the Loch Ness Monster episode, I always LOL hard at it!", "gilded": 0, "created_utc": "1323645180", "subreddit": "funny", "score": -1, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1323645804", "subreddit": "nfl", "score": 2, "controversiality": 0}
{"body": "NO GODDAMNIT LOCH NESS MONSTER GET YOUR OWN TREE-FITTY!", "gilded": 0, "created_utc": "1323645873", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "You wouldnt happen to be the loch ness monster would you?", "gilded": 0, "created_utc": "1323645911", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "and then *she* gives him a dollar!\n\n\nWhy you givin' the loch ness monster a dollar, it's just gunna want more now!", "gilded": 0, "created_utc": "1323646037", "subreddit": "funny", "score": 195, "controversiality": 0}
{"body": "Ok, Can someone help me please? I like to think of myself as pretty reddit-literate, but for the life of me I can't figure out this new meme. What does the loch ness monster have to with tree-fiddy?", "gilded": 0, "created_utc": "1323646186", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "He's just gonna keep askin' for another tree fiddy!", "gilded": 0, "created_utc": "1323646211", "subreddit": "funny", "score": 26, "controversiality": 0}
{"body": "God damn Loch Ness Monster! You ain't gettin' no free-titty!", "gilded": 0, "created_utc": "1323646427", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "LOCH NESS MONSTER NEED MOH MONEH FOH MICKAWEBIA!", "gilded": 0, "created_utc": "1323646634", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Chefs parents explain about the time they met the Loch Ness Monster\n\nhttp://www.streamsouthpark.com/2011/11/30/3-fiddy/", "gilded": 0, "created_utc": "1323646930", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Nessie, old friend!", "gilded": 0, "created_utc": "1323646936", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "What is the origin of the \"tree fiddy\" meme?", "gilded": 0, "created_utc": "1323647397", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "No, the Loch Ness Monster. He was about to kick yo' ass!", "gilded": 0, "created_utc": "1323647472", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "[This is a picture of a blur, out of focus Loch Ness Monster caressing its breasts as it lays seductively on the shore](http://i.imgur.com/6H1XX.jpg \"the trick is to cross your eyes before you masturbate. Then again, that's my solution for every optical illusion ...probably why I'm not allowed into most city libraries.\") - **NSFW**", "gilded": 0, "created_utc": "1323647476", "subreddit": "funny", "score": 230, "controversiality": 0}
{"body": "What's tree fitty?", "gilded": 0, "created_utc": "1323647568", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I would like to see you do a Loch Ness monster impersonation in the bathtub, but I can only give you about three-fiddy..", "gilded": 0, "created_utc": "1323647957", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1323648142", "subreddit": "AskReddit", "score": 42, "controversiality": 0}
{"body": "When I got to the Lake Tess part of Earthbound, I told myself I wouldn't give Tessie no tree fiddy.", "gilded": 0, "created_utc": "1323648320", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Tree fitty?", "gilded": 0, "created_utc": "1323648396", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "What's this \"tree fitty\" stuff about? Scots can pronounce \"th\"s, you know.", "gilded": 0, "created_utc": "1323648971", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "tree fitty", "gilded": 0, "created_utc": "1323649249", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "The thing I've always liked about that famous photo of the Loch Ness Monster is that there is absolutely no way that it could simply be the image of a submerged human sticking his/her arm out of the water.", "gilded": 0, "created_utc": "1323650116", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Damn you Loch ness Monster!!!!!!", "gilded": 0, "created_utc": "1323650281", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Well no *wondah* the loch ness monstah keep comin' back nyow if you keep givin 'um tree fiddy!", "gilded": 0, "created_utc": "1323650932", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "You better not give that monsta tree fitty", "gilded": 0, "created_utc": "1323651013", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "God.  This line is so much funnier than the tree fiddy part.", "gilded": 0, "created_utc": "1323651087", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "loch ness monster", "gilded": 0, "created_utc": "1323651741", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "It's 12/11/11. The front page features Louis CK asking for about $5, Loch Ness Monster asking for about $tree fifty, some pretentious dude on facebook and if I'm not mistaken this phenomena will be on the frontpage in about 5 minutes. I would post it and reap all that sweet karma, but I'm too lazy.", "gilded": 0, "created_utc": "1323652015", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "The Loch Ness Monster, so I can finally give him his tree-fiddy.", "gilded": 0, "created_utc": "1323652546", "subreddit": "AskReddit", "score": 13, "controversiality": 0}
{"body": "That's the Loch Ness Monster!", "gilded": 0, "created_utc": "1323652547", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "south park, the episode where chef almost marries a woman who turns out to be a succubus. kyle, stan and them go to chef's parents and chef's dad tells the story about the loch ness monster...a few times throughout the episode. \n\nedit: it has all of it:\nhttp://www.youtube.com/watch?v=4qcbgclG4_A", "gilded": 0, "created_utc": "1323653427", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "What's tree fiddy? \n", "gilded": 0, "created_utc": "1323653911", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "I was going to ask someone to rule34 this comment, but then I realized it already has been. The naked Loch Ness Monster is the rule34 of Limitedcomment's fantasy. ", "gilded": 0, "created_utc": "1323655245", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "\"Say, would you crackers like to hear about the time we met the Loch Ness Monster?\" ", "gilded": 0, "created_utc": "1323656338", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "[Loch Ness Monster bus hot tub party!](http://i.imgur.com/IpnTV)", "gilded": 0, "created_utc": "1323656778", "subreddit": "Seattle", "score": 3, "controversiality": 0}
{"body": "Wish I had more upvotes. Not because this was a particularly good episode (it wasn't), but because I've had \"tree fitty\" in my head for several days. I find myself laughing in the shower, at court etc.", "gilded": 0, "created_utc": "1323658164", "subreddit": "funny", "score": -1, "controversiality": 0}
{"body": "Atlas Shrugged....Then the Loch Ness monster pressed him for some change. ", "gilded": 0, "created_utc": "1323658936", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "So if he lets you die, it's free advertising.  And he'll get the sum of your possessions and assets to add to HL3 funding.  Score! An extra tree fiddy!", "gilded": 0, "created_utc": "1323659067", "subreddit": "gaming", "score": -2, "controversiality": 0}
{"body": "Oddly, my personal story about why I donated to Wikipedia *did* involve Jimmy Wales being the Loch Ness Monster.", "gilded": 0, "created_utc": "1323660416", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Tree fiddy!", "gilded": 0, "created_utc": "1323661246", "subreddit": "keto", "score": 5, "controversiality": 0}
{"body": "so...how bout dat tree fiddy?", "gilded": 0, "created_utc": "1323665970", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I'm gonna need about tree fiddy.", "gilded": 0, "created_utc": "1323681379", "subreddit": "skyrim", "score": 4, "controversiality": 0}
{"body": "Puff the Magic Dragon is the Loch Ness Monster?", "gilded": 0, "created_utc": "1323697946", "subreddit": "4chan", "score": 1, "controversiality": 0}
{"body": "I could tell ya, but\n\n\nI'm gonna need about tree fiddy", "gilded": 0, "created_utc": "1323709148", "subreddit": "badphilosophy", "score": 3, "controversiality": 0}
{"body": "But I need about tree fiddy!!!", "gilded": 0, "created_utc": "1323710771", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Well fuck, 5 minutes and it has already been shitstormed.\n\nIf you get a chance to answer, it is not meant to be a troll/beating a dead horse joke question.\n\nIf you got about tree fiddy from somewhere, what would you do with it?", "gilded": 0, "created_utc": "1323710921", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Imma need about tree fitty.", "gilded": 0, "created_utc": "1323711569", "subreddit": "Drugs", "score": -2, "controversiality": 0}
{"body": "Eye-witness testimony, even when corroborated by more than one person, is often faulty. First of all, we can't trust our perception. We can hallucinate, we can be subject to optical illusions, etc. Second, our memory tends to be even worse. Our memories can change and alter almost instantly after being stored. We remember things wrong, it distorts over time, we add things, sometimes we create entire memories based on stories people have told us or out of thing air.\n\nSo what this boils down to is, just because people claim to have seen ghosts (or aliens, or the loch ness monster, or god), that is not evidence for their existence.\n", "gilded": 0, "created_utc": "1323718872", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "truly heartless/ignorant? \n\nSo it's okay he might've killed people or made their life miserable as hell because of some stupid shit he believed in, but if he comes on camera and says, \"Oops my bad, I messed up in life, but IT WASNT MY FAULT AT ALL! It was all my upbringing and everyone's else fault I turned out like this! So I need about tree fiddy to get these tats removed!\"\n", "gilded": 0, "created_utc": "1323723479", "subreddit": "offbeat", "score": 0, "controversiality": 0}
{"body": "This came out to be about tree fiddy.", "gilded": 0, "created_utc": "1323724500", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "Unless it was only a spider in disguise.  If he asks for tree fiddy, watch out!  It may not be a spider after all!", "gilded": 0, "created_utc": "1323729044", "subreddit": "trees", "score": 9, "controversiality": 0}
{"body": "The thing is, he needs about tree fitty.\n\nBtw, thank you for starting that mail thing at opt out.", "gilded": 0, "created_utc": "1323729157", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "He needs about tree fitty.", "gilded": 0, "created_utc": "1323730986", "subreddit": "pics", "score": -12, "controversiality": 0}
{"body": "i will give you about tree fiddy", "gilded": 0, "created_utc": "1323731271", "subreddit": "skateboarding", "score": 2, "controversiality": 0}
{"body": "He needs about tree fitty.", "gilded": 0, "created_utc": "1323731412", "subreddit": "pics", "score": -17, "controversiality": 0}
{"body": "i willl give you about tree fiddy for that boot", "gilded": 0, "created_utc": "1323731498", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "i willl give you about tree fiddy for that boot", "gilded": 0, "created_utc": "1323731558", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "he needs about tree fiddy.", "gilded": 0, "created_utc": "1323731563", "subreddit": "IAmA", "score": 40, "controversiality": 0}
{"body": "There is no evidence ***against*** p.\nTherefore, p.\n\nExamples:\nThere are no evidence that the Loch Ness monster exists.\nTherefore the Loch Ness monster ***most likely doesn't*** exist.\n\nThat is logical.\n\nThere are no evidence that the Loch Ness monster ***does not*** exist.\nTherefore the Loch Ness monster ***does*** exist.\n\nThis is illogical.\nEdit: Added examples.", "gilded": 0, "created_utc": "1323733294", "subreddit": "atheism", "score": 10, "controversiality": 0}
{"body": "This post isn't \"It's shit like this, women\" and something so random (like turning into the Loch Ness Monster prostituting itself for three fitty) that the title is the joke.  Being randomly compared to that Facebook girl irritates me to no end.", "gilded": 0, "created_utc": "1323733335", "subreddit": "funny", "score": 7, "controversiality": 0}
{"body": "Thought this was gonna end with \"I need about tree fiddy\"", "gilded": 0, "created_utc": "1323741881", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "The Loch Ness Monster comes as a sixth playable class, only available through DLC which costs only tree-fiddy.", "gilded": 0, "created_utc": "1323743868", "subreddit": "Games", "score": 16, "controversiality": 0}
{"body": "He only needs about tree fiddy.", "gilded": 0, "created_utc": "1323744397", "subreddit": "IAmA", "score": 0, "controversiality": 0}
{"body": "I need about tree fiddy :~)", "gilded": 0, "created_utc": "1323746043", "subreddit": "battlefield3", "score": 4, "controversiality": 0}
{"body": "Now.\n\nThat's always the bit that confuses me with Atheists. I self-identify as an agnostic (I've learned I'm probably a \"Deist\" since I came to Reddit ,but I don't grasp the full scope of the term, so I still call myself Agnostic) because I'm willing to accept that possibly there is some higher power out there and we just haven't found them yet.\n\nThen I see the Atheists in /r/atheism berating believers for their \"fairy tales\" and figuring out ways to basically humiliate people over their beliefs, and all I can imagine is Galileo under house arrest for theorizing that the Earth went around the Sun. Or Christopher Columbus being laughed out the Spanish Court (with the happy Bugs Bunny childhood memories \"The world, she's-a flat like-a you head!\"), or even Schrodinger trying to embarrass quantum theorists by making up as story about a mostly-dead Cat.\n\nThere is no evidence the Loch Ness monster does not exist, therefore, there is a **non-zero possibility** that the Loch Ness monster does exist.", "gilded": 0, "created_utc": "1323746627", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "But in all likely-hood, Nessie probably doesn't exist, and we should stop wasting money &amp; time looking for her, and we should probably stop killing nonbelievers and Bigfootists, and invest more in empirical research and real actual not imaginary things.\n\nAlso, http://en.wikipedia.org/wiki/Theological_noncognitivism", "gilded": 0, "created_utc": "1323749686", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "I'll give you tree fiddy.", "gilded": 0, "created_utc": "1323749780", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "The problem with accepting both is that it seems to reflect negatively on self-described atheists, even when there's actually no fundamental difference in belief, or even no difference at all other than semantics.\n\nTypical theist reaction to an agnostic: \"Good for you! You've got an open mind, and you must be a deep thinker. Hey, maybe you'll change your mind!\" Same kind of thing for \"seeker.\"\n\nTypical theist reaction to an atheist: \"You know you're going to hell, right? You must have a God-shaped hole in your heart, because you hate Jesus so much, you sinner! You're no son/daughter of mine!\"\n\nIt doesn't help when they can say \"But why couldn't you just be an agnostic?\"\n\nAnd frankly, it feels like a cop-out. We don't tend to describe ourselves as agnostic (whether theist or atheist) with respect to other claims:\n\n- Do you believe in faeries?\n- No.\n- Ghosts?\n- No.\n- The Loch Ness Monster?\n- No.\n- Zeus?\n- No.\n- Shai'hulud?\n- What's that?\n- The giant worms of Arrakis, worshiped as gods by the Fremen...\n- The what of the who now?\n- It's from Dune.\n- Oh... no.\n- Scientology?\n- No.\n- Thor?\n- No.\n- Unicorns?\n- Depends. Some rhinos are called unicorns...\n- I mean horses with horns.\n- Nope.\n- Homeopathy?\n- No.\n- Odin?\n- No.\n- God? Allah? Yahweh? Adonai?\n- I'm more agnostic...\n\nTechnically, there are a number of these other claims that I might be agnostic to. Unicorns and faeries at least seem consistent with the laws of physics, for example, and they certainly could be hiding somewhere on Earth that we haven't fully explored yet. God seems much less plausible, and I think many \"agnostics\" would agree.", "gilded": 0, "created_utc": "1323760451", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "I thought he did it for tree fiddy.", "gilded": 0, "created_utc": "1323762487", "subreddit": "circlejerk", "score": 1, "controversiality": 0}
{"body": "what it come down to is he need about tree fitty ", "gilded": 0, "created_utc": "1323768658", "subreddit": "trees", "score": 9, "controversiality": 0}
{"body": "15? That nice man down the block wanted me to buy an album from him for tree fiddy... wait a minute.", "gilded": 0, "created_utc": "1323771753", "subreddit": "AdviceAnimals", "score": 2, "controversiality": 0}
{"body": "God dammit loch ness monster, I aint gonna give you no tree fiddy.\n\nAlso - Gingers.", "gilded": 0, "created_utc": "1323777509", "subreddit": "SouthParkRPG", "score": 3, "controversiality": 0}
{"body": "I'll do it for tree fiddy.", "gilded": 0, "created_utc": "1323785888", "subreddit": "science", "score": 4, "controversiality": 0}
{"body": "God dammit monster you ain't gettin' no tree fiddy!", "gilded": 0, "created_utc": "1323786491", "subreddit": "science", "score": 3, "controversiality": 0}
{"body": "I probably should pay it forward. It looks like the original mirror is down, but here's a link to the album http://www.amazon.com/gp/product/B000000SYG/ref=olp_product_details/192-7885094-1922258?ie=UTF8&amp;me=&amp;seller=\n\nIf preferred, I can find some way to upload it however.\n\nEDIT: The album picture is incorrect, as is the title. However the songs, and the album you get are correct. I swear this band is the goddamn Loch Ness Monster. I learned the edited information from where I found the link, http://peteandpete.livejournal.com/201357.html", "gilded": 0, "created_utc": "1323788154", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1323790460", "subreddit": "IAmA", "score": -1, "controversiality": 0}
{"body": "But c'mon man... I just need about tree fiddy.", "gilded": 0, "created_utc": "1323790637", "subreddit": "IAmA", "score": -1, "controversiality": 0}
{"body": "I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!", "gilded": 0, "created_utc": "1323791031", "subreddit": "IAmA", "score": 302, "controversiality": 0}
{"body": "- Well I gave him tree fiddy just last week.\n\n- God, DAMNIT woman, dats why he keep on comin back!", "gilded": 0, "created_utc": "1323792354", "subreddit": "IAmA", "score": -3, "controversiality": 0}
{"body": "I said \"we'll take a box of the graham crunch. How much will that be?\" Well she looked at me and said \"That'll be about tree fiddy.\" Well it was about this time I noticed that this girl scout was about 8 stories tall and was a crustacean from the protozoic era!", "gilded": 0, "created_utc": "1323793407", "subreddit": "IAmA", "score": 7, "controversiality": 0}
{"body": "Wikipedia is going to shut down all servers in protest!\n\n    But we still need those donations. We need about tree fiddy. ", "gilded": 0, "created_utc": "1323793823", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "damn it loch ness monster i aint givin you no tree fitty!", "gilded": 0, "created_utc": "1323795047", "subreddit": "IAmA", "score": 0, "controversiality": 0}
{"body": "How about tree fiddy?", "gilded": 0, "created_utc": "1323795357", "subreddit": "AskReddit", "score": 25, "controversiality": 0}
{"body": "&gt;tree fiddy\n\nFTFTFY", "gilded": 0, "created_utc": "1323795654", "subreddit": "IAmA", "score": 325, "controversiality": 0}
{"body": "Goddamn Loch Ness monster", "gilded": 0, "created_utc": "1323797078", "subreddit": "AskReddit", "score": 16, "controversiality": 0}
{"body": "Ah, the **\"**History**\"** Channel, full of aliens, ghosts, big-foot and the Loch Ness monster.", "gilded": 0, "created_utc": "1323799154", "subreddit": "skeptic", "score": 8, "controversiality": 0}
{"body": "Tree fitty.", "gilded": 0, "created_utc": "1323799263", "subreddit": "offbeat", "score": 23, "controversiality": 0}
{"body": "Oh you tricky Loch Ness Monstah!  \n\nTL;DR Never give a Loch Ness Monster $3.50.  They will just keep coming back for more.", "gilded": 0, "created_utc": "1323799417", "subreddit": "IAmA", "score": 18, "controversiality": 0}
{"body": "so did my ex gf bitch was crazy... kept asking my for tree fiddy", "gilded": 0, "created_utc": "1323802389", "subreddit": "IAmA", "score": -2, "controversiality": 0}
{"body": "can I have some personal contact info? \nbang any sluts?\nwhat can i get in Madrid for about tree fiddy?", "gilded": 0, "created_utc": "1323802588", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "I think it's a simplification of a complicated problem.  He points out Man's unique ability to outwit predators and to shape the biomass to his will, and defends his nature to do so.  But there are certainly more implications of how this affects our culture rather than just our survivability.\n\nThere's the issue concerning the entire world infrastructure being based on the promotions of greed, and though it provides necessities to a world market, we are also pumping a dizzying amount of layered complexity that has become so dominant that it has drastically affected our culture, for better or worse.  We're not like we were in the paleolithic era; we're not just taking what we need to survive, we're taking everything that we want.\n\nThe fact is that we can't make it in this world without contributing to this complexity or by pumping more products in a world seemingly saturated with secondary materials and services.  We're advancing just for the sake of advancing.  We're driving the gears of the emerging technological supersystem, happily chasing the arts tied to a fishing pole on our heads.  \n\nHow then should we live?  Some say that a return to nature is an abandonment of a modern addiction to the enrichments and luxuries of technology.  A return to nature is to be free from the opaque complexities of consumer culture where personal experiences are only secondary to the work we give to produce our luxuries.  \n\nA return to nature is hazardous, difficult, and some say infeasible and just foolish.  But if happiness is the end-goal of a self-conscious species, then the inifinite advancement of technology will only enrich us until we become bored wanderers of the universe.  Perhaps a return to nature, the primitivist perspective with its roots in philosophy rather than utility, will offer a better path to that end goal of happiness if that is our desired direction.  My concern is that we're not focusing on a direction, but are merely bound to some cultural pattern, driven by its luxuries but ignorant of its implications.\n", "gilded": 0, "created_utc": "1323802861", "subreddit": "bestof", "score": 18, "controversiality": 0}
{"body": "Exactly. Did you know that the CIA has secret prisons? AND THE LOCH NESS MONSTER LIVES IN MY BASEMENT!\n\nJesse Ventura is nothing more than a showman, using your justified paranoia to write his paycheck.", "gilded": 0, "created_utc": "1323803223", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "what is your stance on lgbt rights?\nwhat is the best x-mas gift I can give that costs about tree fiddy?", "gilded": 0, "created_utc": "1323803377", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "can i borrow tree fitty?", "gilded": 0, "created_utc": "1323803395", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Can I have about... tree fiddy?", "gilded": 0, "created_utc": "1323803502", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "they gonna need at least tree fitty", "gilded": 0, "created_utc": "1323803567", "subreddit": "guns", "score": 1, "controversiality": 0}
{"body": "I gave it to that damn Loch Ness monster who keeps pestering me for cash so he'd finally go away!\n\n", "gilded": 0, "created_utc": "1323806195", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "That's nothing, This crustacean from the paleolithic era has been asking me for a sum of money just under 4$ for YEARS now", "gilded": 0, "created_utc": "1323807690", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Really? Only Tree Fiddy?", "gilded": 0, "created_utc": "1323809154", "subreddit": "skyrim", "score": 5, "controversiality": 0}
{"body": "this will probably get buried in the comments but,\nI was working in customer service at a best buy and a little old lady comes up to me with an opened pack of batteries and complained that they were defective, I said that I would be happy to refund her the $1.75 that she spent, but then she said that best buy had a policy where we would give back twice the money if a product was defective, I told her that she was mistaken. she proceded to get incredibly angry and asked to speak with my manager. I called my manager over and he told her exactly what i told her we could only give her $1.75 and not  double the money. The lady got even angrier and began to curse at me and my manager. It was at this point that I realized the customer wasn't no little old lady, it was a giant crustacean from the paleolithic era, I said DAMNIT MONSTER I AIN'T GIVEN YOU NO TREE FIDDY", "gilded": 0, "created_utc": "1323811003", "subreddit": "AskReddit", "score": 93, "controversiality": 0}
{"body": "And It was 'bout that time I noticed that was no guard, it was a god damned crustacean from the paleolithic era. ", "gilded": 0, "created_utc": "1323811601", "subreddit": "skyrim", "score": 6, "controversiality": 0}
{"body": "&gt;We're not like we were in the paleolithic era; we're not just taking what we need to survive, we're taking everything that we want.\n\nYou make it sound like we were once humble creatures that lived without vanity. ", "gilded": 0, "created_utc": "1323813028", "subreddit": "bestof", "score": 1, "controversiality": 0}
{"body": "I coulda tole 'em dat for tree fiddy.", "gilded": 0, "created_utc": "1323813827", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "I've never seen a zipper on the back of a jpg before this one. This shit makes that Loch Ness monster picture seem authentic.", "gilded": 0, "created_utc": "1323816217", "subreddit": "ShitRedditSays", "score": 4, "controversiality": 0}
{"body": "I was working as usual over at the whale tank. I had just finished feeding Mushu when a park patron walked up to me yelling about how one of our coffee machines had broken and taken his money without giving him his coffee. He demanded that I give him a refund. Our coffees were only 3 dollars and everyone on Earth had just gotten a 300 dollar tax rebate from Nixon, so I was already pissed off that this guy was making a big deal over it. I told him I was a whale handler and that I had nothing to do with the coffee machines. This just made the prick angrier, and he demanded I pay him back MORE than he lost. So just to get him off my back, I gave up and asked him how much he wanted. He said he was gonna need about $3.50. Well it was about this time that I noticed this whale enthusiast was about eight stories tall and was a crustacean from the paleolithic era! And I said DAMMIT MONSTER YOU AIN'T GETTING MY TREE FIDDY!", "gilded": 0, "created_utc": "1323817106", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "Goddamn you Loch Ness Monster!", "gilded": 0, "created_utc": "1323817818", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "I get that you didn't like the weak tree fiddy joke, but where's the second Futurama episode? I only referenced the rebate episode. ", "gilded": 0, "created_utc": "1323818310", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Again, according to Cordain, you shoudln't be adding more sodium salts to your diet- as typically it is in abundance in what we eat. Potassium is the one that needs to increase and balance out with the sodium. In the paleolithic era Potassium would have been eaten in higher quantities.\nHaving said that- I still add a little. Better than sugar!", "gilded": 0, "created_utc": "1323818682", "subreddit": "Paleo", "score": 1, "controversiality": 0}
{"body": "Wow, that's really cool. Although you should spoiler tag this, I am not that far in the game and didn't realise the Loch Ness Monster was in it :(", "gilded": 0, "created_utc": "1323821517", "subreddit": "skyrim", "score": 18, "controversiality": 0}
{"body": "You would have about tree fiddy.", "gilded": 0, "created_utc": "1323824093", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Actually it would go something more like this:\n\"  Now, as a former NAVY SEAL DEMOLITIONS SPECIAL OP PATRIOT SUPER SOLIDER, I know our government pretty well.  Did you know that the CIA has secret prisons? As a veteran, I find this especially offensive.  AND THE LOCH NESS MONSTER LIVES IN MY BASEMENT!\"", "gilded": 0, "created_utc": "1323825058", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I need about tree fitty", "gilded": 0, "created_utc": "1323826504", "subreddit": "circlejerk", "score": 3, "controversiality": 0}
{"body": "tree fitty", "gilded": 0, "created_utc": "1323828023", "subreddit": "skyrim", "score": 0, "controversiality": 0}
{"body": "Haha like trying to see Nessie... :P", "gilded": 0, "created_utc": "1323828100", "subreddit": "Scotland", "score": 1, "controversiality": 0}
{"body": "DAMN YOU LOCH NESS MONSTER", "gilded": 0, "created_utc": "1323828692", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I once had a bus driver in high school; a short, round black man. We convinced him to say tree fiddy on the bus coming home from school one afternoon. He was confused but obliged, and we realized he had the exact same voice as Chef's dad. Had a newfound respect for him after that.", "gilded": 0, "created_utc": "1323833328", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "\"tree fiddy\"\n\nYou betchya, red rider.", "gilded": 0, "created_utc": "1323834061", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Quick someone give him tree fiddy!", "gilded": 0, "created_utc": "1323835672", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "You know how much I need to feel rich?  About tree fiddy.", "gilded": 0, "created_utc": "1323838633", "subreddit": "Frugal", "score": 1, "controversiality": 0}
{"body": "I used to work for a rather large electronics chain in the stock room. One day, a transfer request came and I needed to drive a pretty big amount of merchandise to one of our sister stores about 60 miles away. I was willing to take my own car, but company policy dictated that we had to use their run-down van.\n\nSo I'm right at the \"point of no return,\" about halfway between our store and theirs, with about $5k worth of merchandise in the back of this horribly dilapidated cargo van, when we hit a patch of construction. It's all stop-and-go for like the next 3 miles. I'm hot. I'm stuck. The radio only gets three stations, and they all suck. And just when I think my luck couldn't get any worse, the guy behind me hits the van. Yes, he was on the phone.\n\nThe thing I remember most was the sound of the flat screen TV popping. I slowly pulled off to the shoulder and got out to survey the damage, when he runs up out of the car (notice I said \"runs\" here - he seemed perfectly healthy) and starts screaming about whiplash and neck/back injuries. He's literally hopping up and down with a bunch of eyewitnesses.\n\nHe notices the logo on the van and on the nametag and he starts saying he's going to sue the company and I for everything we're worth. I asked him what I could do to help. He looked at me and said, \"I need about tree fiddy.\"\n\nWell, it was about that time that I notice the dude was about eight stories tall and was a crustacean from the protozoic era. It was the Loch Ness monster. I said, \"damn it, monster, I ain't givin' you no tree fiddy.\"", "gilded": 0, "created_utc": "1323839034", "subreddit": "AskReddit", "score": -3, "controversiality": 0}
{"body": "I too am a science nut. But it's almost a smoke screen in this case. A distraction that keeps from you getting to the real issue which is theists have no actual evidence that their god is real and not imaginary.\n\nSame thing with religious texts. Pointless arguing about books who's veracity has not been proven.\n\nI compare it to arguing about the eye color of the Loch Ness Monster. You have to first proves the monster exists or it's just a waste of time.\n\nIt all fits together with agnostic atheism in my view. But if these ideas help you then use them as you wish.", "gilded": 0, "created_utc": "1323841776", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I think they at least have some application in what I'm trying to accomplish (now if only I knew exactly what that was.) Oddly, I would say the odds of the Loch Ness monster are significantly higher than those of God. Plesiosaurs, after all, really existed... at least for a while.", "gilded": 0, "created_utc": "1323842772", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Ness cures blind. Tree fiddy.", "gilded": 0, "created_utc": "1323843748", "subreddit": "fffffffuuuuuuuuuuuu", "score": -3, "controversiality": 0}
{"body": "Tree fiddy cures Lochness.", "gilded": 0, "created_utc": "1323843902", "subreddit": "fffffffuuuuuuuuuuuu", "score": -1, "controversiality": 0}
{"body": "Yup. Even the Loch Ness monster adopted that method, more effective than killing people and taking their money.", "gilded": 0, "created_utc": "1323856335", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "He just really needs that tree fiddy.", "gilded": 0, "created_utc": "1323856403", "subreddit": "skyrim", "score": 1, "controversiality": 0}
{"body": "Avoid the Loch Ness Monster, all he does is ask for handouts.", "gilded": 0, "created_utc": "1323856664", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "The Loch Ness Monster because I've seen people who could pass for Bigfoot.", "gilded": 0, "created_utc": "1323857730", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Probably the Loch Ness Monster. Big foot would almost certainly be taken out of his/it's habitat whereas I think there is a good change Nessie would be allowed to stay put.", "gilded": 0, "created_utc": "1323860905", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "He only wanted tree fiddy :(", "gilded": 0, "created_utc": "1323865154", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "GODDAMNIT STUDIO EXECS! You know if you give 'im tree fiddy davidkarlak's just gonna keep comin' back fo more!", "gilded": 0, "created_utc": "1323865226", "subreddit": "movies", "score": 2, "controversiality": 0}
{"body": "I'll give you about tree fiddy.", "gilded": 0, "created_utc": "1323880483", "subreddit": "longisland", "score": 3, "controversiality": 0}
{"body": "I believe that's pronounced \"tree fitty\" ", "gilded": 0, "created_utc": "1323893306", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "First, that's not the correct formulation of Occam's razor. The notion of _simplest_ can be very nuanced. A better formulation is to select among competing hypotheses that which requires the fewest new assumptions.   \n\nAnyway, your applicaiton is a poor one. That your preferred hypothesis is the simplest is only because the whiole thing was framed to deliberately make it the simplest. \n\n&gt;It's a more far-fetched to think that people invented him as a construct years after his supposed death. What's the motive for doing this? \n\nBut that is not the only other possibility.  We have legends of the Loch Ness monster, bigfoot, Yeti, the chupacabra, alien abduction, et cetera et fucking cetera that many people believe.  The time was rife with messiahs wandering around, had been that way for a long time.  It  seems more likely that the legends of Jesus arose out of several of those.  We know how urban legends arise and they usually have no factual basis at all.  \n\nLet's apply the razor in Bertrand Russell's version. \"\"Whenever possible, substitute constructions out of known entities for inferences to unknown entities.\" Looked at that way the \"simplest\" explanation is that Jesus is an urban legend.  ", "gilded": 0, "created_utc": "1323897902", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "I think I need about... tree fitty?", "gilded": 0, "created_utc": "1323902202", "subreddit": "redditguild", "score": 1, "controversiality": 0}
{"body": "god dam loch ness monster! o wait...", "gilded": 0, "created_utc": "1323907387", "subreddit": "redditguild", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1323908207", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "First of all, definitions.\n\nTheism, which covers things like Christianity, Islam, and Hinduism, is a belief in a god or gods.\n\nAtheism, then, is the opposite of this. It is not, as many theists would claim, a belief that there is no god or gods. Some atheists believe this, others aren't sure. But in it's most basic definition, atheism is simply the lack of belief in a god or gods. For example, I am an atheist in respect to all gods, and you are an atheist in respect to all but the Christian God (And Jesus and the holy spirit, depending on your beliefs of whether or not the three are separate entities).\n\nYou may also hear the word 'agnostic' tossed around. This, in it's most basic definition, means that the person is not sure whether a god exists or not. This has nothing to do with what they believe, however, and therefore, agnostics can be atheist or theist.\n\nNo, as to why atheists exist. To answer this, it would be best to look at why you believe in your god. In the most likely case, you were raised to believe. Another possibility is that you were converted at some point in your life. What will be consistent no matter what your journey to faith is that you do not believe in any of the gods other than the one promoted by your religion. We do not believe in your god or Jesus for the same reasons that you do not believe in Allah, Krishna, Odin, Mithra, or Quetzalcoatl.\n\nBut, in all fairness, this doesn't really answer your question to the fullest extent. Think of any 'paranormal' creature that you don't believe in. Make it one that is, at least, fairly plausible to you. Aliens, Big Foot, the Loch Ness Monster, or ghosts. But make sure it's something that you don't believe, at least not yet. Now, imagine that I'm trying to convince you that they're real. I could present a book written about them, like the bible for the Christian God. We don't accept the bible as proof just as you wouldn't accept a book of ghost stories or a book of UFO sightings as proof of ghosts or aliens. Now if I were to tell you that, personally, I've felt presences or seen things, and that means you should believe it? You would answer no, because those things haven't happened to you. This is why the vast majority of us are atheists. We do not believe in your god because we don't see an actual reason to.\n\nGood luck in your search, my friend. I'm more than happy to answer any questions you need to have answered, to the fullest of my abilities.", "gilded": 0, "created_utc": "1323909331", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Hmmm, I have not read the Bible, Quran, or anything like that.  On the other hand I have not read books on alchemy, astrology, homeopathy, loch ness monster, or big foot either.\n\nI think you should approach it like you would any book of fiction.  For me, I try to limit my reading to topics I think will interest me (being important is implicitly in this category), and religious texts are not among them.", "gilded": 0, "created_utc": "1323916321", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Hey, I need about tree fiddy.", "gilded": 0, "created_utc": "1323922252", "subreddit": "Libertarian", "score": 15, "controversiality": 0}
{"body": "I need about tree fiddy", "gilded": 0, "created_utc": "1323925853", "subreddit": "BrownBares", "score": 3, "controversiality": 0}
{"body": "I think that goddamn loch ness monster is finally gonna get my tree fiddy.", "gilded": 0, "created_utc": "1323928123", "subreddit": "politics", "score": 11, "controversiality": 0}
{"body": "Bout tree fiddy", "gilded": 0, "created_utc": "1323937021", "subreddit": "soccer", "score": -2, "controversiality": 0}
{"body": "Go away, I'm not gonna give you tree fiddy!\n", "gilded": 0, "created_utc": "1323940253", "subreddit": "skyrim", "score": 75, "controversiality": 0}
{"body": "And then he said \"I ain't giving you no tree-fitty you goddamn Loch Ness monster!\"", "gilded": 0, "created_utc": "1323954743", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "Wait...there are *real* women. I thought they were just a myth, like the loch ness monster or south Dakota", "gilded": 0, "created_utc": "1323955701", "subreddit": "funny", "score": 8, "controversiality": 0}
{"body": "id give her tree fiddy to suck my balls\n", "gilded": 0, "created_utc": "1323956138", "subreddit": "nsfw", "score": 3, "controversiality": 0}
{"body": "God dammit, Loch Ness monster! I ain't givin' you no tree-fiddy!", "gilded": 0, "created_utc": "1323961232", "subreddit": "skyrim", "score": 20, "controversiality": 0}
{"body": "\"Hi, I need about tree fiddy.\"", "gilded": 0, "created_utc": "1323966615", "subreddit": "skyrim", "score": 3, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1323966877", "subreddit": "nsfw", "score": 3, "controversiality": 0}
{"body": "In high school, I was part of a club called “Best Buddies.”  For those of you who didn't have this club at your school, it's basically a mentoring/buddy program where students partner up with special needs and mentally handicapped students.  So one day, my school had the brilliant idea to ask our club to sing the National Anthem at an assembly.  Let's think about this for a second...my school, or the administrators at least, wanted the most mentally incapable people to sing what is considered the most difficult song in the American canon.  I'm not saying mentally handicapped can't sing (Timmy wasn't so bad in The Lords of the Underworld after all), but let's just say my expectations weren't so high.  \n\nFast forward to rehearsal.  We start singing.  All is going well.  I am calm and collected.  Focused.  We get as far as “By the dawn's early light,” when suddenly, a wild student with downs syndrome appears, and unleashes the loudest grunt/moan mankind has heard since the paleolithic era.  He continued to do this every other line.  I laughed so hard I cried, covered my face, and ran out the door.  I blamed it on my extreme patriotism.  Oh.  And the assembly? Yeah, I'm sure you can guess how that went. And now I descend to hell to stick pineapples up Hitler's anus.  \n\ntl;dr I lost my shit when singing the Star Spangled Banner with a group of mentally handicapped kids because of a grunting downs syndrome boy.    ", "gilded": 0, "created_utc": "1323977111", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "about tree fitty", "gilded": 0, "created_utc": "1323979692", "subreddit": "funny", "score": 8, "controversiality": 0}
{"body": "Where did the whole lock ness monster tree fiddy thing come from?", "gilded": 0, "created_utc": "1323984449", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I did once.  It wouldn't stop asking me for tree fiddy.", "gilded": 0, "created_utc": "1323984976", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "about tree fiddy.", "gilded": 0, "created_utc": "1323987634", "subreddit": "soccer", "score": 3, "controversiality": 0}
{"body": "That's incredibly misleading, because it's growing because of immigration from Islamic nations. \n\nWhy don't people just drop their faith? Because it makes sense to them. It's a comfort. It was taught to them, etc. Why are there still racists? Why are there still nationalists? Why does evil exist in this world? (and no, I don't mean to equate religion with these negative things). The persistence of a religion does not validate its belief system. Consider the word \"faith\". That's what it comes down to. \"I believe in this despite an absence of proof\". Religion is very appealing for many obvious reasons. It's clear why someone would cling to it. There will always be spirituality in this world.\n\nDo you believe in ghosts? Aliens? Bigfoot? All of these things have persisted for hundreds, if not thousands of years. People believe in The Loch Ness Monster because of a few anecdotes and grainy photographs and probably will forever. ", "gilded": 0, "created_utc": "1323987932", "subreddit": "DebateAnAtheist", "score": 8, "controversiality": 0}
{"body": "'Bout tree fiddy. ", "gilded": 0, "created_utc": "1323989329", "subreddit": "leagueoflegends", "score": 0, "controversiality": 0}
{"body": "At first I thought it was a mountain, but then I realized it was that gad danged loch ness monster again!", "gilded": 0, "created_utc": "1323990918", "subreddit": "Minecraft", "score": 1, "controversiality": 0}
{"body": "I think what he is really saying is \"can I have about tree fiddy?\"", "gilded": 0, "created_utc": "1323998790", "subreddit": "skyrim", "score": 11, "controversiality": 0}
{"body": "Bigfoot or the loch ness monster?", "gilded": 0, "created_utc": "1324000350", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "I have never actually seen more than a handful of South Park episodes, but that one involves the Loch Ness Monster. Wikipedia tells me it's a joke about black comedians. I dunno.", "gilded": 0, "created_utc": "1324001700", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "God Dam Dragon, I ain't gonna give you no tree fiddy!", "gilded": 0, "created_utc": "1324003524", "subreddit": "skyrim", "score": 7, "controversiality": 0}
{"body": "I had just given him tree fiddy the week before.", "gilded": 0, "created_utc": "1324011596", "subreddit": "skyrim", "score": 2, "controversiality": 0}
{"body": "Guy:[](/high \"I need about tree fiddy\")\n  \nYou:[](/dude \"yeah sure here you go\")\n  \n...\n  \nBoth: [](/awyeah \"FREE SODA\") [](/awyeah \"AWWWWWWWW YYEEEAAAAAHHH\")", "gilded": 0, "created_utc": "1324012283", "subreddit": "fffffffuuuuuuuuuuuu", "score": 28, "controversiality": 0}
{"body": "I'm gunna need about tree fiddy.", "gilded": 0, "created_utc": "1324014865", "subreddit": "fffffffuuuuuuuuuuuu", "score": 2, "controversiality": 0}
{"body": "That pic is from the paleolithic era of the internet. Welcome to the......YAWN!!!!!", "gilded": 0, "created_utc": "1324025238", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I though that the picture was more of a \"Can I get about..tree fiddy\" kind of thing", "gilded": 0, "created_utc": "1324033603", "subreddit": "skyrim", "score": 0, "controversiality": 0}
{"body": "&gt;Vampires and pregnancy: when did that idea occur to you? How does that work?\n\n&gt;The first seed (no pun intended) was planted when I did Bella's computer research in chapter seven of Twilight. Bella reads about several real vampire legends—the Danag, Estrie, Upier, etc. In the novel, I only mentioned a few of the many legends I read through. One that I didn't mention at this point was the entry on the Incubus. The unique feature about that legend was that the incubus could father children. Hmmm, I said, and I filed that kernel of an idea away for later. When I decided to write the first sequel to Twilight (Forever Dawn), I knew it was going to revolve around a hybrid baby from the outset.\n\n&gt;When my editor and I decided to go back and really develop Bella's last year of high school, I did so with the knowledge that it was all going to end up with the events in Breaking Dawn. Everything I wrote was pointed in that direction.\n\n&gt;I was always very careful when I answered the \"Can vampires have babies?\" question, because I didn't want to say anything incorrect, but I also didn't want to make the future super-obvious. I focused my answers on the female half of the equation—female vampires cannot have children because their bodies no longer change in any aspect. There is no changing cycle to begin with, and their bodies couldn't expand to fit a growing child, either. I purposely evaded answering the question, \"Can a male vampire get a human female pregnant?\" to preserve a tiny bit of surprise in the last book. There were many statements on this subject purported to have come from me, but I never made those comments because, obviously, I knew where this was going.\n\n&gt;Now, on to the \"how is this possible?\" question. First of all, of course it's not possible. None of this story is possible. It's a fantasy story about creatures that don't actually exist. Within the context of the fantasy, however, this is how it works:\n\n&gt;Vampires are physically similar enough to their human origins to pass as humans under some circumstances (like cloudy days). There are many basic differences. They appear to have skin like ours, albeit very fair skin. The skin serves the same general purpose of protecting the body. However, the cells that make up their skin are not pliant like our cells, they are hard and reflective like crystal. A fluid similar to the venom in their mouths works as a lubricant between the cells, which makes movement possible (note: this fluid is very flammable). A fluid similar to the same venom lubricates their eyes so that their eyes can move easily in their sockets. (However, they don't produce tears because tears exist to protect the eye from damage, and nothing is going to be able to scratch a vampire's eye.) The lubricant-venom in the eyes and skin is not able to infect a human the way saliva-venom can. Similarly, throughout the vampire's body are many versions of venom-based fluids that retain a marked resemblance to the fluid that was replaced, and function in much the same way and toward the same purpose. Though there is no venom replacement that works precisely like blood, many of the functions of blood are carried on in some form. Also, the nervous system runs in a slightly different but heightened way. Some involuntary reactions, like breathing, continue (in that specific example because vampires use the scents in the air much more than we do, rather than out of a need for oxygen). Other involuntary reactions, like blinking, don't exist because there is no purpose for them. The normal reactions of arousal are still present in vampires, made possible by venom-related fluids that cause tissues to react similarly as they do to an influx of blood. Like with vampire skin—which looks similar to human skin and has the same basic function—fluids closely related to seminal fluids still exist in male vampires, which carry genetic information and are capable of bonding with a human ovum. This was not a known fact in the vampire world (outside of Joham's personal experimenting) before Nessie, because it's nearly impossible for a vampire to be that near a human and not kill her.\n\n&gt;I didn't get into all of these details at my signings because it's a long, complicated mouthful. Also, it's hard to be clearly heard with all the screaming. Mostly, though, I waited to do this in writing because I have an immature, Homer Simpson-like tendency to giggle when I say the words \"seminal fluids\" in public.\n\nSource: http://www.stepheniemeyer.com/bd_faq.html", "gilded": 0, "created_utc": "1324040647", "subreddit": "gaming", "score": 13, "controversiality": 0}
{"body": "I believe the exact number is 'tree fitty'.", "gilded": 0, "created_utc": "1324049091", "subreddit": "askscience", "score": -2, "controversiality": 0}
{"body": "About tree fiddy. No really probably 30-50?", "gilded": 0, "created_utc": "1324051866", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "What conspiracy theories are wrong? I'll start:\n\nAnything to do with aliens. I feel we've never been visited and UFOs are just military test aircraft, as has been admitted a large percentage of the time.\n\nMoon landing hoax. I see smoking guns of fake evidence, but I also see smoking guns of an actual landing sight. So while I understand the questions and think that maybe we haven't gone as frequently as we've claimed or maybe at different times (like maybe we went in April but said we went in June just in case we failed so we could cover it up and say they died in a freak training accident and not look bad to the international community).\n\nDavid Icke's 12-foot tall, shapeshifting reptilians thingy.\n\nBigfoot, chupacabra, loch ness monster, et al.\n\nWhat do you not believe?", "gilded": 0, "created_utc": "1324055164", "subreddit": "conspiracy", "score": 1, "controversiality": 0}
{"body": "Ask them questions like this:\n\nWhy do you believe this?\n\nWhat evidence have you seen that supports these assertions that you are making?\n\nWhy should I believe you and not believe, say, a Hindu or a Muslim? Why do you hold your beliefs to be more credible or believable than theirs?\n\nWhy is it necessary to teach these things to children? Why not allow children to learn critical thinking skills and *then* introduce them to a doctrine based on unseen and unknowable supernatural assertions? Is it not possible for a thinking, mature person to accept what you are saying? If so, why are you here?\n\nIf humankind is so far off track, why are infant survival rates and life expectancy so much better than they were even a hundred years ago?\n\nWhy do you think that I should be convinced by supernatural answers to these questions? Why is your story any more credible than reports of the Loch Ness monster or UFOs?", "gilded": 0, "created_utc": "1324070867", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "If one truly cares they will donate about tree fitty", "gilded": 0, "created_utc": "1324075471", "subreddit": "leagueoflegends", "score": 1, "controversiality": 0}
{"body": "OMG LOCH NESS MONSTERS", "gilded": 0, "created_utc": "1324081192", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1324082210", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "The plan sounds good to me too. Nessie covered the logistics, so I wont bother, but as mentioned getting in and out of Sapporo itself can take quite a chunk of time (fine so long as you are expecting it). I am in the New Zealand Snow Sculpting Team for the international snow carving competition in Odori Koen. It runs from the Sunday before the festival to Thursday, stop by for a reddit meetup if you have the time. ", "gilded": 0, "created_utc": "1324083338", "subreddit": "japan", "score": 2, "controversiality": 0}
{"body": "Those clouds need about tree fitty", "gilded": 0, "created_utc": "1324086308", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "They have come to collect their tree fitty!", "gilded": 0, "created_utc": "1324087397", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Scottish here. These are indeed Loch Ness Monsters.", "gilded": 0, "created_utc": "1324088449", "subreddit": "pics", "score": 7, "controversiality": 0}
{"body": "Cobra Triangle and Snake Rattle N' Roll on the NES. Both were games I loved as a kid.\n\nCobra Triangle was a boat racing game, and every few races you would go in to a boss fight against a Loch Ness Monster or Kraken or something. It was hard as fuck but a blast to play.\n\nSnake Rattle N' Roll was a cross between an isometric platformer and a puzzle game. You have to go through the level eating things to grow your tail, like Snake, and you have to find the exit and get there with enough body mass to trigger the scales to complete the level. The final level took place on the moon and I never figured out how to beat the frozen foot thing.", "gilded": 0, "created_utc": "1324092372", "subreddit": "Games", "score": 1, "controversiality": 0}
{"body": "Great... Now that bitch ain't gonna know to have his sweet potatoes and when he shows up she's gonna give him tree fiddy.", "gilded": 0, "created_utc": "1324093853", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Doesn't he mean tree fiddy?", "gilded": 0, "created_utc": "1324093942", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "\"And I'll be DAMNED if it wasn't the LOCH NESS MONSTER\".", "gilded": 0, "created_utc": "1324097015", "subreddit": "Atlanta", "score": 6, "controversiality": 0}
{"body": "YOU GAVE TEH LOCH NESS REDDITOR TREE FITTY?!!!!", "gilded": 0, "created_utc": "1324101669", "subreddit": "wow", "score": 2, "controversiality": 0}
{"body": "HIMYM is full of stuff like this. Keep a lookout in the show for people eating sandwiches. Also in the \"future Marshall\" scenes there's a newspaper clipping on Marshall's desk about how he found the Loch Ness monster.", "gilded": 0, "created_utc": "1324109797", "subreddit": "Music", "score": 1, "controversiality": 0}
{"body": "Scrap Banking is bassically a convenience service for the people getting their weapons scraped and a supplior for the scrap bankers shop.\n\nIf someone wants to scrap their weapons they need to have 2 from the same class and do each pair individually which is a time consuming process. Instead you trade a scrap banker and they give you 1 scrap for every 2 weapons. They in turn take these weapons, scrap the ones that are worthless (nessie nine iron etc) and try to sell the other weapons for 1 scrap (therefore making a profit). The cycle goes on and on.\n\nIf it was really easy to scrap all weapons they there would be no need to use the services of a scrap banker. The scrap banker wouldn't have any inventory and would therefore be unable to make profit.", "gilded": 0, "created_utc": "1324110690", "subreddit": "tf2", "score": 1, "controversiality": 0}
{"body": "I ain't givin' you no tree fiddy you goddamn Lock Ness monster!!! Get your own goddamn money!", "gilded": 0, "created_utc": "1324116767", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "Now, don't be givin' him no tree fiddy. Give him a dollah and he's gonna come back for more.", "gilded": 0, "created_utc": "1324130526", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "A name for it: Loch Ness. Because it looks like the [Loch Ness Monster](http://upload.wikimedia.org/wikipedia/en/thumb/7/79/Lochnessmonster.jpg/220px-Lochnessmonster.jpg)", "gilded": 0, "created_utc": "1324133706", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "Go find the Loch Ness monster. You do have tree fiddy, do you not?", "gilded": 0, "created_utc": "1324140740", "subreddit": "AskReddit", "score": 87, "controversiality": 0}
{"body": "And I say, \"Woman! Why you give Loch Ness Monster a dollar! You give the Loch Ness Monster a dolla, he gonna come back wanting more!\"", "gilded": 0, "created_utc": "1324145213", "subreddit": "AskReddit", "score": 18, "controversiality": 0}
{"body": "All he needs.... is tree fiddy...", "gilded": 0, "created_utc": "1324147028", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Find the loch ness monster. Give him 3.50.", "gilded": 0, "created_utc": "1324151070", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "I got about tree fiddy.", "gilded": 0, "created_utc": "1324151116", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "&gt;about tree fitty\nFTFY", "gilded": 0, "created_utc": "1324152349", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Damn it, Loch Ness Monsta! I ain't givin you no tree fitty!", "gilded": 0, "created_utc": "1324153340", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "About 3.50 eh? Watch out for Nessie.", "gilded": 0, "created_utc": "1324154214", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Find a Loch Ness monster, refuse to give him your tree-fiddy", "gilded": 0, "created_utc": "1324162332", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Well first, ima need about tree fiddy", "gilded": 0, "created_utc": "1324163483", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I can't believe you're the only person to bring up tree fiddy. ", "gilded": 0, "created_utc": "1324163548", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "tree fiddy \n\nFTFY ", "gilded": 0, "created_utc": "1324164546", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "find the loch ness monster, give it the tree fitty", "gilded": 0, "created_utc": "1324165140", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Damn Loch Ness Monster. ", "gilded": 0, "created_utc": "1324167067", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "Don't give no god damn lockness monsta no tree fitty", "gilded": 0, "created_utc": "1324169158", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Find the Loch Ness Monster.\n", "gilded": 0, "created_utc": "1324170876", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Tree Fitty", "gilded": 0, "created_utc": "1324171658", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "But I'm gonna need 'bout tree fiddy.", "gilded": 0, "created_utc": "1324172954", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Maybe if instead of a shark it was a goddamn loch ness monster.", "gilded": 0, "created_utc": "1324173340", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "Goddamn Loch Ness monster!", "gilded": 0, "created_utc": "1324177548", "subreddit": "pics", "score": 9, "controversiality": 0}
{"body": "Give the Loch Ness Monster about tree fiddy.", "gilded": 0, "created_utc": "1324184631", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I don't know what to do with the other stuff, but i need about tree fitty", "gilded": 0, "created_utc": "1324195344", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1324205849", "subreddit": "philosophy", "score": 1, "controversiality": 0}
{"body": "As an atheist, I say Merry Christmas because Christmas has about as much to do with Christianity as the Easter Bunny, Tooth Fairy, Boogie Monster and Loch Ness Monster. It's a holiday meant to celebrate being together as a family and exchanging gifts with loved ones, or if you're a kid, believing in the socially acceptable lie about Santa Claus. Nowhere does Christianity come into the picture except where they inject themselves into it, which is how Christianity went about getting all of its major holidays. ", "gilded": 0, "created_utc": "1324214106", "subreddit": "pics", "score": 14, "controversiality": 0}
{"body": "I need bout tree fiddy.", "gilded": 0, "created_utc": "1324217597", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "God-damn loch ness monster!", "gilded": 0, "created_utc": "1324230775", "subreddit": "StarWars", "score": 2, "controversiality": 0}
{"body": "Remember what happened with the Postal Pummeler and Nessie's Nine Iron? I assume the uncrated spycicles will not be genuine either after they start dropping.", "gilded": 0, "created_utc": "1324235178", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "She a tree fitty ho.", "gilded": 0, "created_utc": "1324245828", "subreddit": "AskReddit", "score": 11, "controversiality": 0}
{"body": "&gt;I'm gonna need about tree fitty.\n\nFTFY", "gilded": 0, "created_utc": "1324256836", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "Tree fiddy!? ", "gilded": 0, "created_utc": "1324270445", "subreddit": "WTF", "score": 40, "controversiality": 0}
{"body": "There I was walking in Greenwich Village, NYC. I was coming home late from the library (NYU student) and I was going across Washington Square Park to get to my dorm. I was getting close to the door when this mugger came from out of the corner. \n\nThe mugger turned to me and said, \" I got a knife.\" I looked at him and said, \"What do you want.\" The mugger stood above me looking down with its big red eyes and said, \"I'm need about tree fiddy.\" \n\nAnd that's when I realized that my mugger was a huge crustacean from the paleolithic era. And I said, \"I ain't giving you no tree fiddy you God damn Loch Ness Monster! Get your own money!\"", "gilded": 0, "created_utc": "1324272265", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "Get out of here, Loch Ness Monster.", "gilded": 0, "created_utc": "1324274334", "subreddit": "WTF", "score": 42, "controversiality": 0}
{"body": "Either this is a decent attempt at trolling, or you're completely delusional. I'm gonna assume the latter because I'm bored.\n\nHumans invented the idea of a god many, many times over as well. There are literally thousands of gods that have been passed down through history. Absolutely no scientific evidence has shown an ounce of proof for any of them, ever. **Ever**. The amount of proof for any god in the history of the universe is the same as the amount of proof for Santa Claus, unicorns, the tooth fairy, and leprechauns. The Loch Ness Monster has more proof than a god. At least we have fuzzy pictures of something looking like it.", "gilded": 0, "created_utc": "1324276380", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "TREE FITTY", "gilded": 0, "created_utc": "1324277474", "subreddit": "funny", "score": 7, "controversiality": 0}
{"body": "Wat I tell yo' bout givin dat Lochnass Monsta tree fitty, woman?!", "gilded": 0, "created_utc": "1324279615", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Her pimp must have called her \"Loch Ness Monster\"", "gilded": 0, "created_utc": "1324285378", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Nicely done.\n\nOnly way I can see this going better:\n\n**x**: A \"lobstacaust\", if you will.\n\n**y**: What's a lobstacaust?\n\n**z**: 'bout tree fiddy.", "gilded": 0, "created_utc": "1324286054", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I stared down a bear once.\n\nAlso, I used to have this habit of walking through town late at night, just to clear my head. Sometimes I had good reasons for being places after dark, but a lot of the time, especially in the fall, I just liked to walk. It was a pretty big city, and there was enough crime that at least a couple violent deaths cropped up every year in places I knew, but I mostly ignored my family's warnings about that sort of thing and just blew it off as media sensationalism (I still do, and walk all over the place where I live now at like 5 AM, but there's less crime here). Anyway, one time I was taking a shortcut through a park and a large black man in a raincoat began to follow me. I tried to speed up unobtrusively, but he ran faster, and eventually started shouting. I stopped, acting like I hadn't seen him before, and waited a second for him to catch up--I didn't think I could outrun him, if it came to that. He towered over me, and was well-muscled.\n\nHe took off his coat, revealing an immaculate suit and tie, and asked for two dollars to catch a train because he had forgotten his wallet.\n\n(You have no idea how tempted I was to say he asked for tree fiddy.)", "gilded": 0, "created_utc": "1324286477", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Back to the loch with you, Nessie.", "gilded": 0, "created_utc": "1324295098", "subreddit": "AskReddit", "score": 25, "controversiality": 0}
{"body": "Short answer: **atheist**.\n\nLonger answer: you're an atheist, but technically an \"agnostic-atheist\". Richard Dawkins explains this quite well in his book called \"The God Delusion\", he details the [Spectrum of theistic probability](http://en.wikipedia.org/wiki/Spectrum_of_theistic_probability). \n\nMost open-minded theists fit into category 2, whereby they believe but not with the ridiculous 100% conviction it takes to be in category 1. Most atheists are category 6, also lacking the ridiculous 100% conviction it takes to be in category 7. \n\nYou could argue both category 1 and 7 are intellectually weak positions because they claim to have absolute faith in something (or absolute non-faith in something) despite the fact there is no evidence to support either viewpoint.\n\nMany proper agnostics (category 4) argue that their position is the only superior position to occupy, since there is no evidence either way. However, they neglect both the probability of specific traits that is accorded to God, and also the *reductio ad absurdum* argument. For example, God supposedly has the qualities omnipotence, omnibenevolence, and omniscience, however possessing these three qualities raises the problem of *\"Where does evil come from?\"*. This problem is called \"the problem of evil\", you can read more about [Theodicy](http://en.wikipedia.org/wiki/Theodicy) here. By being agnostic, you also then have to concede that it is possible that unicorns exist, fairies, goblins, Thor, Zeus, loch ness monster, etc., simply because there's no evidence either way. So you can imagine this is a criticised position because it sort of backs slowly away from the argument of God without taking a stance on the very unlikely possibility he exists.\n\nSo, getting back to my point, you seem to fit category 6: **agnostic-atheist**. This is where myself, and most other atheists (including Dawkins, Hitchens, and other such great company) sit. We say that there is no proof of God, no really good argument for his existence either, so therefore we're pretty sure he doesn't exist (at least in the way he is supposed to be described). We *DO NOT* say that we know for sure he doesn't exist (category 7) because we are driven by proof, and as yet there is no proof whatsoever he doesn't exist.\n\nHope that helps!\n\nP.S. Now that you're aware of these groups, you'll be amazed how many theists think atheists occupy position 7. We are frequently called \"arrogant\" for our dis-belief, but little do they realise that provided with proof of God's existence, every atheist in category 5 and 6 would instantly drop into category 1. In my opinion, this is the best intellectual position to be in, and it is also entirely compatible with science and our understanding of the universe.", "gilded": 0, "created_utc": "1324309844", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "It's correct, though. Why do you want it to be incorrect?\n\nThere is no way to know, and no way to falsify the claim. This is why, in a technical sense, any sensible atheist is really agnostic, in much the same way we are all technically agnostic about Big Foot, unicorns and the Loch Ness Monster. If you can't falsify a claim then you can't prove it isn't true.\n\nYou can make a reasonably educated guess that it is *probably* not true, but without evidence it isn't conclusive.", "gilded": 0, "created_utc": "1324310435", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "I'd go up to about tree fiddy", "gilded": 0, "created_utc": "1324311512", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I've remembered another.  Scooby bloody Doo, when they do the \"Loch Ness Monster\" episode.  Without a shadow of a doubt THE WORST Scottish accent that's even being recorded in the history of film and television.  The poor bastards doing the voiceover work were probably crying and swigging Scotch at the end; they must have known the whole thing was a fucking travesty but carried on thinking the kids woudn'ay Knaw tha diffrence!", "gilded": 0, "created_utc": "1324323051", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Science does not believe in EM sensitivity: http://en.wikipedia.org/wiki/Electromagnetic_hypersensitivity\n\nhttp://en.wikipedia.org/wiki/Non-ionizing\n\nYou probably won't get any other replies.\n\n\"The prevalence of claimed electromagnetic hypersensitivity has been estimated as being between a few cases per million to 5% of the population depending on the location and definition of the condition.\"\n\nApparently lots of people believe they are sensitive, but you wouldn't believe in Bigfoot, Alien abductions, or Nessie and Ogopogo just because people say they experienced something would you?\n\nThere are no upper limits or regulation by the EPA but this website claims 120mG isn't a big deal according to the state of NY or Florida.\n\nhttp://www.nvenergy.com/home/safety/understandingEMF.cfm\n\nIt's difficult to get a straight answer as to what would happen if a person were gradually exposed to an infinitely strong field - they would burn and melt eventually, but i'm not sure what other physiological effects might occur.", "gilded": 0, "created_utc": "1324323374", "subreddit": "askscience", "score": 2, "controversiality": 0}
{"body": "I say about tree fitty.", "gilded": 0, "created_utc": "1324326791", "subreddit": "hookah", "score": 5, "controversiality": 0}
{"body": "Check with the Loch Ness Monster but I think I could go as high as $20", "gilded": 0, "created_utc": "1324337122", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Hah, funny you should post this because the strangest thing happened to me when I went to see this movie. Oh man, so long ago. Anyway so there I was on a beautiful saturday in february, on my way to the cinema with my girlfriend at the time Sarah just walking along. All of a sudden our mate Mike shows up and we all start talking about the past, reminiscing about primary school and all that. Mike decides to come to the movie with us as he doesn't have anything better to do, right, but when we get to the front of the line Mike realises he doesn't have enough money so he asks if he could borrow some, I ask him how much he needs and he replies \"I need about tree-fiddy\". Well it was about that time that I noticed that Mike was about eight stories tall and was a crustacean from the Paleolithic Era! Then I said, I ain't givin' you no tree-fiddy, you goddamn Loch Ness Monster! Get your own goddamn money!", "gilded": 0, "created_utc": "1324340702", "subreddit": "pics", "score": 10, "controversiality": 0}
{"body": "Yes, for tree fiddy.\n", "gilded": 0, "created_utc": "1324341641", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "The monk laughed and said \"I would be glad to take your service\" and so I fixed his ear.  He was grateful and said \"Thank you for opening my mind friend, if there is anything might do for you, any secret of the universe you wish to know all you need is to ask.\". I smiled and said \"I only require one thing, I need about tree fitty\" It was at this point the mon realized I was the loch ness monster and shouted \"I ain't givin you no tree fitty monstah!\" and proceeded to run away.", "gilded": 0, "created_utc": "1324352109", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I dug up a ton of old cards I used to cherish like secret treasures as a child.  I was slightly sad to discover they had lost a ton of value thanks to the internet.  More specifically, back in the day you could usually only find/trade/buy cards through conventions.  Now you have access to people all over the country and the value plummeted.  I believe this card is worth 'bout tree fitty' if I were to estimate.\n\nSame goes for almost every other non-signed or non-numbered card.  The only value I find from cards are for the very very big stars, i.e. Jordan and others.  Oh well, they still bring back memories, and those are priceless.", "gilded": 0, "created_utc": "1324355375", "subreddit": "sports", "score": 3, "controversiality": 0}
{"body": "They need about tree fiddy", "gilded": 0, "created_utc": "1324367430", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "I had one on my finger a few years ago.  Went to a dermatologist and had it frozen off, only to come right back.  Then I tried the duct tape method and didn't notice much improvement.  Finally, my girlfriend suggested rubbing a pumice stone on it, so I did and within a week or two it had disappeared completely, never to return.  So, my suggestion to you is to spend tree fiddy on a pumice stone, rub it gently over the wart(s) once every day, and you should be golden.  ", "gilded": 0, "created_utc": "1324368416", "subreddit": "LifeProTips", "score": 1, "controversiality": 0}
{"body": "When you mentioned water-dwelling dragons, I couldn't help but picture Nessie.", "gilded": 0, "created_utc": "1324382549", "subreddit": "skyrim", "score": 1, "controversiality": 0}
{"body": "Someone should do a [FIXED] version with the Loch Ness Monster instead of a bear.", "gilded": 0, "created_utc": "1324385761", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "i give you tree fiddy", "gilded": 0, "created_utc": "1324400819", "subreddit": "magicTCG", "score": 3, "controversiality": 0}
{"body": "Can I have...tree fiddy?\n\nBless your heart, Lochness, or course you can!!", "gilded": 0, "created_utc": "1324406063", "subreddit": "movies", "score": 2, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1324406904", "subreddit": "videos", "score": 3, "controversiality": 0}
{"body": "Cool piece! These are sold in 1782 from some Swag Shop in Europe. A complete set, which oddly enough includes only two shot glasses for four slots, is said to be priced around $4.5M. In this condition, I could say, among collectors, you could get an easy $3-4M for it.\n\nWhat can I offer you? Well, seeing how rare it is, finding a collector to buy it for what it's really worth would be harder to find than the actual piece itself. So, I can give you...\n\nAbout tree fitty.", "gilded": 0, "created_utc": "1324407143", "subreddit": "pics", "score": 18, "controversiality": 0}
{"body": "I agree, but I don't think that wickedwagon was trying to refute the initial suggestion of Nessie, just pointing out that cycling can end up costing you a lot if you let it.", "gilded": 0, "created_utc": "1324408678", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1324412920", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "ill buy it for about tree fitty", "gilded": 0, "created_utc": "1324425999", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Definitely not a werewolf or vampire, due to their homosexual connotation. \n\nFerreals, ogopogo or Nessie. The king and queen of underwater hide and seek. ", "gilded": 0, "created_utc": "1324429952", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "But then you would want *tree fiddy*", "gilded": 0, "created_utc": "1324432174", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "tree fitty.", "gilded": 0, "created_utc": "1324440243", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1324442459", "subreddit": "nosleep", "score": 43, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1324448450", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Srsly?  You'd choose some paltry amount of money - which won't matter to your life one way or another in a few months - over an experience and story worth much more and which you get to remember forever?  I doubt you'll be reminiscing in your old age about those breasts and thinking \"I wish I had tree fiddy instead, I coulda bought some churros and laundry detergent, what a day that would have been.\"", "gilded": 0, "created_utc": "1324450015", "subreddit": "AskReddit", "score": 13, "controversiality": 0}
{"body": "Tree fiddy?", "gilded": 0, "created_utc": "1324467662", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "And about tree fiddy", "gilded": 0, "created_utc": "1324474949", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "So about tree fiddy.", "gilded": 0, "created_utc": "1324477907", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "it's gonna be bout tree fiddy", "gilded": 0, "created_utc": "1324483705", "subreddit": "pics", "score": -5, "controversiality": 0}
{"body": "Dang, the first time I saw this on facebook I posted that it looked like Jerry Garcia.  Now, I'm wishing I'd posted this: I wonder is Bigfoot pays this much respect to the Loch Ness Monster on his birthday...", "gilded": 0, "created_utc": "1324484545", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "its about 3 parsecs higher, that translates into ~16 fridgelongs, or a just about tree fiddy.", "gilded": 0, "created_utc": "1324485753", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "I need bout tree fiddy.", "gilded": 0, "created_utc": "1324492563", "subreddit": "pics", "score": 16, "controversiality": 0}
{"body": "Did somebody say tree fiddy?", "gilded": 0, "created_utc": "1324493471", "subreddit": "pics", "score": 12, "controversiality": 0}
{"body": "Eventually I got lazy and the picture got too crowded. Some other myths that didn't make the cut were Godzilla, the Loch Ness Monster, Bigfoot and Cthulhu. ", "gilded": 0, "created_utc": "1324495061", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I offer tree fiddy", "gilded": 0, "created_utc": "1324512982", "subreddit": "neopets", "score": 6, "controversiality": 0}
{"body": "Go away Loch Ness monsta, I ain't got tree fiddy!", "gilded": 0, "created_utc": "1324513064", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "Nice try, giant crustacean from the paleolithic era.", "gilded": 0, "created_utc": "1324513187", "subreddit": "gaming", "score": 10, "controversiality": 0}
{"body": "It was about that time I realized these soldiers were really 8 stories tall and actually a crustacean from the paleolithic era!!!", "gilded": 0, "created_utc": "1324523294", "subreddit": "skyrim", "score": 66, "controversiality": 0}
{"body": "\"Damnit Loch Ness monster!\" I said. \"I ain't given you no three fiddy!\".", "gilded": 0, "created_utc": "1324524911", "subreddit": "skyrim", "score": 41, "controversiality": 0}
{"body": "tree fiddy it's a woMANman", "gilded": 0, "created_utc": "1324525964", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "It's pronounced \"tree fiddy\"", "gilded": 0, "created_utc": "1324531058", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "About tree fitty.", "gilded": 0, "created_utc": "1324534250", "subreddit": "funny", "score": 32, "controversiality": 0}
{"body": "Oh cool. That's where I try to play most of the time (when there's an opening for me and my GF at the same time). I dropped my free gift in there and got a Nessie's Nine Iron from someone else. Man, I love those servers.", "gilded": 0, "created_utc": "1324536875", "subreddit": "tf2", "score": 1, "controversiality": 0}
{"body": "i need about tree fiddy", "gilded": 0, "created_utc": "1324538258", "subreddit": "IAmA", "score": 6, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1324540460", "subreddit": "funny", "score": -2, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1324540492", "subreddit": "funny", "score": -2, "controversiality": 0}
{"body": "tree fiddy dot com", "gilded": 0, "created_utc": "1324540655", "subreddit": "southpark", "score": 1, "controversiality": 0}
{"body": "i will give you tree fiddy for that", "gilded": 0, "created_utc": "1324540726", "subreddit": "southpark", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1324540762", "subreddit": "southpark", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1324540784", "subreddit": "southpark", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1324540809", "subreddit": "southpark", "score": 0, "controversiality": 0}
{"body": "I got a Nessie's Nine Iron tonight from someone's Secret Saxon, as well as regular drops. Finally! I too got nothing -- after the noisemaker, at least. ", "gilded": 0, "created_utc": "1324541029", "subreddit": "tf2", "score": 2, "controversiality": 0}
{"body": "i need about tree fiddy", "gilded": 0, "created_utc": "1324541969", "subreddit": "trees", "score": 6, "controversiality": 0}
{"body": "You are balancing bigfoot, right? No, wait, the Loch Ness monster! Damn, I can never tell.\n\nedit: [should have known...](http://troll.me/images/ancient-aliens-guy/ancient-aliens-guy.jpg)", "gilded": 0, "created_utc": "1324542087", "subreddit": "AskReddit", "score": 11, "controversiality": 0}
{"body": "i need about tree fiddy", "gilded": 0, "created_utc": "1324543155", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "http://departments.bloomu.edu/philosophy/pages/content/hales/articles/proveanegative.html\n\n&gt; It is widely believed that you can’t prove a negative. Some people even think that it is a law of logic—you can’t prove that Santa Claus, unicorns, the Loch Ness Monster, God, pink elephants, WMD in Iraq and Bigfoot don’t exist. This widespread belief is flatly, 100% wrong. In this little essay, I show precisely how one can prove a negative, to the same extent that one can prove anything at all.", "gilded": 0, "created_utc": "1324564635", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "The other day I was reading a thread in r/politics about SOPA. It was about that time that I noticed the thread was awfully small and sharp and shaped just like a projectile. \n\n*It was that damn arrow!*\n\nAnd you know what it says to me? \"I need about tree fiddy.\" \n\nAnd then it shoots me right in my god damn knee! ", "gilded": 0, "created_utc": "1324566054", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "You're thinking of the Loch Ness Monster, and you have to give it a dollar to make it never leave you alone.", "gilded": 0, "created_utc": "1324573774", "subreddit": "leagueoflegends", "score": 1, "controversiality": 0}
{"body": "...I'd have tree fiddy.", "gilded": 0, "created_utc": "1324579028", "subreddit": "motorcycles", "score": 10, "controversiality": 0}
{"body": "How about tree fiddy?", "gilded": 0, "created_utc": "1324580355", "subreddit": "buildapc", "score": 18, "controversiality": 0}
{"body": "NICE TRY, LOCH NESS MONSTER", "gilded": 0, "created_utc": "1324581718", "subreddit": "todayilearned", "score": 7, "controversiality": 0}
{"body": "special 1 time price, 349.99.  That's about tree fiddy....", "gilded": 0, "created_utc": "1324583393", "subreddit": "buildapc", "score": 3, "controversiality": 0}
{"body": "damn loch ness monster wanting tree fity again ", "gilded": 0, "created_utc": "1324584583", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "The loch ness monster is always all over me as soon as I hit tree fitty in change", "gilded": 0, "created_utc": "1324592915", "subreddit": "gaming", "score": 85, "controversiality": 0}
{"body": "Gimme tree fiddy", "gilded": 0, "created_utc": "1324597690", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "GOD DAMN LOCH NESS MONSTER ALWAYS AFTER MY TREE FIDDY!", "gilded": 0, "created_utc": "1324601700", "subreddit": "gaming", "score": 19, "controversiality": 0}
{"body": "Xbox tree fitty", "gilded": 0, "created_utc": "1324601702", "subreddit": "gaming", "score": 19, "controversiality": 0}
{"body": "I just realized that Loch Ness Monster is somebodies hobo name.\n", "gilded": 0, "created_utc": "1324602328", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "no, it's the loch ness monster", "gilded": 0, "created_utc": "1324602436", "subreddit": "gaming", "score": 4, "controversiality": 0}
{"body": "He spelled it like Chef's dad said it. Tree fitty.\n\nOn a related note, I apparently just taught my phone the word \"tree\" and am really worried I spelled it wrong...", "gilded": 0, "created_utc": "1324603784", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "It's about this time that I realised that weren't no Girl Scout, it was the goddamn Loch Ness Monster!", "gilded": 0, "created_utc": "1324606728", "subreddit": "gaming", "score": 8, "controversiality": 0}
{"body": "I don't know who Ness or Jeff (mentioned in another comment), I totally thought this was a Loch Ness Monster theme outfit idea. \n\nWhich just means there's still a Loch Ness themed loadout to be designed... hmmm...  ", "gilded": 0, "created_utc": "1324608720", "subreddit": "tf2", "score": 2, "controversiality": 0}
{"body": "Tree Fiddy", "gilded": 0, "created_utc": "1324612798", "subreddit": "shittyaskscience", "score": 1, "controversiality": 0}
{"body": "And really good ones make it worth a lot. Apparently my Nessie's Nine Iron #2 is worth easily a buds.", "gilded": 0, "created_utc": "1324616262", "subreddit": "tf2", "score": 1, "controversiality": 0}
{"body": "You probably want to keep it. Trying to sell it will be a huge hassle. I couldn't even sell my Nessie's Nine Iron #2 for anything close to what it was worth, and I tried for months. \n\nI'll be keeping my Spycicle #72. Make killcams more interesting for my fallen foes ^^", "gilded": 0, "created_utc": "1324616408", "subreddit": "tf2", "score": 1, "controversiality": 0}
{"body": "I bet that the Loch Ness Monster would have liked one at that price.", "gilded": 0, "created_utc": "1324620075", "subreddit": "guns", "score": 8, "controversiality": 0}
{"body": "Now it was about that time that i realized this \"GarMc\" was not a harmless gaming enthusiast, but was a 7 story tall crustacean from the Paleolithic Era.", "gilded": 0, "created_utc": "1324620416", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "Trife-describing something useless or stupid\nKicking It-Not paying attention\nTree Fiddy-Generic Price\nFird Buck-Annoying person", "gilded": 0, "created_utc": "1324621391", "subreddit": "teenagers", "score": 1, "controversiality": 0}
{"body": "I will offer you an all expenses paid trip to Scotland for that. I will personally introduce you to Allen the loch ness monster.", "gilded": 0, "created_utc": "1324634366", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I watched about 3/4 of it and it made no sense. He's really basically saying that the universe exists because of God, which he says atheists can't deny. We also can't deny the existence of the Loch Ness monster or Bigfoot. Does that mean both of those exist? \"God says it, so it's true\" is not good enough. Also, \"you can't prove it's not true\" isn't a good enough argument either.", "gilded": 0, "created_utc": "1324642769", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy!\n", "gilded": 0, "created_utc": "1324652029", "subreddit": "technology", "score": 30, "controversiality": 0}
{"body": "Tree fiddy from New Orleans if they do for sure. \n\nEdit: I hate iPhone typing.", "gilded": 0, "created_utc": "1324653755", "subreddit": "technology", "score": 38, "controversiality": 0}
{"body": "And a creature from the Paleolithic era!\n\nP.S- I'm in for $10 if they move away from GoDaddy. ", "gilded": 0, "created_utc": "1324654294", "subreddit": "technology", "score": 15, "controversiality": 0}
{"body": "See now this a legit reason I'd donate to Wikipedia, not \"a personal appeal from Syed Herpaderp (srs bsns face)\"\n\nif they do this, and make it public, you've got my tree fitty", "gilded": 0, "created_utc": "1324656277", "subreddit": "technology", "score": 2, "controversiality": 0}
{"body": "I will also donate 5 times tree fiddy  if they move away from GoDaddy and show their commitment to the internets", "gilded": 0, "created_utc": "1324657144", "subreddit": "technology", "score": 8, "controversiality": 0}
{"body": "I ain't givin' you no tree fiddy.", "gilded": 0, "created_utc": "1324657290", "subreddit": "todayilearned", "score": 15, "controversiality": 0}
{"body": "I'm don't doubt the *possible* existence of aliens, any more than I doubt the *possible* existence of the Loch Ness Monster. But that doesn't mean I believe that either actually *exists*.", "gilded": 0, "created_utc": "1324659474", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "The mathematical probability of life elsewhere is much greater than the possibility of Nessie. So much so that I can accept that life, in some form, exists elsewhere. ", "gilded": 0, "created_utc": "1324659614", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt;The mathematical probability of life elsewhere is much greater than the possibility of Nessie\n\nI doubt you have provable equations for calculating the probability of *either*, so I'll take your assertion with a rather large grain of salt.", "gilded": 0, "created_utc": "1324659775", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I think you are mistaking Wikipedia with the loch Ness monster.\nIs Wikipedia the loch Ness monster? And if so dammit he's just gonna ask for more. But for some reason I'm okay with that.", "gilded": 0, "created_utc": "1324660488", "subreddit": "technology", "score": 2, "controversiality": 0}
{"body": "That's why they keep coming back and asking for tree fiddy!!\n\n$5 from me if they move. My credit card's already maxed but I don't give a shit, I'll skip out on the coffee for the next 2 days.\n\nDie GoDaddy", "gilded": 0, "created_utc": "1324662776", "subreddit": "technology", "score": 2, "controversiality": 0}
{"body": "How many of them think Loch Ness monster is a dinosaur?", "gilded": 0, "created_utc": "1324663068", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "Or that the Loch Ness monster is a dinosaur. Really, Christians do not account for all of this nonsense. Go reddit: Jump====&gt; Conclusion.", "gilded": 0, "created_utc": "1324663276", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "I'll match that tree fiddy in American dollars and cents", "gilded": 0, "created_utc": "1324665658", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "... Could I borrow about tree fiddy?", "gilded": 0, "created_utc": "1324668121", "subreddit": "trees", "score": 5, "controversiality": 0}
{"body": "NO LOCH NESS MONSTER", "gilded": 0, "created_utc": "1324668896", "subreddit": "trees", "score": 5, "controversiality": 0}
{"body": "All it really takes is the realization that the whole thing rests on people just choosing to believe without evidence. But if it matters to you that what you believe has the best chance to be true then look for the evidence that a god exists without first assuming that it has to be true. That is critical thought. Requiring evidence to believe in something. Like Bigfoot and the Loch Ness Monster. I have to add here they are more likely than a god or another atheist will.\n\nThere is a reading list in the FAQ. It is a good one. But just choosing to base what you believe on evidence is enough. Good Luck", "gilded": 0, "created_utc": "1324673636", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Rocket Version and scratched to shit? \n\nAbout Tree Fiddy.", "gilded": 0, "created_utc": "1324678462", "subreddit": "pokemon", "score": 6, "controversiality": 0}
{"body": "Oh, its all right, I gave him tree fiddy just this morning.", "gilded": 0, "created_utc": "1324679932", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "-\"So how many extras do you have?\"\n\n-\"about tree fiddy\"", "gilded": 0, "created_utc": "1324681545", "subreddit": "gaming", "score": 34, "controversiality": 0}
{"body": "About tree fiddy?", "gilded": 0, "created_utc": "1324683833", "subreddit": "AdviceAnimals", "score": 2, "controversiality": 0}
{"body": "Maybe tree fiddy.", "gilded": 0, "created_utc": "1324687201", "subreddit": "gaming", "score": 16, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1324687910", "subreddit": "gaming", "score": 16, "controversiality": 0}
{"body": "things i heard of in my childhood:  aliens, loch ness monster, ghosts, santa claus, easter bunny", "gilded": 0, "created_utc": "1324689990", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Best I can offer is a Nessie's Nine Iron #2, which is theoretically similar value but not unless you're really interested.", "gilded": 0, "created_utc": "1324693598", "subreddit": "tf2", "score": 1, "controversiality": 0}
{"body": "I'd pay tree fiddy.\n", "gilded": 0, "created_utc": "1324698426", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "About tree fitty", "gilded": 0, "created_utc": "1324701682", "subreddit": "IAmA", "score": 892, "controversiality": 0}
{"body": "I'd need about tree fitty.....", "gilded": 0, "created_utc": "1324702724", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Well it was about dat time I realize that dis girl scout was 8 stories tall and actually a crustacean from the paleolithic era. I said, DAMNIT MONSTA GET OFF MY LAWN I aint gon give you no tree fiddy!", "gilded": 0, "created_utc": "1324703095", "subreddit": "IAmA", "score": 306, "controversiality": 0}
{"body": "Watcha mean u gave him a dollar?! i told u dont gib him no money thas why he always comin round here askin fo that mofuckin tree fiddy.", "gilded": 0, "created_utc": "1324703702", "subreddit": "IAmA", "score": 164, "controversiality": 0}
{"body": "I like the name Nessie better", "gilded": 0, "created_utc": "1324704251", "subreddit": "pokemon", "score": 0, "controversiality": 0}
{"body": "Gimme my tree fitty man!", "gilded": 0, "created_utc": "1324712533", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "about tree fitty", "gilded": 0, "created_utc": "1324717507", "subreddit": "funny", "score": 8, "controversiality": 0}
{"body": "I've got about tree fiddy.", "gilded": 0, "created_utc": "1324719987", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1324735727", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "&gt;A - Do you believe evidence will ever be found to prove the existence of any god?\n\n\nI don't know. How can I? I think that it is very, very unlikely. But not impossible. \n\n&gt;If Yes, doesn’t that suggest that you believe gods and the supernatural exist?\n\nNo. I only believe things I have evidence for. Without evidence for something I do not believe in it.\n\n&gt;B - Do you believe gods and the supernatural are imaginary concepts?\n\nI believe there is **no evidence** that they are anything other than imaginary concepts. Like unicorns and the Loch Ness monster. Though unicorns and the Loch Ness monster are more likely to be real than any god. \n\nThis is still the same position. There has never been any evidence that a god is anything other than purely imaginary. Therefore there is no reason to believe the existence of a god outside of a person's imagination. \n\n\n\n\n\n\n", "gilded": 0, "created_utc": "1324736019", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Your pants are gonna need about tree fiddy.", "gilded": 0, "created_utc": "1324736968", "subreddit": "funny", "score": 113, "controversiality": 0}
{"body": "I need about tree fiddy", "gilded": 0, "created_utc": "1324740037", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "I ain't gonna give you no tree fiddy!", "gilded": 0, "created_utc": "1324740971", "subreddit": "funny", "score": 22, "controversiality": 0}
{"body": "\"What is that tiny thing?\"\n\n\"It's about tree fiddy.... inches....\"", "gilded": 0, "created_utc": "1324741894", "subreddit": "funny", "score": 10, "controversiality": 0}
{"body": "Fake. Who the fuck says \"Loch Ness monster is in my pants?\"", "gilded": 0, "created_utc": "1324742773", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "\"Well my baby calls me the Loch Ness monster, two great big humps and then I'm gone...\"  Grinderman - Worm Tamer", "gilded": 0, "created_utc": "1324743930", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Of course the Loch Ness Monster exists.  It keeps asking me for around tree fiddy. ", "gilded": 0, "created_utc": "1324744569", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "and it needs about tree fitty.", "gilded": 0, "created_utc": "1324744699", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I don't really understand how you can criticize not believing in fairytales.\n\nI guess the same way you'd criticize someone that doesn't believe in bigfoot or the loch ness monster.", "gilded": 0, "created_utc": "1324755148", "subreddit": "Christianity", "score": -11, "controversiality": 0}
{"body": "I'm going to post a rebuttal here, because I CBF making an account there.\n\n&gt;After all, God -- like the Loch Ness Monster or that Canadian girl I lost my virginity to junior year -- can neither be proven nor disproven.\n\nThat's one thing the religious/agnostics need to stop saying. The existence of an omniscient, omnipresent, all loving, sentient god that interacts with the physical universe, can in fact be disproved. The religious have been paring away god's superpowers for years as science has proved each of its claims to fame impossible.\n\nIt used to be that god could talk to us through burning bushes, but now he can't even send a text, for example. As science disproves each claim, god shrinks. Now he is nothing more than the threat of future punishment or promise of future reward. Unlike Job you will not be rewarded in this life, no matter how much you are \"tested\".\n\n&gt;I take issue with how deliberately and needlessly provocative the phrase is.\n\nOne says \"God is Great\" the other says \"God is Not Great\", but the *latter* is the one being provocative?\n\n&gt;But my main complaint is that most purveyors of this sentiment don't really have a beef with God.\n\nThat's because god doesn't really exist beyond the organised religions that claim to speak for him. There are no real \"acts of god\" to criticise. Just natural and human acts that are blamed on god. So we criticise the humans that claim to speak for a higher power, rather than the non-existent higher-power itself.\n\n&gt;And given how much we suck, why shut the door completely on the possibility of something in this universe being better, stronger and wiser?\n\nIf there is such a thing, it will not care for you any more than you care about an ant scurrying around in the Sahara. Our puny little existence is even less of an impact on the universe than that ant running around the Sahara impacts on your life.\n\n&gt;It's always seemed to me that the most virulent atheists -- not mere nonbelievers, but those who claim to be positive about God's nonexistence and openly hostile to anyone who could think otherwise -- are incapable of believing there could ever be something greater than they.\n\nNo, we are incapable of believing that something so awesomely powerful throughout the entire universe would be utterly undetectable *and* give a shit about what we do. Your god can't be detected, has no affect on the physical world, and no scientific reason to even exist. There is no theory to explain it and there is no evidence it exists. There is not even any indication that something is out there that is unexplained. There simply is no sign of a god. Yet you expect us to consider it possible that maybe he's hiding somewhere and we just don't know it?\n\nIf he is, then he has no affect on our lives, so who cares? He may as well not exist at all. And if there is no reason for him to exist, no evidence he exists, and no theory to even explain how he could exist, then put simply, god doesn't exist as a real force in the universe. It is nothing more than an abstract concept believed by people who aren't satisfied with the awesome power of the natural universe and want something more.\n\n&gt;looking at those in pain and believing there is an omnipotent power watching and refusing to help certain people because they haven't jumped hoops sufficiently to win prizes in the form of divine intervention.\n\nBut that's exactly what a belief in an omnipotent,  omnipresent, omniscient, all loving sentient god means. If such a god exists but allows evil to flourish, then it is because god doesn't want to get involved. Either that, or god *can't* get involved in which case he is not omnipotent, and therefore not god.\n\n&gt;And by the same token, faith need not be a sign of a feeble mind. \n\nIf a mind can believe a fairy tale is true, then it is feeble by definition.\n\n&gt;Usually not a trace of intelligence.\n\nOnly because the intelligence is all on the side he doesn't support. So when he looks at these arguments, he notices that all his \"team mates\" are morons, and to avoid thinking about that, assumes everyone in the conversation is equally retarded.\n\n&gt;other holding onto an undying conviction that nothing could be more divine than a mind with the ability to deny the existence of anything more divine.\n\nYet more proof of the authors bias and over-inflated ego. He totally misunderstands, or misrepresents, atheist beliefs to try and make them seem on a par with the religious beliefs that he dressed up as nothing more than people being open to the \"divine\".\n\nI don't deny the possibility of something more divine. I deny the existence of it. My theory makes the prediction that no matter how devout you are, no matter how good you are, no matter how hard you pray, no matter where you look, you will never find any evidence of god. To prove me wrong, all you need to do is find *one* piece of evidence pointing to a god.\n\nGod simply doesn't exist. all the good things in the universe that are attributed to a god come about for the same natural reasons as the bad things. All the good ideas attributed to god were actually thought up by man. *We* are the gods of this planet. Are there other \"gods\" out there? Probably. But they will be no more supernatural than we are.", "gilded": 0, "created_utc": "1324755778", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Tree fiddy?", "gilded": 0, "created_utc": "1324756223", "subreddit": "pics", "score": 8, "controversiality": 0}
{"body": "There's an episode of South Park where Chef's parents describe their encounter with the Loch Ness Monster. I believe the episode is called 'Succubus' and is quite an early one. You could find the clip on YouTube quite easily, and I would usually find it for you, but my computer/internet is being painfully slow right now.", "gilded": 0, "created_utc": "1324757636", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "Tree fitty", "gilded": 0, "created_utc": "1324759106", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1324759389", "subreddit": "worldpolitics", "score": 1, "controversiality": 0}
{"body": "LOCH NESS MONSTER I AIN'T GONNA GIVE YOU NO TREE FIDDY", "gilded": 0, "created_utc": "1324760377", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1324763087", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "out of ten? probably about tree fiddy", "gilded": 0, "created_utc": "1324763415", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.\n\nI honestly couldn't answer that for you. Unusuals are so hard to price, and even if you did sell if for a few buds, you'd have to change the buds into Bills. Once you have Bills, you'd either have to change them to keys, or buy coal in bulk. \n\n", "gilded": 0, "created_utc": "1324770391", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "AND IT WAS ABOUT THAT TIME that I realized that that blunt was really a crustacean from the paleolithic era.", "gilded": 0, "created_utc": "1324780273", "subreddit": "trees", "score": 5, "controversiality": 0}
{"body": "I would have posted this to [r/nutrition](http//:www.reddit.com/r/nutrition/) instead, but as a public health nutrition/dietetics student I think I can help sort some of this out. Also, trust dietitians (not non-RD nutritionists)! They receive an entire degree on nutrition and other health professionals do not have to have a single course on nutrition to be licensed in their respective fields (yes, the AMA does not require nutrition to be an accredited MD program). Not to say they don't know what they're talking about, but unless you look into their specific certifications, you won't know.\n\nEveryone's body is going to react slightly differently to different ratios of carbs/protein/fat and it depends on your body chemistry, how active you are, what type of activity you're doing and also personality factors that will affect your ability to follow any diet.\n\nPaleo is good for people who enjoy cooking (processed ready-to-eat foods are usually high carb) and/or have weight to lose. Keto is good for rapid weight loss, but only if you can stick to it. They are both bad for athletes unless we're talking significant weight loss in the off-season (think football player in the spring). As far as it being what people are used to, I just point to the fact that people living in the Paleolithic era lived into their 40's. Tradition is not always good and I personally believe that science is usually a better place to hang your hat and science backs diets with higher carb intakes.\n\nArtificial sweeteners have not been conclusively found to directly cause health problems. At least not in studies that stood up to peer review. They have been found to increase one's propensity to crave sweets (the sweet tooth) and thus people who drink diet sodas tend to eat higher sugar diets than people who drink non-sweet beverages. I believe it's entirely possible that they have very complicated metabolic effects that we haven't yet elucidated and certainly confer no health benefits, but as far as artificial sweeteners vs high fructose corn syrup goes, we're still a ways out from picking one over the other.\n\nSupplements are only necessary in people who do not receive adequate amounts of nutrition from their diet, which could be from intake, absorption and/or excretion. That being said, most people are inadequate in something. The key is that inadequate does not mean they have a deficiency. Long-term inadequacy (intake) could lead to deficiency (clinical), but most people hover in the range where their intake doesn't give them a clinical deficiency, but they could have long-term health benefits from increased intake. Of course, nutrition from food is better, but if you have a patient who is very unwilling to change their diet, I'd rather have them get their vitamins from a pill than not get them at all.", "gilded": 0, "created_utc": "1324786268", "subreddit": "Health", "score": 5, "controversiality": 0}
{"body": "CAN I BORROW TREE FIDDY", "gilded": 0, "created_utc": "1324787850", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1324789414", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "Tree fiddy? I ain't givin you no tree fiddy lockness monstah!", "gilded": 0, "created_utc": "1324789602", "subreddit": "technology", "score": 14, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1324790260", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "About tree fitty", "gilded": 0, "created_utc": "1324790278", "subreddit": "pics", "score": 20, "controversiality": 0}
{"body": "I can do tree fitty.", "gilded": 0, "created_utc": "1324790838", "subreddit": "firstworldproblems", "score": 23, "controversiality": 0}
{"body": "Ok, Loch Ness Monster, but only 'cause it's Christmas.", "gilded": 0, "created_utc": "1324791080", "subreddit": "pics", "score": 14, "controversiality": 0}
{"body": "This article is very poorly argued.\n\n&gt;After all, God -- like the Loch Ness Monster or that Canadian girl I lost my virginity to junior year -- can neither be proven nor disproven. And given that, it always seems to take an act of both extreme faith and arrogance to mock the very notion of a God or to tell others you know precisely what He is thinking.\n\nThe author is simply asserting without argument that God's existence can neither be proven or disproven—if he cares so much about arrogance, then he shouldn't glide so blithely over the history of intellectual work on the question of God. But then, from this unargued assertion, he concludes that the notion of God should not be mocked. This is a howler of a non sequitur. Indeed, he gives his own counterexample: even if the Loch Ness Monster can neither be proven or disproven, it hardly follows that there's anything wrong with mocking the notion of the Loch Ness Monster.\n\n&gt;That can't be the best way to honor God. I mean, think about your own parents. If you were really proud of your folks and wanted to tell everyone how great they were, would you whip out a list of things they hated?\n\nThis assumes that God is relevantly similar to human beings when it comes to honor. This badly contradicts the beginning of the article, which insists that God is so different from anything else as to be barely comprehensible.\n\n&gt;Are you so impressed with yourself or so intellectually uncurious that you think you perfectly understand the will of God just by reading a book? Hell, put five scholars in a room together and they'll fight about Shakespeare's actual intent with Hamlet. For what it's worth, Vladimir Nabokov and I have diametrically opposed views on Kafka's Metamorphosis. Does anyone truly understand what Joyce was on about in Ulysses? And these were just books written by geniuses -- not all-powerful, all-knowing deities.\n\nHere he's assuming that the greater the author of a book, the more difficult the book is for readers to understand. But that's an outrageous assumption, especially given the case in question: God created both the book and the human mind tasked with understanding the book, which should make it *easier* for God to bring the two into harmony.\n\n&gt;Having a one in four chance of being wrong about God is not that big a deal if you're telling people God loves them, but you don't really want to throw stones with those kinds of odds.\n\nThis doesn't make sense. Why is it worse to mislead people with a nice happy loving interpretation than with a mean hateful interpretation? Either kind of misinterpretation seems like a serious problem, assuming that there is a God and that it pays to get God right.\n\n&gt;But my main complaint is that most purveyors of this sentiment don't really have a beef with God. Even Hitchens' book mostly tears apart the abuses of organized religion, particularly Judaism, Islam and Christianity. I'm surprised how often atheists conflate the two things. Of course organized religion sucks. It's run by people. Religion, like government or anything structured and administered by humanity, will always be flawed and ruined by all of our weaknesses and failings.\n\nThis takes a rhetorical slogan too literally. When people say \"God is not great\" and then bash organized religion, they're not confusing two different things. They're using shorthand.\n\n&gt;And given how much we suck, why shut the door completely on the possibility of something in this universe being better, stronger and wiser? Something we could strive to be more like? It's always seemed to me that the most virulent atheists -- not mere nonbelievers, but those who claim to be positive about God's nonexistence and openly hostile to anyone who could think otherwise -- are incapable of believing there could ever be something greater than they. Not a lack of faith so much as humility. Certainly, that's not true for all atheists, but it doesn't help the atheist cause that the three most hostile atheists I can think of are also on the short-list for most overbearingly arrogant.\n\nHere he's guilty of defining God down (so that anything greater than humans somehow counts as God), assuming that atheists reject the very *possibility* of God (so that you're somehow not an atheist if you think God is as unlikely as unicorns), and mixing together epistemic confidence and hostility to religious believers (as if utterly agnostic skeptics are somehow required to look kindly upon religious believers, as if convinced atheists are somehow required to be hostile to them).\n\n&gt;While God's existence might be an open question, there is no shortage of people doing every damn thing they can to help themselves and still failing. If there is a God, we don't know who gets helped and why.\n\nThis simply begs the question against religious believers who think that if you turn to God in the right way, then you will definitely be helped. Again, the author is reduced to unargued assertion.\n\n&gt;And by the same token, faith need not be a sign of a feeble mind. But just mention God online and you'll be mocked as a mental deficient awaiting the second coming of the \"flying spaghetti monster.\"\n\nHere, he's mixing up two separate views: (i) all religious people are deeply stupid people through-and-through, (ii) all religious people conduct themselves in a deeply stupid way when it comes to their own religious views. Far more atheists hold the second view than the first.\n\n&gt;They will point to creationists and stem cell research protestors as people placing obstacles in the path of progress, and I'll agree with that too. But there is a difference between questioning the stupidity of dogmatic, close-minded zealots perpetrating institutional abuses and simply mocking sincerely held religious beliefs by equating faith with stupidity. It's sort of the difference between giving a formal presentation about the inherent flaws of your company's policies and procedures, and just farting in your boss's office.\n\nHere, he's mixing up two issues: (i) intellectual criticism vs. contemptuous mockery, and (ii) religious believers who bring religion into their politics vs. religious believers generally. Is he okay with mocking political creationists, or are they only to be criticized? Is he okay with criticizing religious believers generally, or is criticism to be reserved for the politically active ones? It's also totally unclear how religious beliefs are supposed to be okay if the believers are never to *act* on their beliefs in the political realm.\n\n&gt;But now, for many, citing the spaghetti monster means only that religious people who are stupid enough to believe in God may as well believe in spaghetti monsters or leprechauns.\n\nHere, he's simply begging the question against atheists who think one mythology is as good as another.\n\n&gt;\nUsually not a trace of intelligence. Just the worst aspects of blind faith from believers and atheists alike: some with unquestioning beliefs in a God just like the one in that Book, and other holding onto an undying conviction that nothing could be more divine than a mind with the ability to deny the existence of anything more divine.\n\nAgain, he's defining God down. And the charge of \"blind faith\" goes completely unsubstantiated.", "gilded": 0, "created_utc": "1324793257", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "This article is very poorly argued.\n\n&gt;After all, God -- like the Loch Ness Monster or that Canadian girl I lost my virginity to junior year -- can neither be proven nor disproven. And given that, it always seems to take an act of both extreme faith and arrogance to mock the very notion of a God or to tell others you know precisely what He is thinking.\n\nThe author is simply asserting without argument that God's existence can neither be proven or disproven—if he cares so much about arrogance, then he shouldn't glide so blithely over the history of intellectual work on the question of God. But then, from this unargued assertion, he concludes that the notion of God should not be mocked. This is a howler of a non sequitur. Indeed, he gives his own counterexample: even if the Loch Ness Monster can neither be proven or disproven, it hardly follows that there's anything wrong with mocking the notion of the Loch Ness Monster.\n\n&gt;That can't be the best way to honor God. I mean, think about your own parents. If you were really proud of your folks and wanted to tell everyone how great they were, would you whip out a list of things they hated?\n\nThis assumes that God is relevantly similar to human beings when it comes to honor. This badly contradicts the beginning of the article, which insists that God is so different from anything else as to be barely comprehensible.\n\n&gt;Are you so impressed with yourself or so intellectually uncurious that you think you perfectly understand the will of God just by reading a book? Hell, put five scholars in a room together and they'll fight about Shakespeare's actual intent with Hamlet. For what it's worth, Vladimir Nabokov and I have diametrically opposed views on Kafka's Metamorphosis. Does anyone truly understand what Joyce was on about in Ulysses? And these were just books written by geniuses -- not all-powerful, all-knowing deities.\n\nHere he's assuming that the greater the author of a book, the more difficult the book is for readers to understand. But that's an outrageous assumption, especially given the case in question: God created both the book and the human mind tasked with understanding the book, which should make it *easier* for God to bring the two into harmony.\n\n&gt;Having a one in four chance of being wrong about God is not that big a deal if you're telling people God loves them, but you don't really want to throw stones with those kinds of odds.\n\nThis doesn't make sense. Why is it worse to mislead people with a nice happy loving interpretation than with a mean hateful interpretation? Either kind of misinterpretation seems like a serious problem, assuming that there is a God and that it pays to get God right.\n\n&gt;But my main complaint is that most purveyors of this sentiment don't really have a beef with God. Even Hitchens' book mostly tears apart the abuses of organized religion, particularly Judaism, Islam and Christianity. I'm surprised how often atheists conflate the two things. Of course organized religion sucks. It's run by people. Religion, like government or anything structured and administered by humanity, will always be flawed and ruined by all of our weaknesses and failings.\n\nThis takes a rhetorical slogan too literally. When people say \"God is not great\" and then bash organized religion, they're not confusing two different things. They're using shorthand.\n\n&gt;And given how much we suck, why shut the door completely on the possibility of something in this universe being better, stronger and wiser? Something we could strive to be more like? It's always seemed to me that the most virulent atheists -- not mere nonbelievers, but those who claim to be positive about God's nonexistence and openly hostile to anyone who could think otherwise -- are incapable of believing there could ever be something greater than they. Not a lack of faith so much as humility. Certainly, that's not true for all atheists, but it doesn't help the atheist cause that the three most hostile atheists I can think of are also on the short-list for most overbearingly arrogant.\n\nHere he's guilty of defining God down (so that anything greater than humans somehow counts as God), assuming that atheists reject the very *possibility* of God (so that you're somehow not an atheist if you think God is as unlikely as unicorns), and mixing together epistemic confidence and hostility to religious believers (as if utterly agnostic skeptics are somehow required to look kindly upon religious believers, as if convinced atheists are somehow required to be hostile to them).\n\n&gt;While God's existence might be an open question, there is no shortage of people doing every damn thing they can to help themselves and still failing. If there is a God, we don't know who gets helped and why.\n\nThis simply begs the question against religious believers who think that if you turn to God in the right way, then you will definitely be helped. Again, the author is reduced to unargued assertion.\n\n&gt;And by the same token, faith need not be a sign of a feeble mind. But just mention God online and you'll be mocked as a mental deficient awaiting the second coming of the \"flying spaghetti monster.\"\n\nHere, he's mixing up two separate views: (i) all religious people are deeply stupid people through-and-through, (ii) all religious people conduct themselves in a deeply stupid way when it comes to their own religious views. Far more atheists hold the second view than the first.\n\n&gt;They will point to creationists and stem cell research protestors as people placing obstacles in the path of progress, and I'll agree with that too. But there is a difference between questioning the stupidity of dogmatic, close-minded zealots perpetrating institutional abuses and simply mocking sincerely held religious beliefs by equating faith with stupidity. It's sort of the difference between giving a formal presentation about the inherent flaws of your company's policies and procedures, and just farting in your boss's office.\n\nHere, he's mixing up two issues: (i) intellectual criticism vs. contemptuous mockery, and (ii) religious believers who bring religion into their politics vs. religious believers generally. Is he okay with mocking political creationists, or are they only to be criticized? Is he okay with criticizing religious believers generally, or is criticism to be reserved for the politically active ones? It's also totally unclear how religious beliefs are supposed to be okay if the believers are never to *act* on their beliefs in the political realm.\n\n&gt;But now, for many, citing the spaghetti monster means only that religious people who are stupid enough to believe in God may as well believe in spaghetti monsters or leprechauns.\n\nHere, he's simply begging the question against atheists who think one mythology is as good as another.\n\n&gt;\nUsually not a trace of intelligence. Just the worst aspects of blind faith from believers and atheists alike: some with unquestioning beliefs in a God just like the one in that Book, and other holding onto an undying conviction that nothing could be more divine than a mind with the ability to deny the existence of anything more divine.\n\nAgain, he's defining God down. And the charge of \"blind faith\" goes completely unsubstantiated.", "gilded": 0, "created_utc": "1324793497", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "God damn loch ness monster, I ain't givin' you no tree fifty!", "gilded": 0, "created_utc": "1324794288", "subreddit": "firstworldproblems", "score": 7, "controversiality": 0}
{"body": "yo dawg i heard you like christmas trees so i put trees on your tree while you tree fiddy", "gilded": 0, "created_utc": "1324795375", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "tree fitty", "gilded": 0, "created_utc": "1324795593", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "You found Nessie!\n   I also didn't see the original, and I think this kicks ass", "gilded": 0, "created_utc": "1324801014", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "I give ya tree fiddy fo it. TREE FIDDY!", "gilded": 0, "created_utc": "1324833104", "subreddit": "wow", "score": 1, "controversiality": 0}
{"body": "Thanks man, nice username :D\n\nUnlike the rest of us 99%, your vote actually counts for something. Spare a 5?\n\nhttp://www.threadless.com/submission/390385/Occupeye\n\nI think we need about tree fiddy", "gilded": 0, "created_utc": "1324834029", "subreddit": "funny", "score": 21, "controversiality": 0}
{"body": "I need about tree fiddy", "gilded": 0, "created_utc": "1324835816", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "It was about that time I realized this wilderness was 8 stories tall and actually a crustacean from the paleolithic era!!!", "gilded": 0, "created_utc": "1324836471", "subreddit": "IAmA", "score": 0, "controversiality": 0}
{"body": "You'd have about tree fiddy", "gilded": 0, "created_utc": "1324838220", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "Tree fiddy?", "gilded": 0, "created_utc": "1324841389", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I do agree. When I am listening to a kid talk about Santa Claus, or an adult talk about Jesus, many similar thoughts run through my head. There is _more evidence_ for Santa Claus, the Easter Bunny, the Loch Ness monster, and Bigfoot than there is for Yahweh. We routinely disregard those entities without a polite nod to those who spend their lives earnestly searching for them. For me it's the same with religion, except I give a few polite nods here and there.", "gilded": 0, "created_utc": "1324853344", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1324859474", "subreddit": "gaming", "score": 14, "controversiality": 0}
{"body": "All I need is about tree fiddy.", "gilded": 0, "created_utc": "1324862780", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "I ain't givin you no goddamned tree fitty!", "gilded": 0, "created_utc": "1324869049", "subreddit": "AdviceAnimals", "score": 3, "controversiality": 0}
{"body": "I needa axe you for about tree fitty.", "gilded": 0, "created_utc": "1324870924", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "God damn you loch ness monster.", "gilded": 0, "created_utc": "1324881928", "subreddit": "hardware", "score": 2, "controversiality": 0}
{"body": "give ya tree fiddy for it", "gilded": 0, "created_utc": "1324885925", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "It just wants bout tree fitty.", "gilded": 0, "created_utc": "1324888011", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "damnit the lochness monster .. and he needs about tree fiddy\n", "gilded": 0, "created_utc": "1324891892", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I got some (admitedly awesome) hand-me-down clothing and like tree fiddy. Also had an awesome meal and got drunk. \n\nChristmas is fucking awesome. If i ever had kids like that, i'd kick them out the house as soon as legally possible. ", "gilded": 0, "created_utc": "1324902076", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1324909429", "subreddit": "pics", "score": 11, "controversiality": 0}
{"body": "about tree fitty", "gilded": 0, "created_utc": "1324923043", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Bout tree fiddy", "gilded": 0, "created_utc": "1324925715", "subreddit": "funny", "score": 42, "controversiality": 0}
{"body": "&gt; there is a lake in Thailand where pink fireballs shoot up into the air-and no one knows why\n\n\n\n\nLoch Ness monster cumming! Sheese, people are *so* uninformed when it comes to monster sex!", "gilded": 0, "created_utc": "1324931357", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "I reckon you need about tree fiddy...", "gilded": 0, "created_utc": "1324945061", "subreddit": "Jokes", "score": 4, "controversiality": 0}
{"body": "That's about tree fiddy.", "gilded": 0, "created_utc": "1324950293", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Just about tree fiddy", "gilded": 0, "created_utc": "1324952380", "subreddit": "gaming", "score": 5, "controversiality": 0}
{"body": "I ain't givin you god damn tree fiddy Loch Ness Monster!", "gilded": 0, "created_utc": "1324952525", "subreddit": "gaming", "score": 3, "controversiality": 0}
{"body": "Don't fall for it! he's the god damn loch ness monster!", "gilded": 0, "created_utc": "1324952553", "subreddit": "gaming", "score": 5, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1324952767", "subreddit": "starcraft", "score": 0, "controversiality": 0}
{"body": "Don't do that! It's nudes of the Loch Ness monster. ", "gilded": 0, "created_utc": "1324958315", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "Nice try, Loch Ness Monster.", "gilded": 0, "created_utc": "1324961897", "subreddit": "skyrim", "score": 9, "controversiality": 0}
{"body": "bout tree fiddy", "gilded": 0, "created_utc": "1324963464", "subreddit": "web_design", "score": 4, "controversiality": 0}
{"body": "He looks maybe tree fitty to maybe fo hundred", "gilded": 0, "created_utc": "1324968277", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "fuck you im not clicking on that link, but maybe for tree fitty", "gilded": 0, "created_utc": "1324968841", "subreddit": "nosleep", "score": 4, "controversiality": 0}
{"body": "Goddamn loch Ness monster all over reddit these days! Get outta here! ", "gilded": 0, "created_utc": "1324971065", "subreddit": "firstworldproblems", "score": 5, "controversiality": 0}
{"body": "and Ticketmaster is owned by the Loch Ness monster\n\n\"I need about three-fitty\"", "gilded": 0, "created_utc": "1324976693", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I thought this was going to end with 'I need about tree fiddy'", "gilded": 0, "created_utc": "1324978783", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Can you afford tree fiddy? ", "gilded": 0, "created_utc": "1324979571", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Goddamn Loch Ness Monster!", "gilded": 0, "created_utc": "1324984321", "subreddit": "Music", "score": 2, "controversiality": 0}
{"body": "The GD Loch Ness Monster.  Is that a problem?", "gilded": 0, "created_utc": "1324999599", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "surely you mean *tree fiddy*", "gilded": 0, "created_utc": "1324999677", "subreddit": "funny", "score": 207, "controversiality": 0}
{"body": "Goddamn Loch Ness Monster.", "gilded": 0, "created_utc": "1325000551", "subreddit": "funny", "score": 32, "controversiality": 0}
{"body": "HOLY SHIT TECHNOBUFFALO. My boy Noah getting sued... for tree fitty. NOOOOOOOOOOOOOOOOOOOOOOOOOOOO", "gilded": 0, "created_utc": "1325003276", "subreddit": "technology", "score": -1, "controversiality": 0}
{"body": "I need about tree fiddy", "gilded": 0, "created_utc": "1325004292", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "and I said \"Goddammit Loch Ness Monster, I ain't givin you no tree-fiddy.\"", "gilded": 0, "created_utc": "1325008125", "subreddit": "funny", "score": 14, "controversiality": 0}
{"body": "I gave him tree fiddy ", "gilded": 0, "created_utc": "1325010063", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "What?! You gave that monsta tree fiddy?!", "gilded": 0, "created_utc": "1325010536", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "More like the truth about Roswell, truth about Pearl Harbor, truth about the moon landing, truth about bigfoot and loch ness monster. Yup I just did have the same kneejerk reaction. ", "gilded": 0, "created_utc": "1325015921", "subreddit": "entertainment", "score": 19, "controversiality": 0}
{"body": "Also, I need about tree fiddy.", "gilded": 0, "created_utc": "1325018602", "subreddit": "IAmA", "score": 28, "controversiality": 0}
{"body": "Upvote if you believe in Nessie.", "gilded": 0, "created_utc": "1325026192", "subreddit": "videos", "score": 2, "controversiality": 0}
{"body": "Wow, the Loch Ness Monster is a good tipper", "gilded": 0, "created_utc": "1325029677", "subreddit": "pics", "score": 15, "controversiality": 0}
{"body": "Upvote if you believe in Nessie.", "gilded": 0, "created_utc": "1325031148", "subreddit": "worldnews", "score": -6, "controversiality": 0}
{"body": "What does everyone have against Nessie? =(", "gilded": 0, "created_utc": "1325032523", "subreddit": "worldnews", "score": 2, "controversiality": 0}
{"body": "SK: We're really sorry about your dear leader dying, so uh... we're going now.\n\n\nNK: Wait wait wait there's one more thing...\n\n\nSK: *Sigh* What is it now?\n\n\nNK: I'm gonna need about tree fiddy.", "gilded": 0, "created_utc": "1325040271", "subreddit": "worldnews", "score": 5, "controversiality": 0}
{"body": "then I realized NK was actually loch ness monster\n", "gilded": 0, "created_utc": "1325041165", "subreddit": "worldnews", "score": 2, "controversiality": 0}
{"body": "Can't be him, he would have a total around about tree fiddy.", "gilded": 0, "created_utc": "1325046010", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Upvote if you believe in Nessie.", "gilded": 0, "created_utc": "1325049810", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "When I was in about 3rd grade I saw something out in Lake Erie. Probably about 6 feet tall or more and black or very dark. It was there for about 5 or 10 seconds and then pivoted at the surface and went into the water. A few months later I saw the cover of a Loch Ness book and was excited because \"Hey! That's what I saw!\" I even told the class for show and tell. When I was younger I would've sworn on my life that this is what I had seen. Now that I'm older I've started doubting myself. I was young so it could've been bad eyesight before I had glasses, my imagination, a duck that I misjudged the distance on, a bouy, a sturgeon doing some strange motion, or a few other things. I was obsessed with the Loch Ness monster for a while after that and I still really want to know what I actually saw.", "gilded": 0, "created_utc": "1325052267", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "My question to you:\n\nYou claim that God created the universe. What proof do you have that this is true? Why do you believe in things that have zero evidence of being correct? Why do you pick God, instead of Zeus, Thor, or the flying spaghetti monster? What makes your God more valid then any other?\n\nAlso requiring proof of absence is WROOOONG. If that's the case, do you believe in leprechauns, dragons, Bigfoot, faeries, the loch ness monster, ghosts, and UFOs until proven otherwise? Because if you don't, then you should apply the same logic to God. The concept of God doesn't get special treatment.", "gilded": 0, "created_utc": "1325055927", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "&gt;What proof do you have that this is true?\n\nMostly what sways me are things like the incredible organization and how well things FIT. I look at mathematics, for example, and I see something like e^i(pi)=-1. Where does e come from? Interest rates. Pi comes from circles, and i comes from the theoretical concept of a negative square root. But somehow if you put them all together they become very neat and organized. Similarly with things like integration. A limit of an infinite sum has no reason to turn out as neatly as it does. To me this speaks of some higher intelligence designing it.\n\n&gt;What makes your God more valid than any other?\n\nNothing. My God could very well be called Thor or Zeus or the FSM. I suppose it would be more accurate to say that I believe that a God created the universe.\n\n&gt;If that's the case, do you believe in leprechauns, dragons, Bigfoot, faeries, the loch ness monster, ghosts, and UFOs until proven otherwise?\n\nI consider these concepts seriously, but they are of somewhat lesser importance than the concept of God BECAUSE the concept of God has a specific claim that it has the ability to torture me forever and none of the ones you mentioned have such claims. As such, I feel that the likelihood of dragon existence matters very little to my life excepting the possibility that the dragon in question is about to ravage my home, in which case there isn't anything I can do about it. I am as prepared as I feel like I can be for a zombie apocalypse.", "gilded": 0, "created_utc": "1325056217", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Do you think we should keep taxes exactly how they are?\n\nNot to mention, being opposed and not believing in something *can* be the same, but not always.  For example, I don't believe in the loch ness monster, but I have nothing against it if it did turn out to exist.  I don't believe that any god or gods exist, but I wouldn't necessarily be opposed to them.  I, personally, am opposed to religion, but it is also possible for an atheist to not be opposed to it.", "gilded": 0, "created_utc": "1325057403", "subreddit": "AdviceAnimals", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1325057817", "subreddit": "AdviceAnimals", "score": 22, "controversiality": 0}
{"body": "I'm Scottish, but am not Groundskeeper Willie. And I hate bagpipes. And there is no Loch Ness Monster.", "gilded": 0, "created_utc": "1325065830", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Damn loch ness monster!", "gilded": 0, "created_utc": "1325079858", "subreddit": "AdviceAnimals", "score": 5, "controversiality": 0}
{"body": "&gt; To an atheist, science is their \"religion.\"\n\nNot according to any sensible definition of religion. If you're using the word so vaguely, then football is also a religion.\n\nTell me, if science is a religion, which religion are Christians who are also scientists? What religion are Christians who at least accept scientific fact, just as an atheist would?\n\nAh, I think I see what the problem might be. Are you thinking of [Scientology](http://en.wikipedia.org/wiki/Scientology)? Because that has nothing to do with science.\n\n&gt; But why is it that they have to destroy religion? It doesn't help\n\nSome atheists believe that religion is an overall negative force in the world and that ridding the world of it would be a positive thing which would indeed help. There are clearly certain aspects of at least some religions which the world *would* be better without.\n\n&gt; Atheists, you have science... Christians have faith.\n\n1. I'd like you to define what you mean by \"*faith*\" and explain in what way it is comparable to science.\n2. Why do you speak as though Christians can't accept science? Most Christians accept science just as much as atheists. And all Christians use evidence, reasoning, logic, skepticism etc. elsewhere in their lives without requiring faith. Do you have \"*faith*\" in gravity or \"*faith*\" that you can't walk through walls?\n\n&gt; But in order to create a better world where people and society can progress, we need to stop the assault on belief.\n\nWhat do you mean by \"*assault*\"? Asking difficult questions isn't \"*assault*\". Being skeptical isn't \"*assault*\". Debating isn't \"*assault*\". You make it sound like atheists are assassinating Christians in the street, plotting to kill the pope, kidnapping and terrorizing them. If anything, it's probably the other way around.\n\nWhat happens when we stop questioning, do away with skepticism and rational inquiry? I'll tell you what: people get taken in by Internet scams, they use homeopathic medicine and faith healing instead of real medicine, sometimes with tragic results, they start believing in ghosts and alien abductions and the Loch Ness Monster etc.\n\n&gt; Christianity- We have faith in a higher power. Atheism- You have faith in science and technology\n\nOnce again, what do you mean by the word \"*faith*\"? You seem to have diluted it to the point of meaninglessness there; to the point that everybody has faith in everything that they claim to know. And once again, why do you think accepting science and technology is mutually exclusive with being a Christian? Are you a crazy young-Earth creationist? Either way, you're using a computer, aren't you? Better be careful that your use of the computer doesn't convert you to the heathen religion of science!", "gilded": 0, "created_utc": "1325083730", "subreddit": "Christianity", "score": 3, "controversiality": 0}
{"body": "&gt; i have no cash\n\nI hate being a sourpuss, but you don't have 2,49 €? Really?\n\nI'm all for the sharing of joy and people being nice, but I really hate moochers and beggars. It just comes off as \"I can't be arsed to spend this cash, lemme beg for it since it's cheap\"...\n\nDon't take this as me condemning you - for all I know, your situation could be \"legit,\" as the expression goes - I'm just curious how you can have a decent computer and Internet, but not two bucks fifty. That's less than the Loch Ness Monster tries to mooch for.", "gilded": 0, "created_utc": "1325087094", "subreddit": "Terraria", "score": 4, "controversiality": 0}
{"body": "Looks like the [loch ness monster](http://monster-legends.info/images/nessie%20sighting.jpg) !!", "gilded": 0, "created_utc": "1325103935", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "I need bout tree fiddy.", "gilded": 0, "created_utc": "1325107914", "subreddit": "gaming", "score": 3, "controversiality": 0}
{"body": "Tree fiddy?\n\nFo rizzle?", "gilded": 0, "created_utc": "1325111653", "subreddit": "gaming", "score": 6, "controversiality": 0}
{"body": "You got tree fiddy I can borrow?", "gilded": 0, "created_utc": "1325113895", "subreddit": "AskReddit", "score": 12, "controversiality": 0}
{"body": "&gt;~Tree fiddy\n\nFTFY\n\n", "gilded": 0, "created_utc": "1325117646", "subreddit": "funny", "score": 77, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1325120707", "subreddit": "trees", "score": 23, "controversiality": 0}
{"body": "Don't give dat loch ness monsta no tree fiddy!", "gilded": 0, "created_utc": "1325126228", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "You, sir, don't know what you're talking about.  Why does an atheist need evidence to back up a \"claim\" that something *doesn't* exist.  What evidence do you have that the loch ness monster doesn't exist, or dragons aren't hiding on some mountain somewhere?\n\nAgnostic is simply avoiding/refusing to answer the question: Do you believe in a god or gods?  Being agnostic or gnostic answers the question: Do you *know* whether a god or gods exist?\n\nYou can be agnostic and atheist or agnostic and theist at the same time.  If you are just agnostic and neither of the above, then you are just refusing to say what you believe.", "gilded": 0, "created_utc": "1325130848", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "didn't she give YOU a dollar, nessie?", "gilded": 0, "created_utc": "1325133857", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "I lost about tree fiddy", "gilded": 0, "created_utc": "1325135637", "subreddit": "funny", "score": 47, "controversiality": 0}
{"body": "It was about that time I noticed that this vending machine happened to be a 7 story tall dinosaur from the Cretaceous period. and I said, \"Loch Ness Monster I ain't given you no damn tree-fiddy!", "gilded": 0, "created_utc": "1325135899", "subreddit": "pokemon", "score": 2, "controversiality": 0}
{"body": "...got-damned Loch Ness monster!", "gilded": 0, "created_utc": "1325137431", "subreddit": "pics", "score": 17, "controversiality": 0}
{"body": "I heard it was about tree fiddy.", "gilded": 0, "created_utc": "1325140092", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "is it wierd that im the lock ness monster and i want tree fitty", "gilded": 0, "created_utc": "1325140839", "subreddit": "fffffffuuuuuuuuuuuu", "score": 2, "controversiality": 0}
{"body": "I ain't giving you no tree-fitty you goddamn Loch Ness Monster! Get your own goddamn money.", "gilded": 0, "created_utc": "1325141045", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "about tree fiddy. ", "gilded": 0, "created_utc": "1325146692", "subreddit": "AskReddit", "score": 9, "controversiality": 0}
{"body": "The french fries cost exactly tree fiddy. \n\nThis cannot be legitimate.", "gilded": 0, "created_utc": "1325150035", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "No!  Goddamn loch ness monster.", "gilded": 0, "created_utc": "1325152208", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I was going to say the same, but after reading his condescending responses further down, I decided not to bother.\n\nThe idea that, as a financially independent woman with a real career and absolutely no desire to have a child (ever!), I'm \"programmed\" to find a man of means is laughable. Are lesbians also programmed like this?\n\nI'm sure financial stability was *really* important in the Paleolithic era.", "gilded": 0, "created_utc": "1325153574", "subreddit": "SRSDiscussion", "score": 18, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1325174732", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1325178691", "subreddit": "trees", "score": 8, "controversiality": 0}
{"body": "67 refined plus my Nessie's Nine Iron #2 and Spycicle #72. Pretty nice.", "gilded": 0, "created_utc": "1325194076", "subreddit": "tf2", "score": 1, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1325195850", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I never though of that!  That must be why they did it.  You can drain the lake looking for Nessie, but Bigfoot can be ANYWHERE!", "gilded": 0, "created_utc": "1325197504", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "about tree fiddy?", "gilded": 0, "created_utc": "1325201205", "subreddit": "funny", "score": 68, "controversiality": 0}
{"body": "God damn loch ness monster", "gilded": 0, "created_utc": "1325203171", "subreddit": "funny", "score": 34, "controversiality": 0}
{"body": "IIRC, it wan an 8 story tall crustacean from the Paleolithic era. ", "gilded": 0, "created_utc": "1325207890", "subreddit": "worldnews", "score": 7, "controversiality": 0}
{"body": "I'm the guy you tip. Do you have tree fiddy?", "gilded": 0, "created_utc": "1325210943", "subreddit": "worldnews", "score": 0, "controversiality": 0}
{"body": "Too slow for a key. I just bought a copy instead. \n\nIt was two fiddy. I bought this and still had a dolla for that damn Loch Ness Monster. :)", "gilded": 0, "created_utc": "1325211218", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "You suck! I thought they really did exist, you know like the loch ness monster.", "gilded": 0, "created_utc": "1325215642", "subreddit": "DIY", "score": 0, "controversiality": 0}
{"body": "&gt; 8 story tall crustacean from the Paleolithic era\n\nSigh... They don't make 'em like they used to.", "gilded": 0, "created_utc": "1325219270", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Damn Loch Ness Monster tricked me again.", "gilded": 0, "created_utc": "1325221369", "subreddit": "4chan", "score": 19, "controversiality": 0}
{"body": "&gt;Aboot tree Fiddy.\n\nFTFY", "gilded": 0, "created_utc": "1325221951", "subreddit": "buildapc", "score": 4, "controversiality": 0}
{"body": "EDC in Vegas required from tree fiddy (350) to 500 dollars for three days when factoring hotel, transportation, drugs, food, etc.", "gilded": 0, "created_utc": "1325226900", "subreddit": "Music", "score": 1, "controversiality": 0}
{"body": "BOUT TREE FIDDY ", "gilded": 0, "created_utc": "1325227018", "subreddit": "AskReddit", "score": 53, "controversiality": 0}
{"body": "Don't you be givin' that barista no tree fiddy now!", "gilded": 0, "created_utc": "1325227229", "subreddit": "AskReddit", "score": 16, "controversiality": 0}
{"body": "So, what you're saying is it's about tree fiddy?", "gilded": 0, "created_utc": "1325227767", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "That's right. I said, \"I ain't giving' you no tree-fiddy, you goddamn Loch Ness Monster! Get your own goddamn money!\"", "gilded": 0, "created_utc": "1325228736", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I know some dudes in Atlanta that make rocks. They sell 'em too. Cost ya about tree fitty.", "gilded": 0, "created_utc": "1325231623", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1325237264", "subreddit": "circlejerk", "score": 22, "controversiality": 0}
{"body": "&gt;Because you only have tree fiddy\n\nFTFY", "gilded": 0, "created_utc": "1325255204", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "TREE FIDDY\n\nGOD DAMMIT", "gilded": 0, "created_utc": "1325256716", "subreddit": "4chan", "score": 1, "controversiality": 0}
{"body": "It's aboslutely never too late for a NES. I would give my left nut twice to get my old NES with all its games back. Oh, Nessie.. how I miss you.", "gilded": 0, "created_utc": "1325257285", "subreddit": "AskReddit", "score": 10, "controversiality": 0}
{"body": "Alls I gots is tree fitty. TV can go in a reddit fort.", "gilded": 0, "created_utc": "1325258027", "subreddit": "Atlanta", "score": 1, "controversiality": 0}
{"body": "Don't forget the level where you fight against the combined efforts of Bigfoot and Nessie.", "gilded": 0, "created_utc": "1325281972", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "[nessie](http://upload.wikimedia.org/wikipedia/en/thumb/7/79/Lochnessmonster.jpg/220px-Lochnessmonster.jpg)", "gilded": 0, "created_utc": "1325288959", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "God dammit Loch Ness monster, get off of Reddit!", "gilded": 0, "created_utc": "1325295643", "subreddit": "IAmA", "score": 7, "controversiality": 0}
{"body": "Good sir, I am not as you say a \"faggot\". I have a girlfriend. Well...she isnt really my girlfriend...shes just a friend. Well shes not really a friend...shea just a girl...Well shes really not a girl...shE says that she just wants her tree fiddy GOD DAMMIT LOCH NESS MONSTER tricked me again.", "gilded": 0, "created_utc": "1325304777", "subreddit": "4chan", "score": 5, "controversiality": 0}
{"body": "I know he isn't the loch ness monster, but maybe he needs about tree-fiddy.", "gilded": 0, "created_utc": "1325304786", "subreddit": "nosleep", "score": 10, "controversiality": 0}
{"body": "bout tree fiddy", "gilded": 0, "created_utc": "1325305280", "subreddit": "AskReddit", "score": 36, "controversiality": 0}
{"body": "Since when is a site that can be edited to say that I am a 8 story tall lizard from the paleolithic era who needs about tree fiddy,a reliable source?", "gilded": 0, "created_utc": "1325309465", "subreddit": "todayilearned", "score": -2, "controversiality": 0}
{"body": "He traded me for Nessies Nine Iron, Postal Pummeler, and the Bazaar Bargain. Quick, easy, and polite. 10/10 would trade with again.", "gilded": 0, "created_utc": "1325314430", "subreddit": "tf2trade", "score": 5, "controversiality": 0}
{"body": "Well, I need about tree fiddy", "gilded": 0, "created_utc": "1325321270", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Is that beasty on the cover The Leviathan seen during Carmageddon, \"The Whale\" that ate Noah, or the Loch Ness Monster?", "gilded": 0, "created_utc": "1325323450", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Because the \"I WANTED TO SAY THAT!! LOL WE'RE SO FUNNY!\" comments are pointless and stupid, and in most cases whoever posted such comment didn't think of that joke before he/she viewed comments.\n\nckelley87 should have just upvoted Nessie instead of announcing it.\n\n&gt; If you're going to upvote the original, you should upvote this guy. &gt;.&gt;\n\nWhy? Because he said he thought of that before Nessie but was too late to comment?", "gilded": 0, "created_utc": "1325328736", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "Seeing as you're throwing 1 million a month down the toilet on tevez, I'd say about… tree fiddy", "gilded": 0, "created_utc": "1325343612", "subreddit": "soccer", "score": 1, "controversiality": 0}
{"body": "I have a Market Gardener and a Nessie's Nine Iron, how about a scrap each?", "gilded": 0, "created_utc": "1325347636", "subreddit": "tf2items", "score": 1, "controversiality": 0}
{"body": "I know it is, but it still fucking asks for about tree fitty until I have to murder everyone in a 3 mile radius.", "gilded": 0, "created_utc": "1325348368", "subreddit": "videos", "score": -8, "controversiality": 0}
{"body": "it's \"Tree Fiddy\"\n", "gilded": 0, "created_utc": "1325350688", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "\"No, you God damn Loch Ness Monsta, I ain't givin' you no tree fiddy!\"", "gilded": 0, "created_utc": "1325355193", "subreddit": "funny", "score": 9, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1325357035", "subreddit": "REDDITEXCHANGE", "score": 2, "controversiality": 0}
{"body": "I asked the Department of Homeland Security, \"How can I help prevent such a terrible disaster from recurring?\"\n\nAnd it said to me: \"I need about two-fiddy.\"\n\nIt just was about then that I realized that this \"DHS\" was the god damn Loch Ness monster!", "gilded": 0, "created_utc": "1325364084", "subreddit": "WTF", "score": 4, "controversiality": 0}
{"body": "Goddamn Loch Ness monster!", "gilded": 0, "created_utc": "1325370242", "subreddit": "funny", "score": 147, "controversiality": 0}
