{"body": "LOL WOW good explination. you are right kind sir. but then what of the loch ness monster? need nessie be under represented?", "gilded": 0, "created_utc": "1301697798", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "This is sort of my point. We could bring up a whole list of things that people may or may not have seen, and it's just going to end up annoying people and then being ignored. Besides, the loch ness monster would only really need to be asked about when we meet people who've been to the loch - which is a very small percentage of IAmA posters, I imagine.", "gilded": 0, "created_utc": "1301698028", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Nessie's been found! ", "gilded": 0, "created_utc": "1301712933", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "NESSIE", "gilded": 0, "created_utc": "1301713030", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "\"What do you want from us Jesus!?\"\n\n\"...I need about tree fiddy.", "gilded": 0, "created_utc": "1301719743", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "Go to the same location in Google Earth.  Turn on the 3D buildings layer.\n\nMUCH better Nessie!\n", "gilded": 0, "created_utc": "1301721697", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt; I'm not going to list all my experiences for you to pick apart, and my age range has been 7 to very recently so nearly 40.\n\nIt's a pity that you're not attempting to explain yourself.\n\n&gt;  I believe all the names of Gods that people have thought up refer to the same God.\n\nAre you aware that drought stricken societies in the past often believed in cruel gods? Yet you think you're able to know god's will because you say that \"he cares for us\".  If they're right you're wrong; if you're right they're wrong, but they had as much reason to think that as you do. For all gods to be true they would share a personality (cruel or kind) and so they could be nothing at all like how people have known them. This suggests that humans aren't able to detect the will of your universal god.\n\nIt's more honest to be humble enough to admit you we don't know because faith and evidence aren't enough to know anything about the supernatural. They're especially not enough to gamble on the correct god while ignoring all others.\n\n&gt; Just because I can't prove my soul goes deeper, doesn't mean it doesn't.\n\nSure, but it does mean that you have as much of a reason to think you've got a deep soul as you do a shallow soul, or to believe that you're reincarnate of the Loch Ness Monster.\n\n&gt; You can't prove that it doesn't go deeper, but you seem to think that is the truth.\n\nAbsolutely not, you're very confused about what I (and other atheists) are claiming and here's the core of it:\n\nThe onus is on people making claims to prove them. For example,\n\n\"A fire-breathing dragon lives in my garage\"\n\nSuppose I seriously make such an assertion to you.  Surely you'd want to check it out, see for yourself.  There have been innumerable stories of dragons over the centuries, but no real evidence. What an opportunity!\n\n\"Show me,\" you say.  I lead you to my garage.  You look inside and see a ladder, empty paint cans, an old tricycle -- but no dragon.\n\n\"Where's the dragon?\" you ask.\n\n\"Oh, she's right here,\" I reply, waving vaguely.  \"I neglected to mention that she's an invisible dragon.\"\n\nYou propose spreading flour on the floor of the garage to capture the dragon's footprints.\n\n\"Good idea,\" I say, \"but this dragon floats in the air.\"\n\nThen you'll use an infrared sensor to detect the invisible fire.\n\n\"Good idea, but the invisible fire is also heatless.\"\n\nYou'll spray-paint the dragon and make her visible.\n\n\"Good idea, but she's an incorporeal dragon and the paint won't stick.\"  And so on.  I counter every physical test you propose with a special explanation of why it won't work.\n\nNow, what's the difference between an invisible, incorporeal, floating dragon who spits heatless fire and no dragon at all?  If there's no way to disprove my contention, no conceivable experiment that would count against it, what does it mean to say that my dragon exists?  Your inability to invalidate my hypothesis is not at all the same thing as proving it true.  Claims that cannot be tested, assertions immune to disproof are veridically worthless, whatever value they may have in inspiring us or in exciting our sense of wonder.  What I'm asking you to do comes down to believing, in the absence of evidence, on my say-so.  The only thing you've really learned from my insistence that there's a dragon in my garage is that something funny is going on inside my head.  You'd wonder, if no physical tests apply, what convinced me.  The possibility that it was a dream or a hallucination would certainly enter your mind.  But then, why am I taking it so seriously?  Maybe I need help.  At the least, maybe I've seriously underestimated human fallibility.  Imagine that, despite none of the tests being successful, you wish to be scrupulously open-minded.  So you don't outright reject the notion that there's a fire-breathing dragon in my garage.  You merely put it on hold.  Present evidence is strongly against it, but if a new body of data emerge you're prepared to examine it and see if it convinces you.  Surely it's unfair of me to be offended at not being believed; or to criticize you for being stodgy and unimaginative -- merely because you rendered the Scottish verdict of \"not proved.\"\n\nImagine that things had gone otherwise.  The dragon is invisible, all right, but footprints are being made in the flour as you watch.  Your infrared detector reads off-scale.  The spray paint reveals a jagged crest bobbing in the air before you.  No matter how skeptical you might have been about the existence of dragons -- to say nothing about invisible ones -- you must now acknowledge that there's something here, and that in a preliminary way it's consistent with an invisible, fire-breathing dragon.\n\nNow another scenario: Suppose it's not just me.  Suppose that several people of your acquaintance, including people who you're pretty sure don't know each other, all tell you that they have dragons in their garages -- but in every case the evidence is maddeningly elusive.  All of us admit we're disturbed at being gripped by so odd a conviction so ill-supported by the physical evidence.  None of us is a lunatic.  We speculate about what it would mean if invisible dragons were really hiding out in garages all over the world, with us humans just catching on.  I'd rather it not be true, I tell you.  But maybe all those ancient European and Chinese myths about dragons weren't myths at all.\n\nGratifyingly, some dragon-size footprints in the flour are now reported.  But they're never made when a skeptic is looking.  An alternative explanation presents itself.  On close examination it seems clear that the footprints could have been faked.  Another dragon enthusiast shows up with a burnt finger and attributes it to a rare physical manifestation of the dragon's fiery breath.  But again, other possibilities exist.  We understand that there are other ways to burn fingers besides the breath of invisible dragons.  Such \"evidence\" -- no matter how important the dragon advocates consider it -- is far from compelling.  Once again, the only sensible approach is tentatively to reject the dragon hypothesis, to be open to future physical data, and to wonder what the cause might be that so many apparently sane and sober people share the same strange delusion. \n\n(quoted liberally from Carl Sagan)\n\n&gt; Aren't you the pot calling the kettle black? You have no facts about the supernatural world or God or energy that is other worldly.\n\nA person who doesn't believe in gods isn't claiming that they don't exist, they're claiming that they're currently unconvinced.\n\nAs the saying goes: bald isn't a hair colour. Not collecting stamps isn't a hobby. Atheism isn't about claiming gods don't exist, but instead to say that they're as likely as any other made up idea because there's no evidence for them.\n\n&gt; If I'm wrong, when I die, I will have not lost anything. What about you?\n\nActually you have lost something. That's known as Pascal's Wager, a long debunked religious claim:\n\nhttp://www.youtube.com/watch?v=X94YffpUryo\n\nhttp://www.youtube.com/watch?v=fZpJ7yUPwdU\n\nAnd here's what you lose in pascal's wager,\n\nhttp://www.youtube.com/watch?v=v9WRG4e6m2s", "gilded": 0, "created_utc": "1301729897", "subreddit": "atheist", "score": 2, "controversiality": 0}
{"body": "I knew Nessie was real.", "gilded": 0, "created_utc": "1301774281", "subreddit": "wallpapers", "score": 1, "controversiality": 0}
{"body": "All dirty liars.  All the classic pictures of the Loch Ness Monster have been debunked, there's really very little evidence for it at this point.", "gilded": 0, "created_utc": "1301782230", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "Honestly, even though I'm familiar with some of the other notorious cryptids, I don't know about what the evidence for or against them.  I just know that pretty much every shred of evidence for Nessie has been faked.", "gilded": 0, "created_utc": "1301782624", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Chupacabra? A conglomeration of hoaxes, awful looking mangy dogs, and hallucinations by people drinking or on drugs.\n\n[Loch Ness Monster](http://www.jmooneyham.com/drag.html) (and other sea and lake monsters)? Most sightings are hoaxes or mistaken conclusions; but as we're still discovering a few sizable water-dwelling creatures for the first time even in the 21st century-- and vast tracts of the ocean depths have yet to be explored-- there's still the possibility of an unexpected monster or two (but the larger the size, the more improbable it is).\n\nThere's also turning out to be unexpected quirks in nature which make it possible for there to be two types of the same animal, one more common but smaller, the other more rare but bigger-- as in the case of the King Cheetah, which only occasionally is born from regular Cheetahs, and so can seem extinct for lengthy periods. And the surprisingly long lives of some sea creatures increases the chances of a large but rare species managing to survive with a lower breeding population than we expect.\n\n\n[Bigfoot](http://www.jmooneyham.com/bgft.html)? Actually it's somewhat plausible that a rare, large primate species still eludes capture in the various wildernesses of the world. As proof, a whole new and unusual large species of chimp was finally confirmed in Africa only in the past year or two-- though people have been trying to prove their existence for a whole lot longer than that.", "gilded": 0, "created_utc": "1301783531", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Good thing he didnt have $3.50 or the Loch Ness Monster would have been all over him", "gilded": 0, "created_utc": "1301807814", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "and that loch ness monster chap...", "gilded": 0, "created_utc": "1301834709", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Well it was about that time I noticed schlitz100 was about 8 stories tall and a huge crustacean from the Paleolithic era.", "gilded": 0, "created_utc": "1301839551", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "Tree Fiddy", "gilded": 0, "created_utc": "1301859450", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I'll compromise with the existence of the Loch Ness monster.", "gilded": 0, "created_utc": "1301880946", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "It's obviously a take on the Loch Ness Monster.", "gilded": 0, "created_utc": "1301945908", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "I'm more convinced that it's the loch ness monster", "gilded": 0, "created_utc": "1301948955", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "So I guess we did see the \"head\" of the loch ness monster....it just happened to be a different head then we expected.", "gilded": 0, "created_utc": "1301957470", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "lmao, I feel the same about UK shows looking for 'the loch ness monster'.\n\nThe famous pic is a bit of fucking driftwood, get over it.", "gilded": 0, "created_utc": "1301965492", "subreddit": "DoesAnybodyElse", "score": 2, "controversiality": 0}
{"body": "I can tell you what *my* six would be, assuming the following rules are true:\n\nRule 1: Nothing extinct. No dinosaurs, no dodo birds, no archeopteryx, etc.\n\nRule 2: Animals can shrink like to fit inside ball, and weight is magic'd as well.\n\nRule 3: Nothing fantasy related. Dragons, Loch Ness Monsters, griffons, chimeras, unicorns, pumas, etc.\n\nRule 4: No traits can magically be given to your animal that don't inherently exist already. i.e. You can't give a giraffe a poison sting attack, as they are not venomous.\n\nRule 5: ONE animal per ball. You can't use a pokeball to summon a SWARM of bees. Only one.\n\n\nSo My 6?\n#1 Bald eagle (Haliaeetus leucocephalus) Drill Peck, Fly, Air Slash &amp; Hurricane\n#2 Inland Taipan (Oxyuranus microlepidotus) Poison Fang, Wrap, Super Fang &amp; Block (or Leer)\n#3 Rhinoceros (Ceratotherium simum) Strength, Horn Drill, Headbutt &amp; Rock Wrecker\n#4 Colossal Squid (Mesonychoteuthis hamiltoni) Brine, Dive, Constrict &amp; Smokescreen\n#5 Gray Wolf (Canis lupus) Bite, Scratch, Growl, &amp; Tackle\n#6 Flying Fox (Pteropus vampyrus) Bite, Fly, Supersonic, &amp; Leech Life", "gilded": 0, "created_utc": "1302011565", "subreddit": "gaming", "score": 12, "controversiality": 0}
{"body": "This makes a lot of sense.  I can see how [Nessie](http://en.wikipedia.org/wiki/Nessie) might be a dog with mange that likes to swim.", "gilded": 0, "created_utc": "1302031459", "subreddit": "scifi", "score": 13, "controversiality": 0}
{"body": "*Do you believe in U.F.O.s, astral projections, mental telepathy, E.S.P., clairvoyance, spirit photography, telekinetic movement, full-trance mediums, the Loch Ness monster, and the theory of Atlantis?*", "gilded": 0, "created_utc": "1302050625", "subreddit": "pics", "score": 28, "controversiality": 0}
{"body": "The research doesn't stop at 5.  The research never stops. If an experiment is running, you can't leave until it stops. If there's a deadline and you need the data for a paper/grant, you don't stop working until you're done.  Steady hours are like the mythical Loch Ness monster, heard of in stories, but with no definite proof.", "gilded": 0, "created_utc": "1302181746", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "\"We threw a baby, showered at work and decorated onessies for the soon-to-be mom...\"\r\n\r\nFTFY", "gilded": 0, "created_utc": "1302184264", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "TIL Nessie moved to Japan.", "gilded": 0, "created_utc": "1302194663", "subreddit": "worldnews", "score": 2, "controversiality": 0}
{"body": "I love finding pictures and video of the Loch Ness Monster and other lake monsters.", "gilded": 0, "created_utc": "1302219506", "subreddit": "skeptic", "score": 2, "controversiality": 0}
{"body": "Homer takes the free pull on a slot machine and results \"jackpot, jackpot, lemon\"]: Doh!\n\nMr. Burns: Tough luck. Simpson.\n\nHomer: Come on Nessie, one more pull.\n\nNessie: BOOOAAAHHHHHHH\n\nHomer: Okay. Okay. Want a shrimp cocktail?\n\nNessie shakes head: Booaahh.\n\nHomer: Yeah. They're not great. ", "gilded": 0, "created_utc": "1302228646", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Dammit Monster I ain't got no tree fitty for you!!!", "gilded": 0, "created_utc": "1302274202", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "I have about tree fiddy.", "gilded": 0, "created_utc": "1302278276", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "No, I ain't gonna give you tree fiddy, now go away!", "gilded": 0, "created_utc": "1302298260", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "OBO? I'll give you tree fitty.", "gilded": 0, "created_utc": "1302309824", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "about tree fitty", "gilded": 0, "created_utc": "1302328965", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "Go away Loch Ness monster!\n", "gilded": 0, "created_utc": "1302334193", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Atheism isn't a religion. Not collecting stamps isn't a hobby. Bald isn't a hair colour. Off isn't a television channel.  Non-belief is a default state. Is people's lack of belief in the Loch Ness Monster and Santa Claus a religion too? \n\nThere's no issue amongst logical people in not believing in something without evidence.", "gilded": 0, "created_utc": "1302355714", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "\"No further evaluation was attempted by SA [censored] concerning the above\"\n\nNor did he further investigate reports of the Loch Ness monster, or the one of a Fresh Prince arriving in Bel Aire.", "gilded": 0, "created_utc": "1302360896", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Whenever a cryptozoologist argues in favor of the existence of some creature once thought to be mythical, people scoff at them by saying \"that could never happen, monsters aren't real!\" When one of these creatures are found, however, nobody actually learns a lesson from it. Granted, I don't see any good arguments for creatures like Nessie, but isn't the real difference between a cryptid and a critically endangered animal just a sample? Look at the Vietnam Leaf-nosed Bat. One degraded corpse found in 60 years. If the guy who found it wasn't keeping records, nobody would even know it existed.", "gilded": 0, "created_utc": "1302380570", "subreddit": "science", "score": 24, "controversiality": 0}
{"body": "&gt; In saying \"there is no evidence for god\" you are simply adopting the default negative position.\n\n\"default\" is a good way of putting it and that there is no evidence is a fact as well as a position. There is no evidence for the Christian God or any God (by most definitions) in the same way that there's no evidence for the Loch Ness Monster or Unicorns or Yetis or the Dragon in my Garage.\n\n&gt; The burden of proof is not on you to present any evidence, nor is it even possible to to do so, as what evidence can you give that there is no evidence?\n\nYes, in most cases it's impossible to disprove made up things so all you can say is that there's no evidence for them. This does mean that it's reasonable to be unsure and to consider a cup of morning coffee as more reliable than the claim, but believers rarely admit that they're unsure or unconvinced.\n\nMore generally, If an idea isn't falsifiable (in the Karl Popper sense) then it that's a weakness because there can be no evidence. Nothing distinguishes the Christian God from any other myth primarily because the claims aren't falsifiable or distinguishable from made-up nonsense.\n\n&gt; Is \"belief\" a word not applicable to negative claims? \n\n1) It's not a claim of negative but a lack of evidence for the positive claim.\n\n2) As the saying goes, if atheism is a belief then bald is a hair colour, not-collecting-stamps is a hobby, and so on.\n\nSo it's both that \"belief\" is the wrong word, and that it's not negative when there's no evidence for the positive claim. We're back at zero.\n\nI presume that you don't have a belief in Yetis or the millions of absurd ideas that people have I could come up with given enough time. If I say I've dragon in my garage then -- at that point -- the burden of proof is on me and you don't have to have belief that there is no dragon.\n\n&gt; Or am I meanly jumping on you over simplifying a complex, and there is some exception, or other clause to cover negative statements?\n\nI would say that it's not complex. It's a general issue and if you treat the gods like you treat anything else such as homeopathy or gremlins or unicorns then it's safe to say that there has been no evidence for them.\n\nA good description of this issue can be found here: [the dragon in my garage](http://www.godlessgeeks.com/LINKS/Dragon.htm)\n\nMore to the point, if you've got evidence then let's hear it :)  I'm willing to change my mind.", "gilded": 0, "created_utc": "1302384077", "subreddit": "atheist", "score": 2, "controversiality": 0}
{"body": "Loch Ness Monster.. Bigfoot... Where's Leonard Nimoy when you need him??", "gilded": 0, "created_utc": "1302426472", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Hoaxes and nonsense. That being said, I think the world would be a much cooler place if ghosts, angels, god, UFOs, bigfoot, the Loch Ness Monster, Hodag, Mothman, etc. etc. did acually exist.\n\nThey don't. But it would be cool if they did.", "gilded": 0, "created_utc": "1302451740", "subreddit": "atheism", "score": 24, "controversiality": 0}
{"body": "Despite all the people who can allude to something, all real data points the other way. If aliens visited earth, there would be microwave, radio, or radiative evidence. If you think about the sheer amount of data our spaceships give out in terms of waves, it doesn't make sense at all that theirs wouldn't.\n\nWhen the only evidence the world has for something are the disputable claims of people, much like the Loch Ness monster, you can safely assume it doesn't exist.", "gilded": 0, "created_utc": "1302454268", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "I think after the Nushagak Bay footage is released people will be rethinking their positions on these elusive sea dragons like the Loch Ness Monster.\n\nAs for the extraterrestrial issue, maybe you haven't seen enough of the evidence of that yet, or the very credible witness testimony. Since I've actually seen one of these things hanging in the sky exactly the way that bricks don't, I know there's definitely something going on, whether it's experimental aircraft or aliens or whatever.\n\n", "gilded": 0, "created_utc": "1302464627", "subreddit": "IAmA", "score": -1, "controversiality": 0}
{"body": "God damn Loch Ness Monster! ", "gilded": 0, "created_utc": "1302464808", "subreddit": "xbox360", "score": 6, "controversiality": 0}
{"body": "Nessie!", "gilded": 0, "created_utc": "1302479535", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "*Tree fiddy*", "gilded": 0, "created_utc": "1302484116", "subreddit": "xbox360", "score": 1, "controversiality": 0}
{"body": "Reminds me of the Loch Ness photograph, sans Nessie.", "gilded": 0, "created_utc": "1302493929", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "What...I paid a good three fiddy for it. Damn loch ness monster, always after my three fiddy.", "gilded": 0, "created_utc": "1302497898", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "About \"tree fiddy\"\n\nhttp://www.youtube.com/watch?v=9cn7xfBpZ3M", "gilded": 0, "created_utc": "1302609812", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "And it was about that time I noticed that girl scout was ten feet tall and a crustacean from the Paleolithic Era!", "gilded": 0, "created_utc": "1302624984", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Chef's Father: That's right. I said, \"I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!\" \n\nChef's Mother: I gave him a dollar. \n\nChef's Father: She gave him a dollar. \n\nChef's Mother: I thought he'd go away if I have him a dollar. \n\nChef's Father: Well, of course he's not gonna go away, Mary! You give him a dollar, he's gonna assume you got more!", "gilded": 0, "created_utc": "1302632966", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Let me clarify.  I am only saying that skeptics would argue the pictures were doctored.  While some of the photographic \"proof\" is clearly faked,  I have no overall impression that this is the case.\n\nTake the LochNess monster photos from the '60s and '70s.  The actual Nessie image in the negative is so small that the blown up \"full frame\" versions are so overwhelmed with grain that they are somewhat underwhelming.  \n\nThe 1st comment above could almost be seen as some odd corollary to the Drake Equation... \n\nThe concept that we are in a Matrix like distortion field in intriguing, but strays from my original question.  If we posit that we are not viewing the world from some Flatlandesque perspective, where is the flood of high tech/high resolution evidence that should be coming from all the phone cameras, etc?? ", "gilded": 0, "created_utc": "1302656728", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Yeah, I hate smug jerk-offs who give a-bigfootism a bad name, and non-alchemists and non-astrologers.\n\nI mean OKAY you don't BELIEVE the loch ness monster abducted me using his intergalactic space ship last night and probed my ass, but you don't have to be so arrogant about that and RIDICULE me.", "gilded": 0, "created_utc": "1302657043", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "True, like the Loch Ness monster.", "gilded": 0, "created_utc": "1302667309", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "They also spliced his DNA with that of a frog and produced the Loch Ness monster.", "gilded": 0, "created_utc": "1302691218", "subreddit": "todayilearned", "score": 3, "controversiality": 0}
{"body": "Actually it's tree fiddy.", "gilded": 0, "created_utc": "1302765091", "subreddit": "leagueoflegends", "score": 1, "controversiality": 0}
{"body": "God damn Loch Ness Monster!", "gilded": 0, "created_utc": "1302765732", "subreddit": "leagueoflegends", "score": 2, "controversiality": 0}
{"body": "Thanks Nessie. I enjoy [re]learning the mechanics of why we say what we say.\n\nWaves of grammar school memories are coming back now...", "gilded": 0, "created_utc": "1302785538", "subreddit": "grammar", "score": 2, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1302786446", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "[I am become Death.](http://www.reddit.com/r/grammar/comments/gnsu8/whats_your_favorite_bit_of_obscure_english_grammar/c1p0wx7?context=3)\n\nAlso, I'm more partial to Nessie's explanation than Picnicpanther's for \"woe is me.\" Either way, it's now an idiom and is therefore immune to grammatical judgment because it's what's known as a \"frozen construction.\"", "gilded": 0, "created_utc": "1302788783", "subreddit": "grammar", "score": 3, "controversiality": 0}
{"body": "I gave it bout tree fitty.", "gilded": 0, "created_utc": "1302808890", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Nessie's point here, though, is the important one. The problem is a weak translation of a sentence better rendered (for modern readers at least) as \"Woe is unto me.\"", "gilded": 0, "created_utc": "1302814961", "subreddit": "grammar", "score": 1, "controversiality": 0}
{"body": "Same reason I don't believe in Santa Claus, the easter bunny, the tooth fairy, leprechauns, bigfoot, and the loch ness monster.", "gilded": 0, "created_utc": "1302870644", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "about tree fiddy.", "gilded": 0, "created_utc": "1302877805", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "I ain't no loch ness monster.", "gilded": 0, "created_utc": "1302889766", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "The tree fiddy answer is right on the money (oh, did I just do that?)", "gilded": 0, "created_utc": "1302890661", "subreddit": "Android", "score": 2, "controversiality": 0}
{"body": "Well some people have taken the sighting seriously.  In fact, many UFO sighting claims have been debunked as hoaxes.\n\nBut the fundamental reason is that UFO sightings never seem to be repeatable and many of the claims that UFO witnesses make are untestable.\n\nYou could apply the same logic to bigfoot, the loch ness monster, or the chupacabra.", "gilded": 0, "created_utc": "1302894338", "subreddit": "askscience", "score": 2, "controversiality": 0}
{"body": "The plate. There were no floral patterns in the Paleolithic era.", "gilded": 0, "created_utc": "1302894464", "subreddit": "Paleo", "score": 3, "controversiality": 0}
{"body": "Do you believe Ghosts exist? Leprechauns? If we can reject these a-priori due to lack of evidence, we can reject the existence of gods as well. The existence of fantastic creatures ( including gods ) requires fantastic proof.\n\nA few foggy pictures of a the Loch Ness Monster is not sufficient proof. A corpse would be. A decent photograph would be a good first step, though doubtful with modern photoshop and cgi.\n\nWith deities, even more proof is needed. \n\nThere are things we are willingy to reject without proof because belief in them is considered delusional, or they have historically been accepted as a creation of fantasy.\n\nIf the existence of deities has a low probability of being true, then it is perfectly fine to say that they don't exist.", "gilded": 0, "created_utc": "1302900333", "subreddit": "Christianity", "score": 11, "controversiality": 0}
{"body": "Great interview. Thanks.\n\nWhat's the tree fiddy question?", "gilded": 0, "created_utc": "1302903093", "subreddit": "Android", "score": 1, "controversiality": 0}
{"body": "A hell of a lot of people think [John Frum](http://en.wikipedia.org/wiki/John_Frum) exists too. And he does not. A hell of a lot of people think Bigfoot exists, and the Loch Ness monster. Hell an Indian guru by the name of [Sathya Sai Baba](http://en.wikipedia.org/wiki/Sathya_Sai_Baba) *does* exist, and he has over a million followers who believe he is a living god who can perform miracles, we have *eye witnesses* attest to that. \n\nWe don't know if someone named Yeshua of Nazareth ever walked around ancient Palestine saying he was the Messiah, we do know about a dozen other guys did in that time period, many of whom were crucified, is its possible, perhaps even probable, that the character of Jesus was based on some of these men? Certainly. Is there any reason to believe that Jesus was a real person who was anything like how he's described in the bible? Not so much. ", "gilded": 0, "created_utc": "1302909410", "subreddit": "DebateAChristian", "score": 1, "controversiality": 0}
{"body": "La, la, la. I can't hear you. Nessie is definitely real.", "gilded": 0, "created_utc": "1302912352", "subreddit": "videos", "score": 2, "controversiality": 0}
{"body": "\"Do you believe in UFOs, astral projections, mental telepathy, ESP, clairvoyance, spirit photography, telekinetic movement, full trance mediums, the Loch Ness monster and the theory of Atlantis?\"", "gilded": 0, "created_utc": "1302917460", "subreddit": "atheism", "score": 7, "controversiality": 0}
{"body": "Do you believe the Loch Ness Monster exists? Why or why not?", "gilded": 0, "created_utc": "1302930083", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Would you sleep with the Loch Ness Monster? ", "gilded": 0, "created_utc": "1302931700", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Haha that's called the nessie blunt.", "gilded": 0, "created_utc": "1302970373", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "I saw a Creationist Biology textbook once that gave sightings of \"dinosaurs\" and the Loch Ness Monster as evidence.", "gilded": 0, "created_utc": "1302993401", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Tree fitty", "gilded": 0, "created_utc": "1303013349", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "and it was the god danm loch ness monster", "gilded": 0, "created_utc": "1303019027", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "I don't think the legality of this \"fetish\" is the root of the problem. You continue to stress that there are no ill effects to the dog as if we care for that dogs' well-being in this situation. The root of this is that as you already know, this fetish is very shocking to most normal people (and I do believe that you are not normal with your actions) and that it is vastly disturbing. What we as your opposition to this matter believe is that it is psychologically and socially fucked up and just a deplorable action. Once again as I stated before, you could fuck the Loch Ness monster for all I care, but I'm just gonna think you are a crazy fuck", "gilded": 0, "created_utc": "1303024356", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "It's the Loch Ness Monster!", "gilded": 0, "created_utc": "1303041656", "subreddit": "Minecraft", "score": 7, "controversiality": 0}
{"body": "I would rather spend my limited time and resources on something with a greater chance of success.  Like search for the Loch Ness monster.", "gilded": 0, "created_utc": "1303047363", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Must have been about seven, eight years ago I got that shirt for about [tree fiddy!](http://www.youtube.com/watch?v=9cn7xfBpZ3M)", "gilded": 0, "created_utc": "1303059325", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "I need about tree fitty.", "gilded": 0, "created_utc": "1303065508", "subreddit": "Minecraft", "score": 6, "controversiality": 0}
{"body": "Nobody else saw Nessie?", "gilded": 0, "created_utc": "1303100055", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "I totally saw Nessie.", "gilded": 0, "created_utc": "1303100095", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I can't seem to wrap my head around the logic of proving something exists because it has a name. That means that the Loch Ness monster is real, and so is Saffron from Firefly or Sponge Bob Square Pants.    \nI don't even understand why someone could convince themselves that it makes any sense.", "gilded": 0, "created_utc": "1303127328", "subreddit": "wikipedia", "score": 24, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1303159611", "subreddit": "RedditThroughHistory", "score": 8, "controversiality": 0}
{"body": "You'll have to forgive me, but I've been stuck in Modern Philosophy studying Descartes for the last 4 months or so.\n\nOntological arguments usually revolve more around the aspect that the idea of \"god\" is greater than any other idea we can have of something. The Loch Ness monster is just an extrapolation of a giant lizard in water or something like that; but God doesn't have a 'starting point' from which we would extrapolate to get a 'perfect being'. If our idea of God doesn't have a starting point, then it must come from God herself.\n\nThey're a little more nuanced than \"it has a name, it exists\" but pretty much only by that qualification; and that qualification is/was enough for some people I suppose.", "gilded": 0, "created_utc": "1303163886", "subreddit": "wikipedia", "score": 3, "controversiality": 0}
{"body": "I call BS as I happen to know that all candy scales are actually calibrated on the moon so everything weighs 6x more here on Earth.\n\nThus the bag and a single piece of candy would probably have run you about... tree fiddy.\n\nAt least that's what it feels like every time I hit the cinema.", "gilded": 0, "created_utc": "1303210553", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "I've been saying for a while that HD video will be the end of urban legend hoaxes like the Loch Ness Monster and Bigfoot. The low quality of video taken of these sightings makes them mysteriously ambiguous. Let me see high-definition video of a UFO just *once*.\n\nSecondly, in the middle of the linked video, two excellent theories are mentioned: Secret military aircraft, and manmade hoaxes.", "gilded": 0, "created_utc": "1303232174", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "I thought that the Loch Ness monster had relocated to Canada.", "gilded": 0, "created_utc": "1303272624", "subreddit": "EarthPorn", "score": 3, "controversiality": 0}
{"body": "TREE FIDDY", "gilded": 0, "created_utc": "1303289967", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "I, the Loch Ness Monster, would like a copy of Portal 2.\n\nAmazingly enough, I do have a computer now I keep in a shed off the loch.  Saving coins day after day that people threw in the lake enabled me to have enough funds to purchase one.  Sadly, this process took 12 years and may be a couple more before I can purchase Portal 2.  Purchase it for me, and I promise to eat one person of your choosing.", "gilded": 0, "created_utc": "1303324108", "subreddit": "gaming", "score": 0, "controversiality": 0}
{"body": "I am not a strong atheist in that sense, though frankly it's a stupid term. I'm pretty sure Father Christmas and the Loch Ness Monster don't exist but I don't have a logical proof against them. I'm not abandoning my faculties nor naturalism by very strongly doubting them just as I am not by strongly doubting the existence of any gods.\n\nIt's quoted to death but if you're going to claim something ludicrous you're going to have to do a damn good job proving it, there is no onus on me to disprove claims that go against the grain of almost everything else we know.\n\nWhat I am absolutely sure of is that a Christian god does not exist. I can prove that easily as the supposed traits of that being are logically self-contradictory. Now if you're going to use the usual nonsense defence that god isn't bound by logic then what on earth are you doing demanding I logically disprove your god?\n\nI do think most questions of morality and ethics as well as values and public policy benefit most from a pragmatic and rational approach. They can't all be determined through pure logic because that would require a level of knowledge that doesn't exist. Moral and ethical questions usually boil down to a rational approach based on imperfect information.\n\nI am not confusing correlation with causation. Religion just does an awful lot of correlating which is enough for me, along with what I see of it, to decide it's a bad thing. I am not claiming absolute knowledge, reality exists in shades of grey. No one would ever make any choice if it required the sort of level of knowledge you seem to be requiring of me. It's a nice little bit of rhetoric though, make me justify myself at impossible length with answers society doesn't have, fling some more questions on top.\n\nHere's a question for you- do you worship the same god as your parents? Isn't that a bit of a coincidence?\n\nMy position is hostile and well-considered.\n\n", "gilded": 0, "created_utc": "1303328125", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "I did this a while ago now. Forgive me if there's anything unavailable or if links don't work. Enjoy. Have to break it up because it's too long. Ha.\n\n\nSkepticism, Atheism, and Ethics for Kids\n\nIntroduction\n\nThis annotated bibliography is a collection of resources for children 9¬–12 years old covering some of the issues related to skepticism, atheism, and ethics. While these resources are predominantly intended for children in this age range, there are a few resources specifically meant for parents or teachers.\n\nThese resources are organized broadly into print and Internet sources, and each broad category is then broken down into the three related topics of skepticism, atheism, and ethics.\n\nPrint Resources\n\nSkepticism\n\nMartin, T. (2002). Flat Earth? Round Earth? New York: Prometheus Books.\n\nThis is a great introduction to a simple question: How do we know the Earth is round? This book is written as the story of two students in a science class tasked with making clay models of the Earth. One student is convinced the Earth is flat and another student goes over all the ways we can show the Earth is round. The doubting student argues throughout the book about reasons why it might not be true. Although he is not convinced by the end of the book, this is a thorough explanation of all the ways we can observe that the Earth is round. This book is meant for children ages 7 and up.\n\nNickell, J. (1989). The Magic Detectives. New York: Prometheus Books.\n\nThis book presents 30 mysteries for children to think about and solve. Each has a supernatural bent and each is discussed in terms of the applicable sciences involved, but they are all presented for a younger audience. Of the mysteries discussed, the Shroud of Turin, UFOs, Bigfoot, ghosts, Loch Ness monster, and faith healers are all examined and debunked using real world explanations. Each mystery is presented and has an upside down explanation on a following page. This book is meant for children ages 9–12.\n\nRuchlis, H. (1991). How Do You Know It’s True? New York: Prometheus Books.\n\nThis book is divided into two sections, Superstition and Fairy-Tale Thinking (which covers many of the superstitions that survive today, and debunks each in turn with rational thought), and Science as a Way of Thinking (which explains how science is done, new facts discovered, and freedom of thought). The bulk of this book is the second section, covering science. Many ideas, the history of science, and the scientific method are all covered in some depth. This book is definitely for the higher end of the age range, likely 11 or 12. The science is more involved and thoroughly described, and will likely require an adult to help explain many of the ideas presented.\n\nHawking, L., &amp; Hawking, S. (2007). George’s Secret Key to the Universe. New York: Simon &amp; Schuster.\n\nThis novel-length chapter book follows the adventures of George and his new neighbor Annie as they travel the solar system using Cosmo, a supercomputer designed by Annie’s father, Eric. The characters travel the solar system and learn about stars, atoms, planets, moons, and black holes. There are frequent sections throughout that include non-fiction explanations of what’s happening in the story, and color pictures detailing various planets, stars, and other astronomical objects.\n\nMcCann, J., &amp; Davis, D. (2005). Scooby-Doo and the Samurai Ghost. New York: Scholastic Inc.\n\nThis children’s picture book follows Scooby-Doo and the Mystery, Inc. gang as they solve another “supernatural” mystery. A samurai ghost is making trouble for a construction site in Japan and the Mystery, Inc. kids investigate. As standard for Scooby-Doo mysteries, it turns out the villain is much more mundane than a ghost. In this case the culprit is the developer himself trying to collect insurance. Every Scooby-Doo story is a study in skepticism. There’s a mystery involving some supernatural creature and the kids come in and solve it. Every story resolves with a real life explanation of what happened and why. It’s never a ghost but instead someone trying to trick people with a supernatural explanation.\n\nAtheism\n\nBrockman, C., &amp; Cammisotto, A. (1978). What about gods? New York: Prometheus Books.\n\nThis is a simple black and white children’s picture book that explains the origin of the various gods of the world’s religions. Covering ancient mythology and modern religion, this short book also describes how we have modern science to explain what people used mythology to explain. This is not a pointed or aggressive atheist children’s book, as some others are. It uses simple and clear language with evocative pictures to relay its story. This book could easily be read to any child under the age range intended for this bibliography, or could be read by children 9–12 on their own.\n\nO’Hair, M., &amp; Kirby, J. (1989). An Atheist Primer. Austin, Texas: American Atheist Press.\n\nThis is another children’s picture book with simple black and white images. The more cartoon style of pictures is offset by the more pointed text used in this book. The text often uses words like “dumb”, “foolish”, and “stupid” when relaying its tale of why people imagined so many gods to explain the natural world. The book ultimately resolves with the thought that once people grow up, they can put away their childish toys (i.e. gods). This book could easily be read to younger children, or read by children in the 9–12 age range.\n\nBarker, D., &amp; Cuebas, A. (1988). Just Pretend: A Freethought Book for Children. Madison, Wisconsin: Freedom From Religion Foundation.\n\nThis is a longer children’s picture book that goes into more detail of the origin of various gods and myths. It also covers some specific religions and religious ideas, such as eternal reward and punishment. While the tone is lighter and less judgmental than some, this book is a Santa buster. Of the previous two books, neither explicitly denounced Santa Claus in its text. This book however, does. Because of that I would recommend this book be reserved until a child has already learned that Santa is a myth. Definitely a longer children’s picture book, but this could easily be read to younger children, or read by kids in the 9–12 age range.\n\nBennett, H. (2005). Humanism, What’s That? A Book for Curious Kids. New York: Prometheus Books.\n\nThis book is presented as a Socratic dialogue between a teacher and her students about various aspects of religion, atheism, ethics, and Humanism. Though a long question and answer session around these topics, many ideas are detailed in a rather straightforward manner. Despite the simple presentation, this book is written for slightly older children. Labeled for ages 10 and up, most kids would likely need an adult to help them understand some of the more advanced ideas presented. Also, an important note, one of the children is presented as a Catholic who borders on anti-Semitic.\n\nBarker, D., &amp; Strassburg, B. (1990). Maybe Yes, Maybe No: A Guide for Young Skeptics. New York: Prometheus Books.\n\nThis book uses a chapter book design to help teach children about critical thinking and rational thinking. The story relayed follows Andrea, a skeptic, as she solves the mystery of a ghost sighting in her neighborhood. The story uses cartoon strips alongside regular text and images to convey its lessons. The book covers the traits of a skeptic, what should be done when confronted by a mystery, and the steps to take to solve a mystery. More importantly, the book asks the reader what they think and why. The book concludes with scientific thought and the steps involved in scientific inquiry. This book could be easily read by most 9–12 year olds with a little help from an adult.\n", "gilded": 0, "created_utc": "1303342448", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt; If you would like me to show you why Christianity is false, message me.\n\nIt's not so much that Christianity is false (I can't disprove Thor or Christianity) but that there's no reason to think that it's true. The onus is on the believer of Loch Ness Monster, or the believer of Christianity to prove it true.", "gilded": 0, "created_utc": "1303358216", "subreddit": "DebateAChristian", "score": 1, "controversiality": 0}
{"body": "IF: \n\n1) You paid your initial initiation etc. with a credit card\n\n2) Your credit card agreed to a [chargeback](http://en.wikipedia.org/wiki/Chargeback)\n\nTHEN:\n\n3) You can safely ignore the collections agency.\n\n*   *   *  \n\nIt's probably not that simple.  I've been involved in large chargebacks before and there's generally a lot more footsie than this.  Either you're abbreviating the story or attempting to prompt REDDIT RAEG (as health clubs are a typical target of geeky white 20-something anger).  I'm gonna go with the former because I'm a trusting individual.\n\nWhat *should* have happened is you called up your credit card and said \"I wish to dispute the following charge.\"  You then would have spoken to a particular department at your credit card, who would have asked you some specifics about your transaction.  They then would have recommended that you consult the contract you signed with the gym, particularly as it regards to cancellation of membership - the written contract between you and the gym has legal precedence over the contract between you and the credit card company in most cases.  For example, Visa refused to reverse charges against Best Buy for me over a bullshit copy of Quicken because the back of Best Buy's receipt says in no uncertain terms \"you open it, you bought it, regardless of how much it may suck.\"\n\nOnce you told them \"I'm pretty sure it says nothing like that, I'm well within my rights\" they should have put a temporary hold on the charge (it's still there, just not in your account, not in theirs), sent you about five documents, one of which requires your signature, one of which asks for the gym contract, one of which tells you that they aren't going to stand with you in any legal dispute, one of which tries to get you to take out a cash advance, one of which suggests you enroll in their credit protection plan.\n\nYou would then fill out these documents and send them back, and in another week or so they would give you their decision - and the one time I reversed a charge of $1800, they wanted \"more info.\"  In that case it was an unscrupulous mechanic ass-raping my car over the course of 8 weeks and they wanted another mechanic to describe the ass-raping.  As I was unable to find a scrupulous mechanic in the time I needed to describe the magnitude of my car's ass-raping, I took a bunch of pictures and wrote up a 5-page description and opinion based on my years as a car mechanic and sent it off.  \n\nThat document that you filled out where they asked for \"more info\" (if you sent in the gym contract that's pretty much all they would have needed) is then sent to the merchant, along with an explanation as to why the credit card is honoring the chargeback.  This documentation, as I understand it, invites the merchant to take you to collections but makes it clear in no uncertain terms that if the merchant tries to involve the credit card in the ensuing shenanigans that said merchant will gain a profound and heartfelt understanding of the \"windshield-bug\" metaphor.\n\nAt this point, if the merchant is *really* butt-hurt they might take you to small claims court.  We're talking \"Epic Quest\"-grade butthurt, though, as it's gonna be months before they see the money and the judge is likely to dismiss things anyway because it's not like you owe them money, it's like Visa slapped their hand when they stole from the cookie jar.\n\nWhat the merchant is far more likely to do, however, is sell your debt to a [debt buyer.](http://en.wikipedia.org/wiki/Debt_buyer)  Note that a debt buyer is ***NOT*** a collections agency (*although they will do everything in their power to look like one, convince you they are one, and lead you to believe they have the powers of one*).  A debt buyer tells the health club \"I'll give you $50 for that butt-hurt\" (debt buyers typically pay between 3% and 16% of the outstanding amount) and the health club takes the cash and buys a bottle of Jim Beam, a pizza and a dime bag to drown their sorrows.  Meanwhile, the debt buyer writes you up a nasty-ass letter demanding the original $1200, $200 in \"collections fees\" and probably $150 in \"interest.\"\n\n*Now pay attention:*  You shall not suffer in the slightest by ignoring the debt buyer:\n\n&gt;While original creditors are often exempt from fair debt collection laws, courts and regulators have generally taken the position that debt buyers and any other third-party collection agency are covered by these laws.  Thus, debt buyers who engage in abusive collections practices are subject to lawsuits under the Fair Debt Collection Practices Act, the Fair Credit Reporting Act and other state and federal laws. They may also be subject to regulatory action by state attorneys general or the Federal Trade Commission, which in 2004 shut down Capital Acquisitions and Management Corporation, a debt buyer that allegedly engaged in extensive abusive collection practices.\n\nDebt buyers are the biggest assholes of the financial sphere.  They're repo men.  They're shady mutherfuckers with shady legal standing and shady business practices who do shady things for money.  They're also lazy.  They also know that the only way they can get *any* money out of you is by bullying you - and look at it this way, if they can get you to settle for $200, they're making a 400% profit.  As such, they'll shake your ass down as much as they think they can get away with to probe for weakness.\n\n**SHOW NONE.**\n\nUsually when I'm writing a letter to a debt buyer I'll use phrases like \"cold dead hands\" and \"willing to fight this at a loss\" and \"spurious legal actions are a hobby of mine\" and \"would love to expose your shady business practices to a larger audience.\"  This serves two purposes:\n\n1) It's fun as hell\n\n2) It separates the men from the boys\n\nIf you're dealing with a *real* debt buyer, they'll fuck off.  They'll check their \"not worth the hassle\" box on their forms and pay less for any debt from the gym in the future.  If you're dealing with a johnny-come-lately debt buyer^1 , they'll write you back an equally insulting letter.  It is at this point that visions of tree fiddy, sea monsters, and [John Cusack on the slopes](http://www.youtube.com/watch?v=nP9gSfXgir0) should come to mind.\n\nIt is at this point that you can laugh and point.  \n\nEither way, sorry about the job.  Don't let tedious shit like this weigh on you.  In the past 8 years I've had ~$25,000 worth of spurious charges leveled against me and I haven't paid a dime.  My credit score is 800+ and I've got a great interest rate on my credit card.  The trick is to be in the *right,* which it sounds like you are.\n\n*   *   * \n\n1) PROTIP: These are the guys who buy those tickets the parking lot wrote you.  If you got a ticket on a street, you'd best pay it.  If you got a ticket on a private lot and can come up with even the flimsiest excuse as to why you shouldn't be charged and respond to the ticket with it, you'll be dealing with these guys every time.  Never pay these tickets.  Pay your parking fees... but also understand that \"fishing for money\" is a major portion of these parking lots' income and that slapping their hooks away is an acceptable strategy.  They're powerless to do anything about it.\n\n", "gilded": 0, "created_utc": "1303487948", "subreddit": "AskReddit", "score": 29, "controversiality": 0}
{"body": "Think she was serious when she was talking about seeing the loch ness monster?    Also....she was looked amazing...", "gilded": 0, "created_utc": "1303575297", "subreddit": "doctorwho", "score": 4, "controversiality": 0}
{"body": "When taking pictures of a non-mobile object, it's preferable to spend the extra second required to capture a decent photograph rather than to rush to print such a completely non-important shred of banality to Reddit in the form of a Loch Ness monster photograph from the 50s. Jesus. ", "gilded": 0, "created_utc": "1303592582", "subreddit": "WTF", "score": 25, "controversiality": 0}
{"body": "That looks a lot more like the loch ness monster...", "gilded": 0, "created_utc": "1303613286", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Anyone else see Nessie/a snail/dragon?", "gilded": 0, "created_utc": "1303657721", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "His post was stupid, so I'm not defending him, but I'll answer your question anyway. One doesn't need a reason to not believe in something; bur rather, reasons *to* believe in something.  If a hypothesis is made, its up to the person(s) making the hypothesis to defend it, not anyone else.  No one has yet made anything close to a compelling argument for any god(s), so we have no more reason to believe in them than we do unicorns or the loch ness monster. ", "gilded": 0, "created_utc": "1303660457", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "DAMN YOU LOCH NESS MONSTER!!!", "gilded": 0, "created_utc": "1303682211", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I won about tree fiddy.", "gilded": 0, "created_utc": "1303690308", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Why is that in any way obnoxious? Please answer that seriously.\n\nMy experience is that most people haven't even considered the possibility of a God not existing even though they've never seen/felt Him. It's the most reasonable explanation for not finding something. Until something is known to be existing it is generally counted as not existing (Bigfoot, God, Santa, Unicorns etc).\n\nWe might have been looking for the Loch Ness monster in the wrong lake or we might consider the possibility that there doesn't exist a monster like that at all.", "gilded": 0, "created_utc": "1303691811", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "about 50% of the words.\nthis along with the loch ness monster gives me a new found respect for Scotland some how. ", "gilded": 0, "created_utc": "1303697318", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "I don't doubt it. They should invite the Loch Ness Monster and Cú Chulainn, and the princess of Wales. Make us all a bit of screed. ", "gilded": 0, "created_utc": "1303701856", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "As has the princess of Wales. And as far as I'm aware, the Loch Ness Monster doesn't exist.", "gilded": 0, "created_utc": "1303706286", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I thought that was what Nessie was saying, maybe I'm confused. That Rombauer = Joy of Cooking because they are both so simple.", "gilded": 0, "created_utc": "1303708028", "subreddit": "Cooking", "score": 2, "controversiality": 0}
{"body": "Oh, you. So you can't argue with what I presented and instead go for a personal jab. But I'm the one who sounds like a Glenn Beck fan.\n\nWe're talking about two entirely different subjects. The supposed \"Rat King\" is classified as cryptozoology. You know what other \"animals\" find themselves in that category? Big Foot and the Loch Ness Monster. Those exist too, right?\n\nThe simple fact of the matter is \"Rat Kings\" have been mentioned in popular culture since the early 1500s and after **500 years** and no one has come forward with hard evidence.", "gilded": 0, "created_utc": "1303716823", "subreddit": "reddit.com", "score": -2, "controversiality": 0}
{"body": "He said, \"I need about tree fiddy\"", "gilded": 0, "created_utc": "1303761191", "subreddit": "gaming", "score": 18, "controversiality": 0}
{"body": "bout tree fiddy", "gilded": 0, "created_utc": "1303784955", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "i need bout, tree fiddy.", "gilded": 0, "created_utc": "1303790896", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "i need bout, tree fiddy.", "gilded": 0, "created_utc": "1303790965", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "&gt;He's a douche because he's a complete moron\n\nDouchebag and Moron do not mean the same thing... Let me rephrase \n\nHe is \"an individual who has an over-inflated sense of self worth\" because he's an idiot.\n\n&gt;It's not a debate if he blocks off all comments and arguments except for the one he chooses.\n\nDid you even watch the video? He clearly states it 10 seconds it.\n\n&gt;Atheism is the belief that there is no god. Most dictionaries seem to agree with this. Most people who identify as atheist would appear to agree with this.\n\nYou are completely ignorant of atheism. Let's take the following as an example:\n\n&gt;I believe that the Loch Ness Monster does not exist\n\nIf I were to make that statement, I would have to provide a proof or a justification as to why.\n\n&gt;I don't believe in the Loch Ness Monster\n\nIf there is no evidence for the Loch Ness Monster, then no justification is needed for this dismissal. \n\n[Burden of Proof](http://en.wikipedia.org/wiki/Burden_of_proof)\n\nNow replace the Loch Ness Monster with God and now you understand the position of an atheist.\n\n&gt; Millions of people believe in a deity. We seem to be hard-wired to believe, as though some being has made us need to believe. There are those who claim to have seen miracles, and even accounts (admittedly not all that reliable) of a man being killed and coming back from the dead.\n\nJust because we're hardwired to believe in crap, doesn't make it true. We are also hardwired to believe that all pristine and clear liquids are clean and good for us. Is this necessarily true?\n\nThere are millions of of people today who witnessed [Sri Sathya Sai Baba of India](http://www.youtube.com/watch?v=RqjB31xiE9k) walk on water, resurrect from the dead, turn water into wine and plenty more. Does this make him a god or perhaps even godlier than Jesus?\n\nThe problem with Jesus is that his account was written by the memory of his peers approximately 40 years after his death. By no means should the New Testament should be taken seriously in terms of historicity.\n\nAlso take a look at [argument from popular appeal](http://en.wikipedia.org/wiki/Argumentum_ad_populum) \n\n", "gilded": 0, "created_utc": "1303803443", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "Oh No! don't you go givin' that tree fiddy...", "gilded": 0, "created_utc": "1303815398", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Banks's Bitter.  Less than tree fiddy for a four-pack from the local corner shop.", "gilded": 0, "created_utc": "1303827337", "subreddit": "beer", "score": 1, "controversiality": 0}
{"body": "Next they need to disprove the loch ness monster or reptilians. ", "gilded": 0, "created_utc": "1303827654", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "\"Well it was about this time i realized there was a loch ness monster in my bed...askin for three fiddy.\"", "gilded": 0, "created_utc": "1303839899", "subreddit": "nosleep", "score": 13, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1303846895", "subreddit": "PS3", "score": 11, "controversiality": 0}
{"body": "[](/high \"Tree fiddy?\")", "gilded": 0, "created_utc": "1303863983", "subreddit": "PS3", "score": 0, "controversiality": 0}
{"body": "Paleo is exactly the diet I was complaining about.  How would you describe the main idea behind paleo?  I.E. the paleolithic diet ?  As I understand it, the concept is humans were stronger in the paleolithic era, so we should try to live like them.  Is that a straw man?  ", "gilded": 0, "created_utc": "1303865255", "subreddit": "Fitness", "score": 1, "controversiality": 0}
{"body": "Personally, I'd consider dairy to be anti-paleo because if you look at any other mammal on the planet, they only consume milk while they're young. Once they are grown enough to get their own food, they stop drinking their mother's milk. Humans in the paleolithic era would have been the same.", "gilded": 0, "created_utc": "1303941474", "subreddit": "Fitness", "score": 1, "controversiality": 0}
{"body": "True, but we are not necessarily genetically the same as humans of the paleolithic era. Some humans have evolved certain abilities, and I think it would be foolish to not use them. Now, I know some adults who are lactose tolerant, but still get phlegm-y or congested when they consume milk, while others have no problems with it at all. I'm one of those people who get a little congested with milk, but can handle cheese just fine. \n\nBasically, I think dairy can have a place in paleo, especially if you want to use the GOMAD method to gain a few pounds, but it isn't for everyone. I tried the paleo diet for a while, felt great, but got lazy. It's effing hard :p I really need to pick it up again.   ", "gilded": 0, "created_utc": "1303942047", "subreddit": "Fitness", "score": 1, "controversiality": 0}
{"body": "I see, and I wish no ill will on anyone who takes this approach, AND I believe it is possible to eat just about any healthy, calorie controlled diet and see results. \n\nIn all kindness and sincerity I just wanted to say that the logic behind paleo is little misinformed, not that it even matters for real world applications since it is perfectly ok to avoid grains or agriculture and still live a full life.   \n\nNow should the average person avoid grain?  Not unless you have celiac disease. Also, breads, pastas and energy bars, (basically modern carbs) are an excellent source of carbohydrates to fuel intense workouts.  \n\nWe were stronger, more healthy during the paleolithic era? Nope. We were a little taller than previous era's but not taller than the average person now. Diseases?  Hard to tell completely, but our average life span is 70+ and it was about 35+ back then. \n \nWe are living longer than ever, we are taller than ever, and we are healthier than ever. This is due to many factors including modern nutritional, agriculture, and modern medicine.  ", "gilded": 0, "created_utc": "1303943254", "subreddit": "Fitness", "score": 1, "controversiality": 0}
{"body": "me: do you have anything on the loch ness monster?\n\nvideo store clerk: um...like a movie?\n\nme: i'd like something more non-fictional.\n\nvsc: i don't think so [](/wat \"wtf\") ...we've got the free willy movies.\n\nme: i already have those [](/galone \"salanaa eiyung ayesis!\")", "gilded": 0, "created_utc": "1303957055", "subreddit": "ForeverAlone", "score": 2, "controversiality": 0}
{"body": "&gt;It's one thing to suggest using reasonable inference and deduction that life could and probably does exist elsewhere in the universe\n\nBut that still does not address the fact that the belief is there with no proof of such existence. I am certain a logical case could also be made for the probability of an existence of God (but then again, that wholly depends on how one defines 'God'.) I mean, one can also logically use reasonable inference and deduction to suggest that the existence of the Loch Ness monster or Bigfoot also exists without any concrete proof, but many people would consider those believer foolish.", "gilded": 0, "created_utc": "1303958758", "subreddit": "atheism", "score": -3, "controversiality": 0}
{"body": "Your analogy is flawed (Bigfoot, Loch Ness monster) The difference between those examples and aliens isn't probability, but plausibility. It is more plausible that there are aliens because we can see so little of the universe, and life doesn't necessarily mean intelligent or complex. Now if you were to say that belief in aliens who come down and anal probe people I'd be on your side, but I don't think that was what you implied.", "gilded": 0, "created_utc": "1303961381", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "je m'appelle mannessier sebastien qui est malentendantje suis CAP de plombier et chauffagiste voilà", "gilded": 0, "created_utc": "1303974212", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "It is a little hard to say for sure how strong people were in the paleolithic era since we can't really examine a live subject. We do know they had stronger bones than modern humans from remains that have been studied. While it is true the average lifespan was shorter back then, it is largely because of the much higher rate of death in the first few years of life. Also people died of many things that modern humans don't have to worry about. Many humans back than lived to be just as old as modern humans. The current generation is certainly not healthier than ever. This generation is expected to be the first to live shorter lives than their parents generation. It is fine if you are just not interested in the diet, but it just doesn't sound like you've done your research. ", "gilded": 0, "created_utc": "1304009286", "subreddit": "Fitness", "score": 1, "controversiality": 0}
{"body": "Rare appearance: Loch Ness Monster\n\n\n\nDrops: \n\n\n\n\n          Scales =&gt; Better than Iron Armor\n          Fangs =&gt; Better than Iron Swords*\n          Eggs =&gt; Chance to Spawn a tamed, baby Loch Ness\n\n\n\n\n*Note: there could be different colored monsters that drop different colored scales/fangs that imbue an element that corresponds to that color (i.e red-fire, blue-ice, et cetera)\n\n\n\nI really hope something like this happens, and eventually the land counterpart could be the Dragon who has it's signature den that's randomly generated. ", "gilded": 0, "created_utc": "1304032819", "subreddit": "Minecraft", "score": 0, "controversiality": 0}
{"body": "What caused all those separate unrelated people to see bigfoot? What caused all those separate unrelated people to see Elvis after his death? What caused all those separate unrelated people to see leprechauns, or the Loch Ness monster, or be visited by Jesus, or Xenu? Do you believe in abductions? What about alien anal probes, there are plenty who would testify to having experienced one. And what about fairies? Sir Arthur Conan Doyle, the creator of Sherlock Holmes, believed in them and thought they were real, is he enough of an authority for you?\n\nOnce more: eye-witness testimony is *not worth anything scientifically*. If you can even *propose* a plausible explanation for what a witness sees, it instantly invalidates that testimony as evidence of anything. The only time observation is worth a fuck is when it's backed up with empirical evidence, and if you can present a shred of empirical evidence regarding UFOs then let's have it.", "gilded": 0, "created_utc": "1304071060", "subreddit": "YouShouldKnow", "score": 0, "controversiality": 0}
{"body": "And then he says \"I just need about tree fiddy\"", "gilded": 0, "created_utc": "1304079902", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Personally, I don't really believe in the concept of the supernatural. Let's say that there exists an energy one could tap into that would let you see the future. It's part of the universe, it exists naturally, we just don't know about it yet. If one person were to tap into this energy, it would seem, to the rest of us, that what was happening was supernatural, when it was in fact perfectly natural - just difficult for us to explain. Based on this thought process, it could be the wind or it could be some unexplained phenomenon.\n\nThe problem is that the conclusion that it is a ghost comes from fairy tales. People tell ghost stories, we like them and believe them, and when something vaguely difficult to measure (or something which one simply chooses not to measure) occurs, one jumps to the conclusion that one likes. No one likes \"It's probably just the wind\", but it just so happens to be the answer most of the time. When you see a magic trick, you know that it isn't real magic, but you pretend. It's completely harmless and it's fun. \n\nOne shouldn't ever say \"Nope, wind\". One should suggest alternative explanations based on what we've seen has been the answer previously, or attempt to document and measure the process. The majority of records of magic and incidents of \"the supernatural\" happened before the age of science. It has been increasingly difficult to get away with making claims of knowing the future or speaking with the dead, because we understand much more about the world these days, and therefore people can't get away with making outrageous claims without having them analyzed. And when they are analyzed, the most often turn out to be false. With this in mind, when someone tells you that they've seen a ghost, the least open-minded thing to do is to accept their explanation based solely on their eye witness report and their own thoughts about what it was. \n\nOr to put it this way, no one who never heard of the Loch Ness Monster ever claimed to have seen it. People see what they know to be there, even when it isn't there.", "gilded": 0, "created_utc": "1304096041", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "&gt; I'm sorry, I should have been more specific. I took 4 years of evolutionary biology and I tend to gloss over things for the laymen.\n\nWow, full of yourself a little? You just have crappy sentence structure. This is what you typed:\n\n&gt; Well, beans and rice were only introduced to our diet after we started farming. I would argue that we haven't quite evolved to eat them on a regular basis yet. There is a reason so many people have a gluten allergy/intolerance. \n\nI guess you meant:\n\n&gt; There is a reason so many people have a gluten allergy/intolerance, which is that beans and rice were only introduced to our diet after we started farming. I would argue that we haven't quite evolved to eat them on a regular basis yet.\n\nI guess I was confused by that train-wreck of a paragraph.\n\n&gt; We have a gluten intolerance because gluten was introduced into our diet near the end of the Paleolithic era.\n\n1- in 167 people is about half a percent. About 2% of people are allergic to bee stings.\n\n&gt; We have a gluten intolerance because gluten was introduced into our diet near the end of the Paleolithic era.\n\nIt doesn't make any sense that people would start to farm plants that they don't eat. If people didn't eat wheat or barley or rice, how could we have known to farm it.\n\n**This is all besides the point. You said:**\n\n&gt; You can get your amino acids from other sources, but does your body recognize it as the same and process it as such? \n\nWhich basically means that you have no evidence that shows plant proteins are bad or in anyway insufficient. One in a hundred-or-so people have an allergy to one type of grain. What does that really prove?\n\n", "gilded": 0, "created_utc": "1304102278", "subreddit": "fffffffuuuuuuuuuuuu", "score": 0, "controversiality": 0}
{"body": "&gt; I feel that there could be some sort of force or transcendent element\n\nI wouldn't call this an irrational belief, as you don't seem to *believe* it exactly. Belief implies that you're confident that it's true. You're just open to the possibility, which I think is a good thing.\n\nI can't think of any real *beliefs* I have that are particularly irrational (though I'm sure there are some), but there are a number of things that are currently lacking evidence or that some might consider fringe that I think have a significant probability of being true:\n\n1. Alien life exists. I'm nearly certain of this, and I don't think it's an irrational belief at all. If our current ideas about how life began and evolved are anywhere close to correct, it's statistically pretty certain. Most of it is probably something like bacteria.\n2. I think there's a pretty good chance that there are some beings that could fairly be called \"gods\" in the universe, though they don't fit the usual modern definition of God. They didn't create the universe, and they're not supernatural, though they have abilities that would seem like magic to us. They're just \"sufficiently advanced\" civilizations.\n3. I think there's a small but significant possibility that sasquatches exist, based on the little evidence that exists. Nessie, however, does not.", "gilded": 0, "created_utc": "1304122201", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "So we had Chuck booked to perform at an event a few years ago. I don't recall exactly what we agreed to pay him but it was in the tens of thousands. So right before he's due to go on I get a frantic call saying that Chuck wont go on without his \"walking around money\" I'm like what the fuck we're paying this asshole thousands and he wants more fucking money? So I go to Chuck's suite and he's in the bedroom, wont come out. His manager tells me that Chuck has to have his \"walking around money\" or he's no show. I'm really tempted to tell him to go fuck himself but there's hundreds of people expecting to see Chuck in about 30 minutes. So I ask how much \"walking around money\" we're talking about? Seven hundred dollars, is the answer. It was just like Chef's dad and the Loch Ness Monster, about three fitty. Chuck now comes out of his room and starts yelling at me he wants his fucking \"walking around money\"  or he ain't gonna play. So I send a kid to the casino (we were in Vegas) to get Chuck his $700.00 in 20s, that's how he asked for it and the asshole played a terrific set. Moral of this story if you book Chuck for a gig be sure to have a pile of 20s on hand.", "gilded": 0, "created_utc": "1304169668", "subreddit": "Music", "score": 0, "controversiality": 0}
{"body": "&gt; Absence of evidence is not evidence of absence. \n\nYou don't actually believe that. Unless you leave offerings for Nessie whenever you're in that part of Scotland. So she won't eat you, of course. Or keep an eye out for selkies when you go swimming, despite the fact that none have ever been observed.\n\nOr perhaps you leave a bowl of milk out for the Fair Folk, who also have ne'er been observed. Perhaps you bedeck your house in garlic to keep vampires away. Perhaps you speak to the djinn. Maybe you have a shrine for your ancestors.\n\nAnd absence of evidence is indeed an evidence of absence. Must I bring up Carl Sagan's dragon?", "gilded": 0, "created_utc": "1304181975", "subreddit": "Christianity", "score": 0, "controversiality": 0}
{"body": "We can fix that though.\nFor tree fiddy.", "gilded": 0, "created_utc": "1304182809", "subreddit": "pics", "score": 1, "controversiality": 0}
