{"body": "Nessie is real. I've seen her, and she's beautiful.", "gilded": 0, "created_utc": "1280719267", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "I agree, fellow intellectual! [Worse, scientists have discovered that the Earth will start spinning slower due to increasing CO2 concentrations.](http://news.bbc.co.uk/2/hi/science/nature/1816860.stm) [But other sicentists have discovered that AGW will also make the Earth start spinning faster.](http://www.newscientist.com/article/dn11555) This combination of the Earth spinning both faster and slower will cause the Earth to bump into itself as one part is spinning slower and the other faster, leading to massive earthquakes and eventually the destruction of the Earth. Think of it as 5 cars driving in a round-about, constantly going in circles, and half suddenly deciding to drive faster while the other half suddenly slowing down. That's what's going to happen to the Earth unless we ban non-fluorescent lightbulbs, fellow intellectuals! Also, there will be a massive number of animal extinctions. [It appears the Loch Ness monster has already gone extinct due to global warming.](http://www.dailyrecord.co.uk/news/scottish-news/2008/02/13/veteran-loch-ness-monster-hunter-gives-up-86908-20317853/) When the Himalaya becomes snow free next year, the Abominable Snow man may soon be little more than a memory as well. Unfortunately there are unscientific right-wing populist conspiracy theorists who are hindering our efforts to fight man-made global warming. Fellow intellectuals, debunk these nutters whenever you find them!", "gilded": 0, "created_utc": "1280755001", "subreddit": "worldnews", "score": -9, "controversiality": 0}
{"body": "Wormholes, though allowed as a solution to general relativity are not  thought to exist (though we cannot posit any real mechanism that would form them), as for the GR solution to have any sort of stability it would require strange forms of matter that do not exist.  \n\nWormholes are almost like the physics equivalent of the loch ness monster.  Sure it the laws of nature seem to almost allow it to exist, but there's no evidence for it existing and many compelling arguments.  \n\nAlso, if we were free to construct wormholes and move the ends of the wormholes through space (while keeping them connected), you have created a time machine.", "gilded": 0, "created_utc": "1280756795", "subreddit": "askscience", "score": 4, "controversiality": 0}
{"body": "It's slightly more than tree fiddy.", "gilded": 0, "created_utc": "1280759596", "subreddit": "pics", "score": 13, "controversiality": 0}
{"body": "\"...I was shocked by how 100% sure everyone is believing (or knowing) that there is no god...I find it's a little odd...evidence disproving religion as we know it, but there's nothing really disproving/proving the existence of (a) god(s).\"\n\nI think many here, myself include, that would not say they are 100% sure that gods do not exist, maybe somewhere between 95% to 99.999% sure. \n\nI agree that there is currently no evidence proving or disproving gods. But the same can be said for; angels, ghosts, elves, big foot, the Loch Ness monster and so on. \n\nWhile the existence of these creatures has not been proven, it can not be conclusively dis-proven, either. \n\nWould you say it's odd for me to be near certain that none of these creatures exists while there are many people who believe that they do? ", "gilded": 0, "created_utc": "1280792020", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I agree with all of that except the Loch Ness monster. I don't think I've ever heard of the Loch Ness monster having mythical powers, I just hear it was a big sea monster. And it's confined to Loch Ness, it's not like it can just swim off and hide somewhere, so while it would be hard to prove, it would not be impossible. (Same with bigfoot, not impossible to disprove, just very very difficult)", "gilded": 0, "created_utc": "1280798234", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Sure, Nessie and Sasquatch are not super-natural and could be more likely to be proven or dis-proven, the point is that while there is little solid evidence supporting their existence, some people believe anyway(\"researchers\" still search Loch Ness). \n\nI would be willing to change my mind if any decent new evidence came to light, but, I don't feel unjustified in essentially discounting their existence. \n\nAlso, it can be very hard to completely dis-prove something.", "gilded": 0, "created_utc": "1280799954", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Jed had hit it big. I mean REAL big. The kind of big that is typically reserved for pictures of burgers on billboards, anchors on aircraft carriers, and Louie Newton's ego.\n\nSee, Jed's mother owned this pig ranch in southern Illinois. He used to spend his summers there when his drunk father got shitfaced and kicked him out of the house for three months. He'd hitch a ways, catch a bus, maybe nick some milk duds from the drugstore. Maybe not. But he'd always end up on her door-step, just as sure as it rains when the sky's full of water.\n\nSo he's, like, 20 something, and Mervyn is sick of him nicking milk duds, so Mervyn kicks his ass out of the store for good. \"Don' come back, you hullum!\" he shouts.\n\nAs Jed's giving Mervyn the finger, what to his wondering eyes should appear but some homeless man picking up a lottery ticket off the ground. So Jed saunters over, looks at the ticket over the guy's shoulder, and realizes... It's a winner.\n\n\"DUDE! I'll give you tree fiddy for that ticket!\" he says.\n\"Oh?\" says the hobo, a little confused. \"Sure thing!\"\n\nThe exchange is made. Jed walks back into Mervyn's store. And then he walks down the street to 7-eleven when Mervyn threatens to call the police.\n\nTicket in hand, he sidles up to the counter and grins. \"I'll have my winnin's thanks.\" He hands it over.\n\nTen minutes later (after some debate as to whether they can accept a wet and slightly muddy lotto ticket) Jed walks triumphantly out of the store, a solid $20 gripped tightly in his hand. He grins from ear to ear as he gives the hobo the bird, then proceeds to meet his friend Ray, who pulls up in his car, blares some music, and video tapes Jed as he dances his $20 victory dance in the street.\n\nJed is positively thrilled. He's a rich man, ballin' and shit. He's dancin' like there's nobody watching. Except the camera.\n\nAs he makes his way into the street, cars drive by, but they won't hit Jed, no way, because Jed's immortal, invincible, he's a big winner. Not like that dumb-ass hobo.\n\nAnd then, [Jed hits it big](http://www.youtube.com/watch?v=E14kNqMwD6s). Ice cream truck, full in the face. BAM. Jed goes flying, and the $20 hits the street.\n\nThe THUD wakes up the hobo, who sees the $20 and carefully walks out to pick it up, then returns to his place of slumber, happy at his good fortune.\n\nRay says \"aw, shit,\" and walks over to Jed, who is unconscious.\n\nAnyway, man... Long story short, Jed dies in the hospital and now he's buried in his momma's pig ranch.\n\nThe end.\n\n&gt; &gt; 455 words.", "gilded": 0, "created_utc": "1280881127", "subreddit": "writing", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1280944984", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "That the loch ness monster is in every lake I come across.", "gilded": 0, "created_utc": "1281030322", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "What's the story with you and the Loch Ness monster?", "gilded": 0, "created_utc": "1281031303", "subreddit": "tf2", "score": 2, "controversiality": 0}
{"body": "no bro, i'm saying /r/trees could make a wolverine purr, chernobyl grow flowers, and the loch ness monster exhibit itself at Seaworld", "gilded": 0, "created_utc": "1281076884", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "I was terrified of aliens.  I was convinced that if I opened the shades in my second story bedroom, an alien would be hovering there looking into my room.  I had a fascination with the occult and paranormal.  I checked every book out of the library about aliens, ufos, ghosts, bigfoot, the loch ness monster, etc. etc.  \n\nNo fear about anything rational, like burglars, or financial insecurity, or war, only aliens. ", "gilded": 0, "created_utc": "1281077481", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "\"you are a dumbfuck\" =  \"you're a dumbfuck\"\n\nyour stupidity is obvious, nessie. ", "gilded": 0, "created_utc": "1281106780", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "so dirty, man...I picture Nessie turning around and being faced with a huge crowd of redditors' looks of disapproval and him screaming ARE YOU NOT ENTERTAINED?!", "gilded": 0, "created_utc": "1281110970", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Yeah, I have it.  Also in the shot are bigfoot and the loch ness monster being abducted by aliens.", "gilded": 0, "created_utc": "1281114186", "subreddit": "technology", "score": 21, "controversiality": 0}
{"body": "Finally a clear picture of the loch ness monster.", "gilded": 0, "created_utc": "1281145153", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "New Zealand is a nomadic country, often drifting far and wide in search of the Loch Ness Monster", "gilded": 0, "created_utc": "1281173208", "subreddit": "trees", "score": 6, "controversiality": 0}
{"body": "Would you be turned off by a flat-Earther? By someone who believes magic is real? By someone who believes in the Loch Ness Monster?", "gilded": 0, "created_utc": "1281266233", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Did you mean: Loch Ness Monster", "gilded": 0, "created_utc": "1281295307", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Even if you pile on the metaphysics?\n\nSuppose you find out that someone not only believes in *fairies*, but also believes in ghosts, wizards, demons, zombies, witches, mermaids, unicorns, leprechauns, genies, satyrs, ogres, trolls, gnomes, elves, goblins, dragons, vampires, werewolves, mummies, Medusa, the Minotaur, Pegasus, cyclopses, Sasquatch, the Loch Ness Monster, the Jersey Devil, Paul Bunyan, Breatharianism, the Marcab Confederacy, Holocaust denialism, the Protocols of the Elders of Zion, the Illuminati, reptilians, alien abductions, the lost city of Atlantis, the Bermuda Triangle, flat-earthism, Satanic ritual abuse, and fan death.\n\nAre you honestly claiming that your opinion of such a person wouldn't lower just a bit after finding this out? You'd say \"I'd need more data before lowering my opinion\"?", "gilded": 0, "created_utc": "1281322712", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Tesla could have been a 30 foot crustacean from the paleolithic era.", "gilded": 0, "created_utc": "1281342290", "subreddit": "pics", "score": 16, "controversiality": 0}
{"body": "he could of needed tree fiddy.", "gilded": 0, "created_utc": "1281343804", "subreddit": "pics", "score": 9, "controversiality": 0}
{"body": "If I was 'open minded' to things that didn't involve evidence. There would be no reason for me not to believe in Zeus, aliens, unicorns, pixies, Brahma, Big foot, the loch ness monster and so on.\n\nDo you believe in all of these? Why not? ", "gilded": 0, "created_utc": "1281365112", "subreddit": "Christianity", "score": 2, "controversiality": 0}
{"body": "Again with the evidence.  Your definition of that word is incomplete.  \n\nScience provides the balance to faith.  I don't believe in Zeus, aliens, unicorns, Brahma, Big Foot or the Loch Ness monster because there is insufficient evidence (both scientific and faith based) for me to believe in them.  I do believe in the God of the Bible because His book thoroughly and accurately reflects the world I live in.  That gives it a basis in reality.  In fact, the Bible talks about those who scorn God because of their faith in science so-called; which, ironically, makes YOU a part of the evidence that leads me to believe in the Bible.", "gilded": 0, "created_utc": "1281368559", "subreddit": "Christianity", "score": 0, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1281381093", "subreddit": "offbeat", "score": 12, "controversiality": 0}
{"body": "Tree fitty?", "gilded": 0, "created_utc": "1281404478", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "That's not worth five dollars, tree fiddy at most.", "gilded": 0, "created_utc": "1281407137", "subreddit": "videos", "score": 16, "controversiality": 0}
{"body": "\"I just gave him tree fitty last week.\"\n\n\"What!?! You gave dat monsta anotha damn tree fitty?\"\n\n\"He tricked me :P\"", "gilded": 0, "created_utc": "1281447836", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "\"Goddammit Loch Ness Monster, I ain't gonna give you no tree fiddy!\"", "gilded": 0, "created_utc": "1281475138", "subreddit": "pics", "score": 9, "controversiality": 0}
{"body": "Peeshaw, I've got him here on a painting from the Paleolithic era.", "gilded": 0, "created_utc": "1281487851", "subreddit": "WTF", "score": 5, "controversiality": 0}
{"body": "You don't roll a nessie blunt when you want something easy to smoke.", "gilded": 0, "created_utc": "1281513186", "subreddit": "Marijuana", "score": 3, "controversiality": 0}
{"body": "\"Interred spirits\" have feelings too Nessie", "gilded": 0, "created_utc": "1281516107", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Korean-American. My cousin dated a white dude. Parents protested. She broke up with him. Almost ten years went by and she didn't marry anyone else. When he came by again looking for my cousin, this time they shut up and let her marry him.  \n\nNow they cannot get enough of the happa grandchildren and constantly brag about how adorable and smart and wonderful the kiddies are. \n\nAnyway, judging by my family and a good 80% of the other Korean families I know, Nessie above^ is right. They really come around when the grandchildren are born. After all, you can block their visitation if they don't suck it up. ", "gilded": 0, "created_utc": "1281544733", "subreddit": "IAmA", "score": 4, "controversiality": 0}
{"body": "That looks awesome. Nice craftsmanship.\n\nI wish I was there to partake in uncovering the mysteries of Nessie.", "gilded": 0, "created_utc": "1281557267", "subreddit": "Marijuana", "score": 1, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1281558026", "subreddit": "AskReddit", "score": 255, "controversiality": 0}
{"body": "Uhh.. How's about tree fiddy?", "gilded": 0, "created_utc": "1281560250", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "Damn Loch Ness monster.", "gilded": 0, "created_utc": "1281560545", "subreddit": "AskReddit", "score": 16, "controversiality": 0}
{"body": "Don't go 'round givin' no Lockness monsta' tree fiddy woman!", "gilded": 0, "created_utc": "1281566157", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I'm not speaking about you at this point, because I don't know you. Some atheists demand of Christians proof for why they believe the way they do, even go so far as to ridicule them for believing in the unprovable, comparing their faith to believing in the loch ness monster. That's fine, I suppose, but let's be honest with ourselves. Atheists who believe in their partner's love for them do the same thing.", "gilded": 0, "created_utc": "1281571902", "subreddit": "DebateAnAtheist", "score": 1, "controversiality": 0}
{"body": "I ain't givin' you no tree fiddy you goddamn loch ness monster! Get your own goddamn money!", "gilded": 0, "created_utc": "1281573544", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "\" I need about tree fiddy.\"\n\n\nWell, our work is done here. ", "gilded": 0, "created_utc": "1281637680", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "The Loch Ness Monster's disguises are getting a lot better these days. ", "gilded": 0, "created_utc": "1281637825", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1281651463", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "The fucking Loch ness monster is here in the Americas.", "gilded": 0, "created_utc": "1281741949", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1281759674", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Depends. How big is his dick? If it's small, will there be a stunt dick? Is there some sort of guarantee of freshness and untouchedness? Ultimately, though, male virginity is kind of seen as worthless. Male virgins are regarded as inexperienced and poor lovers. They lack the \"tightness factor\" of the female virgin. So... yeah. Tree fiddy.", "gilded": 0, "created_utc": "1281760353", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "The SubGenius believes in \"Bob\", God, Allah, Buddha, Vishnu, Krishna, JHVH-1, Xenu, The Loch Ness Monster, The Tooth Fairy, Santa Claus, FSM, The Inivisible Pink Unicorn, and The Rev. Sung Myung Moon—ALL EQUALLY.\n\nThe SubGenius also believes in evolution, intelligent design, The-Great-Greek-Arkleseuziure Theory, and de-evolution, AT THE SAME TIME!", "gilded": 0, "created_utc": "1281770150", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "'There have been \"no \"credible sightings\" of Nessie for over a year.'\n\nWait...were there *ever* \"credible sightings\"?", "gilded": 0, "created_utc": "1281771170", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "holy fuck, it's the [loch ness monster](http://www.youtube.com/watch?v=dQw4w9WgXcQ)", "gilded": 0, "created_utc": "1281813577", "subreddit": "pics", "score": -8, "controversiality": 0}
{"body": "1.  Your life has the meaning you give it.  Try to accomplish what you can, do the good things you can, and enjoy it.\n\n2.  I don't mean to be flip, but I've also heard anecdotes (and even seen pics and video) of \"bigfoot\" and the \"Loch Ness monster\", but that doesn't mean they're real.  Stories spread because they're impressive, not because they're true.  Religious folks have an interest in propagating stories of miracles -- they bolster their faith, which they find comforting.  \n\n3. We're animals, and we've evolved like other species have evolved.  \n\n4.  We've evolved to be particularly adept at locating and interacting with each other.  We readily see human faces in random assortments of matter (e.g., [the Mars face](http://science.nasa.gov/science-news/science-at-nasa/2001/ast24may_1/).)  I think it's the same brain wiring that lets us readily identify other humans that also makes us likely to imagine a human (or rather *super*human) cause for the world around us.  ", "gilded": 0, "created_utc": "1281855969", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Did he ask for tree fiddy?", "gilded": 0, "created_utc": "1281903437", "subreddit": "reddit.com", "score": 4, "controversiality": 0}
{"body": "If you had said $3.50, I would have suspected you of being the Loch Ness monster.", "gilded": 0, "created_utc": "1281936464", "subreddit": "reddit.com", "score": 5, "controversiality": 0}
{"body": "DAMN YOU LOCH NESS MONSTER!  STAY AWAY FROM MY CHILDREN!", "gilded": 0, "created_utc": "1281974560", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1282011279", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "God dammit Loch Ness Monster, I'm not gonna give you tree fiddy!", "gilded": 0, "created_utc": "1282057985", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "In the immortal words of \"Nessie\" who said it to me last week... uperlenmeyered!", "gilded": 0, "created_utc": "1282082245", "subreddit": "breakingbad", "score": 4, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1282139339", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Mythology is in fact the study of myths.\r\n\r\nProblem is that people have seen in the last century a few supposed 'myths' be discovered as fact based that they want to assume the reality basing of ALL myths, which is just a big fallacy.\r\n\r\nYes, the myth of Pompeii was found to be factual, and other archealogical studies have shown select few myths to be fact, but guess what, the Fountain of Youth has not been found in Florida, despite being overrun with retirees and touristas; the Loch Ness monster has never been located, despite subs having gone to the very bottom of the depths there; Yeti and Bigfoot populations of one or two would not have survived the past hundred years, as many populations of species with greater numbers have gone extinct.\r\n\r\nFile this garbage in with the other 'pseudo-sci' and have fun watching your full day runs of fallacies like Ghost Hunters...\r\n\r\nMyth, by definition, is just a fantasy tale, capable of having no scientific basis or foothold in reality.", "gilded": 0, "created_utc": "1282148852", "subreddit": "scifi", "score": 1, "controversiality": 0}
{"body": "But I think the real question is: who would win a fight, you or the Loch Ness Monster?", "gilded": 0, "created_utc": "1282157594", "subreddit": "technology", "score": 0, "controversiality": 0}
{"body": "&gt;If Sasquatch did exist... why is there no fossilized history of him in the geologic records?\n\nSeriously?  I can understand your other points, but lack of FOSSIL evidence?\n\n1. I'm not saying it exists, but do you KNOW without a doubt what species he is SUPPOSED TO BE and thus know exactly what bones to look for?  What I mean is, no one has captured a Loch Ness Monster...but sightings have said it looks suspiciously like a plesiosaur.  Guess what, there ARE fossils of plesiosaurs!  I guess that proves the existance of the Nessie, right?\n\n2. I suppose \"Lucy\" (Austrolopithecus) didn't actually exist until 1974?  Simply because there was nothing in the fossil record up until then...she just magically appeared.\n\n3. People seem to think EVERYTHING gets fossilized.  Not true at all.  Fossilization is rare.  You need to have exactly the right conditions for it to happen.  And typically you are NOT going to get those conditions in a humid temperate forest where these things are supposed to live.  You need rapid burial for the most part and forests don't usually give that.  You'll notice the majority of fossils occur near water.\n\nSorry to lecture, but that was just a silly argument.\n", "gilded": 0, "created_utc": "1282226601", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "Now, Nessie...you did not.", "gilded": 0, "created_utc": "1282242496", "subreddit": "humor", "score": 1, "controversiality": 0}
{"body": "Nessie, can you get in touch with me offline, please?", "gilded": 0, "created_utc": "1282244037", "subreddit": "humor", "score": 1, "controversiality": 0}
{"body": "Nessie, is that you?", "gilded": 0, "created_utc": "1282327659", "subreddit": "Boobies", "score": 0, "controversiality": 0}
{"body": "...found the loch ness monster", "gilded": 0, "created_utc": "1282358556", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "TREE FIDDY", "gilded": 0, "created_utc": "1282391665", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "I'll also find proof the Loch Ness monster exists.", "gilded": 0, "created_utc": "1282393504", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "Oh, come on, *everyone* knows that it's the ghosts of dead aliens that were buried there. I mean, where else was Hitler going to bury the evidence of his occult sacrifices? Surly not in Argentina! \n\nBesides, that lake lies so close to the Paris Meridian, it's the only logical place where the Free Masons could hide the true Loch Ness monster, which, as everyone also knows, feeds on dead alien corpses.\n\nJesh, learn your history channel. ", "gilded": 0, "created_utc": "1282414179", "subreddit": "history", "score": 8, "controversiality": 0}
{"body": "Just shows how illogical humans are; or at least me. I'm actually more scared of wasps than I am bears. I've had wasps attack me and they aren't the least bit scared. Most of the times I've seen bears, they ran like I was the Loch Ness monster. I know it makes no sense, but I now know why gorillas beat their chests.", "gilded": 0, "created_utc": "1282466097", "subreddit": "reddit.com", "score": -5, "controversiality": 0}
{"body": "\"And lo Jesus and the disciples walked to Nazareth. But the trail was blocked by a giant brontosaurus...with a splinter in his paw. And O the disciples did run a shriekin': 'What a big fucking lizard, Lord!' But Jesus was unafraid and he took the splinter from the brontosaurus's paw and the big lizard became his friend. And Jesus sent him to Scotland where he lived in a loch, O so many years, attracting fat American families with their fat fucking dollars to look for the Loch Ness Monster. And O the Scots did praise the Lord: \"Thank you, Lord! Thank you, Lord!”\n\nBill Hicks", "gilded": 0, "created_utc": "1282502246", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Loch Ness Monster.  Final answer.", "gilded": 0, "created_utc": "1282551670", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "you take the picture?\nbefore I scrolled down I was thinking \"oh shit, more loch ness monster shenanigans\"", "gilded": 0, "created_utc": "1282659720", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "But I agree with all your points, there is no basis for disagreement (except labeling quantum ideas as bull). Current theory really does prevent unification of quantum an gravitational theories, and that is an obvious, very serious problem.\n\nThe problem with string theory as a remedy is there is no basis for choosing one form over another (of a nearly infinite variety of forms), and there is no chance to produce experimental verification.\n\nThe quantum foam theory has the same problem.\n\n&gt; ... there is also consensus that quantum foam and string theories (where the Planck length and Planck scale do matter) very well may have observable macroscopic effects\n\nThat consensus has no meaning until such effects are actually observed. There may very well be Bigfoot or a Loch Ness Monster, but this carries no weight until they are actually observed.\n\nIf a more specific prediction were made, it would be more interesting. If quantum foam made a specific, practical prediction that would either succeed or fail, say, within the energy available to the [LHC](http://en.wikipedia.org/wiki/Large_Hadron_Collider), that would be worth taking about. But no such predictions are in the cards at the moment.\n", "gilded": 0, "created_utc": "1282676234", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Move out of the paleolithic era, and into the neolithic. Stop wandering around looking for what you want, and settle down in one place to start building it.  ", "gilded": 0, "created_utc": "1282678944", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "Here’s something to keep you up at night.\n\nThe fossil record for dinosaurs is not particularly tight: while we have many skeletons, they’re mostly in relatively few clusters in time and space spread over many million years and the whole world.\n\nAs far as I know, we have no reason to rule out the idea that some group of dinosaurs ([ornithomimosaurs](http://en.wikipedia.org/wiki/Ornithomimosaurs), say) could have developed relatively effective graspers, high intelligence, tool use, and even agriculture or language of some kind over the course of a million years or so. Maybe not human-like, with nuclear reactors and such, but above chimps and dolphins.\n\nWell, that’s an exaggeration. The lack of evidence and Occam’s razor are pretty good reasons not to give it serious consideration. But put it this way – if that *had* happened, there’s no reason to expect we would have found evidence of it yet. (Whereas, for example, it’s reasonable to assume that if the Loch Ness monster existed, we would have found it.) I think that’s pretty cool. Among other things, it makes me wonder how long terrestrial signs of human civilization would last if we were were wiped out today.\n\nEdit: my new pet conspiracy theory is that dinosaurs landed on Mars. What is NASA trying to hide‽", "gilded": 0, "created_utc": "1282700934", "subreddit": "space", "score": 7, "controversiality": 0}
{"body": "Why anecdotes don't matter, even if there are a lot of them.\n\nPeople see so many things. If you ask a witness to a robbery if they saw the guy in the leather jacket, a surprisingly high percentage will say yes even if there was none. Before people used to believe in trolls, werewolves, elves etc, now they watch sci-fi and thrillers and believe in aliens and ghosts. They also see the Loch Ness monster, aliens, bigfoot, yeti and all kinds of other stuff.\n\nThe point is, that for me everything points to that people are likely to come to believe in supernatural beings that do not exist. They change with the time and location of the culture, and there is never any kind of documentation. Psychology shows that false and real memories are indistinguishable from each other. It also shows that memory changes *every time we recall something*. Details from any long past memory will change with time and each retelling. \n\nIf you first decide that some of these believers in highly speculative supernatural stuff might be wrong, how can you know any of it has any basis in reality? Once you know that even strong personal experiences might be unreal, is it right to trust every experience you've ever had? Do you think the recollection of your episode is the same as back then?\n\nI find stories about the supernatural very interesting and entertaining, but I'm skeptical until tests, documentation and a consensus of critical thinkers tells me otherwise.", "gilded": 0, "created_utc": "1282777013", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Got-damned Loch Ness Monster!  Get your own goddamned money!", "gilded": 0, "created_utc": "1282781863", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "I aint giving you no [tree fiddy](http://www.youtube.com/watch?v=9cn7xfBpZ3M&amp;feature=related), you god damned lochness monster! Get your own god damned money!", "gilded": 0, "created_utc": "1282781918", "subreddit": "offbeat", "score": 15, "controversiality": 0}
{"body": "I was dating this girl once, and it seemed like it was going pretty well.  We used to go on picnics, and go on bike rides and stuff.  She really liked cooking and she was big into fresh-caught fish and Asian fusion stuff, so I'd always be trying deep-fried sushi or sesame-seared ahi tuna.  Great stuff.\n\nAs the relationship progressed, I felt like something was off.  She was frequently distant and uncommunicative, she tried to switch my diet around to be more \"in tune\" with her - I barely had chicken for a month, and the sex started getting really weird.\n\nOne day, I decided I'd rekindle the spark or just give up in an all-or-nothing, super-romantic date.  So I take her to her favorite place for lunch, then I drive her out to the lake and rent a rowboat and we just drift along this little side stream.  It was really beautiful and there were dragonflies all over the place, gentle willow fronds dipping into the water, a very picturesque scene.  She smiled at me, and I felt like I was making a lot of headway, when all of a sudden she says \"I need about a tree fiddy.\"\n\nIt was about that time I noticed that my girlfriend was a god-damn eight-storey, ten-ton sea beast.  It was the god-damn Loch Ness Monster!\n\nSo I said, \"Damn it monster, get off my boat!  You damn relic from the Mesozoic!\"\n\nSo then she said, \"Well, how about about a two fiddy?\"\n\nAnd I said, \"Oh hell no!  You goin' tell me you just change your numbers around all willy-nilly?!\"\n\nSo the god-damn monster just swims off, but I'll be damned if it didn't try to eat my wallet.", "gilded": 0, "created_utc": "1282832973", "subreddit": "AskReddit", "score": 261, "controversiality": 0}
{"body": "Oh. My. God. I've never seen someone Bel-Air with the Loch Ness Monster. I don't know if it's a thing now. But I fucking laughed out loud when I got to a tree fiddy.", "gilded": 0, "created_utc": "1282833526", "subreddit": "AskReddit", "score": 60, "controversiality": 0}
{"body": "you give that monster tree fiddy?", "gilded": 0, "created_utc": "1282836384", "subreddit": "AskReddit", "score": 11, "controversiality": 0}
{"body": "When i read \"tree fiddy\", I stopped reading for a moment and wondered where I had heard that before.  Then i started reading the next line and started laughing uncontrollably.  My coworkers are wondering what the fuck is so funny now.", "gilded": 0, "created_utc": "1282840751", "subreddit": "AskReddit", "score": 9, "controversiality": 0}
{"body": "i dont know why he's back i gave him tree fiddy last week", "gilded": 0, "created_utc": "1282840756", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "/ stabs the shit out of your stomach and crotch, hides the body\r\n\r\nyou should have just  played it cool like you didnt know anything, but you didnt, then you opened the door and saw my face, so you left me no choice!\r\n\r\n\r\nKNOCK KNOCK NESSIE.....", "gilded": 0, "created_utc": "1282845555", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "I had to walk away from my computer because I'm at work and I was laughing so hard people were looking at me.  Even as I walked to the elevator I pretty much pissed my pants.  I'm back now, just to say this is probably the funniest thing I've ever read.  I wasn't expecting it, I didn't see it coming... even after tree fiddy, i figured it was just a girl asking for money ( happens to me all the time ).  Well done sir, that was art.", "gilded": 0, "created_utc": "1282846736", "subreddit": "AskReddit", "score": 8, "controversiality": 0}
{"body": "If pigs started flying around with aliens, Elvis and the Loch Ness monster, yes, I would have considered it a success.", "gilded": 0, "created_utc": "1282863002", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "&gt;Yes, but willingly believing in the supernatural for no reason\n\nI think you're seriously misrepresenting the thought that goes behind religious belief. Very rarely is it \"Oh man, might as well believe this shit for no reason\" \n\nI'm not suggesting that it's the most rational belief, or that it's even a rational belief, but you're attacking basically a strawman and leading it to the conclusion that therefore all religious people can't make objective or rational decisions.\n\nIt's really easy to project our point of view on these other people. Looking at it from how we look at it, *of course* they do this without evidence and are clearly irrational, but you have to realize their entire frame of reference is entirely different, and within their own frame of reference it all makes perfect sense. It's not their reasoning that's off, it's the frame they're making all their reasoning from. When you start with the belief there's an all powerful deity who's motives you can't intuit, there's nothing you can't shoehorn to fit, so they aren't explicitly making anything irrational. They're just holding an irrational assumption.\n\nYou can't draw from that the conclusion that *anything* else they may judge on is biased. I'm sorry but that's a complete non-sequitor.\n\n\nAnd yeah, how we define irrational is important when we're calling people irrational. Nessie's entire point is that because they have one irrational belief they are irrational. If that's the standard we're using then everyone is irrational. So singling any one group out *specifically* for being irrational is fruitless.", "gilded": 0, "created_utc": "1282866617", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "\"And in the end, the love you take\nis equal to the love you make\" \n-McCartney.\n(edit: Correct attribution, thanks to Nessie for pointing out my error)", "gilded": 0, "created_utc": "1282887983", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "HELL NO LOCH NESS MONSTER!!", "gilded": 0, "created_utc": "1282931346", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "I guess they cost about tree fiddy...", "gilded": 0, "created_utc": "1282932694", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "And sure enough, there was that damn Loch Ness Monster! ", "gilded": 0, "created_utc": "1282951706", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I knew Nessie was real...", "gilded": 0, "created_utc": "1282968947", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I knew Nessie was real...", "gilded": 0, "created_utc": "1282968952", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "My best Buzz Killington moment must have been the one back in my freshman year. I was at the dining hall, and there was this girl at the time who I was pretty into-- brunette, great tits, super chatty-- and I ran into her while I was in line waiting to buy food. So anyways, we get to talking, and sit down and eat dinner together, and she's super into it, laughing at all the right points and all. I mention that I was planning on going to this party later that night, and casually drop the \"Hey, you want to come with?\" and she eagerly agrees, and asks if I want to come up to her dorm room beforehand to pregame a bit, and that her \"roommate is out of town for the weekend, so we won't have to share or anything.\" On hearing that, my heart does a double jump of anticipation, but I play it cool, and we head up the hill to her dorm. \n\n\nSo we're drinking and flirting a bit, and I had positioned myself on her bed, and she was sitting in her deskchair across from me, touching my knee every so often for punctuation in that faux-casual way that girls do when they're trying to telegraph their interest. At some point, there's a slight pause in the conversation, and we both take a swig of the vodka-orange juice combo we're drinking-- screwdrivers, I think they're called. Me, drinking to steady my nerves they way they get when you're with a cute girl for the first time, before anything has happened, and her to work up courage, it seems, because she stands up and walks over to the bed and sits next to me, and looks at me from about 10 inches away. I have a grin plastered on my face which I hope looks roguish and appealing, though its probably closer to kid on Christmas than anything, and she smiles back, and says \"I... I wonder if you might do something for me...\" \n\n\nI raise my eyebrow back. \"Oh?\" I said \"What do you need?\"\n\n\nShe looks at me and says \"...I need about tree fiddy.\"\n\n\nWell it was about that time that I realized that this cute brownhaired girl was actually an eight story-tall crustacean from the paleozoic era! You can imagine my surprise. \"God Damn it, Loch Ness Monster, I ain't givin' you no tree fiddy! Now get!\" Super buzz kill.", "gilded": 0, "created_utc": "1282974927", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "Fine, your comments seem to insist that 911 'truthers' as you call it are all bred from the same dumbass reptillian bullshit as  David Icke and all those clowns. All that does is marginalize anyone into that category and it's retarded. Do you think everyone thinks Elvis is still alive or that the Loch Ness Monster is real? No? Well then why the fuck do you insist on lumping people who are skeptical into the same category?\r\n\r\nOccam's razor is bulshit. It only works if no one is 'bending the line'.\r\nFor one to follow a linear path of deductive reasoning, all crucial elements of evidence must be untampered so that you can follow the trail. It doesn't work if someone is lying or planting evidence.\r\n\r\nYou seem smart. You know what diaspora is, so it makes me wonder how you don't know what hasbara is.\r\n", "gilded": 0, "created_utc": "1283021202", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1283034942", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "I AINT GIVIN YOU NO TREE FIDDY YOU GOD DAMN LOCH NESS MONSTER!", "gilded": 0, "created_utc": "1283051306", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Ahh. They finally catched the Loch Ness monster. Not that scary up close. ", "gilded": 0, "created_utc": "1283101164", "subreddit": "aww", "score": 1, "controversiality": 0}
{"body": "my best mate did the same thing once and announced excitedly that he'd laid nessie.. sure enough, after inspection, the Loch Ness Monster was proudly reering it's head from out of the water.\n\nIt truly was a work of art, i wish i had a picture!", "gilded": 0, "created_utc": "1283108811", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "they chargin tree fitty?  Must be the loch ness monster.", "gilded": 0, "created_utc": "1283124944", "subreddit": "pics", "score": 75, "controversiality": 0}
{"body": "Tree Fiddy.", "gilded": 0, "created_utc": "1283128613", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "I said, \"I AIN'T GIVIN' YOU NO TREE FIDDY YOU GOD DAMN LOCH NESS MONSTAH! GETCHU OWN GOD DAMN MONEY!\"", "gilded": 0, "created_utc": "1283129995", "subreddit": "pics", "score": 21, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy. ", "gilded": 0, "created_utc": "1283130915", "subreddit": "pics", "score": 28, "controversiality": 0}
{"body": "THAT GOD DAMN LOCH NESS MONSTER NEVER LEAVE A NIGGER ALONE. JUSS LAST WEEK HE BE HASSLIN ME FO FITTY FI CENT AND I WAS LIKE NIGGA YOU HIGH.", "gilded": 0, "created_utc": "1283144189", "subreddit": "pics", "score": -4, "controversiality": 0}
{"body": "It's on the shelf between the unicorns and the loch ness monster.", "gilded": 0, "created_utc": "1283150510", "subreddit": "reddit.com", "score": 10, "controversiality": 0}
{"body": "That's not a three phase wye or delta or even open delta, it's a tree fiddy phase.", "gilded": 0, "created_utc": "1283173100", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Well GOD DAMMIT woman what'd you have to go give tree fiddy for?", "gilded": 0, "created_utc": "1283173752", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "Don’t answer it! It’s that damn Loch Ness Monster again!", "gilded": 0, "created_utc": "1283199131", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "Maybe not exactly what you're asking for, but I'd certainly like to have had a chance to read Archimedes' [On Sphere-Making](http://en.wikipedia.org/wiki/On_Sphere-Making). And [Gospel of Eve](http://en.wikipedia.org/wiki/Gospel_of_Eve) for that matter.\n\nAlso, I've always had a bit of a weak spot for the Loch Ness Monster, but you can hardly call that a mystery anymore, can you.", "gilded": 0, "created_utc": "1283216267", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I want to see a painting of a little girl playing in the water with the Loch Ness Monster.", "gilded": 0, "created_utc": "1283224213", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "So, one of the professors at my college (chair of the foreign language department) has been life-long friends with Reno.  They grew up in Morocco together, and the professor had Reno agree to be interviewed for an audience at our school.  It was kind of an \"inside the actors' studio\" type interview, except the professor was not as skilled an interviewer as James Lipton (I don't care what people say, he's good at what he does).  \n\nReno was as charming as could be.  He is an advanced English speaker, but not quite fluent.  The audience was split between foreign language students, theatre students, faculty, and a few fans from the general public.  \n\nThe interview was quite fascinating.  They talked about his childhood in Casablanca; actually, Reno's first role was in a play that his professor friend had directed.  Reno has fond memories of his childhood, and specifically of his early acting experiences there.  Unfortunately, he lost his mother just around the time he moved away.\n\nHe went to Paris, where he studied in a few acting studios.  He says the greatest teacher he had was a Greek acting teacher who had moved from the Actor's Studio in New York to Paris, and who taught the Stanislavski-based method that the Group Theatre had espoused.  \n\nHe talked about his first paid acting gig, which (as for any actor) was a big deal.  He made the point that, until an actor is paid, they are virtually invisible in society.  You can't get loans from a bank or anything of the sort without being on a payroll.  In fact, he had friends make up fake pay stubs from their own businesses when he was young just to help him get by.  \n\nHe talked about his philosophy in auditions.  He says that he gives his first reading/delivery in a very neutral way.  Then, when the director or casting director gives some direction (because s/he is obviously not happy with the neutral take), then he makes bold choices.  That way, he knows he is taking the scene in the direction that they want to see, and he has shown at least a little range.\n\nThen he started the conversation moved on to his film career.  He hadn't considered film as a young actor, because in Casablanca that wasn't really an option.  But in France, things started opening up.  He started getting work, and making friends in the industry, which in turn helped him get more work.  \n\nHe said the difference between films in France and films in America is that in America, you are making films for the whole world.  There is more money to get the picture right and do things over and over if need be.  France has a much smaller contingent to play to, and much fewer resources.\n\nThings came to his breakout roles: Big Blue and The Professional.  He talked about spending a year to learn to dive for Big Blue.  Eventually, they were diving about 100 ft down.  \n\nHe talked about young Natalie Portman.  When the camera was not on her, she would make faces and play around; it was very cute.  Reno taught her that this was a serious business, and you have to behave seriously, and they became very fond of each other.  He talked about her as if she were a beloved niece.  \n\nThis was where the name dropping began.  But it never felt phony or like he was trying to impress anyone.  These were just his colleagues.  He spoke about them with great respect:  John Frankenheimer, Ron Howard, Tom Hanks, Steve Martin, Tom Cruise, Roberto Benigni, Gerard Depardieu, etc.\n\nThe highest praise he gave was aimed at Tom Hanks and Robert De Niro.  He said that Tom Hanks was incredibly precise; as he received direction, his performance would adjust accordingly, no more or less.  \n\nSome of the best stories he told were about Ronin.  He said the original script was terrible.  It was very thin (literally), and he and his agent thought it would be a bad movie.  (Of course, at the time, he was filming Godzilla.)  But then, Bob De Niro was attached to the thing.  This made them think twice, but he still couldn't see how this script would make anything worthwhile.  Then, he was woken up by a call in his trailer: De Niro was calling to talk him into taking the movie.  They agreed to meet for dinner in New York.  The restaurant turned off the lamp over the back table and De Niro came in through the back door.  De Niro asked Reno if he liked hot sake or cold sake.  Reno had no experience with sake, but wanted to hit it off with De Niro, so he guessed hot.  De Niro said cold.  Then De Niro said, \"this is gonna be a good movie.\"  Reno had no choice.  What was he gonna do, argue with De Niro?\n\nReno said De Niro could deliver impossible lines.  He had one line in Ronin where he says \"the road\" like ten times in the same sentence, and every time made it believable.  \n\nIt was clear that Reno has a lot of love in his heart.  He has a wife and five children, and they are clearly the most dear part of his life.  His youngest child is only 14 months.  He spoke of many of his colleagues with not just respect, but admiration, even love.  It was kind of hard to believe how much of a bad ass the dude can play sometimes.  He was very down to earth and approachable.  It was a thoroughly enjoyable evening, and it made me a bigger fan.\n\nTLDR:  It turned out that it wasn't Jean Reno, but a sixty foot reptile from the mesozoic era asking for about tree fitty.", "gilded": 0, "created_utc": "1283228674", "subreddit": "movies", "score": 2, "controversiality": 0}
{"body": "Okay, lame. This is the typical replacement argument from theists:\n\nIf you don't worship god, what do you worship?\nIf you don't believe in Jesus, who do you follow?\nIf you don't believe in the bible, what book teaches you morals?\n\nAs if **not** believing in something absurd means you must replace it with something else. When you don't believe in Santa Claus, you don't put out the milk and cookies at all. No substitute is required for non-beliefs. This is equally true of horoscopes, homeopathy, psychic readings, alien abductions, Loch Ness Monster, Big Foot, and Russel's Tea Pot.", "gilded": 0, "created_utc": "1283246759", "subreddit": "atheism", "score": 6, "controversiality": 0}
{"body": "bout tree fiddy", "gilded": 0, "created_utc": "1283262932", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Is a 404 scam when you get an email from a Nigerian gentleman containing links to nonexistent webpages?  (Sorry.)\n\nLook, I'm a simple seeker of knowledge.  My own skills were too weak to discover the Nessie of my description.  I had hoped that you, someone with apparent interest in the topic, would be sufficiently motivated by the carrot of proving someone you've never met and you probably wouldn't like anyways completely and totally wrong.  \n\nAlas, but we both sit together now in the darkness of ignorance.  ", "gilded": 0, "created_utc": "1283268095", "subreddit": "WeAreTheMusicMakers", "score": 2, "controversiality": 0}
{"body": "GODDAMN LOCH NESS MONSTAH I AIN'T GIVIN' YOU NO TREE FIDDY", "gilded": 0, "created_utc": "1283270084", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "This sort of thing puzzles me. \n\nA knife is a tool for cutting things with. It has been around, in some form, since the paleolithic era. \n\nIn other words, since before the dawn of recorded history, humans have enjoyed the privilege of cutting things, and making fire. \n\nAre we regressing? ", "gilded": 0, "created_utc": "1283291963", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "ill sell for tree fiddy", "gilded": 0, "created_utc": "1283292242", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "micron 01 acid free waterproof. nessie also decided to be a pirate!", "gilded": 0, "created_utc": "1283295558", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
