{"body": "Oh it's just a bear with nessie hair.", "gilded": 0, "created_utc": "1193948215", "subreddit": "reddit.com", "score": 9, "controversiality": 0}
{"body": "Oh bloody hell... why does this come up every friggin time there's a discussion on this, and why can no one get it right?\n\n(In response to too many of the comments in this thread)\n\nStrong atheism: I believe there is no God\n\nWeak atheism: I do not believe there is a God.\n\nThey're two semantically different statements. Both are atheism. Most atheists are weak atheists. The strong position, a positive assertion, is much harder if not impossible to defend. The weak position is much more akin to a lack of belief in the loch ness monster - simply \"I won't believe without proof\".\n\nNow, agnostiticism has nothing to do with either of those. It concerns itself with knowledge rather than belief. Most people, atheist and theist alike, are agnostic: \"I cannot know for sure that God exists (or doesn't)\".\n\nOne can be an agnostic atheist: \"I don't know if God exists but I don't believe one does\"\n\nOr an agnostic theist: \"I don't know if God exists but I believe one does.\"\n\nIt's not hard, but it's frustrating when even self-described atheists don't understand the basics of the terminology or the positions they represent.", "gilded": 0, "created_utc": "1194368310", "subreddit": "politics", "score": 16, "controversiality": 0}
{"body": "9-11, DEBUNK FURTHER FAIRY TALE EXPERTS.\n\nHistory will put this group comfortably alongside those who insist the Loch Ness Monster and Bigfoot are real.\n\nI do like those SlimJim Bigfoot commercials, though.", "gilded": 0, "created_utc": "1194706677", "subreddit": "reddit.com", "score": -2, "controversiality": 0}
{"body": "To tighten testspecimen's comparison, this isn't Tree Fiddy warning rival gang members against coming on turf he may or may not actually care about on pain of being shot with guns he may or may not actually own, this is Grand Dragon Sheepfucker singing \"Let's go hang some niggers.\"", "gilded": 0, "created_utc": "1194890536", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "i was thinkin about tree-fiddy\r\n\r\nfuckin Loch Ness Monster", "gilded": 0, "created_utc": "1195057622", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Oh whew, what massive amounts of judgment and insight it takes. Almost as much as it took me to finally stop believing in the Loch Ness Monster.", "gilded": 0, "created_utc": "1196020214", "subreddit": "reddit.com", "score": 6, "controversiality": 0}
{"body": "That's right. I said, \"I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! ...", "gilded": 0, "created_utc": "1196362720", "subreddit": "reddit.com", "score": 12, "controversiality": 0}
{"body": "damn ol lockness Monster, always wanting my tree fiddy! ", "gilded": 0, "created_utc": "1196389115", "subreddit": "reddit.com", "score": 8, "controversiality": 0}
