{"body": "*tree fiddy*", "gilded": 0, "created_utc": "1325376471", "subreddit": "todayilearned", "score": 3, "controversiality": 0}
{"body": "And I'm like, I'm not given you no tree fiddy!", "gilded": 0, "created_utc": "1325377234", "subreddit": "funny", "score": 34, "controversiality": 0}
{"body": "tree fiddy.", "gilded": 0, "created_utc": "1325382715", "subreddit": "fffffffuuuuuuuuuuuu", "score": 45, "controversiality": 0}
{"body": "I wont give you tree fiddy but here's half a rock.", "gilded": 0, "created_utc": "1325384193", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "I believe that Nessie is real. ", "gilded": 0, "created_utc": "1325385366", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "[Oh no, not again Loch Ness Monster!](http://www.youtube.com/watch?v=B4C96ZTJIhU)", "gilded": 0, "created_utc": "1325386077", "subreddit": "fffffffuuuuuuuuuuuu", "score": 10, "controversiality": 0}
{"body": "&gt;Please explain to me how using science to move the human race forward and live in more harmony with the earth isn't an attribute of atheism?\n\nAtheism is a one sentence proposition: there's (probably) no God(s). There are atheists who believe in ghosts and homeopathy and the Loch Ness Monster, who are racist and homophobic, who have committed murder and other crimes, and none of that - not one bit of it - changes the fact they don't believe in a God. ", "gilded": 0, "created_utc": "1325403615", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Bessie. it's like nessie (loch ness monster), but with a B", "gilded": 0, "created_utc": "1325420262", "subreddit": "pokemon", "score": 1, "controversiality": 0}
{"body": "He came to collect tree fitty ", "gilded": 0, "created_utc": "1325430403", "subreddit": "leagueoflegends", "score": 16, "controversiality": 0}
{"body": "Quote: tree fiddy", "gilded": 0, "created_utc": "1325436127", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "Can I have about tree fiddy?", "gilded": 0, "created_utc": "1325440802", "subreddit": "shittyaskscience", "score": 6, "controversiality": 0}
{"body": "\n&gt;I can prove that.\n\nGo on then.\n\n&gt;By saying that my statement is false you are making the claim that there is no possible way a God could exist\n\nNo I am not making that claim. I will state now that it is possible that I could owe a stranger a debt. (Especially after last night), but I would demand more evidence than naked assertion. I belief it is possible that a large, previously unknown creature could live in a scottish lake, but I don't believe in the loch ness monster.\n\n\n&gt;Unless of course you are claiming you are an Agnostic... and not an Atheist at all. \n\nMost people on here are both. The terms address different things and are not mutually exclusive. I'm fairly sure you have been pointed to the FAQ by now.\n\n", "gilded": 0, "created_utc": "1325441118", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1325444783", "subreddit": "southpark", "score": 1, "controversiality": 0}
{"body": "Can I have about tree fiddy?", "gilded": 0, "created_utc": "1325448077", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Tree Fiddy, same as in town", "gilded": 0, "created_utc": "1325453636", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Now make a Nessie ", "gilded": 0, "created_utc": "1325455502", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "&gt; Yes, but it's not the representative city of the Netherlands, that's the only thing I'm saying. Most of the Dutch people do not identify with Amsterdam as being a typical Dutch city.\n\nYou said to \"avoid\" Amsterdam, Rotterdam, and the Hague, and now say that they are not representative of the Netherlands.\n\nMetro Amsterdam+Rotterdam+'s-Gravenhage add up to about 4 million people, one quarter of the population of the country. They may not be representative of your ideal of the country but they are clearly representative of a very significant part of it.\n\nThe \"real\" Netherlands changes over time, and today it includes large international cities. Otherwise I might as well say that the only way to see the \"real\" Netherlands is to stand waist-deep in mud during the Paleolithic Era, before all those stupid humans screwed it up with their houses and farms and those infernal polders.\n", "gilded": 0, "created_utc": "1325464591", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I just need about tree fiddy.", "gilded": 0, "created_utc": "1325466835", "subreddit": "offmychest", "score": 40, "controversiality": 0}
{"body": "Can I borrow about tree fiddy?", "gilded": 0, "created_utc": "1325473035", "subreddit": "gaming", "score": 0, "controversiality": 0}
{"body": "Can I borrow about tree fiddy?", "gilded": 0, "created_utc": "1325473683", "subreddit": "southpark", "score": 4, "controversiality": 0}
{"body": "those lights on either side of the bridge definitely remind me of Loch Ness monsters.  Or dinosaurs.", "gilded": 0, "created_utc": "1325476005", "subreddit": "photoclass2012a", "score": 2, "controversiality": 0}
{"body": "I gave him tree fitty the other day. I couldn't help it, he tricked me!", "gilded": 0, "created_utc": "1325478332", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "My friend had to convince a fellow classmate that the MYTH of the [Ogopogo](http://en.wikipedia.org/wiki/Ogopogo), the North American equivalent to the Loch Ness Monster, didn't even exist. What he was trying to argue is that the concept of it didn't exist, which is strange since they were talking about it.", "gilded": 0, "created_utc": "1325484916", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Testa went to Scotland and kilt Nessie?", "gilded": 0, "created_utc": "1325490075", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "So the loch ness monster is the sole beacon of a drowning man, the victim of a boat sinking with nothing but a nessy cutout at his disposal, attempting to use it as a life preserver as it gets slowly clogged with water. And people said it was all a hoax.", "gilded": 0, "created_utc": "1325490288", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Testa does *taxidermy*. That means that he cut off the head of the loch ness monster, and paraded about with its head on a stick to mess with people.", "gilded": 0, "created_utc": "1325490562", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Gonna need about tree fiddy.", "gilded": 0, "created_utc": "1325492676", "subreddit": "discgolf", "score": 3, "controversiality": 0}
{"body": "Anyone seeking more info might also check here:\n\ntitle | comnts | points | age | /r/\n:--|:--|:--|:--|:--\n[Tree Fiddy.](http://www.reddit.com/r/funny/comments/ll8ct/tree_fiddy/) | 8^coms | 82^pts | 2^mos | funny\n[What 'Rider 4 Real' was really about](http://www.reddit.com/r/funny/comments/lcfzu/what_rider_4_real_was_really_about/) | 0^coms | 2^pts | 2^mos | funny\n[50 Centaur](http://www.reddit.com/r/funny/comments/iqren/50_centaur/) | 16^coms | 217^pts | 5^mos | funny\n[50 Centaur.](http://www.reddit.com/r/pics/comments/k5696/50_centaur/) | 2^coms | 18^pts | 3^mos | pics\n[Fixed for National Coming Out Day!](http://www.reddit.com/r/pics/comments/lay6n/fixed_for_national_coming_out_day/) | 3^coms | -6^pts | 2^mos | pics\n\n*[source: karmadecay](http://karmadecay.com/r/funny/comments/nzev8/i_shouldnt_have_laughed_at_this_as_hard_as_i_did/)*\n", "gilded": 0, "created_utc": "1325493081", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "No, no, you have it all wrong. It was Col. Robert Wilson and the Loch Ness monster himself who put it together. The monster, who isn't a plesiosaur after all, but actually vaguely man-shaped and furry, was looking to...well, [Hodgman will do a better job at this than I](http://books.google.com/books?id=sKcdsD1v12oC&amp;lpg=PP1&amp;dq=john%20hodgman%20the%20areas%20of%20my%20expertise&amp;pg=PA219#v=onepage&amp;q&amp;f=false).", "gilded": 0, "created_utc": "1325496633", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Wait a minute! You're not Tiksi, you're that goddamn monstah! You get the hell out o' here monstah I ain't giving you no tree fitty damn it!  ", "gilded": 0, "created_utc": "1325498718", "subreddit": "offmychest", "score": 5, "controversiality": 0}
{"body": "Can I borrow tree fiddy?", "gilded": 0, "created_utc": "1325500426", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "I'm not a paleo dieter and I know this is days old, so I apologize up front.\n\n&gt;The paleo thing is a bit extreme. It vilifies grains and carbs--which makes it not much different than a keto diet.\n\nIt's not much different then keto, many ex-ketoers move to it to maintain weight.\n\n&gt;In addition, they seem to say that they want to emulate how homosapiens lived back in the day, but then they say things like 50% fat 25% carb/protein--- or \"60% fat, 10% carb\"---and claim that cavemen had access to that much fat (they didn't). \n\n[Read this](http://en.wikipedia.org/wiki/Paleolithic_diet#Plant-to-animal_ratio) and take special care to read the last few paragraphs.\n\n&gt;So just trying to simulate a paleo diet is not going to make you a lean caveman.\n\nI don't think that's the penultimate goal, or even what the \"paleo\" part in Paleo Diet means. I understood it to mean \"eat more in line with our ancestors\". Our digestion is the result of millions of years of evolution. Paleo is about eating things that it's \"attuned\" to. A side effect is that you feel healthier. Another side effect is that you know what is going into your body, and know generally how many calories there are. You can then discount your daily caloric intake because you know how many you're getting, and *that's* why you lose weight.\n\nFrom the [/r/paleo FAQ](http://www.reddit.com/help/faqs/paleo):\n\n&gt;**Q: Why should we care about the Paleolithic Era today?**\n\n&gt;A: To put it simply: the Paleolithic Era is what formed our species. Evolution is a slow process. Our species had a leisurely 2-3 million years to adapt to our environmental niche. The invention of agriculture, only 10-15,000 years ago, was a very sudden and dramatic shift in diet and environment for many human cultures. Foods like cereal grains (wheat, rice, barley), legumes (beans, peanuts) and dairy not only appeared, but became dietary staples, when earlier they would have been rare to nonexistent. Genetically, we are still the same species we were 100,000-500,000 years ago, but we no longer live the way we used to. It should not be surprising to see problems emerge from this upheaval: we have not had as much time to adapt.\n\n\n&gt;**Q: Didn't Paleolithic man only live to be 25 years old?**\n\n&gt;A: Probably not. Measurements of paleolithic life expectancies are obviously tough to nail down. A major cause of death among modern hunter-gatherer groups is interpersonal violence; however, the social factors which cause this high rate of violence (many of which are the result of these tribal people being disrupted and displaced by civilization) do not have much to do with what we consider \"health.\"\n\n&gt;Hunter-gatherers remain relatively free of chronic, degenerative diseases compared to their farming counterparts. It is not uncommon to see people over 70 years of age in such cultures.\n\n&gt;Infectious disease is also a factor, but less so among hunter-gatherers than among farmers and herders who have higher population densities and close contact with domesticated animals. Since many urbanites now have easy access to antibiotics and other modern medicines, we can combine the technological advantages of civilization with the healthier diets and lifestyles of foragers. For more, see the article in the Appendix, [Longevity among hunter-gatherers: a cross-cultural examination (PDF)](http://www.anth.ucsb.edu/faculty/gurven/papers/pdrdraft04182006.pdf)\n\nAs a note, if your caloric intake is lower then what your body is putting out then it doesn't matter how big portions are. I could eat a pound each of broccoli, spinach greens, a steak, and cheese sprinkled on it and have a lower caloric intake then output. That's 3 pounds of food, enough even for me.  Even when I could eat, I shit you not, a whole large works pizza by myself. Which if course was washed down by a 2 liter of pepsi.\n\n16oz Broccoli - 126cal      \n16oz Spinach - 104cal        \n16oz Steak    - 720cal      \n2oz Cheddar - 220cal      \n-=-=-=-=-=-=-=-=-=-     \nTotal               1170cal\n\n\n\n\n16\" [Papa John's Pizza](http://www.myfitnesspal.com/food/calories/papa-johns-pizza-the-works-16-inch-1462748) - 4200cal     \n2 liter Pepsi  - 800cal      \n-=-=-=-=-=-=-=-=-=-     \nTotal      5000\n\nDue to the calories involved (mostly carbs), there is no way you can eat the same weight in food and still lose weight. Portion control is a less direct way of controlling calories. Except for some people, portion control doesn't work without making the person miserable. So it's a good idea to make sure people know another way to lose is to know how many calories your body uses at rest, and eat as much as you want below that, by calories, not volume.\n\n*edited for clarity, spelling, and your pleasure*", "gilded": 0, "created_utc": "1325504336", "subreddit": "Fitness", "score": 1, "controversiality": 0}
{"body": "&gt;Wtf to his prices...\n\nTree fiddy for 2 magnets?!! I'm outta here!", "gilded": 0, "created_utc": "1325506471", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "In other news, biologists today announced the result of a 12-year-long investigative programme and confirmed to the world at large that dragons, gryffins, unicorns and vermicious knids are \"overwhelmingly unlikely\" to exist. \n\nSpeaking to news reporters outside the World Biology Taskforce headquarters in Geneva, Hans Findesnicht said the announcement was sure to bring despair to cryptozoologists all over the world but that it was \"time to face facts\" and define horned horses, eagle-headed flying lions, giant fire-breathing reptiles and Roald Dahl's beloved knids as \"speculation\".\n\nThe team also announced that it will release the preliminary findings of its investigation into the genome of the Loch Ness monster, sasquatch and the Ice Man of the Mountains next month. \n\nThey warned that its results are also likely to disappoint those who have no real ability for logic.", "gilded": 0, "created_utc": "1325511976", "subreddit": "space", "score": 3, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1325515178", "subreddit": "atheism", "score": 172, "controversiality": 0}
{"body": "thats loch ness monster ", "gilded": 0, "created_utc": "1325515349", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "Just curious, but how did you prove it? I would think that someone who believes they exist would need damn conclusive evidence, and that shit can be hard to produce. I mean look at Nessie or Bigfoot.", "gilded": 0, "created_utc": "1325515420", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Now don't go given him no tree fiddy", "gilded": 0, "created_utc": "1325516314", "subreddit": "atheism", "score": 98, "controversiality": 0}
{"body": "Can I borrow about tree fiddy?", "gilded": 0, "created_utc": "1325516898", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "God damn Loch Ness Monster!", "gilded": 0, "created_utc": "1325519387", "subreddit": "pokemon", "score": 6, "controversiality": 0}
{"body": "And then I realized that hobo was the loch ness monster! ", "gilded": 0, "created_utc": "1325520224", "subreddit": "atheism", "score": 6, "controversiality": 0}
{"body": "N.T. Wright's lectures are often good for a laugh. This one did not disappoint.\n\nThere is no evidence for the resurrection any more than there is evidence for the Loch Ness Monster, bigfoot, or alien abductions. All we have are peoples' words. Are you really going to throw out your brain and believe in magic, just because some ancient, superstitious homeless men say it's so?", "gilded": 0, "created_utc": "1325520241", "subreddit": "Christianity", "score": -2, "controversiality": 0}
{"body": "And it was about that time that he asked me for about tree fiddy.", "gilded": 0, "created_utc": "1325521172", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "That god-damn Loch Ness monster!\n\nFTFY but I hate myself for joining in :(", "gilded": 0, "created_utc": "1325521306", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Now, it was about that time that I realized that the girl scout was actually a 3 story tall monster from the Paleolithic era.  ", "gilded": 0, "created_utc": "1325523165", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "So we can stop making \"I need bout tree fiddy\" jokes?", "gilded": 0, "created_utc": "1325528397", "subreddit": "technology", "score": 3, "controversiality": 0}
{"body": "\nIt was about this time I realized that the girl scout was 4 stories tall and was a crustacean from the paleolithic era.\n", "gilded": 0, "created_utc": "1325528893", "subreddit": "atheism", "score": 34, "controversiality": 0}
{"body": "tree fitty\n\nhttp://memegenerator.net/cache/instances/400x/11/11354/11627287.jpg", "gilded": 0, "created_utc": "1325529474", "subreddit": "technology", "score": -38, "controversiality": 0}
{"body": "It's the same concept as something like 'Is there a Loch Ness Monster?'\n\nAfter tons of searching for a monster there's nothing proving that it does, but until you drain the lake and search the entire place it's always a possibility. So it's pretty darn difficult to prove that some elusive organism doesn't exist until you've really exhausted all of its hiding places, a la some potential bacteria on mars that only lives in deep caves. Searching every cave on Mars would take some time.", "gilded": 0, "created_utc": "1325532811", "subreddit": "space", "score": 6, "controversiality": 0}
{"body": "'bout tree fiddy", "gilded": 0, "created_utc": "1325533645", "subreddit": "budgetfood", "score": 7, "controversiality": 0}
{"body": "The loch ness monster doesn't exist.\n\nThere I solved your problem.", "gilded": 0, "created_utc": "1325538039", "subreddit": "space", "score": -1, "controversiality": 0}
{"body": "TF2 is frustrating because of the whole balanced weapons deal. \"NEW WEAPON? NI- oh, it sucks.\"\n\nLike, Nessie's 9 iron is by far the worst weapon ever created. Nobody in their right mind would ever use that POS...but all for the sake of balance I guess.", "gilded": 0, "created_utc": "1325540840", "subreddit": "truegaming", "score": 1, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1325542980", "subreddit": "rutgers", "score": 4, "controversiality": 0}
{"body": "DAYAM, I got .edu linked!\n\nYou're missing the greater point:\n\n&gt;My personal experience is evidence for me.\n\nIn context, this sentence relegates the term \"evidence\" to the same level as UFOs, Bigfoot, and the Loch Ness Monster. You are having experiences which can be dismissed with nothing more than the acknowledgement of appeals from ignorance and other hasty generalizations.\n\nThe human brain does not record reality, it models it; it interprets it as best it can. It turns out that our perceptions and intuitions are not very reliable.", "gilded": 0, "created_utc": "1325550697", "subreddit": "DebateReligion", "score": 1, "controversiality": 0}
{"body": "Damn you loch ness monster!", "gilded": 0, "created_utc": "1325554359", "subreddit": "discgolf", "score": 4, "controversiality": 0}
{"body": "I need about tree fiddy- Nessy", "gilded": 0, "created_utc": "1325563524", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Hey you seem cool so I need to ask you an important favor?\n\nI need about tree fiddy.", "gilded": 0, "created_utc": "1325564753", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "GODDAMMIT NESSIE", "gilded": 0, "created_utc": "1325565917", "subreddit": "gaming", "score": 4, "controversiality": 0}
{"body": "Looks like the Loch Ness monster pooping out an old fashion telephone.", "gilded": 0, "created_utc": "1325567046", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "[Still think my is legit.](http://animals.m-y-d-s.com/uma/nessie/b.gif). Considering the top of that gem.", "gilded": 0, "created_utc": "1325572820", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "What I derived from this meme:\n\nJimmy Wales = Loch Ness Monster", "gilded": 0, "created_utc": "1325573226", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1325575001", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "you'll save about tree fiddy", "gilded": 0, "created_utc": "1325575392", "subreddit": "gaming", "score": 10, "controversiality": 0}
{"body": "What the fuck are you? the loch ness monster?", "gilded": 0, "created_utc": "1325576097", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I see no reason why god should be considered any more probable than a teapot orbiting about the sun or faeries or the loch ness monster. Therefore, I \"know\" there is no god just as much as I know those other fictional creations of humanity's imagination do not exist.\n\nAt a certain point, agnosticism has to be seen as irrational in some cases as gnosticism would be in others.", "gilded": 0, "created_utc": "1325585341", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "I was looking for the Loch Ness monster or something...", "gilded": 0, "created_utc": "1325595882", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "In a way, I love these sorts of shows. Not cause I believe it, but because it inevitably manages to completely disprove the thing they're looking for but then go back to page one and say \"he could still be out there\". \n\nA very good one was in search of the Loch Ness Monster. Dunno if that got shown abroad, but I think I have probably seen all the photos that there are to see xD Usually seagulls or sticks floating in the water. Or a fish leaping at just the right moment.", "gilded": 0, "created_utc": "1325596283", "subreddit": "DoesAnybodyElse", "score": 3, "controversiality": 0}
{"body": "Tree Fitty", "gilded": 0, "created_utc": "1325614283", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1325616438", "subreddit": "guns", "score": 1, "controversiality": 0}
{"body": "I actually agreed with Marshall in the episode. I don't necessarily believe in God, but I don't necessarily not believe in God either. The thing is that I've spent so many years suspending disbelief in order to enjoy books, TV shows and movies about magic and supernatural creatures that part of me sort of believes all that stuff is real.\n\nLike if I had to grade how certain I was that stuff existed or that something was true, it would go something like this:\n\n* The Moon Landing/Evolution - &gt; 99%\n* Aliens - 95%\n* D.B. Cooper got away with all or most that money - 80%\n* There really are places like Eureka/Warehouse 13 - 75%\n* Love - 70%\n* Bigfoot - 60%\n* Aliens that have visited Earth - 50%\n* Wizards/Witches (real ones, not Wiccan douchebags) - 45%\n* Ghosts - 40%\n* Werewolves - 35%\n* Aliens that visited Earth thousands of years ago and were mistaken for gods by primitive humans - 30%\n* Loch Ness Monster - 25%\n* Vampires - 20%\n* Some kind of being or energy that got everything started but hasn't necessarily done much since - 15%\n* Greek, Norse and Egyptian gods (most likely aliens) -10%\n* Angels, Demons and a war in Heaven (also most likely aliens) - 5%\n* The Judeo-Christian-Islamic God - &lt; 1%\n\nThe list is by no means exhaustive, and all of this is subject to change based on what books I've read lately or what movies or TV shows I've been watching. I recently discovered \"Lost Girl\" and spent a week catching up on it, so at the time, I was about 65% sure the Fae are real. But now that the show is on a break, it's back down in the Vampire/Werewolf range.", "gilded": 0, "created_utc": "1325619649", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1325620514", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "tree fiddy?", "gilded": 0, "created_utc": "1325621241", "subreddit": "science", "score": 4, "controversiality": 0}
{"body": "GOD DAMMIT LOCH NESS TIDE MONSTER I AIN'T GIVING YOU TREE FIDDYμm", "gilded": 0, "created_utc": "1325623427", "subreddit": "science", "score": -3, "controversiality": 0}
{"body": "bout tree fiddy seconds", "gilded": 0, "created_utc": "1325625191", "subreddit": "iphone", "score": 8, "controversiality": 0}
{"body": "looks like the god dammed loch ness monster to me. ", "gilded": 0, "created_utc": "1325625802", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "about tree fitty", "gilded": 0, "created_utc": "1325627440", "subreddit": "leagueoflegends", "score": 2, "controversiality": 0}
{"body": "About tree fiddy?", "gilded": 0, "created_utc": "1325628628", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Loch Ness Monster - $1.50 = Snoop Dogg", "gilded": 0, "created_utc": "1325629612", "subreddit": "videos", "score": 39, "controversiality": 0}
{"body": "Sure that's what they're doing. We all know this is just an elaborate setup to find the loch ness monster.", "gilded": 0, "created_utc": "1325629806", "subreddit": "science", "score": 5, "controversiality": 0}
{"body": "Cool story, bro. I need ha bout tree fitty. ", "gilded": 0, "created_utc": "1325632504", "subreddit": "CFB", "score": 1, "controversiality": 0}
{"body": "nah. its about...\n\ntree fiddy", "gilded": 0, "created_utc": "1325636800", "subreddit": "videos", "score": 7, "controversiality": 0}
{"body": "NO, HE RENTS IT OUT TO US FOR TREE FIDDY AN HOUR", "gilded": 0, "created_utc": "1325637166", "subreddit": "sex", "score": 13, "controversiality": 0}
{"body": "GOD DAMN LOCH NESS MONSTER!", "gilded": 0, "created_utc": "1325637513", "subreddit": "sex", "score": 7, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1325648805", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "They needed a dance break featuring the Pop-and-Loch Ness Monster.", "gilded": 0, "created_utc": "1325649965", "subreddit": "Music", "score": 2, "controversiality": 0}
{"body": "&gt;Just because God knows the outcome of every situation does not necessitate that He caused it or that we don't have free will of the outcome.\n\nYet if he is omniscient he would know right? Which means he created a person knowing full well that they would eventually be condemned. Which means he created a person that he knew would go to hell. I'm sorry, but the problem still stands.\n\nIgnoring for a moment the huge problem of how exactly C.S. Lewis knew what he said about God was true, does he not claim here that God is not in fact omniscient?\n\n&gt;If there was a way for God to convince people to believe in Him, He would.\n\nHe is the creator of all and allegedly omnipotent. If there is no way for him to convince all of us that means he is not omnipotent (can God create a rock that he himself cannot lift?). Do you see the paradox here?\n\nWhy don't you think there is good reason to show that God exists? Do you mean that you do not think it is necessary to prove his existence? Do you believe anything else exists (bigfoot, the loch ness monster, aliens, reptiles in the white house) without evidence? I'm sorry if this seems argumentative, but I cannot see any way you can claim something exists without evidence for it. To quote a phrase that has made its rounds several times on Reddit these past few weeks:\n\n&gt;That which can be asserted without evidence, can be dismissed without evidence.\n-Christopher Hitchens\n\nFinally your three main reasons for believing in God. They are all arguments I've heard before and that I simply disagree with for a number of reasons. I think you should look up Iron Chariots Wiki. I'll be happy to discuss them with you, but some of your points may be argued well (or better) there:\n\n[Argument from Design](http://wiki.ironchariots.org/index.php?title=Argument_from_design) \n\n[Argument from First Cause](http://wiki.ironchariots.org/index.php?title=First_cause_argument)\n\n[Argument from Desire](http://wiki.ironchariots.org/index.php?title=Argument_from_desire)", "gilded": 0, "created_utc": "1325659839", "subreddit": "DebateAChristian", "score": 1, "controversiality": 0}
{"body": "I'd say mo' 'round tree fiddy. ", "gilded": 0, "created_utc": "1325662659", "subreddit": "videos", "score": 2, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1325672207", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "&gt;she asks for tree fiddy\n", "gilded": 0, "created_utc": "1325679136", "subreddit": "4chan", "score": 5, "controversiality": 0}
{"body": "I was honestly waiting for the: \"And then I looked up and saw that she was a giant crustacean from the paleolithic era\"", "gilded": 0, "created_utc": "1325680906", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy!", "gilded": 0, "created_utc": "1325686222", "subreddit": "funny", "score": 14, "controversiality": 0}
{"body": "tree fiddy.", "gilded": 0, "created_utc": "1325696862", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Either way, it's hellabetter than before, since the robes don't do jack. Took me 2 characters and over Tree Fiddy hours to figure this out. :D", "gilded": 0, "created_utc": "1325697958", "subreddit": "skyrim", "score": 2, "controversiality": 0}
{"body": "'bout tree fiddy.", "gilded": 0, "created_utc": "1325700397", "subreddit": "IAmA", "score": 29, "controversiality": 0}
{"body": "More than tree fiddy. ", "gilded": 0, "created_utc": "1325702838", "subreddit": "Fitness", "score": 4, "controversiality": 0}
{"body": "I'm convinced and this is why: Everything about the idea of God is ridiculous and leads only to inconsistencies or paradoxes. On top of that there isn't a single shred of evidence of his existence stronger than that for the loch ness monster or leprechauns - which is rather bizarre given all the claims of his interaction with humans (and interestingly enough there is *always* a more plausible explanation for miracles).", "gilded": 0, "created_utc": "1325703617", "subreddit": "DebateAnAtheist", "score": 1, "controversiality": 0}
{"body": "Aight i'll buy it, hopefully i get enough mana by whenever that is, i only have 25mil right now. \nadd me on steam; Wheresnessie", "gilded": 0, "created_utc": "1325710949", "subreddit": "dungeondefenders", "score": 1, "controversiality": 0}
{"body": "Good lord it's the loch ness monster!!", "gilded": 0, "created_utc": "1325712477", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "I'm still after Nessie!! So, bottom.", "gilded": 0, "created_utc": "1325714002", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "You accidentally word or a letter there.  Either way, I'd like to think that something (the what?) took your stapler.  It's probably the god damned Loch Ness Monster holding it hostage for $3.50.", "gilded": 0, "created_utc": "1325717835", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "No Mr. Loch Ness Monster I won't give you no tree pitty.", "gilded": 0, "created_utc": "1325718380", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "GOD DAMN YOU LOCH NESS MONSTER!", "gilded": 0, "created_utc": "1325723329", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "I see the lochness monster.  If you want me to tell you where in the photograph its going to cost ya about tree fitty.", "gilded": 0, "created_utc": "1325727812", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1325737930", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Poor motherfucker should have realized that the bill came to about tree fiddy.", "gilded": 0, "created_utc": "1325739273", "subreddit": "4chan", "score": 3, "controversiality": 0}
{"body": "Tree fiddy. Wait a minute..", "gilded": 0, "created_utc": "1325740069", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Nessie, you were on the right track yesterday...but now? Not so much. I think you should re-work your wording :)", "gilded": 0, "created_utc": "1325742624", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I'm a merry believer in the nonexistence of Unicorns, the invisible sun orbiting the moon, pixies, bigfoot, loch ness monster, and God.\n\nI also have a lot of hobbies: not collecting stamps. Not making amateur rockets, not making ships in a bottle, and not swimming around Windemere in the winter.\n\nI could mention more, but time is brief, and I have to arrange time for my non-jobs, non-modes of transportation, and the non-sports I do. ", "gilded": 0, "created_utc": "1325746360", "subreddit": "DebateAChristian", "score": 1, "controversiality": 0}
{"body": "I'd just ask for about tree fiddy", "gilded": 0, "created_utc": "1325749144", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Unless you're friends with a giant crustacean from the Paleolithic Era in which case it's about tree fiddy.", "gilded": 0, "created_utc": "1325776434", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "I'll give you tree fiddy.", "gilded": 0, "created_utc": "1325776492", "subreddit": "startrek", "score": 4, "controversiality": 0}
{"body": "Damn you Loch Ness Monster!", "gilded": 0, "created_utc": "1325779833", "subreddit": "startrek", "score": 5, "controversiality": 0}
{"body": "I'll give you bout, *tree fiddy*", "gilded": 0, "created_utc": "1325799896", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "My lookat the coat on that one! I'll give ya tree fitty for it, no more, no less.", "gilded": 0, "created_utc": "1325803151", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1325820329", "subreddit": "nsfw", "score": 5, "controversiality": 0}
{"body": "LAPRAS! PLEASE LAPRAS! My friend has a bong named 'Nessie' Lapras is an awesome poke'mon. Whoop whoop, we've got a badass over here. God, can anyone else hear my fingers. After seeing that post about a dude named screaminghand, it's making me think my hand is yelling at me. Snorlax is cool I guess, kinda lazy though. I ate some fudge today. No I didn't. that was yesterday. trofl. My dog is so freaking cute. yes. TRY TO GUESS MY HIGH LEVEL! and explain why I'm at that level. Or don't, do what you want. Out.", "gilded": 0, "created_utc": "1325822903", "subreddit": "trees", "score": 4, "controversiality": 0}
{"body": "God Damnit, Loch Ness Monster, I thought I told you to leave my family alone!", "gilded": 0, "created_utc": "1325823171", "subreddit": "AskReddit", "score": 244, "controversiality": 0}
{"body": "You sir are a loch ness monster and a scholar", "gilded": 0, "created_utc": "1325826821", "subreddit": "AskReddit", "score": 9, "controversiality": 0}
{"body": "GODDAMN LOCH NESS MONSTER TRYING TO TAKE HIS TREE FITTY!", "gilded": 0, "created_utc": "1325826890", "subreddit": "fffffffuuuuuuuuuuuu", "score": 31, "controversiality": 0}
{"body": "I ain't givin you no goddamn tree fiddy.", "gilded": 0, "created_utc": "1325829123", "subreddit": "AskReddit", "score": 24, "controversiality": 0}
{"body": "Damn, not even one vote for Nessie! ", "gilded": 0, "created_utc": "1325831659", "subreddit": "trees", "score": 0, "controversiality": 0}
{"body": "fuck those crustaceans from the paleolithic eras\n", "gilded": 0, "created_utc": "1325831897", "subreddit": "bestof", "score": 3, "controversiality": 0}
{"body": "Okay, this will probably be lost in the mass of comments, but what bothers me when I read all these comments (and a trend I see in the US as a whole) is not the fact that you would drug test people for welfare, that it would be necessary, or even that people are for or against it. No, what I have a problem is can be summed up in the question I hear asked the most:\n\n&gt;\"What costs me the most money? Lets not do that.\"\n\nThis makes me rather sick to my stomach. I'm not sure what the average tax rate for the average citizen in the US is, but it seems you have this extreme aversion to taxes, as if taxes are necessarily a bad thing.\n\nBeing young and earning little (when I work, studying right now), I only pay about 30-35% in taxes here. I have colleagues who are older and earn more who pay about 45-55% of their income in taxes.\n\nWhat I hear, when I hear the quoted question asked, is \"I'm okay with people suffering if it means I get more money\". Basically, profiteering from other peoples' misery. \n\nIt's your country, your citizens and your infrastructure. People who are poor, unhealthy and engaging in criminal activity costs a whole bunch. Add to this the humanitarian factor of it all; why should people, your OWN people, suffer when you have the ability to help them by paying a little more in taxes? People who might then get an education, get a job, pay THEIR money in taxes and contribute to a strong, healthy USA. \n\nI'm not sure if this is because of the corporate view of capitalism that exists in the US, and I'm not saying socialism is the answer to everything and anything either. Naturally, a man should benefit from working (which is why I have respect for a decision to drug test people applying for welfare, provided they get care and rehabilitation if they don't pass). \n\nBut these are your people, just as much as your friends and family are. They are your friends, your neighbours, your colleagues and loved ones. To the greatest extent, THEY are YOU... just so happens they were born into a different family than you were. So lift them up, and in turn, they too, will lift you up. High and on high, to a glorious USA that is strong and great once again... instead of pissing on them, for another tree fiddy.", "gilded": 0, "created_utc": "1325833020", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Beh. Nessie's not as cool. and I feel that the color scheme was more Lapras anyways :3", "gilded": 0, "created_utc": "1325833519", "subreddit": "trees", "score": 0, "controversiality": 0}
{"body": "You seem to want to have it both ways, either 1. we claim belief of something's nonexistence, and must defend this with all the rigor of stating our belief in something's *existence* or 2. we state our disbelief in something, but are not allowed to comment further. \n\nI do know something about \"the issue.\" I know there is no evidence in support of it and I know we've looked. \n\nThe problem with nonphysical suppositions like God, the Soul, and the Mind is there is always somewhere for them to hide from empirical exposition. God cannot be \"disproven\" because any lack of evidence or evidence against could simply be a barrier beyond which God lurks. \n\nEven if we discovered the most fundamental mathematical proof for the origin of the universe beyond which no further study is required to explain everything, a theist could still argue, \"God set it up like that, he \nexists beyond your proof.\" Which effectively renders all debate pointless. \n\n&gt;  you are not convinced that there exist souls but neither are you convinced that there do not, you simply don't know and don't believe in (aren't convinced by) either case.\n\nThis is exactly what atheism *isn't*. The atheist point of view is that, sure maybe he does exist, but there certainly is no evidence to support that hypothesis and therefore no more reason to believe it than any other absurd suggestion. \n\nYou are attempting to characterize the atheist almost as an apathist. That he doesn't know and he is somehow neutral on the topic. \n\nAtheists are not neutral. Just because it isn't possible to prove God does not exist does not mean that we're simply \"unconvinced\" by either case. We regard the existence of God as vanishingly unlikely. The same follows with the non-physical mind, and the soul. \n\nWe've looked and looked for evidence of these things, and not only have we never found any, but we've also steadily shrunk the blank spaces on the map where such things might hide. But still, the blank spaces are like a hyperbola to zero, never completely disappearing.  \n\nIts like a search for the Loch Ness Monster. Lets say you search and search, using sonar and divers and nets, and you never find anything. A Nessie-believer tells you you just haven't looked hard enough. So you drain the lake, leaving no space for it to hide. The believer then tells you \"Nessie is invisible.\" \n\nNow, have you \"disproven\" the Loch Ness Monster? No. But you're certainly more than \"unconvinced\" by the validity of the believers argument. \n\nedit- I'll be in the air for the next 30 hours, but we can pick up the debate then if you still want to. ", "gilded": 0, "created_utc": "1325835410", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "lol @ \"I don't know why, I love african american movies\"\n\nI've never seen Tales in the Hood but I'm sure it's worth 2.50 or even tree fitty. ", "gilded": 0, "created_utc": "1325835430", "subreddit": "dvdcollection", "score": 2, "controversiality": 0}
{"body": "I rather like Nessie, but the masses are not agreeing with me! Sick piece though, how does it smoke? Is this from the Freaky's in Boulder?", "gilded": 0, "created_utc": "1325845057", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "Sounds like that goddamned Loch Ness monster to me.", "gilded": 0, "created_utc": "1325847389", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "About tree fitty.", "gilded": 0, "created_utc": "1325849171", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "tree fiddy km^2", "gilded": 0, "created_utc": "1325849288", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Do you believe in UFOs, astral projections, mental telepathy, ESP, clairvoyance, spirit photography, telekinetic movement, full trance mediums, the Loch Ness monster and the theory of Atlantis? ", "gilded": 0, "created_utc": "1325851142", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I just need about tree fiddy", "gilded": 0, "created_utc": "1325860910", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Apparently somewhere where girl scouts are actually the loch ness monster", "gilded": 0, "created_utc": "1325861070", "subreddit": "fffffffuuuuuuuuuuuu", "score": 2, "controversiality": 0}
{"body": "It's gon' be about tree fiddy.", "gilded": 0, "created_utc": "1325861334", "subreddit": "pics", "score": 93, "controversiality": 0}
{"body": "One winter, my female roommate left a gas can (full of gas) in our living room because she thought it would freeze of we left it outside.\n\nShe was on the Deans List all 4 years of her college career.\n\nAlso, she had never heard of the loch Ness monster.", "gilded": 0, "created_utc": "1325861885", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "I'll take the Tomislav, Diamondback, and Nessie's Nine Iron. I'll add you later in the day.", "gilded": 0, "created_utc": "1325862750", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "Damnit, Loch Ness Monster! You know I ain't givin you no tree fiddy!", "gilded": 0, "created_utc": "1325863268", "subreddit": "pics", "score": 43, "controversiality": 0}
{"body": "Oh and can you also toss in Nessie's Nine Iron for a Scrap?", "gilded": 0, "created_utc": "1325865052", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1325865725", "subreddit": "leagueoflegends", "score": 1, "controversiality": 0}
{"body": "I have 1 Earbuds and lots of vintage items, please take a look at my backpack: http://steamcommunity.com/id/snkmad/inventory/\nAlso 4 refined, valve cupons, and lots of normal items.\n\n\n**Rare Promos**\n\n* Earbuds\n\n\n**Genuine Hats**\n\n* Genuine Companion Cube Pin\n* Genuine Pip-Boy\n\n\n**Vintage Hats**\n\n* Vintage Backbiter's Billycock\n* Vintage Bloke's Bucket Hat\n* Vintage Camera Beard x 2\n\n\n**Normal Hats**\n\n* Ghastlierest Gibus\n\n\n**Promo Hats**\n\n* Alien Swarm Parasite\n* Ellis' Cap\n\n\n**Vintage Weapons**\n\n* Vintage Ambassador\n* Vintage Axtinguisher x 2\n* Vintage Backburner x 2\n* Vintage Blutsauger x 2\n* Vintage Bonk! Atomic Punch\n* Vintage Buff Banner\n* Vintage Chargin' Targe\n* Vintage Cloak and Dagger\n* Vintage Crit-a-Cola\n* Vintage Dalokohs Bar\n* Vintage Dead Ringer x 3\n* Vintage Direct Hit\n* Vintage Equalizer x 3\n* Vintage Eyelander\n* Vintage Flare Gun\n* Vintage Force-A-Nature x 2\n* Vintage Frontier Justice x 2\n* Vintage Gunboats\n* Vintage Gunslinger\n* Vintage Homewrecker\n* Vintage Huntsman\n* Vintage Jarate x 3\n* Vintage Killing Gloves of Boxing x 3\n* Vintage Kritzkrieg\n* Vintage Natascha x 2\n* Vintage Pain Train\n* Vintage Razorback\n* Vintage Sandman\n* Vintage Sandvich x 3\n* Vintage Scotsman's Skullcutter\n* Vintage Scottish Resistance\n* Vintage Southern Hospitality\n* Vintage Ubersaw\n* Vintage Wrangler x 4\n\n\n**Normal Weapons**\n\n* Ali Baba's Wee Booties\n* Ambassador\n* Amputator x 5\n* Atomizer\n* Back Scratcher\n* Battalion's Backup x 2\n* Big Earner x 3\n* Black Box x 3\n* Blutsauger\n* Bonk! Atomic Punch x 2\n* Boston Basher x 2\n* Brass Beast x 3\n* Buff Banner x 2\n* Buffalo Steak Sandvich x 2\n* Bushwacka x 4\n* Candy Cane x 3\n* Chargin' Targe x 5\n* Cloak and Dagger\n* Cow Mangler 5000 x 2\n* Crusader's Crossbow\n* Dalokohs Bar\n* Dead Ringer\n* Detonator x 2\n* Direct Hit x 2\n* Enforcer\n* Equalizer x 5\n* Eviction Notice x 2\n* Eyelander x 3\n* Family Business\n* Fan O'War\n* Flare Gun\n* Frontier Justice x 3\n* Frying Pan\n* Gloves of Running Urgently\n* Gunboats\n* Gunslinger\n* Homewrecker x 2\n* Jag x 2\n* Jarate x 4\n* Kritzkrieg\n* L'Etranger x 2\n* Liberty Launcher\n* Mad Milk\n* Mantreads\n* Market Gardener x 3\n* Nessie's Nine Iron\n* Persian Persuader x 2\n* Postal Pummeler\n* Razorback x 2\n* Righteous Bison x 2\n* Sandvich\n* Scotsman's Skullcutter x 4\n* Scottish Resistance x 2\n* Shahanshah x 2\n* Slot Token - PDA2\n* Soda Popper\n* Southern Hospitality\n* Sydney Sleeper x 2\n* Tomislav\n* Tribalman's Shiv x 2\n* Ubersaw\n* Ullapool Caber\n* Vita-Saw x 3\n* Winger\n* Wrangler x 2\n* Your Eternal Reward\n\n\n**Tools**\n\n* Class Token - Engineer\n* Class Token - Medic\n* Dueling Mini-Game\n\n\n**Crates**\n\n* Series 1 Crate x 3\n* Series 3 Crate\n* Series 7 Crate\n* Series 8 Crate\n* Series 9 Crate\n* Series 20 Crate\n* Series 21 Crate x 2\n* Series 24 Crate x 4\n* Series 25 Crate\n* Series 26 Crate\n* Series 27 Crate x 4\n* Series 28 Crate x 4\n\n\n**Metal**\n\n* Refined Metal x 4\n\n\nList generated at [TF2Toolbox.com](http://tf2toolbox.com/bptext) with help from [JonDum](http://www.reddit.com/r/tf2trade/comments/k2zru/tool_tf2toolboxcom_bbcode_converter/) at Reddit.\n\nSteam Community URL: http://steamcommunity.com/id/snkmad\n\nTF2Items: http://tf2items.com/id/snkmad\n", "gilded": 0, "created_utc": "1325866715", "subreddit": "SteamGameSwap", "score": 1, "controversiality": 0}
{"body": "tree fitty", "gilded": 0, "created_utc": "1325868327", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "FUCK YOU LOCH NESS MONSTER!", "gilded": 0, "created_utc": "1325869718", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "&gt;god damn loch ness monster tricked me again", "gilded": 0, "created_utc": "1325872926", "subreddit": "4chan", "score": 3, "controversiality": 0}
{"body": "Pretty sure that's the Loch Ness Monster...", "gilded": 0, "created_utc": "1325873149", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "Xbox tree fitty.", "gilded": 0, "created_utc": "1325875816", "subreddit": "gamernews", "score": 14, "controversiality": 0}
{"body": "Just give it tree fitty.", "gilded": 0, "created_utc": "1325877052", "subreddit": "gamernews", "score": 3, "controversiality": 0}
{"body": "You may not \n\n&gt;associate \"creationists\" with idiots who honestly believe Satan put dinosaur bones on the earth to deceive people\n\nbut I don't see how what creationists think is any better or worse than the idea that Satan put dinosaur bones on Earth to trick people.  To me, that's like saying that believing in the Chupacabra is somehow more ridiculous than believing in the Loch Ness Monster.  ", "gilded": 0, "created_utc": "1325881804", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "And he needs about tree fiddy\n\nhttp://www.google.ca/url?sa=t&amp;source=web&amp;cd=1&amp;ved=0CCYQtwIwAA&amp;url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D9cn7xfBpZ3M&amp;ei=llwHT6HpDujf0QGDwdirAg&amp;usg=AFQjCNH88Xgcnsifq1tWx5lDTN4e1iS-RQ", "gilded": 0, "created_utc": "1325882543", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "about tree fiddy and a big mac. you offering?", "gilded": 0, "created_utc": "1325886381", "subreddit": "ronpaul", "score": 3, "controversiality": 0}
{"body": "This happens to me to when I submitted a picture of the loch ness monsters head above water and it got like 15 upvotes and then 3 days later someone submits the same thing and it gets to the front page....", "gilded": 0, "created_utc": "1325890368", "subreddit": "TrollXChromosomes", "score": 2, "controversiality": 0}
{"body": "You can buy mine for tree fiddy", "gilded": 0, "created_utc": "1325890490", "subreddit": "battlefield3", "score": 1, "controversiality": 0}
{"body": "The Dalai Lama is not considered a deity.  Neither, in fact, is the Buddha.  The only thing that gets you into the 'atheist club' is that you deny the existence of a deity either gnostic or agnotically.  Buddhists don't believe in any form of god.  Logic and scientific backing may be what prompted you to this decision, but it has nothing to do with atheism at all.  It's more than possible to be atheist and believe in aliens, ghosts, the loch ness monster, yetis, or anything else that doesn't have scientific backing.  ", "gilded": 0, "created_utc": "1325891784", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "First thing that popped into my head was lochness monster related, maybe nessie. I tend to agree with Sav23 though, the right name will come to you, I've always found it to be more of an organic process.", "gilded": 0, "created_utc": "1325894033", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "He asked me for tree fiddy!", "gilded": 0, "created_utc": "1325899025", "subreddit": "AdviceAnimals", "score": 1, "controversiality": 0}
{"body": "The father did show up three years later wanting three fiddy. Thats when I noticed he was actually a crustacean from the paleolithic era. ", "gilded": 0, "created_utc": "1325903773", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Having any sort of belief that is irreconcilable with the basic scientific precept of reservation of judgement and still claiming that you love science makes you a hypocrite.\n\nOr, to put it another way, you can believe in bigfoot, dragons, the Loch Ness monster, and leprechauns, and still be able to perform an experiment to find answers, but that doesn't save you from being wrong about anything else.\n\nYou can only be consistently right when you consistently yield to the truth.", "gilded": 0, "created_utc": "1325917982", "subreddit": "AdviceAnimals", "score": -1, "controversiality": 0}
{"body": "Goddamn Loch Ness Monster!", "gilded": 0, "created_utc": "1325919064", "subreddit": "technology", "score": 2, "controversiality": 0}
{"body": "People say fo fiddy, really? It's tree fiddy!", "gilded": 0, "created_utc": "1325921897", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1325927631", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "'bout tree fitty.", "gilded": 0, "created_utc": "1325927996", "subreddit": "cats", "score": 8, "controversiality": 0}
{"body": "or the conversation could have done something like this:\n\ntree: *dials a number*\n\n*someone picks up*\n\nreceiver: tree? is that you?\n\ntree: hello. yes, this is tree.\n\nreceiver: good. now listen up because i'm only going to say this once...\n\ntree: go on.\n\nreceiver: i need about tree fiddy.", "gilded": 0, "created_utc": "1325953057", "subreddit": "funny", "score": 52, "controversiality": 0}
{"body": "For the times when you need about tree fiddy", "gilded": 0, "created_utc": "1325954146", "subreddit": "atheism", "score": 28, "controversiality": 0}
{"body": "what about tree fiddy?", "gilded": 0, "created_utc": "1325958365", "subreddit": "funny", "score": -1, "controversiality": 0}
{"body": "\"To continue your call you must please insert about tree fiddy\"\n\n\"Ah shit... GUYS, GET IN HERE\"", "gilded": 0, "created_utc": "1325958552", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "i didn't see that \"tree fiddy\" coming.\nthank you", "gilded": 0, "created_utc": "1325959639", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "There was this chick at my highschool who always talked about seeing fairys and leprachauns, the loch ness monster, dragons - you get the picture. I don't know if she had some kind of schizophrenia or just a lying disorder but she was batty as hell. She thought she was half fairy (and a witch) and told people about dreaming they had impregnated her(often). Also one time she sat at my lunch table and she ate a mixture of meat sauce, ranch , melted Popsicle , lettuce and chocolate milk off of everyones trays afterwards.", "gilded": 0, "created_utc": "1325960928", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "What's wrong with believing in the Loch Ness Monster?", "gilded": 0, "created_utc": "1325966938", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "It's close to an [special pleading](http://en.wikipedia.org/wiki/Special_pleading) but not quite.\n\nYou can have exceptions to generalizations provided there are sufficient justifications for that distinction.\n\nI'll offer an example without and without sufficient justification:\n\nA: The lochness monster cannot exist because the loch is too small to support such a large breeding population of such animals\n\nB: Sea animals that weigh over a ton require at least a 3,000 foot breeding area, except the loch ness monster.  Ergo your grievance is invalid.\n\nNow if we actually knew the loch ness monster existed and bred in the loch, then we would have a justified exception, but without sufficient justification, it's just trying to invalidate a legitimate argument aka [special pleading](http://en.wikipedia.org/wiki/Special_pleading)\n\nWith justification:\n\nA: Ants must be red or black\n\nB: Citronella ants are yellow (justified by observation), ergo ants need not be red or black\n\nIn regards to theistic arguments, some arguments seem painfully aware of this, but attempt to justify the exceptional status of God through various means.\n\nJust for some examples:\n\n**Kalam Cosmological Argument**\n\n1. Everything that *begins to exist* has a cause\n\n2. The universe began to exist\n\n3. The universe has a cause and it's God for reasons xyz\n\nThe \"begins to exist\" portion is trying to justify exempting God from needing to have his own cause (as that cause would have nearly all the same alleged attributes, and then you get an infinite regression of God upon God)\n\nThe argument is still very much fallacious, but it's not special pleading were this part true.\n\n**Unmoved mover**\n\nAquinas primarily argued that the only things which could cause actions without being acted upon themselves were minds.\n\nThis not only false (for assuming our minds are not acted upon), but also a minor argument from ignorance (I don't know anything else which acts without being acted upon, therefore it's brains)", "gilded": 0, "created_utc": "1325969154", "subreddit": "DebateReligion", "score": 1, "controversiality": 0}
{"body": "When I asked him for \"tree fiddy\", he gave me this", "gilded": 0, "created_utc": "1325971079", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "The real loch ness monster.", "gilded": 0, "created_utc": "1325975118", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1325980216", "subreddit": "gifs", "score": 1, "controversiality": 0}
{"body": "I'll throw tree fiddy on it. ", "gilded": 0, "created_utc": "1325985641", "subreddit": "tf2trade", "score": -1, "controversiality": 0}
{"body": "Bannocks or scones and oatcakes for a grain, cranachan for dessert. Or take Nessie's tip and bring shortbread for dessert. My favorite variation is dipped in chocolate with a sweeter scotch. ", "gilded": 0, "created_utc": "1325991795", "subreddit": "food", "score": 1, "controversiality": 0}
{"body": "trolololo tree fiddy!", "gilded": 0, "created_utc": "1325996036", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "I'm the loch ness monster and I'm gonna need about tree fiddy", "gilded": 0, "created_utc": "1325998134", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "[Nessie!](http://1.bp.blogspot.com/-WczRve--bYM/TeR6q_4L5bI/AAAAAAAAACQ/DLxC4AqaoRU/s1600/NESSIE.jpg)", "gilded": 0, "created_utc": "1326020296", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "God damn loch ness monster!", "gilded": 0, "created_utc": "1326037380", "subreddit": "pics", "score": 20, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy!\n", "gilded": 0, "created_utc": "1326041886", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!", "gilded": 0, "created_utc": "1326043613", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1326044941", "subreddit": "Fitness", "score": 20, "controversiality": 0}
{"body": "I'm more specificity talking about Bigfoot/Nessie/Yeti ect...", "gilded": 0, "created_utc": "1326050044", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "http://steamcommunity.com/id/scottishboy61\n\n[Nessie!](http://upload.wikimedia.org/wikipedia/en/thumb/7/79/Lochnessmonster.jpg/220px-Lochnessmonster.jpg)\n\nForgot why: Nessie is a reptilian dinosaur like animal that lives in Scotland and is just a stone cold badass! He's a sneaky bugger, too, pretty hard to get a photo of him.", "gilded": 0, "created_utc": "1326066104", "subreddit": "playitforward", "score": 1, "controversiality": 0}
{"body": "It's that goddamn Loch Ness Monster again!", "gilded": 0, "created_utc": "1326068921", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "First off we are not talking about drinking juice by itself. You need to look at the glycemic load of the meal. That's why glycemic index can be misleading. \n\nSecond fructose does not behave like sucrose in the blood. \n\nThird maybe you have an argument for Europeans (although they did have apples and pears) but research and anecdotal evidence has consistently shown that foods available to us during the Paleolithic era promote homeostasis in the body. \n\nLastly, of course it might not be the best idea in an insulin resistant individuals but that is a non sequitur. Squats aren't a good idea for people with knee problems but that doesn't mean they aren't good for the vast majority of healthy individuals. ", "gilded": 0, "created_utc": "1326069337", "subreddit": "Paleo", "score": -1, "controversiality": 0}
{"body": "I'll give you tree fiddy for the whole lot of em.", "gilded": 0, "created_utc": "1326071553", "subreddit": "xbox360", "score": 1, "controversiality": 0}
{"body": "I have a similar story. I was purchasing items, the total came to $5.25, but for some reason the cashier said $1.75. I immediately got my card out and swiped it. The older woman behind me in the line started yelling at the cashier \"You got the price wrong, he should only have to pay the $1.75 like you said, not the $5.25.\" I immediately said back to her \"I'm buying $5.25 worth of things, I'm going to pay the full amount.\" She suddenly flips her shit and yells at the cashier \"Well, if he don't want the money, I'll take it!\".  \nSuddenly I look back, and I realise it's not an old woman at all, and I yell at her \"Loch Ness Monster! You ain't gettin' no three-fiddy!\"", "gilded": 0, "created_utc": "1326073242", "subreddit": "AskReddit", "score": 201, "controversiality": 0}
{"body": "[Loch Ness Monster sighting?](http://gyazo.com/f352086f3e207bdd54b1c06aa2de69dd)", "gilded": 0, "created_utc": "1326076313", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1326077056", "subreddit": "AdviceAnimals", "score": 23, "controversiality": 0}
{"body": "About tree fitty.", "gilded": 0, "created_utc": "1326079548", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "He said he needed 'bout tree fiddy.", "gilded": 0, "created_utc": "1326080985", "subreddit": "pics", "score": 8, "controversiality": 0}
{"body": "Tree fiddy yo?  Daaayum that's sum crazy ass shit yo.", "gilded": 0, "created_utc": "1326081842", "subreddit": "AdviceAnimals", "score": 1, "controversiality": 0}
{"body": "I have about tree fiddy.", "gilded": 0, "created_utc": "1326082432", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "I said \"Dammit monster! Get off my lawn! I ain't givin' you no tree fiddy!\"", "gilded": 0, "created_utc": "1326083274", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "And she said, \"I need about tree fitty.\"", "gilded": 0, "created_utc": "1326086657", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "If Newports are 50 cents, Marlboros must be about tree fiddy.", "gilded": 0, "created_utc": "1326088714", "subreddit": "AdviceAnimals", "score": 1, "controversiality": 0}
{"body": "It should also cost tree fiddy. ", "gilded": 0, "created_utc": "1326091874", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "It's about tree fitty.  Or rather, [tiny tanks trying to off each other](http://www.youtube.com/watch?v=nDw_mpjKlpg) on some increasingly sketchy 2D terrain.", "gilded": 0, "created_utc": "1326100381", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Considering Atheists don't believe in God... The second one is like saying \"If you disobey me again, the loch ness monster will take you underground and torture you\"", "gilded": 0, "created_utc": "1326122657", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Alright guys, I've talked with a few of my friends abd we've decided that we're going to undertake this challenge.\n\nBasically we're just going to do a textures mod of XIII, with all new dialogue taken from the show and new maps that we will create.\n\nNaturally, this process will take money. Money that we do not have. We need no sound equipment and writers, but I figure that if a few redditors could donate even just a small amount, we would be well funded in no time at all. All I'm asking is for a meager amount per person. Something like, I don't know, tree fiddy. I need about tree dollars and fiddy cents.", "gilded": 0, "created_utc": "1326128874", "subreddit": "gaming", "score": 0, "controversiality": 0}
{"body": "Hey wheresnessie!\n\nFor your DPS toon, you want max resist on all 4 elements. For a \"starter\" myth set, you want 50^, all 4 resist 10+ starting, hero dps +50 or more, piercing +50 or more, and no negative hero stats. (run spd prob won't matter)... and YES, matching is important. Huge boost!\n\nAn ideal piece would have 14 starting in all 4 resists, at least 80 hero dps/pierce and no negatives with 80+ ups. You can rarely find these at endless NM HC, and can find them consistently last 3 waves of Misty NM HC. \n\nFirst, upgrade the highest starting resist until it is capped. (General resist if 2 or more have good starting value) Hopefully this took 8 upgrades or less. Your 9th or 10th upgrade, you can increase a capped resist. You will be able to increase capped resists every 10 upgrades. So cap best resist, then move on to the next... always watching for the 10th upgrade where you can go back and upgrade a capped resist more. \n\nYour first 20-30 upgrades will probably be all resist. After you are capped in all 4, start upping hero dps every time except the 10th upgrade. Focus mostly on general resist for these bonus upgrades. Gear with 200+ ups you can balance all 4, but this gear won't be enough - so get your gen resist as high as possible.\n\nThis will give you max 90% resist in all 4 stats in non-NM games... basically making you untouchable unless you try to melee 3-4 ogres at once. (You can almost afk insane UMF)\n\nEven if it says 90/90/90/90 in shop, keep going. In nightmare having 38-42 gen resist on all 4 pieces will give you 75% NM resist instead of 50%. \n\nHope that helps! I think I'm going to post this as a separate thread actually... useful info.", "gilded": 0, "created_utc": "1326135367", "subreddit": "dungeondefenders", "score": 2, "controversiality": 0}
{"body": "About tree fitty", "gilded": 0, "created_utc": "1326139191", "subreddit": "videos", "score": 5, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1326141198", "subreddit": "zelda", "score": 16, "controversiality": 0}
{"body": "And he was selling it with Nessie's Nine Iron, i remember that one.", "gilded": 0, "created_utc": "1326148051", "subreddit": "tf2trade", "score": 2, "controversiality": 0}
{"body": "Just like Bigfoot and the Loch Ness Monster. ", "gilded": 0, "created_utc": "1326148617", "subreddit": "skyrim", "score": 2, "controversiality": 0}
{"body": "\"sorry, bad example - You don't believe in bigfoot, aliens, thor, ganesh, jackalopes, jersey devil, yeti, loch ness monster, or cthulu, right?\"", "gilded": 0, "created_utc": "1326149532", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Scumbag Conservative: Doesn't accept evolution. Believes in the Loch Ness Monster.", "gilded": 0, "created_utc": "1326151801", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Of course, you're right. If you want to debate or converse this is not the best strategy. Some of us just like to get to the point. I'd imagine that DumDumDog expects a reasonable, dissenting opinion to be about as likely as -- well, I was going to say an apocalyptic meteor strike, but those actually happen -- a about as often as a peer reviewed autopsy of the Loch Ness Monster.\n\nFWIW DumDumDog, I am aware of this, and this is why I don't create submissions. I'm also am not capable of leading people on and calling it civility.", "gilded": 0, "created_utc": "1326153625", "subreddit": "DebateReligion", "score": 1, "controversiality": 0}
{"body": "Yo dat nigga gon get got, man, he stole tree fiddy da other day from me and my homies, B-boy. MothaFUCKA gotta learn some RESPECT.", "gilded": 0, "created_utc": "1326157247", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "tree fitty?", "gilded": 0, "created_utc": "1326158741", "subreddit": "AdviceAnimals", "score": 7, "controversiality": 0}
{"body": "I don't know what I'm going to do if Brodus Clay ever debuts. It would be like a cryptozoologist actually meeting Bigfoot and the Loch Ness monster.", "gilded": 0, "created_utc": "1326162283", "subreddit": "SquaredCircle", "score": 3, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1326168904", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Mufuckin loch ness monster!", "gilded": 0, "created_utc": "1326173413", "subreddit": "skyrim", "score": 3, "controversiality": 0}
{"body": "he probably just needed tree fiddy", "gilded": 0, "created_utc": "1326177615", "subreddit": "skyrim", "score": 10, "controversiality": 0}
{"body": "Aliens. Loch Ness monsters. Ghosts.", "gilded": 0, "created_utc": "1326181352", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Got tree fiddy?", "gilded": 0, "created_utc": "1326209938", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I think I might here, let me just che... Wait a second!\n\nYou're the god dang Loch Ness Monster!!!\n\nDamnit Nessie!! I told you before, I aint given you no tree fiddy!!", "gilded": 0, "created_utc": "1326210782", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Tree fitty?", "gilded": 0, "created_utc": "1326230571", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "I'll give you about tree fiddy.", "gilded": 0, "created_utc": "1326234897", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "And inactive. If your God's behavior is indistinguishable from his complete absence, any attempt to credit him with a behavior is nothing but wishful thinking. You may as well thank the good fairy or the Loch Ness monster or a jug of spoiled milk for giving you strength.", "gilded": 0, "created_utc": "1326235698", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Came here to say this. Seriously. I love Raspberry Zingers, but it's damn hard to fork over tree fiddy when, just two feet away, there's a box of Little Debbie Swiss cake rolls for half the price. ", "gilded": 0, "created_utc": "1326246364", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "I can't think of anyone from back then that was famous for being famous.  For someone to be in the tabloids they would have to be famous for something else.  TV and movie stars mostly.\nThe bat-boy, bigfoot, nessie, and of course Space Aliens have been around for a loooong time.", "gilded": 0, "created_utc": "1326248959", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "There is no such thing as the Loch Ness Monster.", "gilded": 0, "created_utc": "1326264186", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "A blunt in the form of the Loch Ness Monster?!", "gilded": 0, "created_utc": "1326266215", "subreddit": "trees", "score": 0, "controversiality": 0}
{"body": "Aww remind me of when my two Shelties where such fluff balls! Lol we named one kiltie for the Scottish kilt and the other nessie after the locness monster. Upvote!", "gilded": 0, "created_utc": "1326267954", "subreddit": "aww", "score": 1, "controversiality": 0}
{"body": "&gt; Can you choose to believe in Santa Claus? Bigfoot? Chupacabras? The Loch Ness Monster? You have reasonably concluded that all of these things are myths. There was no choice. You cannot escape what you believe to be the truth about these matters. Based on the evidence or lack of evidence you had no choice but to conclude that all of these things were myths.\n\nYou most certainly could believe those things if your parents didn't tell you otherwise. Belief is indoctrination and indoctrination is reliance on the source of your information. I believed in bigfoot into my early teens because my mom was/is an idiot. Just like your jesus.", "gilded": 0, "created_utc": "1326269170", "subreddit": "DebateAChristian", "score": 0, "controversiality": 0}
{"body": "I'd give him about tree fiddy.", "gilded": 0, "created_utc": "1326301309", "subreddit": "fffffffuuuuuuuuuuuu", "score": 3, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1326303749", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "This is a scam people! Don't buy into it.\n\nHofhuis is actually the damn lochness monster trying to scam you out of tree fiddy.", "gilded": 0, "created_utc": "1326308628", "subreddit": "fffffffuuuuuuuuuuuu", "score": 54, "controversiality": 0}
{"body": "\"The bartender said 'That'll be another tree fiddy...'  That's about the time I noticed the bartender was about 50 feet tall, and covered in scales...  Dat damn loc ness monster wanted ANOTHER tree fiddy!!!\"", "gilded": 0, "created_utc": "1326308757", "subreddit": "fffffffuuuuuuuuuuuu", "score": 49, "controversiality": 0}
{"body": "Tree fitty?", "gilded": 0, "created_utc": "1326315916", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Jack and Jill went up the hill to meet the Loch Ness Monster.\n\nSomething something tree fiddy.", "gilded": 0, "created_utc": "1326317406", "subreddit": "funny", "score": 23, "controversiality": 0}
{"body": "This is just awful - it's as bad as that [ridiculous statue](http://en.wikipedia.org/wiki/File:BraveStatue_1200x1600.jpg). Independence may or may not happen, but it's only one of the issues affecting Scotland - our shockingly bad life expectancy is easily as important, so why not a lorne sausage?\n\nMore seriously:\n\n* Saltire\n* Wallace Monument\n* Scott Monument\n* Edinburgh Castle\n* Glasgow Armadillo\n* Squinty Bridge\n* Falkirk Wheel\n* Cuillin Ridge\n\nJesus, even Nessie or highland cattle would be better than a racist jakie…", "gilded": 0, "created_utc": "1326318008", "subreddit": "Scotland", "score": 4, "controversiality": 0}
{"body": "somewhere around tree fitty", "gilded": 0, "created_utc": "1326318788", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "[Pornography has been around since the paleolithic era.](http://en.wikipedia.org/wiki/Venus_figurines) It's only more recently that people have felt shame for it.", "gilded": 0, "created_utc": "1326329206", "subreddit": "AdviceAnimals", "score": 2, "controversiality": 0}
{"body": "Forget SOPA, ask him if you can borrow like tree fitty", "gilded": 0, "created_utc": "1326330902", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "(= +-) can be shown as  ~\n\nConsider the Tree Fiddy as your own drink.", "gilded": 0, "created_utc": "1326331948", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "If you cut up that cauliflower, toss it in a food processor with a little bit of milk and grated parm cheese, bake it at tree fiddy for about fitteen or twenny minutes, then melt some cheddar cheese over it - you got yourself some delicious Mashed Cauliflower.", "gilded": 0, "created_utc": "1326334204", "subreddit": "Frugal", "score": 13, "controversiality": 0}
{"body": "Sho it wasn't wasn't tree fiddy?", "gilded": 0, "created_utc": "1326337749", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "I AIN'T GIVEN YOU NO TREE FIDDY YOU G'DAMN LOCH NESS MONSTER!", "gilded": 0, "created_utc": "1326340467", "subreddit": "PittsburghList", "score": 3, "controversiality": 0}
{"body": "Nobody can really speak for all atheists, we're a diverse group. I'm sure there are atheists who believe in alternative medicine, Nessie etc., we just don't believe in a deity. The definition of an atheist doesn't really rule out anything else.", "gilded": 0, "created_utc": "1326348203", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1326352968", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "no loch ness monster", "gilded": 0, "created_utc": "1326357942", "subreddit": "circlejerknyc", "score": 1, "controversiality": 0}
{"body": "\"**This is because at the absolute level you must put religion on the same level as the Loch Ness Monster**\"\n\nBingo. You put that very well. Except that this isn't something that you \"*DO*\", this is something that just \"*IS*\".\n\n\"**community based on nothing,**\"\n\nDisbelief in the gods is a characteristic that other people find very distinguishing about us. It's not what tends to unite us. The desire to understand the way the universe really works unites us. Freethinking unites us. Skepticism and a love of knowledge unites us.\n\nTrying to understand atheists by way of atheism is like trying to understand the Irish by way of their hair color. It's a characteristic that is truly secondary to what makes them tick.\n\n\"**Again though, the nature of Atheism means such a structure cannot exist.**\"\n\nAs their are already atheist groups voicing their opinions and pushing an agenda I hardly see this as impossible.", "gilded": 0, "created_utc": "1326377250", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "UFO's, paranormal, aliens, Bigfoot and Nessie critters should have their own subreddits IMO. I am not saying that they night not occasionally crossover. \n\nWhat drew me to r/conspiracy was that it was open minded and not constantly policed and controlled like r/politics and r/worldnews. You begin to see that so much submitted to those two main subreddits is largely propaganda. The left/right, conservative/liberal, Republican/Democrat paradigm has become complete bullshit and are tightly controlled parameters that obfuscate what is really happening. \n\n9/11 also led me to r/conspiracy. History IMO is the story of groups conspiring against one another. ", "gilded": 0, "created_utc": "1326391716", "subreddit": "conspiracy", "score": 1, "controversiality": 0}
{"body": "First... aliens would not be supernatural creatures - nor would they be if they had visited earth.\n\nAs per other non-supernatural creatures (Loch Ness, etc) - these would be accepted as soon as empirical proof is provided for such a creature - otherwise they are **mythical** - not *supernatural*.\n\nLoch Ness monster is not \"supernatural\" - but rather unproven and thus mythical at this point.\n\nSupernatural would be things like ghosts, gods, psychics, etc.", "gilded": 0, "created_utc": "1326393977", "subreddit": "atheism", "score": 9, "controversiality": 0}
{"body": "I'll take it off your hands for tree fiddy.", "gilded": 0, "created_utc": "1326410943", "subreddit": "Android", "score": 1, "controversiality": 0}
{"body": "I'll beat that. I'll give 'em tree fiddy.", "gilded": 0, "created_utc": "1326414547", "subreddit": "todayilearned", "score": 0, "controversiality": 0}
{"body": "Good thing you got a picture of that. Wow. Literally the Bigfoot of office don'ts. The Loch Ness Monster of worrisome workplace behavior!", "gilded": 0, "created_utc": "1326415668", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "\"Dude in a suit\" Scooby-Doo movies:\n\n2003: *Legend of the Vampire* and *Monster of Mexico*\n\n2004: *Loch Ness Monster* (Nessie exists in movie, but irrelevant to plot)\n\n2005: *Aloha, Scooby-Doo!* and *Where's My Mummy?*\n\n2006: *Pirates Ahoy!* (with some hypnosis)\n\n2007: *Chill Out, Scooby-Doo!*\n\n2009: *Samurai Sword*\n\n2010: *Camp Scare*\n\n2011: *Legend of the Phantosaur* (with some hypnosis)\n\nBut seriously, the live-action movies can suck cocks in hell.", "gilded": 0, "created_utc": "1326417185", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Aye ain't givin you no tree fiddy!", "gilded": 0, "created_utc": "1326417359", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "It's mostly just disturbing if you think about the age demographic these books are aimed at.  To me, it seemed to be saying, \"Have your baby at all costs, even if it takes your life.\"  Also, she names the baby \"Renesmee\" (I think I spelled that right), nicknamed \"Nessie\" (jokes ensue).  Then the baby proceeds to grow super fast and is perfect, and the werewolf guy who thought he loved Bella realizes that he'd actually loved her baby before she was even born (creepy...)\n\nAnd...I also like Harry Potter...?", "gilded": 0, "created_utc": "1326440388", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "Hi there! \n\n[H]\n \n* Force A Nature\n* Bonk\n* Ullapool Caber\n* GRU x2\n* Amputator\n* Huntsman \n* Crit-a-Cola\n* Mad Milk\n* Tribalman's Shiv\n* Persian Pursuader\n* Pain Train\n\n[W]\n\n* Atomizer\n* Bazaar Bargain\n* Overdose\n* Eviction Notice\n* Cow Mangler \n* Postal Pummeler x2 (one for a friend)\n* Nessie's Nine Iron\n* Original\n* Short Circuit\n* Scottish Handshake\n\nYeah, missing quite a few weapons. You can take your pick from what I have and I'll give you an extra couple of weapons to add to the bank as well :) Don't expect to get all of what I asked for but will take whatever I can if you still have it!\n\nEdit: Great Trade, Thanks! \n", "gilded": 0, "created_utc": "1326445318", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "Tree fitty!", "gilded": 0, "created_utc": "1326448265", "subreddit": "barter", "score": 3, "controversiality": 0}
{"body": "When I was little I had these three awesome plastic/vinyl toys, one was of the Loch Ness Monster (Plesiosaur?), a giant Ant and a giant Spider.  I used to have them face off in Godzilla-esque scenarios with my Micro-Machines Military toys.\n\nOne night I remember putting them back into my toy drawer after a good play sesh, when I went to fish them out the following day, the Loch Ness Monster was missing a flipper, one of the Ant's mandibles was gone and the Spider was missing two legs.  They had been all 100% perfect when I had put them away, I remember feeling really angry and confused as I always looked after my toys!  I logically concluded that they had come to life during the night and attacked each other in the toybox.\n\n\nOne other story, not quite glitchy and more wtf'y, but on another occasion when I was younger I remember having a dream of being stuck in a coffin, I woke up and I felt like I was upside down.  I extended my left arm out to where the wall should have been in my bed and hit it.  I then extended my right hand out and hit.... another wall.... I started freaking out, tried to put my hands out in front of me and hit ANOTHER fucking wall.  At this point I was screaming at the top of my lungs for my Dad, eventually I heard him calling my name, like he was right outside wherever I was, I could hear him trying to open whatever I was in up to get to me.\n\nIt turned out that somehow, after falling asleep i my bed, I ended upside down in an airing cupboard, wedged behind a boiler.  Furthermore, the airing cupboard door was inexplicably sealed shut (it had no lock or even a turning handle and opened on a roller), my dad broke it off its hinges trying to open it to get to me.", "gilded": 0, "created_utc": "1326458291", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "'bout tree fitty", "gilded": 0, "created_utc": "1326463214", "subreddit": "funny", "score": 103, "controversiality": 0}
{"body": "YOU GAVE DAT GERD DAMN MONSTER TREE FITTY?", "gilded": 0, "created_utc": "1326463416", "subreddit": "funny", "score": 39, "controversiality": 0}
{"body": "Damn loch ness monster!", "gilded": 0, "created_utc": "1326463609", "subreddit": "AdviceAnimals", "score": 1, "controversiality": 0}
{"body": "except that shared dreaming is right up there with Samsquamtchs and the  Loch Ness Monster", "gilded": 0, "created_utc": "1326467688", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "[*I need about tree fitty*](//#wales)", "gilded": 0, "created_utc": "1326477248", "subreddit": "metamoderatorjerk", "score": 1, "controversiality": 0}
{"body": "I have a lot of small scars on my body, most notably on my left arm. \n\nI once convinced this guy that they were the result of a parasite I had that went in and out of my body through my skin (kind of like the Loch Ness monster).", "gilded": 0, "created_utc": "1326480329", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Maybe the black guy owed them about TREE FIDDY", "gilded": 0, "created_utc": "1326482626", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "Well lets see... 2 legs.. a torso... *clicks calculator buttons* .. id say about tree fitty.", "gilded": 0, "created_utc": "1326484256", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I think about tree fiddy.", "gilded": 0, "created_utc": "1326491523", "subreddit": "IAmA", "score": 10, "controversiality": 0}
{"body": "I created the loch ness monster from a manatee! Look at a manatee,  it could never change into a loch ness monster. See, I told you I created it from a manatee. ", "gilded": 0, "created_utc": "1326492021", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Nessie", "gilded": 0, "created_utc": "1326496535", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "Evopsych is a bullshit concept that was invented by neckbeard assholes who want to justify whatever stupid bullshit theory that they desperately want to be true. There is absolutely **NO** way to prove any of it, it lacks any kind of scientific method, and is rarely ever taken seriously by *actual* scientists. \n\nIt is **NOT** the same as economics or anthropology. Namely because economics and anthropology have actually historical data to back up their theories. Evopsych does not.\n\nBasically, evopsych = ufo/bigfoot/Nessie", "gilded": 0, "created_utc": "1326497667", "subreddit": "AskReddit", "score": 20, "controversiality": 0}
{"body": "tree fiddy.\nFTFY", "gilded": 0, "created_utc": "1326503019", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Seeing Terrence Malick on film is like watching Bigfoot or the Loch Ness Monster, all in all great video.", "gilded": 0, "created_utc": "1326507397", "subreddit": "movies", "score": 9, "controversiality": 0}
{"body": "Tree fiddy\n\nEdit: Auto correct on phone...ffs.", "gilded": 0, "created_utc": "1326524933", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "i recently found our Narwhales exist. i thought they were mythical creatures like unicorns and the loch ness monster.", "gilded": 0, "created_utc": "1326525866", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1326530493", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Lemme get bout tree-fitty and I'll tell you all bout dat god damn loch ness monster.", "gilded": 0, "created_utc": "1326543322", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "My thoughts right before I fall asleep leave much brain usage to be desired. A few samples: \"If you eat too many Lucky Charms you'll poop rainbows\" and \"The Loch Ness Monster has the head of a turkey and the body of a cucumber.\" :P I love the things people come up with in dream state.", "gilded": 0, "created_utc": "1326562196", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "'bout tree fiddy", "gilded": 0, "created_utc": "1326571674", "subreddit": "videos", "score": 6, "controversiality": 0}
{"body": "God damned Loch Ness Monsta, eatin' fingers and always be talkin' 'bout dem tree fiddy.", "gilded": 0, "created_utc": "1326572078", "subreddit": "videos", "score": 5, "controversiality": 0}
{"body": "Personal testimony is insufficient to qualify that something really happened.  Examples, alien abduction, loch ness monster, bigfoot, etc.  If you want to convince yourself, you can use whatever you wish as evidence.  if you want to prove something to be true, you need a lot more that a personal experience.  ", "gilded": 0, "created_utc": "1326574071", "subreddit": "DebateReligion", "score": 1, "controversiality": 0}
{"body": "I saw a pic of the loch ness monster's head rising above the lake, with Chuck Testa holding the stick it's planted on. It was the first time I actually laughed to that meme.", "gilded": 0, "created_utc": "1326577300", "subreddit": "Minecraft", "score": 20, "controversiality": 0}
{"body": "It's from South Park. They had [a bit](http://www.youtube.com/watch?v=9cn7xfBpZ3M) about a family that was constantly harassed by the Loch Ness Monster asking for change.  ", "gilded": 0, "created_utc": "1326580341", "subreddit": "Minecraft", "score": 3, "controversiality": 0}
{"body": "I got tree fiddy in Reddit bucks for you. ", "gilded": 0, "created_utc": "1326586123", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "Goddamn Loch Ness monster.", "gilded": 0, "created_utc": "1326587824", "subreddit": "LetsNotMeet", "score": 14, "controversiality": 0}
{"body": "Ah, Rugby.  What is it about that magical sport that makes straight guys just tear their clothes off at the slightest provocation?  Seeing a pic of an American Football player with his shirt off is like spotting the Loch Ness Monster.  Rugby players... they get naked before you can finish saying the words \"charity calendar\".", "gilded": 0, "created_utc": "1326594877", "subreddit": "gaymers", "score": 1, "controversiality": 0}
{"body": "I'm not scared because I truly, genuinely, 100% believe that hell is made up. It's no different than someone threatening to sic Bigfoot on me, or feed me to the Loch Ness Monster.\n\nIf a random three year old girl were to throw glitter at me and say \"abra cadabra, this spell will turn you into a toad!\", I wouldn't worry about \"But what if it's real?\" Hell is the same. ", "gilded": 0, "created_utc": "1326602338", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Nice try, loch ness monster.", "gilded": 0, "created_utc": "1326620858", "subreddit": "malefashionadvice", "score": 3, "controversiality": 0}
{"body": "That you Nessie?", "gilded": 0, "created_utc": "1326643205", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "When you donate about tree fiddy to Bickabebia.", "gilded": 0, "created_utc": "1326649536", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "This. This is where I will build my fortress. Away from that god damn loch ness monster. ", "gilded": 0, "created_utc": "1326652587", "subreddit": "EarthPorn", "score": 3, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1326655948", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Have you seen the Loch Ness monster?", "gilded": 0, "created_utc": "1326661282", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "The Loch Ness Monster was on your school's football team? ", "gilded": 0, "created_utc": "1326663731", "subreddit": "AskReddit", "score": 9, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1326663843", "subreddit": "AskReddit", "score": 44, "controversiality": 0}
{"body": "You know, that story was so ridiculously 8th grade in nature that I couldn't help but expect it to end with the lochness monster and tree fiddy.", "gilded": 0, "created_utc": "1326667776", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "and those players aren't getting tree fiddy from their coach.", "gilded": 0, "created_utc": "1326672573", "subreddit": "AskReddit", "score": 13, "controversiality": 0}
{"body": "Make sure you buy them off girl scouts. Not that damn loch ness monster!", "gilded": 0, "created_utc": "1326679013", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "TREE fiddy\n\nFTFY", "gilded": 0, "created_utc": "1326679454", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Tree fitty", "gilded": 0, "created_utc": "1326680994", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Yeah, I'm pretty happy with what I have. I occasionally try to make a new weapon when it comes out to see if I can get a number. (So far I have a Nessie's Nine Iron #2 and a Spycicle #72). ", "gilded": 0, "created_utc": "1326700801", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "You got tree fiddy?", "gilded": 0, "created_utc": "1326706809", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "I believe it was the Loch Ness monster's constant request for Tree Fiddy that created the need for the income tax. ", "gilded": 0, "created_utc": "1326726116", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "tree fiddy, tree fiddy", "gilded": 0, "created_utc": "1326727859", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "God Dammit Woman! You give him tree fiddy, he gonna come back fo mo! ", "gilded": 0, "created_utc": "1326729313", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "GODDAMN BRITISH LOCH NESS MONSTER", "gilded": 0, "created_utc": "1326731458", "subreddit": "pics", "score": 58, "controversiality": 0}
{"body": "GODDAMMIT LOCH NESS MONSTER", "gilded": 0, "created_utc": "1326731541", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "Tree Fitty*", "gilded": 0, "created_utc": "1326732838", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Is there a non-British Loch Ness monster?", "gilded": 0, "created_utc": "1326733155", "subreddit": "pics", "score": 23, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1326735283", "subreddit": "pics", "score": 132, "controversiality": 0}
{"body": "Whooosh\n\nEdit - For the idiots downvoting this, \"The Loch Ness Monster\" is a (imaginary) creature, not a place.  An identical creature elsewhere could still be called a \"Loch Ness Monster\" the same way African Honey Bees are still called African Honey Bees even when they're found in South America.  Fealiks totally missed my point, thus the \"Whooosh\"", "gilded": 0, "created_utc": "1326736671", "subreddit": "pics", "score": -1, "controversiality": 0}
{"body": "I can give you freedom, but I'm gonna need about tree fiddy. ", "gilded": 0, "created_utc": "1326737519", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "...and it was about that time that I realized that girl scout was three stories tall and a crustacean from the paleolithic era.", "gilded": 0, "created_utc": "1326739195", "subreddit": "pics", "score": 12, "controversiality": 0}
{"body": "But \"the Loch Ness Monster\" is NOT a place, it's a (probably non-exist) creature.  An identical creature elsewhere could still be called a Loch Ness Monster despite not being in Loch Ness, much like an African Honey Bee (a.k.a. killer bee) is still called an African Honey Bee even when it's found in South America.\n\nedit - fixed a typo.", "gilded": 0, "created_utc": "1326739445", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Those mosnters man.... always wanted dat got damn tree fiddy", "gilded": 0, "created_utc": "1326745913", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "If you have no evidence and review to corroborate your claims, fuck your claims. This is the standard. Evidence and review. if you don't have it, fuck you for making the claim to begin with. I don't care if it is cold fusion, loch ness monsters or the jesus fucking christ.", "gilded": 0, "created_utc": "1326747129", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1326747279", "subreddit": "fffffffuuuuuuuuuuuu", "score": 20, "controversiality": 0}
{"body": "Don't go givin' no monster no dam tree fiddy.", "gilded": 0, "created_utc": "1326747648", "subreddit": "fffffffuuuuuuuuuuuu", "score": 6, "controversiality": 0}
{"body": "Bout tree fiddy\n", "gilded": 0, "created_utc": "1326750486", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "I'll give you about tree fitty!", "gilded": 0, "created_utc": "1326772097", "subreddit": "wow", "score": 17, "controversiality": 0}
{"body": "You're right, Boobies_Are_Awesome!  It took a little searching, but I finally found the button in [Reddit Enhancement Suite](http://redditenhancementsuite.com) that converts karma to cash!  Now all my problems are solved!  Also, I need more karma.  Could you give me about tree fiddy?", "gilded": 0, "created_utc": "1326773647", "subreddit": "circlejerk", "score": 2, "controversiality": 0}
{"body": "tree fiddy.", "gilded": 0, "created_utc": "1326776024", "subreddit": "shittyaskscience", "score": 8, "controversiality": 0}
{"body": "did residential organic food delivery. one customer was a nasty old cat lady with a filthy hoarder house that stank like desitin and funyuns. We usually leave a box on the front door and walk off, but she had special instructions to leave the box inside her front door, the trick was, we had to do it without letting the cats out AND push aside her trash heap so that we could open the door and fit the box of food inside there and then retrieve the box from last week. One week I opened the door and a cat got out, so I had to run down the street chasing it, finally caught it and brought it back, opened the front door again and I saw three or four more cats were trying to rush the door when I opened it again. That lady must have heard all the commotion and woken up from her slothful midday slumber and came over to stop the cats from escaping and kicked the cats away from the door, hard, and threw one of the cats up against the wall -- that cruel batshit old coot. I looked at her, shocked and speechless, and just handed her the foodbox and told her to have a nice day. She took the box and said \"don't you have something else for me?\" WTF? \"What's that ma'am?\" she says, \"I need about tree fiddy\" and I realized it wasn't a filthy old cat hoarding lady but it was about 30 feet tall and huge with a long neck and flippers and I said \"Now see here Loch Ness Monster, I ain't givin you no tree fiddy.\" I turned around, slammed the door and that was the end of that. ", "gilded": 0, "created_utc": "1326777759", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "It's really the Loch Ness Monster, don't let him fool you", "gilded": 0, "created_utc": "1326781664", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "She gave 'em a dolla!  Now we ain't never gonna get rid that dang-ol Loch Ness monster.", "gilded": 0, "created_utc": "1326782826", "subreddit": "guns", "score": 14, "controversiality": 0}
{"body": "I wish i would ahve seen this thread earlier today!! oh well, im still going to add you and take a look at anything you've got :D Wheresnessie my steam btw.", "gilded": 0, "created_utc": "1326783723", "subreddit": "dungeondefenders", "score": 1, "controversiality": 0}
{"body": "It's a fact that fox news viewers know less about current events than anyone else. It might have to do with the fact that they skew heavily to the paleolithic era 80+ age demographic. ", "gilded": 0, "created_utc": "1326786348", "subreddit": "ronpaul", "score": 1, "controversiality": 0}
{"body": "How about Bigfoot? Nessie? Unicorns? You can't explain that.\n\nThat doesn't mean we shouldn't ridicule people who hold stupid beliefs.\n\nWhat about antivaxxers? Are they entrenching?", "gilded": 0, "created_utc": "1326809091", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Value of Human life? About tree fiddy\n\n~Mittens Romney ", "gilded": 0, "created_utc": "1326812471", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "mind read. that will be tree fitty.", "gilded": 0, "created_utc": "1326817918", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "While he is known to be a mysterious man in general, perhaps the greatest controversy surrounding Josh Homme concerns his nationality.  Although he has touted his American-ness in shows such as Anthony Bourdain's \"No Reservations\", and his wikipedia page states he was born in Joshua Tree, CA., the attached photographic evidence is irrefutable proof that Mr. Homme is, in fact, FINNISH. \n\nThe myth of Mr. Homme's nationality has grown to rival those of the Loch Ness Monster and where xxReckonerxx hid Keith's body.  This photo, thought to be captured at Lake Saimaa, proves the following: Mr. Homme is Finnish, he posts on the interwebs under the username \"tim0k\", and he knows how to smoke a damn fine cigar.  ", "gilded": 0, "created_utc": "1326821253", "subreddit": "cigars", "score": 2, "controversiality": 0}
{"body": "I disagree.  I found it upsetting as a kid when I learned that UFOs, the Loch Ness Monster, the Yeti, ghosts, etc, were all based upon superstition and lies.  Adults shouldn't lie to children.", "gilded": 0, "created_utc": "1326821895", "subreddit": "skeptic", "score": -6, "controversiality": 0}
{"body": "I love it. I to come from the paleolithic era of interwebs and I too wish to bury things under my lawn.", "gilded": 0, "created_utc": "1326822413", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Let me tell you about the lochness monster. One time me and my lady were on a boat when this monster who looks to be from the paleolithic era comes out of nowhere. My lady was so scared and I asked the monster what he wanted. And you know what he said? He said \"about tree fiddy.\" I said, \"I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!\"", "gilded": 0, "created_utc": "1326825490", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I'm glad somebody else noticed.  Back in the paleolithic era, BOFH was among the most hilarious internet lore I'd ever read; then it turned into a lukewarm pile of trying too hard.", "gilded": 0, "created_utc": "1326833494", "subreddit": "iphone", "score": 3, "controversiality": 0}
{"body": "are you from the paleolithic era?\n\nDo you need about tree fiddy?\n\nARE YOU EIGHT STORIES TALL??\n\nAmerica deserves to know!", "gilded": 0, "created_utc": "1326837064", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "NA UH  MONSTA I AIN\"T PAYING NO TREE FIDDY FOR YOUR DAMN STUDENT LOANS ", "gilded": 0, "created_utc": "1326839267", "subreddit": "funny", "score": 35, "controversiality": 0}
{"body": "So if it's a total of 10 karma, you get tree fiddy.", "gilded": 0, "created_utc": "1326839327", "subreddit": "funny", "score": 139, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1326841084", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Very interesting indeed. Thank you for the cool insight into Mexico.\n\nYeah I'm glad that they are very accepting and open. But it's something you can never be sure of. No one questions or grills me if I declare to them I am an atheist, but you don't know what they truly think.  Though I'm sure in Mexico, perhaps religion is not taken very seriously at all.  Perhaps secularism is well understood there--which is quite rare in many countries.\n\nAlso, as an aside, what do I say when I want to say \"bye\" in Mexico's dialect of Spanish. My formal Spanish teacher always said \"adios\", I never knew it meant Go with God or whatever. Nor did I know that only rural people use it.\n\n&gt;was totally shocked when he ended the address with the comment, \"God bless America.\"\n\nYep, in modern times, all presidents say that. I think it can be traced back to the Cold War, and religious propaganda during the red scare, that portrayed America as the force of Good and of God, and Communism as atheist and evil. That's where \"In God We Trust\" comes from and it is unconstitutional.\n\nBut be forewarned, while Mexico might have modernized itself, and while America does have certain religious quirks at times, there are many countries in the world who are non-Arab, and have huge religious tendencies or histories.\n\n\n\nRegarding Mexicans living with contradictions, don't worry a lot of people live with contradictions with themselves. It's not just a Mexican thing. Most religious people live with many contradictions, that they haven't pinpointed AS a contradiction.\n\nBut nevertheless, believing in God, AND not believing in God, is a contradiction. Either you believe or you don't, if you're unsure, agnostic, even that is a contradiction backed up by no evidence and you wouldn't be agnostic if we were talking about the existence of unicorns, sasquatch, or loch Ness monster, but people do about God---and that's because religion is deeply rooted in humanity's traditions in all cultures, even if there are places like Mexico, or Finland or UK, where religion is pacified or modernized.\n\nBeing Catholic and cherry picking what you want to believe, is a contradiction. Specifically, it is like that with any religion. The idea of calling oneself a Christian, then selectively picking and choosing the Christian morals you want to believe makes being a Christian redundant and changes nothing.", "gilded": 0, "created_utc": "1326844745", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "What does he need tree fiddy fo anyway?", "gilded": 0, "created_utc": "1326845783", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "No, I need about tree fiddy", "gilded": 0, "created_utc": "1326852386", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "Lochness Monster? YOU SHALL NOT ~~PASS~~ HAVE TREE FIDDY!", "gilded": 0, "created_utc": "1326859007", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1326859791", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1326861776", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "God dammit Loch Ness Monster, I ain't gonna give you no tree fidy, now get off Reddit!", "gilded": 0, "created_utc": "1326866287", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "Having something beneath me. Not like me laying on someone, I rather like that, (Zing), but the thought of being in the ocean for example makes me freak the fuck out. Inhabitants of water can move faster than you in water. And sometimes you can't see shit underwater. Fucking Cthulhu or the Loch Ness Monster could be underneath you and you wouldn't know it. The Mariana Trench is Hell on Earth for me.", "gilded": 0, "created_utc": "1326873299", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "There is no 'variation' of atheism. Atheism is nothing except the lack of belief in any gods. Nothing else. No variations. No exceptions. No associated anything else.\n\nNO, definitions are very specific and not at all vague. They are only vague if you are an idiot who doesn't understand what words mean, or you are willfully ignoring reality to cram in your personal desired definition of the word. The meaning of words only changed over time in the past because most people were illiterate, and there were no dictionaries. Now, the meanings of words change over time because people are morons who use words incorrectly and out of context. \n\nAtheism IS NOT A SET OF BELIEFS and has NOTHING to say about the cause, nature, or purpose of anything.\n\nThe fact that some or many atheists hold similar views on these subjects is not because they are atheists. It's correlation, not causation, ya dig? People who are atheists also just happen, often, to be into science and philosophy and nature and politics, but it's not *because* they are atheists. \n\nAtheism is not a set of beliefs. You really need to learn the meanings of words, and stop using your own, usually wrong, interpretation of words. You are not even understand or getting any of what I am saying at all. Your arguments are completely disconnected from anything I have actually said or meant. Case in point:\n\n&gt;I find atheism comparable to a religion, so it's conversion to me either way. People are trying to change others beliefs to fit theirs because they believe theirs are the right ones despite having no proof that either is correct. - You\n\nAtheists are not trying to change anyone's beliefs to be the same as their own, because atheism is not a set of beliefs for someone to convert and start believing. By 'converting' someone to atheism, all an atheist is doing is showing them how to let go of the indoctrination and brainwashing of religion so that they can open their mind to the real wonders of the world. It has nothing to do with whether you accept the big bang theory or not. Any attempt by an atheist to convince people to believe what they believe has nothing to do with their atheism. All people want other people to agree with them. Religion wants people to unquestionably agree with everything in the doctrine. Atheism is just the lack of a belief in any gods. That is all it is.\n\nScientific Theory: I don't think that word means what you think it does.\n\nYou are actually completely and utterly wrong about proofs (obviously not talking about math here). What is impossible is proving a negative, ie: proving something is not true. This is why one cannot disprove God or bigfoot or Nessie. It's not possible. It is also not possible to prove something positive in absolute terms. What you can, however, do is gather evidence that supports the idea. The more supporting evidence, the more the idea (aka theory) is accepted. If a theory is found to lack evidence, or it fails to be predictive, it is dropped. If evidence continually supports the theory, and it continues to be accurate and predictive, the theory is continued to be accepted as true. Some theories, like gravity and evolution, have so much evidence, from so many different areas, that all come to the exact same conclusions that you cannot possibly argue that they are fallacious. \n\nYou misunderstand Einstein's work as well. He was not wrong, there is just more to it. Same with Darwin. Same with Newton. Same with every scientist from the past who came up with a theory that we continue to accept today as true. Just because we have learned even more, and have been able to tweak the original theories so they are even more accurate in their predictions, does not make the original theorist wrong. Religion thought that the Earth was at the center of the universe, and abused their power disgustingly to prevent scientists from telling people the truth - that the Earth goes around the Sun. Clearly they did not know for certain at all. The fact that the Earth revolves around the sun never changed.\n\nClaiming that \"science changes\" is possibly the most ignorant thing I have ever heard in a discussion about science. Science doesn't \"change\", we do it better and get more accurate results as time goes on. The beauty of science is that it is self-correcting, and only matters if other people can reproduce what you are claiming. If a scientist makes a claim that no other scientists can replicate, then no one believes that the claim is true or the scientist is correct. If every time a different person tries the experiment, and other experiments testing the same claim, and every time the claim is shown to be accurate, then it is accepted as true. \n\nClaiming that the only choices are belief in god or belief in nothing is a false dichotomy. If your logic was true, I would be a solipsist, and I am not. So you are wrong. Again. Just because there are no gods doesn't mean that people aren't real, that experiences aren't meaningful, and that the human experience isn't the greatest accomplishment of any creature that has ever existed on our planet. My life is amazing and it has a lot of meaning to me and the people I love. I don't need to believe silly myths to love life.\n\nEugenics was only considered legit by racists who wanted to use science to prove their own prejudices were justified. Those 'scientists were as terrible at science as believers when they try to use science to prove god. It's all nonsense, and science has since shown that there is nothing to eugenics, except some people are racists. Science was not applied to any moral decisions. The values and prejudices of individuals was applied to moral decisions. You are ridiculous. I'm starting to think you must be a high school girl, possibly home schooled, or else you must go to a religious school. Literally nothing you are saying is accurate or true. For the love of God, please do not procreate.", "gilded": 0, "created_utc": "1326876627", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1326938590", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "About tree fiddy ", "gilded": 0, "created_utc": "1326940672", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "I'll give you tree fitty.", "gilded": 0, "created_utc": "1326941788", "subreddit": "BookCollecting", "score": 0, "controversiality": 0}
{"body": "~~About tree fiddy~~\n\nNot enough.  Do we have to form our own lobby?  It'd be cheaper just to.... no no lead by example, better than them ect.\n\nEdit: Accidentally a word", "gilded": 0, "created_utc": "1326942541", "subreddit": "movies", "score": 1, "controversiality": 0}
{"body": "Well this was way back in High School so I may have some details a little fuzzy. But as most high schools went there was always large parties thrown every weekend by the same groups of people. This time was around Halloween and the party was at a cemetery, and despite my fear of the dead and morbidity of the whole idea I decided I would go because my crush was going to be there that I had been flirting with in class recently. Keeping in mind that I was not the most popular person. I arrived and eventually tried to drink some of my fear and anxiety away, which lead to me being excessively drunk. People were starting to get crazy and apparently one of the popular Jocks had been dared by some of the others to dig up a grave. After some jostling he eventually gave in the the cheers egging him on and he grabbed a buddy to help him dig. While the party continued they dug and dug until they hit a solid object, the coffin, and begin to uncover it. Of course by now the whole party is going crazy and my crush was standing near me.    And I saw him move towards me and ask if I wanted to leave with him before any trouble happened. However someone had already called the police and police cars had just showed up. In a mad break to run away from it all we were both chased by police and tackled as we ran into a forest. We were handcuffed and left sitting together, which was when my crush turned to me and asked me for about tree fiddy.\"", "gilded": 0, "created_utc": "1326947100", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "How about tree fiddy?", "gilded": 0, "created_utc": "1326947121", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "This happened as my Grandmother was in a coma on life support, having been in this coma for about a little over a week. My family gathered around her crying as the nurse pulled her from life support. I rested my hand on her shoulder and to my surprise and complete shock her head leaned over toward me and in her final words she asked me for just one thing, about tree fiddy.", "gilded": 0, "created_utc": "1326947939", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "How about tree fitty?", "gilded": 0, "created_utc": "1326948397", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "My dorm mate in college always seemed a little bit on the creepy side. Stayed in the dorm at what seemed like was forever, never left his computer, and always closed his tabs around me. Wore trench coats and listened to the weirdest music that I could hear blaring through his earphones. One night I came back early from a party that I had said I would be at until very late, to open my door to see my dorm mate with a girl. Now this surprised me at first to see him with a female. So I immediately backed out and shut the door, thinking I might have ruined his one chance at a female encounter. However they opened the door and brought me in. Explaining to me a fetish they had for threesomes. In my drunken stupor, I agreed. (After all the girl was Extremely attractive) However as I began to kiss her and remove our clothes, to my utter horror I saw her penis. But that was not even the worst of it, as I grabbed the member in shock she bent over and asked me for \"about tree fiddy\"", "gilded": 0, "created_utc": "1326948914", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "\"Bypassing\" the Wiki block probably violates the DMCA somehow.  \n\nIf they just checked the logs and sent out some good ol' *pay-us-or-be-sued* extortion letters to every one of the IP addresses they wouldn't have to keep asking me for tree fiddy.", "gilded": 0, "created_utc": "1326948941", "subreddit": "politics", "score": 9, "controversiality": 0}
{"body": "I am actually very familiar with the club that you are speaking of. If It is the correct club I have in mind they have already been in several similar cases such as this, I have worked with the said club for different promotional activities that my job requires and I could easily put you in touch with the director who would back off immediately and try to not deal with legal problems such as the last cases. I would love to help you resolve this issue, however for some of the services I do require about tree fiddy.", "gilded": 0, "created_utc": "1326949193", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "~~Don't go givin' that Obama no tree fiddy, woman!~~", "gilded": 0, "created_utc": "1326952035", "subreddit": "movies", "score": 2, "controversiality": 0}
{"body": "Its a quote from an old southpark episode about the loch ness monster needing 3.50", "gilded": 0, "created_utc": "1326957026", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Aww, it's Nessie! Don't worry, she's friendly.", "gilded": 0, "created_utc": "1326957472", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "Goddamn Loch Ness Monster!", "gilded": 0, "created_utc": "1326957689", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Our biology teacher said the same thing, only with the Loch Ness Monster.", "gilded": 0, "created_utc": "1326996426", "subreddit": "Christianity", "score": 8, "controversiality": 0}
{"body": "the Loch Ness Monster", "gilded": 0, "created_utc": "1326998661", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "\"Walk the dog\" is a euphemism in otter's household: obviously, as we all know, all Scottish families own a Loch Ness Monster to look after, and giving it its daily exercise is a truly crushing task.", "gilded": 0, "created_utc": "1327004395", "subreddit": "pics", "score": 23, "controversiality": 0}
{"body": "Tree.5. Damn Loch Ness Monster", "gilded": 0, "created_utc": "1327004725", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Lemme hold about tree fiddy...", "gilded": 0, "created_utc": "1327005713", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Find Nessie yet?", "gilded": 0, "created_utc": "1327005989", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "tree fitty", "gilded": 0, "created_utc": "1327007424", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I need about tree fiddy", "gilded": 0, "created_utc": "1327013328", "subreddit": "IAmA", "score": 10, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1327014428", "subreddit": "AskReddit", "score": 13, "controversiality": 0}
{"body": "'bout tree fiddy, billion.", "gilded": 0, "created_utc": "1327015801", "subreddit": "technology", "score": 2, "controversiality": 0}
{"body": "Look out, it's the Loch Ness monster!", "gilded": 0, "created_utc": "1327018518", "subreddit": "IAmA", "score": 18, "controversiality": 0}
{"body": "I'm gonna need about tree fiddy. ", "gilded": 0, "created_utc": "1327024023", "subreddit": "funny", "score": 8, "controversiality": 0}
{"body": "I ain't givin' you no tree fiddy!", "gilded": 0, "created_utc": "1327024108", "subreddit": "funny", "score": 7, "controversiality": 0}
{"body": "I got about tree fiddy", "gilded": 0, "created_utc": "1327025293", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Marshall is hysterical. Although, I was a bit disappointed they referred to Nessie as \"The Loch Ness **Monster**,\" as Marshall has been quoted saying that he did not like referring to her as such, as she is a gentle creature.", "gilded": 0, "created_utc": "1327026200", "subreddit": "HIMYM", "score": 2, "controversiality": 0}
{"body": "I would very much like to do this, or even mm nm non survival because i cant seem to get the right setup to beat the boss :/\nAnyways \n\nHuntress: 1.3mil dps Maxed out resists 80~ in nm\n\nAdept: 445/1126/361/571 tower stats\n\nMonk: 433/866/318/291 aura stats\n\nAlso have a genie, huntress pet, apprentice pet, and a dps pet\nSteam name is Wheresnessie ", "gilded": 0, "created_utc": "1327026306", "subreddit": "dungeondefenders", "score": 1, "controversiality": 0}
{"body": "&gt;It seems to me that you are an agnostic, not an atheist.\n\nI disagree. Atheist accurately describes me.\n\n&gt;The burden of proof also lies with non-theists to explain the universe in the manner they see fit.\n\nThis is a fallacy of logic. The how does my ignorance lend credulity to your theistic claim?\n\n&gt;No one has convincingly done so, so why discount a possibility?\n\nFor the sake of sanity and pragmatism. How can we possibly keep track of and appropriately consider every idea which hasn't been proven to be false? From this logic I should assume you hold Islam with equal regard to Christianity? How about the possibility of the Loch Ness Monster? This is not a functional way of viewing the world. We must and do make determinations about what we need to worry about and what we don't. I've never seen, heard, or read a reason why I should concern myself with notions of the divine and/or supernatural, so I don't -- it's as simple as that.\n\n&gt;Then why do you (presumably) accept the multiverse theory?\n\nWe'd have to get very specific about the word \"accept\" here for me to answer that question. I think the multiverse theories are an interesting and, relatively speaking, novel idea. They are ideas which challenge my intellect. What's more, these are ideas which I have access to. I could do the work of string theorists myself and understand it at the level of the people who came up with the concepts, and many have. There is nothing accessible about one's \"spirituality\". It's a bland bag of incontrovertibly warm and fuzzy feelings that I do not find worthwhile. Talking about religion is tantamount to grabbing a fellow passer-by on the street and exclaiming in a profound interrogative tone, \"No way! You like money too!\" Of course they like money; and of course I feel connected to humanity -- but what reason is there to suppose the supernatural? I see none.\n\n&gt;Or any other theory that is equally as unknowable as intelligent design?\n\nMultiverse theory is a theory, intelligent design is not. It is a logical paradox which can and will keep anyone silly enough to tangle with it occupied. There is no equivocating between these two ideas -- they are patently distinct from one another. String theory (for example) attempts to explain the physical interactions of things at all scales in compatible terms. Intelligent design is an idea which came about and continues to exist for one reason -- to support the notion of God.\n\nYou do yourself a disservice by equivocating between multi-verse theories and intelligent design. Intelligent Design is logically invalid, it the appeal to ignorance, dressed up for academia -- and no one fell for it.\n\n&gt;You must know that science is fundamentally incapable of proving definitively where the universe comes from.\n\nFrom the standpoint of logic, this is no different than saying \"you know that we are fundamentally incapable of proving definitively where the universe comes from.\" Science has nothing to do with it -- this possibility is not an indictment of science, and anyone who understands the philosophy of science wouldn't make the mistake of having this failed expectation.\n\n&gt;Science will, and perhaps already has, reach a point where it no longer has any observable evidence to work with.\n\nPeople have been saying this for centuries. It will certainly turn out to be true if it becomes popular -- yet again, this is no indictment of the philosophy of science.\n\n&gt;You can argue that point, although I don't know why you would, but at the end of the day you are placing just as much faith in science as I do in my God. \n\nNonsense, I comfortable in my position of ignorance, thankful for the ability to stand on the shoulders of giants and see it for what it is. Do not presume to lecture me about what you don't understand. There is no aspect of my character which possess the same kind of \"faith\" or \"belief\" that you do. In my worldview, *all* truths are provisional, and assailable through the same provisions which substantiate their supremacy. Gravity may be completely misunderstood, and I would be entertained by the notion if it were rigorous and intellectually honest. There is nothing rigorous or intellectually honest about Intelligent Design, and the very suggestion is an offensive betrayal of everything science has achieved.", "gilded": 0, "created_utc": "1327026419", "subreddit": "DebateReligion", "score": 1, "controversiality": 0}
{"body": "I was hoping that nessie would appear on camera with both of them missing it while marshall was chasing after lily.  ", "gilded": 0, "created_utc": "1327031254", "subreddit": "HIMYM", "score": 2, "controversiality": 0}
{"body": "It was about this time I realised that the girl scout was 8 stories tall and was a crustacean from the paleolithic era.", "gilded": 0, "created_utc": "1327036846", "subreddit": "guns", "score": 3, "controversiality": 0}
{"body": "&gt;Atheist accurate describes me.\n\nThen your outlook on the world is, by definition \"I know that no god exists\". If it is not, you are agnostic. That's why these two terms exist, to easily differentiate belief systems. Don't muddy the waters more than they already are.\n\n&gt;From this logic I should assume you hold Islam with equal regard to Christianity?\n\nFrom a philosophical point of view, I do.\n\n&gt;This is not a functional way of viewing the world. \n\nThis is not a functional way of viewing the *observable* world. Because there have been expeditions to Loch Ness, and these expeditions found no monster, I do not believe in the Loch Ness monster. If there was no way to travel there or make a meaningful statement as to whether or not the Loch Ness monster existed, I would be forced to withhold judgement on the matter unless the monster showed himself. \n\n&gt;I've never seen, heard, or read a reason why I should concern myself with notions of the divine and/or supernatural, so I don't.\n\nLet's look at an example here. There are some tribes in the rain forest who have never heard of, read about, or seen another group of human beings. Does that mean that logging companies can't come in and destroy their homes? Of course it doesn't. At some point in time, almost everything we know about the universe was not known. Does that mean we should have assumed none of it existed?\n\n&gt;There is nothing accessible about one's \"spirituality\". It's a bland bag of incontrovertibly warm and fuzzy feelings that I do not find worthwhile.\n\nPerhaps that is only your interpretation of what religion is. I can see why many have a distaste for it, but to assume that they are pointless is to deny the reason many do not share your sentiment.\n\n&gt;but what reason is there to suppose the supernatural?\n\nAgain, until science provides an alternate answer, it would be foolish to discount any theory. Especially one that has been the accepted answer for thousands of years. Don't throw out old answers until you have a new one.\n\n&gt;Multiverse theory is a theory, intelligent design is not. It is a logical paradox\n\nAny theory you can propose is illogical until you can demonstrate that stable matter can spontaneously create itself from nothing. To propose that creation occurred *ex nihilo* without a gods involvement *is* the same as intelligent design on a logical level.  Even if you don't think creation occurred *ex nihilo*, you aren't any closer to explaining where the universe comes from. Saying the universe has always existed is a cop-out to avoid saying \"I can't explain it\".\n\n&gt;anyone who understands the philosophy of science wouldn't make the mistake of having this failed expectation.\n\nThat makes absolutely no sense. If you are aware that we are incapable of providing a definitive answer to the question of where the universe comes from, how can you discount *any* proposed answer?\n\n&gt;Do not presume to lecture me about what you don't understand.\n\nI have no idea what you are referring to but I'm sorry you feel the need to be a jerk.\n\n&gt;There is no aspect of my character which possess the same kind of \"faith\" or \"belief\" that you do.\n\nYes there is. You have faith in humanity's intellectual capability and in your own. You think that because we have the powers of reason and logic, nothing is out of our realm of understanding. That is the most self righteous worldview you could have. You can call me uneducated or brainwashed if you like, but that doesn't make it any less true. We all place our faith in something. Maybe you don't like that word but the core concept still remains. You place your faith in human intellect. I hope you don't watch the news. You might start to question your faith.\n\n&gt;There is nothing rigorous or intellectually honest about Intelligent Design, and the very suggestion is an offensive betrayal of everything science has achieved.\n\nThat is your opinion and you are entitled to it. The fact that you do not see them as equally possible does not mean that they are not. It does not bother me that you do not believe in a god. That is your choice and assuredly nothing I can say will convince you to change your mind. I just wonder if you will be as convinced of your position when you reach your deathbed as you are now.", "gilded": 0, "created_utc": "1327037397", "subreddit": "DebateReligion", "score": 1, "controversiality": 0}
{"body": "For about two fitty ill send them pictures of the loch ness monster for about 2 minutes.", "gilded": 0, "created_utc": "1327044784", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I'll give you about tree fiddy for it.", "gilded": 0, "created_utc": "1327059902", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Nessie? Is that you? ", "gilded": 0, "created_utc": "1327075958", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "'bout tree fiddy", "gilded": 0, "created_utc": "1327078469", "subreddit": "chicago", "score": 4, "controversiality": 0}
{"body": "Gimme tree fiddy. ", "gilded": 0, "created_utc": "1327079646", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "No one's going to pay her a million for that, more like tree fitty.", "gilded": 0, "created_utc": "1327082602", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "People find evidence of Noah's Ark all the time. They also find bigfoot all the time. And Nessie, ect.\n\nThink about it, if there was any really strong proof this was Noah's ark, don't you think you'd hear about from somewhere a little more mainstream than \"sciencedaily?\"", "gilded": 0, "created_utc": "1327085631", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Krashmo, do you believe in the Loch Ness Monster?", "gilded": 0, "created_utc": "1327087874", "subreddit": "DebateReligion", "score": 1, "controversiality": 0}
{"body": "&gt;Because there have been expeditions to Loch Ness, and these expeditions found no monster, I do not believe in the Loch Ness monster. If there was no way to travel there or make a meaningful statement as to whether or not the Loch Ness monster existed, I would be forced to withhold judgement on the matter unless the monster showed himself. ", "gilded": 0, "created_utc": "1327088295", "subreddit": "DebateReligion", "score": 1, "controversiality": 0}
{"body": "She looks like she needs about tree fiddy.", "gilded": 0, "created_utc": "1327090736", "subreddit": "cats", "score": 1, "controversiality": 0}
{"body": "Because there have been expeditions to Loch Ness, and these expeditions found no monster, **I do not believe in the Loch Ness monster**. If there was no way to travel there or make a meaningful statement as to whether or not the Loch Ness monster existed, I would be forced to withhold judgement on the matter unless the monster showed himself. ", "gilded": 0, "created_utc": "1327092108", "subreddit": "DebateReligion", "score": 1, "controversiality": 0}
{"body": "How do you know the Loch Ness Monster doesn't exist?", "gilded": 0, "created_utc": "1327092634", "subreddit": "DebateReligion", "score": 1, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1327093028", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "I heard that Bigfoot had actually found Noah's Ark but the liberal media covered this up after they killed Nessie for trying to warn humanity about the end of the world in 2012.", "gilded": 0, "created_utc": "1327094882", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Really? You are going to make me copy and paste the same paragraph for the third time? This will be the fourth time you've seen it. Please learn to read.\n\n&gt;Because there have been expeditions to Loch Ness, and these expeditions found no monster, I do not believe in the Loch Ness monster. If there was no way to travel there or make a meaningful statement as to whether or not the Loch Ness monster existed, I would be forced to withhold judgement on the matter unless the monster showed himself. ", "gilded": 0, "created_utc": "1327095612", "subreddit": "DebateReligion", "score": 1, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1327096521", "subreddit": "pics", "score": 13, "controversiality": 0}
{"body": "Are you sure its not called the [Loch Ness Monster](http://i.imgur.com/rndXE.jpg) Road?", "gilded": 0, "created_utc": "1327097229", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Tree fiddy x 1000", "gilded": 0, "created_utc": "1327097531", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "...weighs tree fiddy", "gilded": 0, "created_utc": "1327098327", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "As a lawyer, Marshall is aware that sometimes you must use the rhetoric most suited to your audience, even if it may not always be your first choice of words. He apologized to Nessie later. She understood. A rose by any other name and all that.", "gilded": 0, "created_utc": "1327108823", "subreddit": "HIMYM", "score": 2, "controversiality": 0}
{"body": "PC i take it? [This](http://i.imgur.com/sNlaN.png) is it, it's in my shop for 16 mil atm. Add me, wheresnessie.", "gilded": 0, "created_utc": "1327117565", "subreddit": "dungeondefenders", "score": 2, "controversiality": 0}
{"body": "I make about tree fitty", "gilded": 0, "created_utc": "1327119259", "subreddit": "Calgary", "score": 3, "controversiality": 0}
{"body": "Lamar Smith will become the most scorned name among black Americans since the Loch Ness monster.", "gilded": 0, "created_utc": "1327122554", "subreddit": "politics", "score": 13, "controversiality": 0}
{"body": "And Ireland? entirely made off alcoholic gingers in kilts with huge bears playing bagpipes and singing tales about the Loch Ness Monster.", "gilded": 0, "created_utc": "1327130399", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "&gt; Loch Ness is best known for the alleged sightings of the cryptozoological Loch Ness Monster, also known affectionately as \"Nessie\".", "gilded": 0, "created_utc": "1327144840", "subreddit": "wikipedia", "score": 1, "controversiality": 0}
{"body": "I'm gonna need about tree fitty.", "gilded": 0, "created_utc": "1327150167", "subreddit": "food", "score": 43, "controversiality": 0}
{"body": "God Dammit Loch Ness Monstah, I ain't gonna give you no tree fiddy!", "gilded": 0, "created_utc": "1327157229", "subreddit": "food", "score": 21, "controversiality": 0}
{"body": "What's the Nessie decoration made out of?", "gilded": 0, "created_utc": "1327157691", "subreddit": "food", "score": 6, "controversiality": 0}
{"body": "Lies! Misdirection! Don't you see, man? They don't want us looking into this, because it would implicate them in the global mind washing conspiracy.  Wake up, sheeple! This was planned from the start, man, and can only be explained by one thing: extra terrestrial ghost hunters working in collusion with the FBI and Sasquatch to cover up the existence of Nessie and Bat Boy's vampire love child! Betelgeuse (or Beetlejuice) is the star system the alien ghost hunters come from, and 16.8.5 is the coordinates for their secret base in the Rigel system.  The zombies in 1.16 are an allusion to the fact that you're all mindless drones, believing what they tell you when the obvious truth is right there for you to see.  Annie's pen in 2.08 causes the group to faction and miss the puppy parade, just like this debating on the Internet distracts us from the real truth: government agents are hiding the existence of Nessie's baby!  And Britta's psych test in 3.05 is just how they will disprove this theory, by telling you all I'm psychotic and schitzophrenic and it's all just made up.  But it's **not!** It's real! Ganz is just another pawn in the game, spouting lies to cover up the truth! The proof is out there, right in front of your face if you know where to look for it!", "gilded": 0, "created_utc": "1327159269", "subreddit": "community", "score": 4, "controversiality": 0}
{"body": "I was hoping for a cupcake array iced with the words \"I need about tree fiddy\"\n\nEdit: excellent work btw ", "gilded": 0, "created_utc": "1327161960", "subreddit": "food", "score": -1, "controversiality": 0}
{"body": "you spelled tree fiddy wrong\n\nand about...", "gilded": 0, "created_utc": "1327166495", "subreddit": "gaming", "score": 12, "controversiality": 0}
{"body": "I am soooo sick of all this \"new age\" star child indigo crystal vaccines are evil bullshit.  Hey I think I have a fairly open mind about things but if you jump on the new age bandwagon and believe all the crap that they try to sell you , you will not know up from down or left from right.  Everything is a fucking magical mystery to them. Fuck.  (my mother is a new age follower that believes everything from the Loch Ness monster to hollow earth theories.)", "gilded": 0, "created_utc": "1327167620", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Don't go giving no loch ness monster no tree fiddy!", "gilded": 0, "created_utc": "1327170414", "subreddit": "geek", "score": -1, "controversiality": 0}
{"body": "I ain't got no tree fitty!\n", "gilded": 0, "created_utc": "1327171763", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I came here to see how many \"tree fitty\" jokes were made.  I was not disappointed.", "gilded": 0, "created_utc": "1327174495", "subreddit": "food", "score": 0, "controversiality": 0}
{"body": "Tree fiddy!?", "gilded": 0, "created_utc": "1327174727", "subreddit": "fitnesscirclejerk", "score": 2, "controversiality": 0}
{"body": "Definitely. I thought it was going to be the loch ness monster!", "gilded": 0, "created_utc": "1327175248", "subreddit": "videos", "score": 3, "controversiality": 0}
{"body": "Did you leave out the period and the zero and really mean to say tree fiddy?", "gilded": 0, "created_utc": "1327181882", "subreddit": "Frugal", "score": 2, "controversiality": 0}
{"body": "But he would not appreciate Nessie being referred to as a \"monster\". ", "gilded": 0, "created_utc": "1327182585", "subreddit": "food", "score": 1, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy!", "gilded": 0, "created_utc": "1327192358", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1327192458", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "And then there are those monks who are 8 stories tall and crustaceans from the paleolithic era. ", "gilded": 0, "created_utc": "1327195986", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Couldn't be the Loch Ness monster. It never asked the cameraman for tree fiddy. ", "gilded": 0, "created_utc": "1327198404", "subreddit": "videos", "score": 4, "controversiality": 0}
{"body": "    God Dammit Loch Ness \n    Monster, I ain't gonna give \n    you no tree fiddy!", "gilded": 0, "created_utc": "1327204626", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Yeah, but per serving it's about tree fiddy.", "gilded": 0, "created_utc": "1327208820", "subreddit": "food", "score": 21, "controversiality": 0}
{"body": "WELL IT WAS ABOUT THAT TIME THAT I REALIZED IT WASN'T NO SOURDOUGH SANDWICH MONSTROSITY, IT WAS THAT GOD DAMN LOCH NESS MONSTER!", "gilded": 0, "created_utc": "1327215044", "subreddit": "food", "score": 9, "controversiality": 0}
{"body": "As someone who has dated a smoker, I tried standing around the smoke, but being a non smoker, it was just too disgusting for me. And the kiss of someone after they just got smoking is even worse than that feeling. \n\nSo what I'm trying to say is, smoking can be a big turn off, depending on the person. Based upon what his actions have been, he probably doesn't find it pleasant.\n\nRegarding penis size, that's a difficult situation. If you love him and want to stay with him, then your options are to suck it up and make due with what your guy has or incorporate toys with him. If he's super open, he might allow a threesome, but I wouldn't be willing to assume that as the case. You could also break things off with him and go for it with the Nessie dick or try to get it without breaking things off, but I don't particularly recommend either of those decisions, especially the later. The former should be done if you think his dick size is a deal breaker. \n\nAnd no, I don't think you're a bad person if you break up over penis size. If its that important to you, you're the person living with the decision. Go with what's in your best interest, and it's even in your boyfriend's best interest if that's the case. He'll probably feel inadequate otherwise, or get some sort of negative end from your pleasure and curiosity not being fulfilled anymore.", "gilded": 0, "created_utc": "1327217762", "subreddit": "relationships", "score": 2, "controversiality": 0}
{"body": "Priceless it ain't.  That'll be tree fiddy.", "gilded": 0, "created_utc": "1327222036", "subreddit": "C25K", "score": 1, "controversiality": 0}
{"body": "... I was waiting for someone to ask for tree fiddy or someone to walk the dinosaur", "gilded": 0, "created_utc": "1327247587", "subreddit": "4chan", "score": 2, "controversiality": 0}
{"body": "Did him asking for tree fiddy start the fight?", "gilded": 0, "created_utc": "1327255246", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "No, he came to my door and asked me for dat tree fiddy, but I said, \"I ain't givin' you no tree fiddy\". And it was about that time I realized he was 50 stories tall and from the crustacean era.", "gilded": 0, "created_utc": "1327258937", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1327259473", "subreddit": "EngineeringPorn", "score": 5, "controversiality": 0}
{"body": "tree fitty", "gilded": 0, "created_utc": "1327261198", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1327275078", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "i haven't actually had one, but i think about tree fitty.\n\nfrom what i see online, they were $2.99 in 2008. hopefully someone else can give you a definitive answer.  ", "gilded": 0, "created_utc": "1327275589", "subreddit": "keto", "score": 2, "controversiality": 0}
{"body": "Just think of the ones that stuck around always asking for tree fitty.", "gilded": 0, "created_utc": "1327295642", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "I'd do it for about tree fiddy", "gilded": 0, "created_utc": "1327298985", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "Dinosaurs were not made up at all. Nessie is a living proof of that.", "gilded": 0, "created_utc": "1327302299", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "Loch Ness Monster. I don't know why, but its existence just seems so sure to me.", "gilded": 0, "created_utc": "1327305682", "subreddit": "AskReddit", "score": 56, "controversiality": 0}
{"body": "Locals keep the rumour going for tourism. That's about it really. But hell, its a beautiful part of the world and its a fun mystery so no harm in Nessie!", "gilded": 0, "created_utc": "1327313908", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Nessie! I've been to the Loch Ness, and that shit is for real. I believe it to be a plesiosaurus, they lived in that area back in the day, and some of them could have lived in the 'lake' before the land closed and made the lake, thus trapping them in the Loch Ness. They may be dead now (hope not), but some could have survived long enough for humans to see them and pass down the story through the generations.", "gilded": 0, "created_utc": "1327317510", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I grew up near Loch Ness. Everyone knows someone who knows someone who has seen Nessie. Whether it's true or not, I have no idea, but I don't think it's too far fetched to believe that there are species out there that we haven't discovered yet. \n\nThe loch is very deep, very dark (due to the high peat content) and has a complex system of underground caverns that are all but impossible to explore. Whether Nessie or not, it's perfectly plausible that there are things living there that we haven't been able to scientifically verify as of yet. \n\nI've been out on the loch many times. I'm not one for believing in things that can't be proven, but the place does have a certain mysterious feel to it. You can't help but want to believe when you're there. \n\nIf everyone stopped believing in Nessie, there are villages on the banks of Loch Ness that would fall apart because they are almost exclusively reliant on tourism for their income. ", "gilded": 0, "created_utc": "1327325912", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "Of course. Everybody knows that the Loch Ness Monster is the ghost of a martian dinosaur from the future. \n\n*Duh...*", "gilded": 0, "created_utc": "1327328161", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "It is not about being benign or not benign, I mean the entire crytozoology column is fairly benign, my believing in the Loch Ness monster or fairies doesn't harm anyone else.  It is about irrational things, and Buddhism asserts things that have no evidence, such as a soul.   ", "gilded": 0, "created_utc": "1327331641", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "Tree fitty?", "gilded": 0, "created_utc": "1327332140", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "&gt;If everyone stopped believing in Nessie, there are villages on the banks of Loch Ness that would fall apart because they are almost exclusively reliant on tourism for their income.\n\nAnd that is what makes it suspect for me.", "gilded": 0, "created_utc": "1327334533", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "West Edmonton Mall, to be exact, in Alberta.  That's a pretty new slide, I've only been out of Edmonton for under 5 months and I hadn't seen it until Sunday.  \n\n\nI still say Nessie's Revenge is the best for Anal Torture.  Your bathing suit gets wedged about an inch and a half up your anal cavity.", "gilded": 0, "created_utc": "1327334636", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "I think Marshall also got a little bit of the Joey/Phoebe open mind (Nessie, Sasquatch, Aliens, Ghosts). ", "gilded": 0, "created_utc": "1327335717", "subreddit": "HIMYM", "score": 11, "controversiality": 0}
{"body": "My first concert cost $3.50 or 2.5 times min wage.  A guy named Jimi Hendrix played. All the concerts cost around, no joke, tree fiddy.  2.5 times min wage now is $18.13 and probably won't get you in to see a Hendrix calibre concert.  My second concert was The Rolling Stones, Chuck Berry and Terry Reid.  Tickets were $3.00, $4.00 &amp; $5.50 plus $.50 service charge as seen in this [You Tube video](http://www.youtube.com/watch?v=e0IW081U8ns)  Min wage had been raised so this concert was less than two times min wage.  Now concerts seem to cost around nine times min wage.", "gilded": 0, "created_utc": "1327340041", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1327340349", "subreddit": "Frugal", "score": 1, "controversiality": 0}
{"body": "Nope. Not at all.\n\nLuck does not exist. There is no way to measure luck. There is no way to calculate it. Random chance does, however, exist and can be calculated based on factors such as knowing the right people, having job openings in your area, and such.\n\nLuck is just as real as the tooth fairy, leprechauns, and the Loch Ness monster.", "gilded": 0, "created_utc": "1327341905", "subreddit": "buildapc", "score": -2, "controversiality": 0}
{"body": "I can verify this story. \n\n\n**Edit:** I gave about a Tree Fiddy.\n\n**Edit2:** $50 more incoming.\n\n**Edit3:** Gypsy is fixed! Huzzah!", "gilded": 0, "created_utc": "1327345111", "subreddit": "Assistance", "score": 8, "controversiality": 0}
{"body": "I recently brought one of these watches with some spare cash I had laying around the house and I was just thinking that it would act just like any other watch I have ever owned.... To my surprise it is much more then a watch! This watch can actually STOP TIME and GO BACK in time! I remember going back to the paleolithic era and set up camp near the one of the most wonderful beaches you will ever see. After about 5 minutes this giant crustacean come out of the water and he started to look down on me with his big red eyes and I yell \"What do you want me monster\" he leaned down and said I need about three fiddy.", "gilded": 0, "created_utc": "1327346974", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Well, I suppose the first chink was taking the first step to critical thinking.\n\nI had been big on UFOs, Loch Ness monsters, and stuff at age 8.  Super obsessed.  Couldn't figure out why scientists weren't more involved.\n\nThen I discovered Santa wasn't real, and I had a flash of inspiration.  People make up shit all the time, and other people want to believe it.\n\nThen 8 years later I was brave enough to ask myself, 'How do I know my church is right?' and it quickly disintegrated.", "gilded": 0, "created_utc": "1327347324", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "about tree fiddy.", "gilded": 0, "created_utc": "1327348054", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "I think there are too many other things it could be. Assuming it's real seems like jumping the shark to me. All \"evidence\" is highly circumstantial at best.\n\nMy main question, which maybe you can answer; why haven't we found a corpse? Genuine curiosity. I've never heard an explanation.\n\nSo many sightings are conveniently similar to Surgeon's Photograph, which has soundly been proven as fake. It's kind of like with crop circles. There weren't any reliable records of them before the first ones in 1978, which later turned out to be fake. A large portion are likely copy-cats.\n\nPersonally, I think the \"rotting log\" theory is the most likely for another chunk instances. Logs at the bottom of the lake rot, filling with gas as they decompose. Eventually, the gas is enough to lift the log ever so slightly. The buoyancy then causes the log to accelerate upwards as the water pressure decreases with altitude, launching the log out of the water with a splash, creating a wake and potentially a neck-like protrusion.\n\nWhat puts the nail in the coffin for me is that if Nessie rumors were completely put to rest overnight, entire villages in the area would lose their livelyhood. Therefore, they have a vested interest to keep thorough research away and keep the whole thing under wraps.\n\nThat all said, I'm sure there are all kinds of things in the oceans that we haven't discovered. The giant squid is already such an exciting find, and I'm certain there are other fascinating creatures underwater that we haven't discovered. I just doubt the likes of Nessie or Champ are actual creatures.", "gilded": 0, "created_utc": "1327349048", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "A greentextstory from 4chan about a guy and his cousin who smoked weed, but then the girl actually was the loch Ness monster", "gilded": 0, "created_utc": "1327350182", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "What I think is most likely, seeing as I'm somewhat of a believer, is that there was once a creature there (could be plesiosaurus as I mentioned), which lived while humans existed in the area (about 13.000 years ago). These creatures could have died out anywhere between 500-12.000 years ago, so that the remains would have vanished or been buried deep under the seabed. But humans would still have been around to see them and thus tell the tale of the Loch Ness monster which can easily have survived to this day (due to the scary seamonster-factor). This, as I wrote, seems to me the most likely way of explaining how the legends started without making them untrue. I haven't really studied it or anything, I've been to some museums in the area, but since I like some mystery, I choose to believe that humans (and machines) can error, leaving just a smidgen of a possibility that there is a Loch Ness monster today. Weeee!", "gilded": 0, "created_utc": "1327350922", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "'bout tree fiddy", "gilded": 0, "created_utc": "1327351386", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "&gt;It's not what you believe in, it's whether you afford others the right to disagree with you.\n\nWell, you've articulated one side of this debate effectively - but to what degree would you afford a dolphin-spirit-channeller the right to your vote?  \n\nTo what degree would you afford a job interview to someone who believed Elvis was still alive?  \n\nTo what degree would you afford the right to include a chapter about the Loch Ness monster to your kid's public school?\n", "gilded": 0, "created_utc": "1327356613", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "&gt;The problem with religion has never been belief. The problem has always been narrow-mindedness.\n\nSays you. You realize that there are people who believe in ESP? Truthers, psychics, witches, Loch Ness monster? Demonology, numerology, homeopathy?\nThe reason we deny all of these things is because we think they're wrong. Religion is exactly the same.\n\nOpen-mindedness is not thinking that everything is equally right, it's giving everything a chance.", "gilded": 0, "created_utc": "1327357265", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Bout tree fiddy.", "gilded": 0, "created_utc": "1327357780", "subreddit": "funny", "score": 15, "controversiality": 0}
{"body": "DAMN YOU, LOCH NESS MONSTER!!!\n\n*also, [/r/ragenovels](http://www.reddit.com/r/ragenovels/)", "gilded": 0, "created_utc": "1327358567", "subreddit": "fffffffuuuuuuuuuuuu", "score": 4, "controversiality": 0}
{"body": "\nThe loch ness monster. People say it doesn't exist, but would you go swimming in that lake?", "gilded": 0, "created_utc": "1327359956", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Worth about tree fiddy", "gilded": 0, "created_utc": "1327360427", "subreddit": "gamecollecting", "score": 2, "controversiality": 0}
{"body": "GODDAMN LOCH NESS MONSTER", "gilded": 0, "created_utc": "1327361367", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "&gt; loch ness monsters asking you for $3.50\n\nFTFY", "gilded": 0, "created_utc": "1327362043", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "The Loch Ness monster,even though there is actual evidence that it does not exist and [this](http://upload.wikimedia.org/wikipedia/en/7/79/Lochnessmonster.jpg) photo was staged", "gilded": 0, "created_utc": "1327367205", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "YOU PAID ABOUT TREE FIDDY?", "gilded": 0, "created_utc": "1327367738", "subreddit": "WTF", "score": 7, "controversiality": 0}
{"body": "Definitely Nessie.", "gilded": 0, "created_utc": "1327367823", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "YAH MAN ABOUT TREE FIDDY.", "gilded": 0, "created_utc": "1327368364", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "Loch Ness Monster.", "gilded": 0, "created_utc": "1327370537", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "'Science' is defined by making predictions, testing whether the prediction is true or false in an unbiased way, and recording those results as objectively as possible. 'creation science' and the Loch Ness monster are by definition NOT science, and therefore should not be taught in a science class. People can learn about creation science and the Loch Ness monster on their own time if they want to. \n\nIf the someone believes something they can make a case for that, and all they can do is hope that people will be convinced (after all, everyone is the arbiter of his/her own reality, etc etc). If this person thinks that a person should be legally/morally required to come to the same conclusions as they have, this is intolerance, no matter who's doing it.  \n\nAnd for some reason, I'm really enjoying the Elvis bit of our debate-- How would someone's beliefs about the endurance of Elvis's even come up in a job interview? What is this hypothetical Elvis-conspiracy-theorists reasons for believing this? Is this person otherwise completely normal and intellectually functional, or does he have more idiosyncrasies? This is relevant to the debate, actually.", "gilded": 0, "created_utc": "1327372651", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "&gt;'creation science' and the Loch Ness monster are by definition NOT science, and therefore should not be taught in a science class.\n\nOK.\n\n&gt;If the someone believes something they can make a case for that, and all they can do is hope that people will be convinced (after all, everyone is the arbiter of his/her own reality, etc etc). If this person thinks that a person should be legally/morally required to come to the same conclusions as they have, this is intolerance, no matter who's doing it.\n\nSo uncontroversial I literally don't see why you wrote it.\n\n&gt;And for some reason, I'm really enjoying the Elvis bit of our debate (...)This is relevant to the debate, actually.\n\nNot sure if or why you're trolling me here.  My only point about Elvis was that the belief is a strong indicator of poor thinking.  If you actually do have something further to say about it, feel free to fill in all the details in the way most suited to your argument.\n\n***\n\nI don't feel like you're addressing my last charge: that not only are there no atheists saying \"religious people are required to come to atheist conclusions\", there is no distinction to be made between \"belief that someone is wrong\" and \"belief that someone shouldn't be allowed to be wrong.\"\n\nThe only reason there might seem to be a difference is if the conclusion to be reached doesn't matter: as soon as it does matter, your tolerance-of-other-people's-wrongness evaporates: should I be free to believe that driving my car into an orphanage won't injure anybody if I hold my breath while doing it?  Should I be free to poison the water supply if I believe it will only kill the guilty?\n\nEDIT: last sentence: Should I be free to believe that my poisoning the water supply will only kill the guilty?\n\n", "gilded": 0, "created_utc": "1327373732", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "There are unconfirmed reports. It's kind of like Sasquatch, or the Loch Ness Monster. ", "gilded": 0, "created_utc": "1327373814", "subreddit": "MkeBucks", "score": 1, "controversiality": 0}
{"body": "Turns out she's actually the Loch Ness monster.", "gilded": 0, "created_utc": "1327374825", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "That's a running joke in the show that he's obsessed with Nessie", "gilded": 0, "created_utc": "1327383350", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "bro that is a loch ness monster", "gilded": 0, "created_utc": "1327384048", "subreddit": "fffffffuuuuuuuuuuuu", "score": 5, "controversiality": 0}
{"body": "My wife is agnostic and wants to let our kids figure out what religion to pick. I told her hell the fuck no. I will teach my kids there are no gods, ghosts, spirits, souls, Jesus, Santa, bigfoot, loch ness monster, etc", "gilded": 0, "created_utc": "1327408715", "subreddit": "atheism", "score": 7, "controversiality": 0}
{"body": "Sadly it's a valid, if theoretical, concept; an outgrowth of the idea of \"tulpas\"... the idea that enough people's belief in something nonexistent (Loch Ness monster, Bigfoot, Chupacabra) gives it form and substance.", "gilded": 0, "created_utc": "1327412141", "subreddit": "nosleep", "score": 2, "controversiality": 0}
{"body": "I think the Loch Ness Monster would be a lot less than .33 Jesii.  Other than no credible physical evidence for its existence, it's basically a pretty plausible animal.  It's not like anyone's claiming it can fly or perform miracles or anything.", "gilded": 0, "created_utc": "1327414183", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Who says the Loch Ness Monster can't do those things? He IS the chosen prophet of the Flying Spaghetti Monster, after all.", "gilded": 0, "created_utc": "1327420510", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "&gt; On the \"yummy-yum-yum parasites\" and \"wooshy hot stuff science\", that was an example that principles, concepts and ideas can be called whatever you want so that you can sleep at night, naw mean?\n\nExcept, no. Not at all. By that very same logic, I can argue the existence of Unicorns and Loch Ness monsters. Your argument is flawed at it's base. Sorry. There's a Penn Jillette quote that floats around on this subject. \n\n&gt; The thing is that these \"god(s)\" exist with and without this abilities. Its the ultimate principle of life which is the balance between everything and nothingness. Im using the term \"God\" because it refers to the ultimate end of that spectrum, which is everything. \n\nThis entire paragraph is junk. It means absolutely nothing, in regards to the conversation. You can just as easily say that my girlfriend's blowdryer holds the secrets to the universe inside it. Bluntly, you're talking hippy nonsense.\n\n&gt; So wanna know what god is? The personification of the very force that holds the fabric of the universe together. The ultimate form of consciousness that is omnipotent without being a living entity. Its what allows a tree to make a sound falling in a desolate forest, with nothing to hear it. \n\nMore hippy nonsense. Someone else in this thread is arguing for scientists' usage of mind-altering drugs. You've beaten them to the punch. PS, you're still describing a \"deist\" position, which is worth exactly nothing, outside mental masturbation. \n\n&gt; If you recall from the video, one of the guys mentioned how atoms behave in a way where they act as waves and particles at the same time. This means they are everywhere and no where at the same time. So what keeps it all aligned and not creating chaos so that we as living, conscious, beings can understand it? Whatever the hell that thing is that people are calling \"God\".\n\nActually no, it's called the precursors to what we now study/understand as Quantum Physics/Mechanics. Adding a stupid \"supernatural\" label to it does nothing. There's no reason to even attempt to call it \"god\", and doing so adds a bunch of attachments that don't belong anyways. Scientists scoff at the idea of the \"god particle\" as it stands now (calling it that, not it's existence). It's a mockery.\n\n &gt; So these arent loopholes. Loopholes only exist in politics\n\nThis is a demonstrably false statement, as I've shown throughout the thread, and via my responses to you. Your definition of \"god\" is laughable at best. You've poorly described someone/thing outside normal, logical realms, and therefore easily dismissed as having zero affect on the daily lives of humanity. Replace \"god\" in everything you've said with \"flying orange super-hippos\". You've described exactly nothing but a foolish idea.\n\n", "gilded": 0, "created_utc": "1327424602", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "[**i only got tree fiddy**](//#magnets)", "gilded": 0, "created_utc": "1327424676", "subreddit": "circlejerk", "score": 26, "controversiality": 0}
{"body": "You rank the young earth hypothesis as more probable than both jesus *and* the loch ness monster?", "gilded": 0, "created_utc": "1327427247", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Read it again; it's not a measure of probability, it's a measure of bullshit. YEC is much more unbelievable than Jesus. Nessie is slightly more believable (but still bullshit) since there's at least crappy picture \"evidence\" of her.", "gilded": 0, "created_utc": "1327427652", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "It was about that time that I realized that she was three stories tall and a crustacean from the paleolithic era", "gilded": 0, "created_utc": "1327435740", "subreddit": "fffffffuuuuuuuuuuuu", "score": 3, "controversiality": 0}
{"body": "I said \"we'll take a box of the ramen. How much will that be?\" Well she looked at me and said \"That'll be about tree fiddy.\" Well it was about this time I noticed that this girl scout was about 8 stories tall and was a crustacean from the protozoic era!", "gilded": 0, "created_utc": "1327445765", "subreddit": "AdviceAnimals", "score": 14, "controversiality": 0}
{"body": "I know it's not directly related to an internet short film, but it's still something I hope you find and watch.\n\n\"The Ballad of Nessie\" was an animated short that was played before the new Winnie the Pooh movie, and it had one of the most wonderful messages I've ever seen in an animated short.  I can't seem to find it in full, I can only seem to find the trailer on youtube. But if you do end up watching it, on DVD, or online, I really hope you enjoy it.", "gilded": 0, "created_utc": "1327446950", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I was expecting it to ask for tree fitty.", "gilded": 0, "created_utc": "1327450920", "subreddit": "WTF", "score": -1, "controversiality": 0}
{"body": "This dude gets it. I was interested in ghost hunting and paranormal investigation back in high school when the only supernatural programing on TV was a block of programming on Discovery on weekends and they usually rotated the same 10 or so shows about the Loch Ness Monster, ghosts, UFOS, and Bigfoot. Well, that and The X-Files! Most of my information came from the Internet or scouring the school library for any book I could get my hands on.\n\nWhen friends and I went out or researched stories and legends, it was for fun and to sate curiosity. Running around cemeteries at night, spooking ourselves, and discussing the \"big questions\" about life made for some of the best nights of my life. \n\nNow you can't go two fucking feet in this field without running into a pack of mooks with a night-shot camera and a home silk-screening kit claiming to be a \"professional paranormal investigation team\". All they're interested in is trying to hock books, Internet radio shows, and gunning for a prime time slot on A&amp;E or Syfy. ", "gilded": 0, "created_utc": "1327452715", "subreddit": "Paranormal", "score": 2, "controversiality": 0}
{"body": "Loch Ness Monster", "gilded": 0, "created_utc": "1327452876", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "At least there are pictures of bigfoot and the Loch Ness Monster. Pics or no deity!", "gilded": 0, "created_utc": "1327453312", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I use that same setup, with exception of nessie's nine iron.\n\nHead full of steam, summer shades, bombinomicon, peg leg, sticky jumper, and nessie's nine iron. Premium trolling if you get plenty of kills.\n\nI change my name to \"The Legend of Bagger Vance\" in these situations.", "gilded": 0, "created_utc": "1327465921", "subreddit": "tf2", "score": 4, "controversiality": 0}
{"body": "I'd say that theory is 0.3 jesuses, roughly equivalent to a Loch Ness monster", "gilded": 0, "created_utc": "1327468669", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Um... doesn't believe in *any* unexplained or supernatural phenomena?  Not only God, but also bigfoot, leprauchans, the Loch Ness monster?\n\nI guess that would make me one.", "gilded": 0, "created_utc": "1327475952", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I gave the loch ness monster about tree fiddy.", "gilded": 0, "created_utc": "1327477831", "subreddit": "AskReddit", "score": 366, "controversiality": 0}
{"body": "Tree Fiddy", "gilded": 0, "created_utc": "1327478166", "subreddit": "AdviceAnimals", "score": 0, "controversiality": 0}
{"body": "Goddammit woman! I dun told you not to give dat lock ness monster no tree fiddy!", "gilded": 0, "created_utc": "1327479451", "subreddit": "AskReddit", "score": 21, "controversiality": 0}
{"body": "goddamn loch ness monster", "gilded": 0, "created_utc": "1327482595", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Seriously. I mean, you give the loch ness monster tree fiddy, and what do you think he's going to do? Stop coming around and asking for more? ", "gilded": 0, "created_utc": "1327482747", "subreddit": "AskReddit", "score": 8, "controversiality": 0}
{"body": "Nice try, lochness monster! You ain't getting my tree fiddy!", "gilded": 0, "created_utc": "1327483219", "subreddit": "AskReddit", "score": 9, "controversiality": 0}
{"body": "Well it was about that time I realized the girl scout was about 8 stories tall and was a crustacean from the paleolithic era!", "gilded": 0, "created_utc": "1327484614", "subreddit": "AskReddit", "score": 9, "controversiality": 0}
{"body": "It was around this time that I noticed the guard was twelve stories tall and had a long serpentine neck.\n\nAnd then he asked me, \"I need about tree fitty.\"", "gilded": 0, "created_utc": "1327490760", "subreddit": "skyrim", "score": 7, "controversiality": 0}
{"body": "I can only talk about the best $3.50 I spent. It was buying girl scout cookies from this cute girl scout when I realized, that's no girl scout- that's a paleolithic monster- the god-damn loch ness monster.", "gilded": 0, "created_utc": "1327491484", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I need about tree fitty ", "gilded": 0, "created_utc": "1327492085", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "best money I ever spent was.... about tree fiddy. And with that investment that damn Loch Ness monster left me alone!", "gilded": 0, "created_utc": "1327494361", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I meant about tree fiddy.", "gilded": 0, "created_utc": "1327495242", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "No he meant tree fitty", "gilded": 0, "created_utc": "1327497048", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "can someone please explain to me what this tree fiddy is from.", "gilded": 0, "created_utc": "1327498549", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1327500369", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "&gt;How much do you know about Buddhism? Do you know any Buddhists?\n\nYes. I live in Southeast Asia.\n\n\n&gt;Please explain to me with empirical evidence how science has disproven reincarnation.\n\nPlease explain to me with empirical evidence any indication reincarnation *does exist*. \n\nThe burden of proof is on those asserting a claim. Not the other way around. That which can be asserted without evidence can be dismissed without evidence. \n\nFor that matter, please explain to me with empirical evidence that there not currently rainbow-farting unicorns in orbit around Neptune. \n\n&gt;Personally I don't believe science can prove or disprove whether or not the body has a soul, if the soul is reincarnated in another being, or the existence (or lack there of) of a God or any spiritual being.\n\nIt can't. Here is why. \n\nThere are two people. One believes the Loch Ness monster is real, one does not. \n\nThe first says, prove there is no monster. So the unbeliever goes out with sonar and divers and scans the lake. \"See,\" he says, \"no monster.\"\n\nThe second replies \"you didn't look hard enough.\" So the first goes back to the lack, and drains it completely. \n\n\"See!\" The unbeliever says, pointing to the empty lake bed. \"No monster.\" \n\n\"Ah,\" says the believer, \"but the Loch Ness monster is invisible.\"\n\n\n&gt;Things must exist already for science to be able to understand them.\n\nWhereas things need not exist at all for religion to claim to understand them. And use this as a basis for authority. \n\n&gt;The interpretation of ancient religious text into contemporary surroundings, does not work. The hermeneutics is flawed and it pisses people off, because it makes those who don't look at it objectively unbelievably ignorant. Predominantly with anybody who follows a Judeo-Christian based religion.\n\nI have no idea what you're saying here. Care to rephrase it? \n\n&gt;Buddhism on the other hand, though with many similarities of moral beliefs to Judeo-Christian ideas, has one importance difference: they do not believe in a God. Instead they have ideas of karma and reincarnation. Good deeds and leading a morally appropriate life allow you to transcend into a better being upon your reincarnation.\n\nWhat is your point? **You do realize there have been and are buddhist terrorists right? Buddhist authoritarian states? Its no different in substance from other religions. Just a different coating.** \n\n&gt;Science can't prove or disprove that or whether or not there is a God. Aristotle tried with his five arguments about the \"Prime Mover\". Mainly - there can be no infinite regression in existence - It's logical, but not empirical.\n\nScience doesn't need to. All science asks is \"Is there evidence in support of something?\" If so, then actions can be based upon it. If there is no evidence, then action based upon pure faith is probably a bad idea. \n\n&gt;I think this is what the Dali Lama meant by his response \"mighty hard to disprove\". Buddhists are very accepting of facts (I know several devout Buddhists and live in a Buddhist country).\n\nI'm sure this is exactly what he meant. And don't you see the sick beauty in this? All the authority this man holds is founded upon his statement that the Invisible Loch Ness Monster is real and go ahead and try to prove me wrong. \n\n\n&gt;When it comes down to it any religion's basic function is to instil civility and morality into an individual.\n\n....wow\n\nNo, the basic function of any religion is the survival of that religion. Along with the search for more influence. And if you want evidence of this, I'd point to the strong correlation that the less religious an individual is, the less likely he is to commit a crime. The most atheistic nations are have the lowest crime rates.\n\nReligion does not instill morality. It either builds upon what society has already given the individual or (quite frequently) does the exact opposite and influences people to do horrible things. \n\n&gt;But these concepts are so fucking twisted now (especially with Christianity) that it does the opposite. \n\nNo. This is how it always has been. If anything, its better now than it was in the past, when religion had more control. \n\n&gt;The bible is mythic literature... and like any mythic story, it has a moral that teaches us a lesson through the actions (and consequences of those actions) of the protagonist. You cannot take a mythic story verbatim and quote it as truth. It is a gross misuse of the function of the text and it fucks people up.\n\nNo. What fucks people up is subscribing any power to the bible above that of a normal book, not failure to \"interpret it correctly.\" \n\nRead the thing. There are countless passages that offer no other interpretation beyond the subjugation of woman, brutality, and the slaughter of non-believers. \n\n&gt;I don't think any religion is opposed to science nor science opposed to any religion.\n\nNow I think you're trolling me. Condoms in Africa? Stem Cell Research? Creationism? Global Warming? Muslims killing teachers for their failure to follow the lessons of the Koran? The Indian Caste System? (wonderful use of reincarnation there btw)\n\nReligion \"knows\" the Truth. Science tries to discover the truth. \n\nReligion is a system of faith. Science is a system of observation. \n\nAny time you create an institution that derives its power from a monopoly on an truth, and that truth is not derived from reality, you are going to run into serious problems. ", "gilded": 0, "created_utc": "1327501429", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "I paid about 3.50 to make the Loch Ness monster go away.", "gilded": 0, "created_utc": "1327502097", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Ha, what about in Joshua where he prayed and \"stopped the sun from moving across the sky\"  \nShouldn't it read \"stopped the earth from spinning\" which would also kill us all.  \n\n[Joshua 10-13](http://bible.cc/joshua/10-13.htm)\n\n**Edit** Like CyLLama mentions below this is laughable.  \nI would work more on asking for \"credible sources\" but that might start a different war. I would still name a few problems w/ this source but maybe work on the fact that his site http://www.bibletoday.com/ is biased/unprofessional/amateur/silly and ask for some \"science\" thats actually taught in science classrooms or written by scientists. Not something on the same level as a geocities loch ness monster fan site.\n\n**edit 2** and it often goes this way so i'll comment on it.  \nScience is something that can be tested and repeated. Science has helped cure and prevent disease. put your 10 best priests vs the worlds top 10 scientists/doctors and lets have a miracle off. You say you don't believe in science? (well first, stop trying to use science to prove god then) Then stop using your iphone, or dont get an MRI, and stop driving your car. You could say god inspired them or saved you through your doctor but what if your doctor is hindu? What about great inventions like Parachutes, shampoo, windmills and many modern surgical tools that were invented by muslims?  \nDon't use my wording as its a little forward but those are points you might want. Its aggravating when theists try to use science and discredit it at the same time. Especially when they are a forensic police officer, putting people in jail based on scientific evidence but dont believe in science like carbon-dating. ಠ_ಠ", "gilded": 0, "created_utc": "1327502103", "subreddit": "atheism", "score": 27, "controversiality": 0}
{"body": "$3.50 on helping out that loch ness monster.", "gilded": 0, "created_utc": "1327503742", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "I need tree fiddy!", "gilded": 0, "created_utc": "1327503922", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I was leaving the corner store one day and my friend walked up to me. He started talking about how his day was going then asked me \"Do you have any money? I need about tree-fitty.\" I asked him what for and he said it was for his new friend. So we went to see his new friend and sure enough, it was the loch ness monster. I said \"Damn you loch ness monster! You aint' gettin' my tree-fitty!\"", "gilded": 0, "created_utc": "1327506952", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "is that the loch ness monster?", "gilded": 0, "created_utc": "1327507287", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt;Do you believe in UFOs, astral projections, mental telepathy, ESP, clairvoyance, spirit photography, telekinetic movement, full trance mediums, the Loch Ness monster and the theory of Atlantis? \n\nAh, if there's a steady paycheck in it, I'll believe anything you say.", "gilded": 0, "created_utc": "1327511782", "subreddit": "DebateReligion", "score": 2, "controversiality": 0}
{"body": "Okay, but I'm gonna need about tree fiddy.", "gilded": 0, "created_utc": "1327514164", "subreddit": "AskReddit", "score": 13, "controversiality": 0}
{"body": "'bout tree fiddy.", "gilded": 0, "created_utc": "1327514317", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "No effort into this one at all...\n\nBesides, it's TREE fiddy", "gilded": 0, "created_utc": "1327514810", "subreddit": "4chan", "score": 1, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1327516829", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Dat wudden no elderly woman you foo! Dat was dat got-damn Loch Ness monster again! Don' be surprised if it come back jus ta hit you up for anudder se'en fiddy.", "gilded": 0, "created_utc": "1327517571", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Get back your goddamned tree fiddy", "gilded": 0, "created_utc": "1327519138", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I just need tree fitty", "gilded": 0, "created_utc": "1327519716", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "heck I'll say it for tree fiddy", "gilded": 0, "created_utc": "1327524084", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I'll give you about tree fiddy.", "gilded": 0, "created_utc": "1327529989", "subreddit": "waterloo", "score": 1, "controversiality": 0}
{"body": "that looks like a creature who wouldn't normally ask for more than tree fiddy.", "gilded": 0, "created_utc": "1327532762", "subreddit": "funny", "score": 15, "controversiality": 0}
{"body": "WELL it was about that time that I noticed that the girl scout was about 8 stories tall and was a giant crustacean from the paleolithic era", "gilded": 0, "created_utc": "1327535087", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "&gt; Now, I believe in God because I choose to believe in him and accept him \n\nI couldn't just decide to believe in the Loch Ness monster one day.  It's impossible.  I could lie about it, and tell others that I believe, but I cannot so simply \"choose\" to believe.  Likewise, if I saw Nessie with my own eyes, I could hardly choose to disbelieve.  How does one *choose* to believe in something?\n", "gilded": 0, "created_utc": "1327545009", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "Tree fiddy.\n\nThat's my final offer, take it or leaf it.", "gilded": 0, "created_utc": "1327545432", "subreddit": "IAmA", "score": 5, "controversiality": 0}
{"body": "Saxxy, Conscientious Objector, Bootlegger, Scottish Handshake, UHHHH, Nessie's Nine Iron, Golden Wrench, Wanga Prick, Unarmed Combat (and Holy Mackerel?)", "gilded": 0, "created_utc": "1327546465", "subreddit": "tf2", "score": 1, "controversiality": 0}
{"body": "About tree fitty", "gilded": 0, "created_utc": "1327547518", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "At least he didn't ask you for tree fiddy.", "gilded": 0, "created_utc": "1327551090", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "CAN I GET ABOUT TREE FIDDY\n\nIN KARMAS", "gilded": 0, "created_utc": "1327555448", "subreddit": "circlejerk", "score": 3, "controversiality": 0}
{"body": "* Chrome = Rocket ship\n* Firefox = Empire State Building\n* Internet Explorer = Rock concert\n* Safari = Loch Ness Monster\n\nYou fags will argue about anything.", "gilded": 0, "created_utc": "1327555526", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "And in that infinity pool is Nessie.", "gilded": 0, "created_utc": "1327570158", "subreddit": "WTF", "score": -3, "controversiality": 0}
{"body": "Goddamned Loch Ness monster!", "gilded": 0, "created_utc": "1327587938", "subreddit": "guns", "score": 1, "controversiality": 0}
{"body": "54 here. I don't believe in god for the same reason no one believes in unicorns, leprechans, santa claus, the easter bunny, the tooth fairy, Tinkerbell, Thor, the Loch Ness monster, UFOs, and any number of things and entities that grown-ups are simply aware do not exist, and are, instead, constructs of man's imagination.\n\nAs with all of the above, there has been not one shred of reasonable, verifiable evidence put forward that any god exists or has ever existed. ", "gilded": 0, "created_utc": "1327588170", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "god damnit loch ness monster", "gilded": 0, "created_utc": "1327591840", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Gas is about tree fiddy here in Cleveland, I imagine it be less with all the farm land in between Cleveland and Cbus", "gilded": 0, "created_utc": "1327595162", "subreddit": "starcraft", "score": 2, "controversiality": 0}
{"body": "That's when I knew it wasn't no damn Sasquatch that ate my sack lunch, it was that damn loch ness monstah.\n\nSo I says, \"DAMN IT, LOCH NESS MONSTER. WHY DON'T YOU GO AND BUY YO OWN DAMN LUNCH!\" \n\nAnd you know what he says? He looked me in the eye and said, \"I need about tree fiddy.\"", "gilded": 0, "created_utc": "1327596916", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "Your comment falls out of the thread because they were performing a scene from Billy Madison, and thus is getting downvotes, but I had to catch a mouthful of burrito I lost when I read \"tree fiddy\".", "gilded": 0, "created_utc": "1327600131", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1327613344", "subreddit": "AskReddit", "score": 8, "controversiality": 0}
{"body": "at least bigfoot, nessie, and the chupacabra serve some kind of legitimate purpose", "gilded": 0, "created_utc": "1327614721", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "About tree fiddy?\n\nSorry...shameless I know.", "gilded": 0, "created_utc": "1327625042", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "Hey man can I borrow like tree fiddy?", "gilded": 0, "created_utc": "1327628271", "subreddit": "TrueReddit", "score": 2, "controversiality": 0}
{"body": "I need about tree fiddy. (350)", "gilded": 0, "created_utc": "1327629563", "subreddit": "battlefield3", "score": 3, "controversiality": 0}
{"body": ":throws custard pie: at Nessie", "gilded": 0, "created_utc": "1327631111", "subreddit": "books", "score": 2, "controversiality": 0}
{"body": "Really surprised that nobody gave tree fiddy.", "gilded": 0, "created_utc": "1327638762", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "It was pretty much the same deal when I lived in CA, now I live in central FL and finding good weed is like hunting down the loch ness monster", "gilded": 0, "created_utc": "1327639718", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1327639729", "subreddit": "pics", "score": 20, "controversiality": 0}
{"body": "I accept.  \n  \nYou still owe him tree fiddy though.", "gilded": 0, "created_utc": "1327641817", "subreddit": "pics", "score": 8, "controversiality": 0}
{"body": "tree fiddy ", "gilded": 0, "created_utc": "1327645564", "subreddit": "battlefield3", "score": 1, "controversiality": 0}
{"body": "Simple: There is no god. We cannot see a god, touch a god, feel a god, or taste a god. There are no theories which necessitate a god to function. There are no known effects of god on anything, vegetable, animal, mineral, force, or energy.\n\n**There is no God.** If you claim the evidence is still out, then you logically must say the same for unicorns, fairies, the philosopher's stone, the loch ness monster, and Harry Potter.\n\n'Un-Evidence' doesn't exist. There's no evidence that disproves unicorns, there just aren't any fucking unicorns.", "gilded": 0, "created_utc": "1327660767", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "goddamn Loch Ness monster!", "gilded": 0, "created_utc": "1327667388", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Shut up, Nessie.", "gilded": 0, "created_utc": "1327677137", "subreddit": "IAmA", "score": 5, "controversiality": 0}
{"body": "Seems legit, nessi would have asked for tree fitty. ", "gilded": 0, "created_utc": "1327680605", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "I got tree fiddy on it.", "gilded": 0, "created_utc": "1327685384", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "...I need about tree fitty.", "gilded": 0, "created_utc": "1327689971", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "tree fiddy*", "gilded": 0, "created_utc": "1327698491", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "I've done my critical thinking. I've taken classes on religious studies and have considered each of the religions I have studied intently. But, there are very few that do not contradict themselves or seem ridiculous to me. I feel like many people feel that way, which makes it difficult to truly \"understand\" them and not mock them. It's like trying to understand people who believe in the Loch Ness Monster. Religion is believed because people are afraid to die and cease to exist. They crave for there to be more, and they don't like not knowing what's next. I understand it, but I disagree with it.", "gilded": 0, "created_utc": "1327704487", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "That was going to be my big one, too. Not sure if a C-17 is worth more though.\n\nAlso, a 747 retrofitted to carry the Space Shuttle might be worth more, because it was a limited run item.\n\nEDIT: Forgot Clinton's Air Force One. That's gotta be worth tree fiddy at least.", "gilded": 0, "created_utc": "1327708102", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "This is like Winston's belief requirement:\n\nJanine Melnitz: Do you believe in UFOs, astral projections, mental telepathy, ESP, clairvoyance, spirit photography, telekinetic movement, full trance mediums, the Loch Ness monster and the theory of Atlantis? \n\nWinston Zeddemore: Ah, if there's a steady paycheck in it, I'll believe anything you say. ", "gilded": 0, "created_utc": "1327709582", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I'd pay tree fiddy", "gilded": 0, "created_utc": "1327709976", "subreddit": "videos", "score": 113, "controversiality": 0}
{"body": "Nessy! Like the Loch Ness monster", "gilded": 0, "created_utc": "1327714755", "subreddit": "Pieces", "score": 3, "controversiality": 0}
{"body": "Tree fitty.", "gilded": 0, "created_utc": "1327721384", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "oh yeah I met this guy once, he pulled me over for riding my loch ness monster on the highway in space", "gilded": 0, "created_utc": "1327730812", "subreddit": "trees", "score": 16, "controversiality": 0}
{"body": "[Wait, why aren't you allowed to ride your loch ness monster on the space highway?](http://img.ibtimes.com/www/data/images/full/2011/12/09/202526-dumb-rage-face.jpg)", "gilded": 0, "created_utc": "1327736895", "subreddit": "trees", "score": 8, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1327738947", "subreddit": "WTF", "score": 19, "controversiality": 0}
{"body": "Tree fiddy?  Good LAWD that's a lotta money.  ", "gilded": 0, "created_utc": "1327745006", "subreddit": "WTF", "score": 6, "controversiality": 0}
{"body": "You gave that gawd damn lock ness monster tree fitty?", "gilded": 0, "created_utc": "1327749778", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "I just need...about tree fitty. ", "gilded": 0, "created_utc": "1327765324", "subreddit": "perth", "score": 2, "controversiality": 0}
{"body": "We're reliving the paleolithic era of creativity.", "gilded": 0, "created_utc": "1327777122", "subreddit": "TrueReddit", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1327778861", "subreddit": "Music", "score": 3, "controversiality": 0}
{"body": "did anyone else read this and expect it to end with the loch ness monster?", "gilded": 0, "created_utc": "1327779035", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "What about if they tip you tree fiddy?", "gilded": 0, "created_utc": "1327782527", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "The former. I thought of the username back when I was ~10 while I was watching \"Scooby Doo and the Loch Ness Monster.\" Scooby and Shaggy were driving down an old \"rocky road\" while eating rocky road ice cream and singing \"you can take the high road and I'll take the rocky road... rocky road ice cream, that is!\" \n\nIronically, I don't enjoy that flavor that much.\n\nEdit: If you see either \"rockerode\" or \"rockeroad\" it is 99% likely to be me. ", "gilded": 0, "created_utc": "1327783783", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I thought he only had to agree. What about those 1800lawyer dudes who don't get paid unless you do? Well homie here got cause to pay so the po po gonna get his tree fitty too? ", "gilded": 0, "created_utc": "1327790992", "subreddit": "shittyaskalawyer", "score": 2, "controversiality": 0}
{"body": "What's it cost?  About tree fiddy.", "gilded": 0, "created_utc": "1327791926", "subreddit": "WTF", "score": 8, "controversiality": 0}
{"body": "Yeah, ~~$3.50~~ tree fiddy for a box of fucking cereal?!", "gilded": 0, "created_utc": "1327799443", "subreddit": "WTF", "score": -1, "controversiality": 0}
{"body": "it just wanted \"tree fitty\"", "gilded": 0, "created_utc": "1327800746", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "NESSIE!!!", "gilded": 0, "created_utc": "1327807214", "subreddit": "videos", "score": 2, "controversiality": 0}
{"body": "I'm on the of the guilty ones here.  I have been deeply critical of threads I read here about faking the Moon landing (all of them?) and commercial airliners spraying chemicals from 30,000 feet to control us and/or give us diseases.\n\nYou see, I believe that the whole issue of conspiracy investigation is clouded by deliberate disinformation and giving time to ridiculous theories makes it that much easier to dismiss ALL theories by association. \n\nDo you remember the scene in Close Encounters where there is a town meeting being held.  The Richard Dreyfuss character is pressing the government for real information about what he really saw and experienced.  He almost seems to be winning the argument, almost gets some real answers, and then this jackass stands up and starts talking about how he saw the alien ships and he also saw BIGFOOT, too.  And the whole meeting dissolves and the truth remains hidden.\n\nThere are a lot of real legitimate questions to ask about climate change, the food supply, false flag actions that lead us into war, increased government surveillance in the wake of 9-11 and much more.  But then there's this other shit:  the fake Moon landing and how Kubrick actually shot the footage (I guess Spielberg faked the pictures from the Mars rover too).  And chem trails from commercial airliners.  So fucking ridiculous to me - it's like Big Foot and the Loch Ness Monster and the Face on Mars.  It makes us all look like tinfoil hat loonies.\n\nI know this disinformation and the putting forward of outlandish, ridiculous theories is done very deliberately and with very clear intent by those in power who wish to continue to hide the truth.  So use your mind, people, use your head.  EVERYTHING is not a conspiracy but some things ARE and they deserve full attention and focus.  Be sensible.  Use your head.  Don't be a loony.", "gilded": 0, "created_utc": "1327808958", "subreddit": "conspiracy", "score": 4, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1327837838", "subreddit": "movies", "score": 22, "controversiality": 0}
{"body": "I ain't givin' you no tree fiddy god damn loch ness monsta!", "gilded": 0, "created_utc": "1327844826", "subreddit": "movies", "score": 6, "controversiality": 0}
{"body": "&gt;I know there is/isn't a god because\n\nActually, you won't hear the latter part of that much at all. I'm led to believe you don't actually understand what atheism means (which is somewhat disappointing because it's pretty clear in the FAQ)\n\nThe majority of atheists don't argue that they know, with certainty, that god doesn't exist. The existence of a higher power that chooses not to reveal itself to us is definitely a possibility, however unlikely. Our case is simply that there is not enough evidence to support the claim that such an entity does exist. However, in day to day terms of the word 'know', we are much more inclined to say 'there is no god' rather than 'it's a possibility but there is a lack of supporting evidence'.\n\nAnother thing, simply because we do not KNOW, does not mean we can't reject a certain proposition. Honestly, we don't KNOW if there really is a loch ness monster or a big foot. There certainly can be one. But we can still argue with **some** certainty that it doesn't exist based on the lack of supporting evidence.\n\n&gt;Atheism is a belief.\n\nAgain, this is really answered clearly, and much more eloquently in the FAQ. Please, go and have a read. I'm sure you don't categorise your lack of assertion in the existence of a spaghetti monster as a 'belief'.\n\n&gt;What i can't stand is attempting to press your belief on others.\n\nI agree. Others on this subreddit may disagree however\n\n&gt;I believe society should be equal to all, and that religion should be a completely personal thing.\n\nGood man", "gilded": 0, "created_utc": "1327845269", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I said, \"Goddamnit George Lucas whatchu wann go do dat fo?\"\n\nSo HE said, \"Bout tree fiddy.\"\n\n\"Gooooddamnit lochness monster, I told you you ain't gettin no tree fiddy from me. It's that damn lochness monster again.\"", "gilded": 0, "created_utc": "1327851712", "subreddit": "movies", "score": 2, "controversiality": 0}
{"body": "You misspelled \"tree fiddy\" as \"13\"", "gilded": 0, "created_utc": "1327856571", "subreddit": "movies", "score": 1, "controversiality": 0}
{"body": "I aint giving you tree fiddy you goddamn loch ness monster!", "gilded": 0, "created_utc": "1327857594", "subreddit": "movies", "score": 2, "controversiality": 0}
{"body": "\"Don't be a loon\" is good advice, to be sure. But the nature of the conspiracy theory is that nothing comes from official channels. This is a very wide road.\n\nAdd to that that what *does* come from official channels is censored and now you've got the added restriction that you can't say that any conspiracy theory is an outright falsehood, because then you're simply part of some disinformation campaign.\n\nIt's like the time I did my community service for a DUI at an alcoholics-anonymous place. You can say you're not an alcoholic, but then you're simply in denial, that's all.\n\nI myself prefer people to sound like loons than miss an idea or a concept, and I get MANY of them from r/conspiracy. For which I am grateful.\n\nFor example, the idea that some but not all of the moon landings were faked, because the aliens that run the secret base on the far side made it clear that we are not welcome there.\n\nIs it true? It would explain a lot of things! But can it never be said to be \"loony\"? No, and I'm comfortable with that.\n\nThe chemtrails, in my opinion, is a bit \"loony\" as you say, because there are much easier ways to poison us. Easier in the sense of energy efficiency and in avoiding detection. \n\nPlus, if we're embracing the other conspiracies, there's a lot more air travel. So we have mutual inclusions and exclusions of conspiracy theories.\n\nBig foot is one that I used to believe was possible, but it's been debunked too many times to remain credible. It now seems to have been a Jungian concept the whole time. A Jungian archetype.\n\nBut I don't mind hearing and reading about them. I think the Universe is a lot more interesting.\n\nDid you know that there's a theory that the Loch Ness monster is the ghost of a Stegosaur? It was the first time it had ever crossed my mind that non-humans could leave ghost-like energies. I like that idea. The truth of it is not exactly relevant, even though Truth is what I'm after, I know from experience that Truth is much stranger than fiction.", "gilded": 0, "created_utc": "1327862755", "subreddit": "conspiracy", "score": 4, "controversiality": 0}
{"body": "I really for the most part agree with you. But the novelty of Crouching Tiger has worn and Shawshank just looks dated. I still watch and enjoy SR a couple times a year but the quality just doesn't seem to stick even though I am a big Tim Robbins fan. Opinion of course and I would still recommend it as well.\n\nI would be surprised if people are still watching Iron Giant fifty years from now. I bet you tree fitty. ", "gilded": 0, "created_utc": "1327868999", "subreddit": "movies", "score": 2, "controversiality": 0}
{"body": "When did they go from $3.50 to $4? The Loch Ness Monster bit on South Park isn't relevant anymore?", "gilded": 0, "created_utc": "1327873387", "subreddit": "todayilearned", "score": 7, "controversiality": 0}
{"body": "tree fitty", "gilded": 0, "created_utc": "1327887669", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "'bout tree fiddy", "gilded": 0, "created_utc": "1327901011", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "But he only wants tree fiddy!", "gilded": 0, "created_utc": "1327912568", "subreddit": "nosleep", "score": 2, "controversiality": 0}
{"body": "Never give that succubus her tree fitty.", "gilded": 0, "created_utc": "1327925818", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "NO, Loch Ness Monster.", "gilded": 0, "created_utc": "1327932866", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "[Ew...send this Nessie back to the Loch.](http://kaylacruz.net.nyud.net/victoria/Bath/28dec05b%20096.jpg)", "gilded": 0, "created_utc": "1327941829", "subreddit": "opendirectories", "score": 13, "controversiality": 0}
{"body": "I think the Loch Ness Monster already fulfills this role.", "gilded": 0, "created_utc": "1327956756", "subreddit": "skeptic", "score": 3, "controversiality": 0}
{"body": "i'll give ya tree fiddy", "gilded": 0, "created_utc": "1327958115", "subreddit": "gaming", "score": 8, "controversiality": 0}
{"body": "Oh I'm sorry, did humans not originate in Africa and migrate into the Middle East, and from there spread all over the Eurasian continent before the Asians crossed into NA and then SA or not?\n\nIf not, where did humans originate? The moon, perhaps?\n\nI wasn't associating race, I was associating the general genomes of the races as the migrated during the paleolithic era.\n\nhttp://en.wikipedia.org/wiki/Early_human_migrations\n\nIt isn't really about race, race is the easiest thing to describe here. \"Similar\" people?\n\nEdit: Perhaps I should mean \"Humans with ancestors who lived for a substantial amount of time in the northern hemisphere during paleolithic era\" instead of listing the races who had ancestors who lives for a substantial amount of time in the northern hemisphere during paleolithic era?", "gilded": 0, "created_utc": "1327962275", "subreddit": "SRSDiscussion", "score": 1, "controversiality": 0}
{"body": "&gt; *Evidence is: \"that which tends to prove or disprove something; ground for belief.\" There is nothing about evidence that requires only physical, testable, repeatable scientific evidence.*\n\nThat is one carefully selected definition of evidence. By that definition, you are correct, but it allows for far too much wiggle room and equivocation. For instance, witness testimony would qualify.\n\nThis is not the definition of evidence to use when attempting to prove something exists, else we'd have to accept Bigfoot, fairies, and the Loch Ness monster as entities for which there is evidence. For that reason, I propose this definition instead: \"The available body of facts or information indicating whether a belief or proposition is true or valid.\"\n\nThe reason I prefer this definition is that it makes clear the distinction between **fact** and **proposition**. The First Way is a proposition, an argument, and it employs supposed facts and observations in its support. It is not evidence in and of itself, any more than the argument I am using right now is evidence in favor of itself. Depicting an argument as evidence in favor of its own conclusion is pure circular logic, along the lines of:\n\n* \"This is an argument in favor of the Flying Spaghetti Monster.\" &lt;-- (This is evidence that the Flying Spaghetti Monster exists)\n\n&gt; *The demand for physical evidence for a being that is purported to be nonphysical is a category error. If you retort that a non-physical being who interacts with the world should be detectable through physical means, you are right and the First Way begins with that.*\n\nThere are two problems here.\n\n1. A nonphysical entity interacting with the material world would, as you say, generate measurable effects on the physical world. If it did not, there would be no way to tell the difference between a universe with nonphysical entities and one without, rendering the proposed entity moot. But the First Way does not begin with that. There is nothing about \"things change\" that implies interaction by a nonphysical entity.\n2. And of course, if the nonphysical entity does not interact with the physical world, then you are left with an entirely inferred being, for whom any attempt to establish an empirical basis of belief automatically results in a contradiction.\n\n&gt; *You've offered reasons against those, which is fine, but there is a huge difference between saying \"the evidence you've presented fails for reasons XYZ\", and \"there is NO evidence AT ALL.\" The First Way is evidence, because it is \"that which tends to prove or disprove something; ground for belief.\"*\n\nSee my reasoning for a more precise definition of evidence above. Thomism isn't evidence in support of itself.\n\n&gt; *The only observation is that things change. The rest is pure reasoning. The reasoning may be flawed, but it is a mistake to think of it as a competitor to physics.*\n\nI really don't think that's true. The division you like to establish between physics and metaphysics is invalid in the context of Thomas' arguments, because they predate any such division. Differentiation between physics and metaphysics is a modern phenomenon, one Thomas himself would not accept. He believed he was accurately arguing for the theistic nature of the world. He believed his natural philosophy was properly informing his theistic philosophy. The reasoning might actually be valid, but the presuppositions it relies on are not, because -- as I have pointed out repeatedly -- the natural philosophy informing his theism was **wrong**. \"Things change,\" as he perceived them to, is not actually true, and is indefensible.\n\nThere's more I'd like to answer here, but you'll have to wait. RL calls. :)", "gilded": 0, "created_utc": "1327970889", "subreddit": "DebateReligion", "score": 2, "controversiality": 0}
{"body": "&gt;1- Isn't everybody really agnostic?\n\nNo.There are fundamentalists who don't just \"believe\" there's a god, they KNOW God. They'd sooner doubt their own existence than God's.\n\n&gt;2- Would you people and their beliefs (or lack thereof) bother you less if they were just up front about this?\n\nMost people are upfront about what they believe, or don't believe. At least on this forum.\n\n&gt;3- Why the hell aren't they up front about it?\n\nI don't believe in ghosts or gods or unicorns or the loch ness monster or that aliens are abducting Americans from their homes to conduct anal probes on them before they are re-released. Technically, I have to say I'm \"agnostic\" in the sense that I can't prove that aliens aren't abducting people for their anal probes, but I sure won't believe those stories without any evidence. I don't feel any need to be any *more* up front about this bullshit that people are asserting with no supporting evidence. ", "gilded": 0, "created_utc": "1327971870", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "'Bout tree fiddy.", "gilded": 0, "created_utc": "1327976866", "subreddit": "Dallas", "score": 3, "controversiality": 0}
{"body": "Probably dating that goddamn loch ness monster.", "gilded": 0, "created_utc": "1327977569", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "'bout tree fitty", "gilded": 0, "created_utc": "1327978695", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Is that Nessie?", "gilded": 0, "created_utc": "1327985187", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "widowmaker, sun on a stick, sharpened volcano fragment, the original, nessie's nine iron, l'etranger, bootlegger\nhttp://steamcommunity.com/profiles/76561198047094570/ ", "gilded": 0, "created_utc": "1327986733", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "loch ness monster!", "gilded": 0, "created_utc": "1327987289", "subreddit": "poop", "score": 1, "controversiality": 0}
{"body": "i need about tree fiddy.", "gilded": 0, "created_utc": "1327996712", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "TREE FIDDY.", "gilded": 0, "created_utc": "1327997235", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I'll give you about tree fiddy for it.", "gilded": 0, "created_utc": "1328009477", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "i will trade an ubersaw and splendid screen for a tomislav and nessie's nine iron", "gilded": 0, "created_utc": "1328018418", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "ill give you tree fitty", "gilded": 0, "created_utc": "1328019899", "subreddit": "filmmaking", "score": 2, "controversiality": 0}
{"body": "&gt;For instance, witness testimony would qualify.\n\nWitness testimony is evidence. It just isn't scientific evidence. But both Witness testimony and scientific evidence are Bayesian evidence, which is what all evidence is.\n\n&gt;Bigfoot, fairies, and the Loch Ness monster as entities for which there is evidence. \n\nThere is evidence for the existence of those. It just isn't sufficiently strong that we conclude it is likley they exist.\n\n&gt;\"The available body of facts or information indicating whether a belief or proposition is true or valid.\"\n\nAnd if some one tells you \"I saw big foot yesterday\" have you not gained information?", "gilded": 0, "created_utc": "1328021598", "subreddit": "DebateReligion", "score": 1, "controversiality": 0}
{"body": "I would like the Half-Zatoichi, Original, Nessie's Nine Iron and Cow Mangler 5000. I am already in your friend list. Message me when you ready.", "gilded": 0, "created_utc": "1328024258", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "i dont have no goddam tree fiddy", "gilded": 0, "created_utc": "1328025836", "subreddit": "filmmaking", "score": 1, "controversiality": 0}
{"body": "It's about tree fiddy", "gilded": 0, "created_utc": "1328030545", "subreddit": "atheism", "score": 6, "controversiality": 0}
{"body": "About 12 years old, 1963, me and same age cousin and another kid went camping outside small town in GA.  Cousin and I built up a story to the other kid about a Loch Ness monster being seen in the small pond where we were going to camp.  Cousin and I made a Nessy out of tin foil about 2 feet tall.  Looked like a duck and not Nessy.  Ran trials in bathtub.  Spray painted it green but the paint didn't adhere too good.  We hid Nessy from the other lid in our camping gear.  Aunt dropped us at camping location.  I distracted other kid while cousin went to far side of the lake and launched Nessy.  Cousin rejoined us at which time we just happened to spot Nessy on the far side of the pond.  We convinced other kid that what we were seeing wasn't just two feet but was huge.  It was an optical illusion.  Gave other kid the shotgun and told him to kill Nessy.  He shot it a few times while cousin and I were rolling on the ground laughing.  Other guy got a little pissed about the Nessy prank.\n\nWalked down to the nearby RR tracks.  Duct taped some pennies on the track like pros.  Entire train rolled over them and mashed the shit out of them.\n\nThat evening cousin and I went frog gigging.  Other guy was still pissed about the Nessy prank.  He loaded the shotgun and took a couple of shots at us.  Pellets were raining down on the bushes all around us.  Luck has it we were about out of range of the shotgun.  Cousin and other guy ate frog legs for breakfast.  Nasty.  Aunt picked us up.", "gilded": 0, "created_utc": "1328036418", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!", "gilded": 0, "created_utc": "1328040083", "subreddit": "circlejerk", "score": 4, "controversiality": 0}
{"body": "tree fiddy.", "gilded": 0, "created_utc": "1328042101", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Antarctica is just a myth like the Loch Ness Monster or North Dakota.", "gilded": 0, "created_utc": "1328047617", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Growing karma, want some? Only tree fiddy for a dose ", "gilded": 0, "created_utc": "1328053829", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
