{"body": " OP, I understand you are asking for different New Year's customs as you are not fond of grapes. In my little part of the world it is customary to eat roast pork and sauerkraut on January 1st for good luck in the coming year. \r\n On another note...I have read where people spewed drinks on their monitor from laughing so hard, but believed it was a myth rather like the Loch Ness Monster. I was wrong...(another little piece of my internet virginity taken from me).\r\n Thank you reddeditors for the priceless comments, am upvoting as many as I am able.\r\n A wonderful 2011 to us all!", "gilded": 0, "created_utc": "1293845196", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "tree fitty!", "gilded": 0, "created_utc": "1293870875", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "It's like finding the Loch Ness Monster.", "gilded": 0, "created_utc": "1293919006", "subreddit": "OneY", "score": -4, "controversiality": 0}
{"body": "like the loch ness monster, or that thing in 'the Sphere'? Sadly, no. It's just extremely dull out there.\n\nOne thing which we constantly found annoying, was shrimp. They are the noisiest things in the ocean. Imagine an ocean full of rice-krispies....that's what they sound like. They can completely jam a passive array. Submarines have been known to have to dive, just to clear a layer of shrimp.\n\nI was never on a sub, i was based on a Frigate, which is an anti-submarine platform. i have been on subs for a few days at a time and the lighting on the German boats is the same as the lamps that are used to treat people who suffer from SAD.\n\nFor defence watches and action station, you work 6-on 6-off. It can get pretty bad, but a lot of us would just sleep one of the shifts, and stay awake the other. it helped to maintain a sense of time and the days passing. Mostly, people just sat in the messdeck watching porn and eating pringles from the NAAFI.", "gilded": 0, "created_utc": "1293919352", "subreddit": "IAmA", "score": 5, "controversiality": 0}
{"body": "d'awww it's nessie! :3\n\n...you gonna smoke that shit or what?", "gilded": 0, "created_utc": "1293928027", "subreddit": "trees", "score": 3, "controversiality": 0}
{"body": "Imma need about tree fitty.", "gilded": 0, "created_utc": "1293933431", "subreddit": "trees", "score": 39, "controversiality": 0}
{"body": "Well, it was about that time I begin to get suspicious! I said, \"Chef, my boy, why do YOU need tree-fitty?\" He said, \"My imaginary friend Boo-Boo the dinosaur wants it.\" So I went to my son's room, and sure enough, there was that damn Loch Ness Monster!", "gilded": 0, "created_utc": "1293936095", "subreddit": "trees", "score": 12, "controversiality": 0}
{"body": "You know what that damn Loch Ness Chronster wanted?? \n\nAbout tree fitty.", "gilded": 0, "created_utc": "1293938577", "subreddit": "trees", "score": 9, "controversiality": 0}
{"body": "I said \"we'll take a box of the graham crunch. How much will that be?\" Well she looked at me and said \"That'll be about tree fiddy.\" Well it was about this time I noticed that this girl scout was about 8 stories tall and was a crustacean from the protozoic era!", "gilded": 0, "created_utc": "1293945167", "subreddit": "trees", "score": 11, "controversiality": 0}
{"body": "If you wanna watch I'm gonna need about tree fitty. ", "gilded": 0, "created_utc": "1293947572", "subreddit": "WTF", "score": 7, "controversiality": 0}
{"body": "I just give'd him tree fitty the week befo", "gilded": 0, "created_utc": "1293958148", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "It's actually Nessie the Blunt Ness monster.", "gilded": 0, "created_utc": "1293983952", "subreddit": "Marijuana", "score": 5, "controversiality": 0}
{"body": "Locke Ness Monster*\n\nOl' Nessie Lives!", "gilded": 0, "created_utc": "1293990309", "subreddit": "Marijuana", "score": 1, "controversiality": 0}
{"body": "GODDAMN Loch Ness monster!", "gilded": 0, "created_utc": "1293992308", "subreddit": "WTF", "score": 4, "controversiality": 0}
{"body": "i think i would light it at the tail so i could kiss Nessie for smoke", "gilded": 0, "created_utc": "1293993799", "subreddit": "Marijuana", "score": 2, "controversiality": 0}
{"body": "And Nessie is a Plesiosaur, so Nessie the Blunt Ness Monster is a Bluntosaur Bluntasaurus.", "gilded": 0, "created_utc": "1294022557", "subreddit": "Marijuana", "score": 1, "controversiality": 0}
{"body": "But until we have evidence for it, or a system requires it as a presumption to function, why should we presume its existence? I mean, I could theoretically presume that the human body is inhabited by thousands of souls - millions, in fact - and that only one is in control of that body, by virtue of sheer random luck. But I should not, because it makes no sense to do so.\n\nThere are \"persistent rumors\" about a lot of things. UFOs, the Loch Ness Monster, reptoids, Illuminati, and more. The stakes are also very high there. Should we \"investigate with an open mind\" in each of those fields?", "gilded": 0, "created_utc": "1294032057", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "Wellll it was right about this time I noticed this \"dealer\" was actually an 8-foot tall creature from the late Cretaceous. \n\nI said, \"God dammit Blunt Ness Monsta, I ain't gonna give you no tree fitty!\"", "gilded": 0, "created_utc": "1294032062", "subreddit": "Marijuana", "score": 1, "controversiality": 0}
{"body": "this ancient peruvian sword would easily bring in a quarter mil at auction\n\n\n\n\n\n\nill give ya tree fiddy......", "gilded": 0, "created_utc": "1294039186", "subreddit": "DoesAnybodyElse", "score": 9, "controversiality": 0}
{"body": "Skip the tree fiddy...cut out the middle-man---just give them meth and a Hustler.", "gilded": 0, "created_utc": "1294059679", "subreddit": "DoesAnybodyElse", "score": 1, "controversiality": 0}
{"body": "[fuck](http://www.mediabistro.com/unbeige/files/original/nessie.jpg)", "gilded": 0, "created_utc": "1294092903", "subreddit": "Minecraft", "score": 1, "controversiality": 0}
{"body": "&gt; About [Tree Fiddy](http://www.youtube.com/watch?v=9cn7xfBpZ3M)\n\nFTFY", "gilded": 0, "created_utc": "1294132360", "subreddit": "funny", "score": 66, "controversiality": 0}
{"body": "\"My baby calls me the Loch Ness Monster: two great big humps and then I'm gone.\"", "gilded": 0, "created_utc": "1294164545", "subreddit": "listentothis", "score": 2, "controversiality": 0}
{"body": "Shooter: Cheesecake Shooter - (pineapple juice, grenadine, vanilla vodka - trust me)\n\nShot: [Loch Ness Monster](http://www.drinksmixer.com/drink4877.html)\n\nMixed drink: Manhattan", "gilded": 0, "created_utc": "1294171181", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Nessie?", "gilded": 0, "created_utc": "1294172658", "subreddit": "circlejerk", "score": 1, "controversiality": 0}
{"body": "So it's still a mystery.\r\nI'm thinking Senior Big Foot II and his friend Nessie went hunting with their mind bullets.", "gilded": 0, "created_utc": "1294197302", "subreddit": "skeptic", "score": 2, "controversiality": 0}
{"body": "damn I signed like tree fiddy of those pettitions before I stopped on one mentioning steve jobs.", "gilded": 0, "created_utc": "1294282336", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "tree fitty", "gilded": 0, "created_utc": "1294322553", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "NES: can't remember the name of the emulator I've been using (NESsie sounds familiar, but so does Nesticle)\r\nSNES: ZSNES and Snes9x both work ok\r\n\r\nN64: UltraHLE and Corn both work(I think, my emu box is down at the mo), there may be some more recent ones.\r\n\r\nI don't emulate a Playstation Half, so I can't help you there. They've all got proper Windows UIs so setting them up shouldn't be too hard. There is a Gamecube/Wii emulator out there too, but I haven't tried it.", "gilded": 0, "created_utc": "1294326803", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "Had a few, but this one easily takes the cake.\n\nA friend of mine set me up with one of her girlfriends, with the warning that this girl could be a little crazy (as in, partying crazy and crazy crazy). Me, being a dumbass 22-year old with no real interest in anything but some sex, saw these things as perfectly cool (and in fact, somewhat positive).\n\nSo, I agree to meet this girl. We actually talked before, and she seemed pretty cool; we decided to meet at a bar downtown for a few drinks and some pool, just to keep things low-key.\n\nWell, she gets there, and she's pretty damn good-looking. Not model-hot, mind you, but clearly takes care of herself and has absolutely beautiful eyes. She walks up, smiles, and introduces herself (we'll say \"Mary\" for this story). I grab her a drink, and we immediately hit it off.\nSo, we're playing pool, and \"Mary\" is just pounding drinks. She asked for a jack and coke for her first drink, and just pounded it like a shot. \n\n\"Alright,\" I'm thinking to myself, \"this girl is nuts, I am definitely getting laid tonight.\"\n\nSo, night goes on, and we're both pretty ripped. We decide to go for a walk, and she asked where I parked. I was in a garage near the bar, and she asked to see my car. Needless to say, I obliged.\n\nWe get out there, and just start going to town on each other. She tears (and literally tears, I had buttons pop off) my shirt off, and undoes my pants within about 30 seconds of getting into the car, and just starts going wild on me downstairs.\n\nNow, this girl was a pro. She was after me like she was hungry for it, and I was more than willing to take care of her. So, embarrassingly, I realize that I'm about to cum after just a few minutes of her going down on me. I say fuck it and just go with it, and riiiiight as I'm about to cum, she stops abruptly.\n\nI look down and say, \"What is it?\"\n\nShe looks up at me with those gorgeous blue eyes, and just says, \"I need about tree fitty.\"\n\nWellll it was right about this point that I noticed this bar skank was actually an eight-foot tall monster from the late cretaceous.", "gilded": 0, "created_utc": "1294329662", "subreddit": "sex", "score": 17, "controversiality": 0}
{"body": "Actually, this very argument (more precisely, the variant \"Do you believe the Loch Ness Monster exists in the absence of evidence?  Do you believe God exists in the absence of evidence?  Why did you answer differently to each question?\" put me on the path from middle of the road \"don't know, don't care\" agnosticism to full blown atheism.\n\nI try to be a happy atheist.  As a mathematician, I embrace the power of counterexamples to destroy stereotypes. It's a lot of fun. :)", "gilded": 0, "created_utc": "1294389599", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Forget that \"the one\" stuff, never wait for a girl, Stop tracking the loch ness monster, instead go shoot fish in a barrel", "gilded": 0, "created_utc": "1294391074", "subreddit": "relationship_advice", "score": 22, "controversiality": 0}
{"body": "Nessie", "gilded": 0, "created_utc": "1294422153", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Other than \"you bunch of idiots\" I do not put both statements in the same lump.  \"There is a god and his name is ____\" and \"there is no god\" are not equal.  It's like comparing \"there is a god\" to \"there are no fairies, there are no unicorns, there is no Loch Ness Monster\".  There has been no evidence to believe that there is no god, so to assume that one does not exist is not retarded.  ", "gilded": 0, "created_utc": "1294424880", "subreddit": "atheism", "score": 8, "controversiality": 0}
{"body": "Long time since that Loch Ness monster's been to town.", "gilded": 0, "created_utc": "1294433860", "subreddit": "sex", "score": 1, "controversiality": 0}
{"body": "[NESSIE!](https://secure.wikimedia.org/wikipedia/en/wiki/Loch_Ness)", "gilded": 0, "created_utc": "1294434429", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1294437684", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "tree fiddy?", "gilded": 0, "created_utc": "1294438440", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Goddammit, Loch Ness Monster! I ain't gonna give you no tree fiddy!", "gilded": 0, "created_utc": "1294438487", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Atheism isn't a belief. It's a response to a claim. I can't prove that the Loch Ness monster doesn't exist, but I live my life as though it doesn't until there's good evidence that it does. I respect anyone's right to believe in the Loch Ness monster, but I don't respect that belief. ", "gilded": 0, "created_utc": "1294439875", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "&gt; Take a fish that only something as big as Nessie could eat\n\nI think what you are looking for here is a Yeti - AFAIK, the Loch Ness Monster loves Yeti meat, and is large enough for your purpose.\n\nSo, I think you should start by finding the Yeti, and then proceed to step 2.", "gilded": 0, "created_utc": "1294445742", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "There is no Loch Ness Monster. \n[I know it's an eHow article, but it does disprove it.](http://www.ehow.com/how_2072702_disprove-loch-ness-monster.html)\n", "gilded": 0, "created_utc": "1294448063", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "step 1: drain lake.\nStep 2: Nessie? ", "gilded": 0, "created_utc": "1294457492", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Well, the first problem you run into is the fact that there is no Loch Ness Monster.", "gilded": 0, "created_utc": "1294463343", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Oh don't worry, the dinosaurs are clearly playing the long game. Phase 1 of their plan to reassert dominance is to invade and control Florida. Have you heard anything about the alligators there? Well, they aren't ancient because they're pretty. An alligator is to evolution as Carlos Hathcock was to sniping. They will remain hidden as long as it takes to get a clear shot, then they will explode your head, except in this case, it's more like bite your leg and drown you. Nessie is coming to join them during the invasion of Miami (if you haven't seen that amazing video wherein she reveals this information, search on youtube. it's a little tough to hear with a hydrophone but I am convinced that she says \"I'm gonna take my talents to South Beach.\" Who knows what this cryptic message means, but enjoy the beach while you still can!), where they will surround the city from the Everglades. They have hired mercenaries from the hundreds of thousands of escaped pythons, the result of pet owners with no foresight.", "gilded": 0, "created_utc": "1294552049", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "No, that's not it at all. We know enough things about the world to be certain that god stories are simply and obviously false. Just like we know there are no unicorns, no loch ness monster, etc. These things simply do not and have not ever existed. We know enough about the way things are in the universe to positively rule out some states of affairs and an intelligent god is one of those things that we can dismiss. As for the precise working of the universe black holes, and all that, there are lots of open questions, but a god in the terms that organized religion defines it isn't the answer to any of those questions. \"God\" simply isn't on the table.", "gilded": 0, "created_utc": "1294553245", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "That dog sees something.  My guess is that this picture was taken just seconds before the Loch Ness monster lurched out of the water and bit their heads off.", "gilded": 0, "created_utc": "1294590129", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "NO!\n\nLet me clarify.....\n\n**NO!**\n\nYou will be straining all of that goodness anyway...  leave the goodnessiest of the goods in there.", "gilded": 0, "created_utc": "1294590405", "subreddit": "Cooking", "score": 2, "controversiality": 0}
{"body": "Nessie should work for fox news.", "gilded": 0, "created_utc": "1294666714", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "More like tree fiddy.", "gilded": 0, "created_utc": "1294671490", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "No. These people are absolutely stupid. Humanity will not be going to Mars for anytime soon. Even if we had the fuel, time, and people to go to Mars, do you know what would happen the second people tried moving their limbs on Mars' surface after so long without gravity? Their bones would break in upon themselves, cracking and busting open the minute they tried moving. \n\nIf you *seriously* wanted to go to Mars, we'd have to have robots or some shiz to setup anti-radiation chambers and places where they could get oxygen. Oh, but that doesn't solve you breaking all your bones the second you land. And then, I can only assume once Jupiter aligns close to Mars and shows its big ugly ass that's going to be a huge enough radiation bombardment, and with Mars' atmosphere being probably the weakest in the solar system to actually still sustain clouds, it's not going to filter out shit. \n\nOn a side note and talking about \"exploring\" the gas giants and their moons, that's also not happening for a very , very long time. Exploring the gas giants, specifically Jupiter and Saturn, would be like being in a boxing match with a microwave, infused with every other microwave ever made, while microwaving, using nunchucks on you made out of nuclear fuel rods while occasionally pissing uranium on your face and telling you mid-match he made your boxers out of pure lead and that he slept with your mother.\n\nYou want to go space exploring ? [**MOTHER FUCKING NEPTUNE, BITCH**](http://www.fvalk.com/images/Space/Neptune/NEPTUNE_GDS.JPG) look at that son of a bitch, basically wanna have sex with it just from that picture. Neptune is basically a big, fat, pure ocean made out of water, methane, and ammonia. You think your loch ness monster is the shit? Neptune probably got some methane-pissing shark that feeds on the asteroids of the damned. \n\nNot only that, it's possible Neptune's ocean is filled with *fucking huge diamonds* just floating there like it's nobody's business. You engaged? Take your girlfriend to that gangster out there past Uranus and give her the biggest damn diamond the solar system has ever seen. \n\nThere. End. Stupid Mars aint got nothin' but dirt and wimpy dust-devils.", "gilded": 0, "created_utc": "1294678307", "subreddit": "reddit.com", "score": 8, "controversiality": 0}
{"body": "Did it ask for tree fiddy?", "gilded": 0, "created_utc": "1294723999", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "'ello there, Nessie.", "gilded": 0, "created_utc": "1294763538", "subreddit": "AskReddit", "score": 9, "controversiality": 0}
{"body": "I wish I could help but I'm busy trying to find the Loch Ness Monster.", "gilded": 0, "created_utc": "1294775200", "subreddit": "skeptic", "score": 1, "controversiality": 0}
{"body": "We do need to be careful not to over generalize, I firmly agree. But that's true when referring to any social group, including religions. Atheist, the word, might simply be defined as non-theism. But as soon as you get a group of people together with shared interests, a culture emerges, with shared inside jokes and often, shared ideas (for example, we have a \"community FAQ\" file). Sure, we don't want to over generalize, but since this is a \"community\" there is an \"us\". All communities have disagreements among their individuals. Unless it's community of one, there will always be a diversity of ideas. Hell, there is a diversity of ideas even in an individual. I often find that I disagree with my own ideas, typically, shortly after they happen. Still, in the big picture, this community shares more ideas about how to treat knowledge than say a group that believes in the Loch Ness Monster or \"Big Foot\". Are these exclusive groups? Nope, you can be an atheist that believes that the Loch Ness Monster and Big Foot exists, but suspect that's rare for this community of atheists. The lack of belief in unsubstantiated claims is a very common characteristic of **us**, albeit, not universal.", "gilded": 0, "created_utc": "1294776740", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I'd offer abou'd tree fiddy!", "gilded": 0, "created_utc": "1294780901", "subreddit": "reddit.com", "score": 40, "controversiality": 0}
{"body": "He ain't no goddam Loch Ness monster!", "gilded": 0, "created_utc": "1294783195", "subreddit": "reddit.com", "score": 22, "controversiality": 0}
{"body": ":D [I call her \"Nessie\"](http://i.imgur.com/g2V1Z.jpg)", "gilded": 0, "created_utc": "1294803954", "subreddit": "AskReddit", "score": 8, "controversiality": 0}
{"body": "We all know you spend your time thinking up amazing user names. But at what cost sir? At what cost?!\n\n\n\n\nProbably about tree fiddy.", "gilded": 0, "created_utc": "1294828631", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "\"And I gave him a dollar\"\n\n\"And she gave him a dollar!  God damn Loch Ness monster!\"", "gilded": 0, "created_utc": "1294848693", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "i just give up on talking reason to those people and make up something stupid, like \"i believe the world was created two weeks ago by the loch ness monster\".", "gilded": 0, "created_utc": "1294854445", "subreddit": "atheism", "score": 33, "controversiality": 0}
{"body": "Excellent......   \n\nNessie needs to get used more often in jokes....", "gilded": 0, "created_utc": "1294859362", "subreddit": "atheism", "score": 15, "controversiality": 0}
{"body": "I noticed a loch ness monster in the clouds", "gilded": 0, "created_utc": "1294872800", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt;If you define it as blindly believing something regardless or in opposition to evidence, no.\n\nSo an atheist that believes in UFO's is religious? An atheist that believes in the Loch Ness monster? An atheist that follows a specific political school of thought that according to others has no solid foundations?\n\nThe problem with the \"if you define it\" scenarios is that they can be used to justify anything and are mostly tautological in nature. If you define a Christian not as someone who calls himself a Christian but as someone that follows \"Jesus teachings\" (whatever they might be), then all of a sudden there aren't any bad Christians. Not that everyone that calls himself something should automatically be considered as belonging to it, of course, but neither should the definition be so narrow that only a few selected ones remain.\n\nI find it a weak defence when Christians do it, I continue to find it weak when atheists do it. There seems to be a certain unwillingness to acknowledge that others that agree with us on certain things - at least superficially - are able of committing atrocities, and if they do then they weren't \"really\" atheists/Christians/socialists/capitalists/whatever.\n\nWhat's more, and as I have repeatedly said, just because some atheists in some context behaved a certain way during a specific historical period it doesn't follow that atheists or atheism in itself can be attacked because of it. Historical context is key in all this, there are reasons for the way things happened and I find it unfortunate that people seem to eager in capitalising something that they mostly know little about to gain some quick rhetoric points.", "gilded": 0, "created_utc": "1294880323", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "I posted this joke to the [In response to the bar joke thread... Has anyone here actually thought up an original joke?](http://www.reddit.com/r/AskReddit/comments/bcmex/in_response_to_the_bar_joke_thread_has_anyone/) thread which was me reposing it from the first time I ever wrote it down in the [Reddit, what are your favorite jokes that only people with a better than average fact knowledge or specific \"geek\" knowledge would get?](http://www.reddit.com/r/AskReddit/comments/b56c6/reddit_what_are_your_favorite_jokes_that_only/) thread.  You have to have two kinds of geeky knowledge to get this one.\n\nQ: What did the Loch Ness Monster say when when asked to build a very redundant network?\n\nA: I need about three FDDI.", "gilded": 0, "created_utc": "1294894526", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "Well actually the unicorn and flying horses can be proven or disproven.\nFor instance. Horses are to heavy and not aerodynamic enough to fly, i think it is save to say the power needed to make a horse fly is outside of the reach of evolution/biology. On unicorns, whats to stop us from dna-enginering a horn on the little fucker?\n\nAnother \"proof\" would be the Loch Ness monster. Some scientist calculated that the lake was to small to house enough fish for a monster two to three times the size of a human.", "gilded": 0, "created_utc": "1294940544", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "&gt; Another \"proof\" would be the Loch Ness monster. Some scientist calculated that the lake was to small to house enough fish for a monster two to three times the size of a human.\n\nThat would depend on its metabolic rate.", "gilded": 0, "created_utc": "1294945954", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "When I was taking biology in 2006, I asked my teacher what she thought of the giant squid, she told me she doesn't spend time studying the loch ness monster and other mythical creatures....  I feel she would feel the same way about things like this;", "gilded": 0, "created_utc": "1294960938", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Same with the Loch Ness Monster", "gilded": 0, "created_utc": "1294968893", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "&gt;That being said, when I wrote, \"Personally, I cannot understand rejecting the Truth,\" I meant, \"Personally, I cannot understand someone who asserts that God does not exist.\n\nWhy isn't is reasonable to say the same thing about fairies, leprechauns, the loch ness monster, or Santa Claus?\n\nPeople don't get called to task when they say vampires don't exist.  You don't nitpick a person who says werewolves don't exist.  The chupacabra?  Perfectly reasonable to dismiss.\n\nOr from a different angle: If you told me there was a full grown African elephant in my office cubicle right now (part of this dimension/universe, etc... an ordinary multiple thousand pound elephant), I am perfectly well justified in saying it's not there.  Yet you would have me say otherwise.  There is supposed evidence for this thing (crowded, smelly, noisy, etc), and if that evidence is not there, then the thing isn't there.  Unless... ooh, papers got moved, that is evidence the elephant was there!  (ignore the fact that there are other explanations for why papers might have moved)\n\nBut not God.  Why does he get a different standard from anything else we are asked to believe?\n\nEDIT: I do realize which sub I'm in, and I'm not trying to actually argue against God's existence.  I'm questioning why zhay can't understand how people can assert his non-existence.", "gilded": 0, "created_utc": "1295021537", "subreddit": "Christianity", "score": 3, "controversiality": 0}
{"body": "Ill give ya Tree Fiddy!", "gilded": 0, "created_utc": "1295026771", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "yeah, i also heard the loch ness monster ate 2 people last week. stupid monster..", "gilded": 0, "created_utc": "1295030415", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Synopsis of several points, already made:  Atheism is a \"denial of the existence of deities\" (paraphrasing a web definition).  It is not denial of the supernatural - that is materialism (\"the philosophical theory that matter is the only reality\").  Atheists do not **necessarily** deny the existence of the supernatural.  An atheist that does is more accurately labeled a materialist.  \n  \nBigfoot and the Loch Ness monster are neither deities nor supernatural - they are supposed to be prehistoric creatures that somehow survived their supposed extinction events.  Belief in them does not require belief in god.  Disbelief of them requires neither atheism nor materialism.  **However**...  \nBelief in the supernatural (ghosts, etc) or prehistoric survivors does require a leap of faith since the evidence is so sketchy.  The ability to believe something despite a lack of evidence is not the SOLE province of the theists.  \n  \nPersonally:   I waver between calling myself atheist and \"pan-theist\" - I believe that all religions have part of the truth and I discard (at least) the part where each claims that their god(s) are the only god(s) and [**\"all-powerful\"**](http://atheism.about.com/library/quotes/bl_q_RHeinlein.htm).  I am more comfortable around atheists than most deists/theists.  Their holy books are lighter and usually more fun to read.  ;-)  \nMy mother and grandmother are both atheists BUT firm believers in the supernatural.  Part of our heritage is Basque, which has a high percentage of Romany - the gypsies.  Belief in the supernatural without a coincident belief in god is par for many in that culture.", "gilded": 0, "created_utc": "1295033755", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "&gt;Most of the arguments for or against God depend on proving the rationality or irrationality of the existence of God (any of the more empirical methods are usually just a waste of time and don't meet the average theist's conception of a transcendant God).\n\nI would think that most arguments for against gods would depends on the existence or nonexistence of gods, not on the rationality or irrationality of their existence. \n\nIf we're speaking of the Christian god, it's pretty clear that there are better explanations -- it's a work of fiction, and not a particularly good one at that.\n\nIf we're speaking of a deistic god, then we're dealing with something that will perpetually stay out of our reach -- like fairies under the hill, or the Loch Ness monster, or Bigfoot. When someone gives an existential claim, such as \"There exists unicorns/the chupacabra/God/a magic spell that when recited cures cancer\", there's no possibility of refuting said claim. \n\nI have better things to do then spend my time criticizing such silly ideas, other than to point out that they are, at least in principle, not amendable to any sort of empirical investigation -- that is, unless they 'decide' to reveal themselves by knocking on the front door and whisking off their top-hat. \"Why, it is I! The lost city of Atlantis! Ha-ha!\" Yes, they might very well exist, and we might stumble upon some of these things by accident or good fortune (come knocking on the door), but many fantastic things might exist. So?\n\n&gt;This sounds very interesting, could you recommend a book/resource or something where I could read more?\n\nNot off the top of my head, but Feynman, Einstein, Eccles, and Lorenz each wrote extensively on epistemology, the process of perception, or the philosophy of science.\n\n&gt;I was looking for a solid epistemological basis for realism. \n\nI wish you luck on your search, but I think it's a fool's errand.\n\nAny more questions?", "gilded": 0, "created_utc": "1295035374", "subreddit": "PhilosophyofScience", "score": 1, "controversiality": 0}
{"body": "Nessie is even worster.", "gilded": 0, "created_utc": "1295046111", "subreddit": "TwoXChromosomes", "score": 1, "controversiality": 0}
{"body": " tree fiddy.", "gilded": 0, "created_utc": "1295135966", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "Looks more like the Loch Ness monster.", "gilded": 0, "created_utc": "1295146476", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "That's exactly why I won't ride Apollo's Chariot. Don't really dig that face-down free fall on the Griffon, either. I'm a wuss.\n\nI do still love the Loch Ness Monster, though. I love speeding over the \"Rhine\" and through the trees. Oh, and the interlocking loops.", "gilded": 0, "created_utc": "1295149208", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Pics or it didn't happen\n\n&gt; There are also documented cases of people without legs and arms having them spontaneously grow back. I personally haven't seen that though, but just because I haven't experienced something myself doesn't mean it isn't real.\n\nThe following things are also real\n\n* Leprechauns\n* Unicorns\n* The Flying Spaghetti Monster\n* The Loch Ness monster\n* Bigfoot\n\nI personally haven't seen any of them though, but just because I haven't experienced something myself doesn't mean it isn't real.\n", "gilded": 0, "created_utc": "1295166335", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Dude, fuck the Loch Ness Monster. Every time I ride that it gets shakier than the last time. I'm glad they got rid of the Big Bad Wolf for the same reason, and now it's time to retire the Loch Ness Monster.\n\nDon't worry, I wouldn't ride the Griffon for the longest time, and then I couldn't muster the courage to ride front row until one of my high school physics teachers went with me (it was during a field trip, not a weird thing).\n\nI like BG for the atmosphere, since it's so much nicer than King's Dominion, but BG is seriously lacking in the rides department. They need to build a new one that can rival the rides at KD if they want to bring back the \"ride warriors\" that go to KD.", "gilded": 0, "created_utc": "1295168846", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Implying that you are some sort of ultra-man-porn-star...priceless\n\nShowing your children...well dat's tree fiddy", "gilded": 0, "created_utc": "1295178122", "subreddit": "WTF", "score": -1, "controversiality": 0}
{"body": "&gt; the loch ness monster blunt\n&gt; \n&gt; http://www.reddit.com/r/Marijuana/comments/acglh/may_i_present_the_loch_ness_chronster/\n&gt; \n&gt; http://imgur.com/APaxZ.jpg", "gilded": 0, "created_utc": "1295184480", "subreddit": "trees", "score": 3, "controversiality": 0}
{"body": "Of course your position rests on the notion that God's existence is absurd, or at least that we should treat God in the same light as the Loch Ness monster.  Hardly a provable assumption and certainly not widely agreed upon.", "gilded": 0, "created_utc": "1295188210", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "I'll give you tree fiddy.", "gilded": 0, "created_utc": "1295203420", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Thank you for the correction! I'm a bit foggy on the dates, it's not often that I think about the paleolithic era.", "gilded": 0, "created_utc": "1295203873", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "Why does the Stone Age have to be used a metaphor for stupidity? Without the technological advancements of the paleolithic era we wouldn't be where we are today. Furthermore, there were probably quite a few atheists kicking around back then. Who's got time for sky fairies when there are mammoths to be hunted?", "gilded": 0, "created_utc": "1295225060", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "The only time I fell to the ground laughing and accidentally peed my pants a little because I was laughing so hard was this incident in the summer of '94 when I was 15. I suddenly got up in front of my two friends, holding my arm in front of myself like a puppet or the Loch Ness Monster. At that point I farted, and made it look like that's what the puppet was saying. We had already been doing that from time to time recently, but they didn't know what I was doing at first, so when it happened, they burst into laughter. I wasn't really expecting them to laugh at all, and that was somehow so funny to me that I fell to the ground and couldn't stop laughing. I looked at them during my laughing fit and they were both laughing so hard at my reaction that they were leaning forward with drool running out of their mouth because they couldn't swallow. I know it doesn't sound that funny and sounds like a story about 3 retarded people, but man, you just had to be there. ", "gilded": 0, "created_utc": "1295243674", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1295249348", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt;As far as discussion about atheism and religion goes, you're going to be waaaay out of your league...\n\nOnly if you mean it would be as if someone from MLB played a Little League game.\n\nPeople like you want to discuss how many angels can dance on the head of a pin. It keeps you occupied, a fool's errand, and you sure apparently enjoy it, probably because you think you're good at it. Why not take up the topic of aliens and what they like to eat for breakfast when visiting Earth? Or does the Loch Ness Monster always use a breast stroke or does it throw in the occasional crawl?\n\nIt's bullshit and you like it. Enjoy it, but don't forget you're wasting your life because you're not smart enough not to. (See? I can be an insulting asshole, too. Ain't it grand?)", "gilded": 0, "created_utc": "1295303520", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "About tree fitty. ", "gilded": 0, "created_utc": "1295309254", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "The Paleo Diet is a myth in modern society.  The idea that all of our ancestors ate the same way is absurd.  Our ancestors were scattered across several continents by the Paleolithic era, where there was little in common in terms of available edible plants and animals.  \n\nTo truly eat a Paleo diet today you would need to avoid all domesticated crops and animals and rely only on wild plants and animals.  You would need to give up alcohol, dairy products, salt, and any other foods that required sedentism for processing, like vinegars, grains, cured, smoked or preserved meats and fish.  Basically a Paleo diet is dandelions greens and deer.  \n\nSee [Why some like it hot](http://books.google.com/books?id=MEQ45L3ZcegC&amp;printsec=frontcover&amp;dq=why+some+like+it+hot&amp;hl=en&amp;ei=1Q81TdyWM8T48Abf2JXdCA&amp;sa=X&amp;oi=book_result&amp;ct=result&amp;resnum=1&amp;ved=0CCsQ6AEwAA#v=onepage&amp;q&amp;f=false) by Gary Paul Nabhan.  \"most characterizations of ancestral diets woefully simplify such variation, ignoring incredible levels of dietary diversity that have guided our evolution in space and in time\" (pg 41).  ", "gilded": 0, "created_utc": "1295323749", "subreddit": "Cooking", "score": 21, "controversiality": 0}
{"body": "&gt; Why? Because for the person's entire life, they have food, air to breath, water to drink, strength to do things etc, but they still don't acknowledge God. This is the height of ungratefulness. \n\nNo it's not. If God came down and demonstrated that he is responsible for these things then it would be ungrateful not to thank him. But there is no evidence that any sort of god is responsible for these things. \n\nNot to mention the following:\n\n* God designed us to be reliant on the things he expect us to thank him for. He could have designed us not to require food or water.\n* Does ungratefulness justify eternal punishment? Why should someone be punished even a finite amount for being ungrateful? \n\n&gt; That is the worst crime, because that is the crime against God.\n\nReally? Worse then imprisoning a little girl in a basement for decades and raping her again and again and making her bear your children like that German guy did? That's not a worse crime. Ungratefulness is? \n\n&gt; God even has the mercy to allow that person to live, each day bringing the opportunity to acknowledge God's existence , but they still don't acknowledge God. Even then, if with their last breath, they acknowledge God, God is willing to accept it and enter that person into Paradise, but it must be in this world.\n\nI will acknowledge God when he stops playing this game of hide and seek and shows himself. Until then the lack of evidence forces me to have a non-belief in a god. Or creator aliens. Or spirits. Or thetans. Or unicorns. Or the millions of god of the Hindu faith.\n\n&gt; If so, that will be too late then, because the test is in this world. It's like a person taking an exam, failing it, then seeing the answers the teacher provides and then asking the teacher to retake the same exam.\n\nNo it's like the teacher hiding behind a bush and judging a student based on criteria the student doesn't know about, a test he's never been presented with, and he's never even seen the teacher. \n\n&gt; In a sense that the person was given the opportunity, every minute of their existence to pass the test and acknowledge God, but they chose not to\n\nI don't choose anything. I genuinely don't see any evidence for a god. I'm not rebelling against him but I just don't see anything that proves the existence of a god. In the same way you see no credible evidence of the Loch Ness Monster so you have a non-belief in it.\n", "gilded": 0, "created_utc": "1295373906", "subreddit": "islam", "score": 2, "controversiality": 0}
{"body": "Great, I think we're unlikely to have serious beef then.  This next part may sound impolite, but I want to be clear and succinct.  I hope you'll forgive the phrasing.  Agnosticism strikes me as a little wishy-washy.  To just say \"I don't know\" and throw up your hands seems half-baked to someone like me who wants to pick at threads until they come apart.\n\nYou aren't agnostic with respect to faeries are you?  Or unicorns?  Or bigfoot?  Or the Loch Ness monster?  Chances are you're comfortable disbelieving in at least one of those things.  Well, the same evidence is available for any given god.\n\nAppeals to the vast numbers of believers is nothing more than *argumentum ad populum.*  It looks nice, but it's not actually all that useful in assessing a truth claim.\n\nBut that's just me advocating my position against yours.  As far as personal interactions go I would never interfere with your ability to exercise your right to believe as you want.  Generally, I go by H.L. Mencken's ideal of the First Amendment:\n\n&gt;The purport, though not the letter, of its first two strophes is that every free-born Americano shall stand clear of ecclesiastical domination, and be at liberty to serve, dodge or bamboozle Omnipotence by whatever devices appeal to his taste, or his lack of it.", "gilded": 0, "created_utc": "1295395021", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "Chupacabra's a mangy coyote, Nessie's a spooked waterfowl, Bigfoot's a drunk guy with a gorilla suit and a camera", "gilded": 0, "created_utc": "1295411755", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "BigFoot is real!  The Loch Ness Monster's book said so.\n\nAlso, Puma?  Hey Griff... chupathingie. ", "gilded": 0, "created_utc": "1295413588", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "My God!  Its the loch ness monster!", "gilded": 0, "created_utc": "1295454573", "subreddit": "sports", "score": 2, "controversiality": 0}
{"body": "Don't they know anything? Chef's parents are gonna have to get the spirit out… it'll cost about tree fitty.", "gilded": 0, "created_utc": "1295481439", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "I used to dedicate a lot of time to figuring out if the profile I just clicked on belonged to the Loch Ness monster or a girl I'm attracted to. Now I just click on next. If you're overweight, fine, just don't try to trick me into thinking you're not D:", "gilded": 0, "created_utc": "1295485476", "subreddit": "OkCupid", "score": 3, "controversiality": 0}
{"body": "$25???   I have to help haiti... or something... how bout tree fitty?", "gilded": 0, "created_utc": "1295497848", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "The null hypothesis is not something you just choose, it's not 'my' null hypothesis. In this context, the null hypothesis is to assume that something does not exist until there is sufficient evidence that it does. Is there some other area where you assume that something exists until evidence of non-existence is provided? The Loch Ness monster, for example? Santa Claus?\n\nOr in medicine, if you need to test a bunch of different drugs, you don't start assuming any of them has any effect; the correct null hypothesis is that none of them is useful, and test them.\n\nIn short, \"null hypothesis\" is not equivalent to \"first guess\".\n\n&gt; _I can't see how_ this world can exist without a creator\n\nThat's an argument from ignorance. Just because you can't see how, it doesn't mean nobody can. To think that way is arrogant.\n\n&gt; This is also true for atheists.\n\nNo, I don't \"believe there is no god.\" I've evaluated the claims that there is one, and found that all of them lack merit. As soon as good evidence is shown, I'll reconsider God's existence. For example, fiery letters in the sky all over the world that everyone can understand in their own language. At least that would be impressive, and certainly within the capabilities of a god, at least of the one you prefer.\n\nNow, what would you consider as good evidence that no god exists? Or at least that your particular god doesn't exist? Don't say things like 'scan all the multiverse and find no such thing', since that would require us to be basically gods, thus defeating the whole point, right? ;)\n\n&gt; am I rejecting atheism by not believing in it?\n\nNo, atheism makes no claim for you to reject. It's not a \"belief in no god\", but \"disbelief in god.\"", "gilded": 0, "created_utc": "1295499815", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "Goddamn loch ness monster!", "gilded": 0, "created_utc": "1295501446", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Ooh! It must've been about seven, eight years ago. Me and the little lady was out on this boat you see, all alone at night, when all of a sudden this huge creature, this giant crustacean from the paleolithic era, comes out of the water", "gilded": 0, "created_utc": "1295537375", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "1 there you have again an argument from ignorance \"I don't understand how an orderly universe can arise, so god did it\". What about \"the universe seems orderly, lets find out what caused it\"?\n\nAnd here comes another fallacy, [argument from authority](http://en.wikipedia.org/wiki/Argument_from_authority), by invoking Einstein. It doesn't matter what he thought, after all, Newton believed in alchemy. We have confidence in science not because it's made by scientists, but because it follows the scientific method, designed and proven through time to be the most accurate tool we currently have to understand our world. If some scientist asserts that the Loch Ness monster exists, meh. If he did follow the method, published a peer-reviewed work that explains his observations and whatever, then it has more weight.\n\n2 I understand, but the proper name _is_ 'argument from ignorance', or if you prefer, 'argumentum ad ignorantiam', which sounds... smugger.\n\nScience cares about what is observable, about what interacts with our world. If god doesn't interact with our world in any way, then sure, he is outside science, but he is also useless. That's the position [deists](http://en.wikipedia.org/wiki/Deism) use: god created the universe, then he went away or ceased to exist or something.\n\nMost definitions of omnipotence will say that it doesn't include twisting the laws of logic, limiting god to what is logically possible. Not been able to create a square circle, for example. Do you want to go that way, asserting that god can make absolutely everything, including creating a rock so heavy that even he can't lift, or creating a three-sided square? Or do you want to place some limitations on what god can do?\n\n&gt; looking for natural evidence to prove the existence of a supernatural entity is probably futile.\n\nMaybe, but we could find evidence of the tampering that the supernatural being does within our natural world.\n\n3 Depends on your definition of God. For example, you could mention things that god can do in our world that can be measured, such as: \"Tyche (greek goddess of fortune) grants his followers greater chances to win the lottery\". Then we can check if Tyche's followers are actually more likely to win the lottery.\n\nOr Zeus, throwing lightning bolts from mount Olympus. What, they found that lightning bolts are due to atmospheric electrical discharge? Then Zeus doesn't exist _OR_ \"that's the way Zeus does it.\" That's another tactic used by religions: moving the goalposts. As former miraculous events are explained, god moves further.\n\nOf course, this have been done with various claims about various gods (including the christian one) and all claims have been found false, so what they do? Redefine god to not do that directly or some other excuse, like \"you can't test god.\"\n\nBut let forget about convincing the world. What would convince _you_ or at least make you seriously doubt? In other words, is your mind open to the possibility that god may not exist?", "gilded": 0, "created_utc": "1295554173", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1295569747", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "and he has my tree fiddy\n\nFTFY", "gilded": 0, "created_utc": "1295581017", "subreddit": "funny", "score": 54, "controversiality": 0}
{"body": "I told that woman not to give him that damn tree fiddy, I knew if she did he'd keep coming back for my tree fiddy. ", "gilded": 0, "created_utc": "1295589789", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "Fucking insane. Sugar water for tree fitty. DAMN YOU LOCH NESS MONSTER.\n\nSeriously when will people learn, this sugared carbonated water is DEATH IN A CAN. Bad for the teeth, huge cause of obesity, and it fucking costs a lot of money. Drink WATER or tea, people!", "gilded": 0, "created_utc": "1295590451", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Nessie, the one true forever alone.", "gilded": 0, "created_utc": "1295609885", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "The assailant is the Loch Ness Monster. I'm sure of it!", "gilded": 0, "created_utc": "1295623153", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Bout tree fiddy.", "gilded": 0, "created_utc": "1295628370", "subreddit": "gaming", "score": 10, "controversiality": 0}
{"body": "Bout tree fiddy.", "gilded": 0, "created_utc": "1295629301", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Getcha own god-dang money you god-damn Loch Ness monster!", "gilded": 0, "created_utc": "1295630786", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "He would totally team up with Bigfoot, the Loch Ness monster and aliens to kick our asses.", "gilded": 0, "created_utc": "1295703025", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Next time someone exclaims, \"Oh God!\" or something like that to me I am going to respond with, \"Unicorns!  Leprechauns!  Loch Ness Monster!\" and when they look confused I'll simple say, \"Oh sorry, I thought we were listing things that don't exist.\"\n", "gilded": 0, "created_utc": "1295703885", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "And it looks like you've found a website from the Paleolithic era", "gilded": 0, "created_utc": "1295704403", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "When we're talking about \"modern diet\" here we're largely talking about a diet that dates back to the dawn of civilization.  For example with dairy products, we've very likely [evolved](http://en.wikipedia.org/wiki/Lactose_intolerance#Lactase_biology) to better consume them since the paleolithic era.\n\n[Status quo](http://en.wikipedia.org/wiki/Status_quo) is defined as the current state of affairs.  I think it's quite a stretch to consider the paleolithic era current.  Basically, the modern diet is *by definition* the status quo.  Furthermore, diet is ever changing and region dependent.  There is no simple divide between then and now.\n\nThis diet advocates people **changing** their consumption for an improvement in health.  It really doesn't matter if it was used in the past if it can't be scientifically tied to health benefits.\n\nLets be clear, I'm going out of my way to *not* make assumptions, can you say the same?", "gilded": 0, "created_utc": "1295733071", "subreddit": "TrueReddit", "score": 2, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1295734505", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Can I get about tree fiddy?", "gilded": 0, "created_utc": "1295742850", "subreddit": "gaming", "score": 36, "controversiality": 0}
{"body": "i told that loch ness monster, \"i aint givin you no tree fiddy!\"", "gilded": 0, "created_utc": "1295745951", "subreddit": "gaming", "score": 25, "controversiality": 0}
{"body": "you shouldn't ave tipped him no tree fiddy", "gilded": 0, "created_utc": "1295764507", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I need about tree fiddy!", "gilded": 0, "created_utc": "1295806176", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "\"I ain't giving you no tree-fitty you goddamn Loch Ness monster! Get your own goddamn money!\"", "gilded": 0, "created_utc": "1295817827", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "NO LOCHNESS MONSTAH, I AIN'T GONNA GIVE YOU NO TREE FIDDY!\nI just gave 'im tree fiddy las' week... \nDAMMIT WOMAN NO WONDAH HE KEEP COMIN' TRYINA GET TREE FIDDY YOU KEEP GIVIN' 'IM TREE FIDDY!!!", "gilded": 0, "created_utc": "1295820271", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "TREE-FITTY!? Goddamn Loch Ness Monster!", "gilded": 0, "created_utc": "1295835467", "subreddit": "WeAreTheMusicMakers", "score": 1, "controversiality": 0}
{"body": "'Bout tree fitty.", "gilded": 0, "created_utc": "1295926774", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "I ain't giving you no tree-fiddy you God damn Loch Ness Monster! Getcha own God damn money!", "gilded": 0, "created_utc": "1295927441", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "You might have just found the loch ness monster.  And he is disguised as a landlord.", "gilded": 0, "created_utc": "1295988053", "subreddit": "fffffffuuuuuuuuuuuu", "score": 2, "controversiality": 0}
{"body": "There's nothing wrong with using anecdotes in conversation. My point is that they are not acceptable as evidence in support of a theory. If they were, than alien abductions, big foot and the loch ness monster would all be accepted fact. There are hundreds of people with anecdotal evidence about these things, but that isn't enough.", "gilded": 0, "created_utc": "1296003683", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "do you believe in zeus? or the loch ness monster? no? does it take faith to not believe in those things?", "gilded": 0, "created_utc": "1296013224", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "Poseidon? Nessie? Riptide? Triton? hm...", "gilded": 0, "created_utc": "1296030497", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "I might have to do Nessie or Kula :P I have yet to put it to work though! &lt;3 you guys", "gilded": 0, "created_utc": "1296031294", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "Saying \"atheists think X\" is almost certainly false, with the exception of when X is \"there is no god\".\n\nYou may say \"The vast majority of atheists think X\" or \"Many atheists think X\" or \"Atheists tend to believe X\"\n\nThere is no dogma with atheism. It just means you lack a belief in god, or you believe there is no god.\n\nYou can be a creationist atheist, as long as the creator isn't a god. You can be an atheist who prays, as long as who you pray to isn't a god. You can disbelieve evolution, the big bang, the loch ness monster or anything else, and still call yourself an atheist.\n\nThat being said. Most atheists do believe in evolution, and the big bang. And don't believe life or the universe was created by an intelligent being. But there are exceptions. \n\nAnd because there are exceptions, you can't safely make blanket statements about atheists. ", "gilded": 0, "created_utc": "1296037978", "subreddit": "pics", "score": 17, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1296058993", "subreddit": "gaming", "score": 0, "controversiality": 0}
{"body": "about tree fitty.", "gilded": 0, "created_utc": "1296082546", "subreddit": "fffffffuuuuuuuuuuuu", "score": 4, "controversiality": 0}
{"body": "What's tree fiddy? ", "gilded": 0, "created_utc": "1296083244", "subreddit": "fffffffuuuuuuuuuuuu", "score": 2, "controversiality": 0}
{"body": "[](/fu)God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy!", "gilded": 0, "created_utc": "1296103750", "subreddit": "fffffffuuuuuuuuuuuu", "score": 2, "controversiality": 0}
{"body": "He probably came to the conclusion on his own. So did the first person to believe in alien abductions, the Loch Ness monster, demons, witches etc.\r\n\r\nPeople seem to be confusing \"default position\" with \"What human beings have come to believe\". The default position is the position on claims that does not have any philosophic burden of proof.", "gilded": 0, "created_utc": "1296147274", "subreddit": "DebateAChristian", "score": 1, "controversiality": 0}
{"body": "I don't **know** that there isn't a Bigfoot or Loch Ness Monster but I surely don't **believe** in them. \"That which can be asserted without evidence, can be dismissed without evidence.\"", "gilded": 0, "created_utc": "1296166902", "subreddit": "skeptic", "score": 7, "controversiality": 0}
{"body": "I'm no angrier at god than I am at the Loch Ness monster, or Bigfoot.", "gilded": 0, "created_utc": "1296169947", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "TREE FITTY... WOOT!", "gilded": 0, "created_utc": "1296193371", "subreddit": "programming", "score": 3, "controversiality": 0}
{"body": "Oh... about tree fiddy.", "gilded": 0, "created_utc": "1296207443", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt; I find it incredibly odd that people who believe so strongly in science CAN'T ACCEPT THE POSSIBILITY of an afterlife.\r\n\r\nA good scientist will be open to the *possibility* (as are, I bet, most atheists even). However, being open to the possibility of an idea doesn't mean we necessarily have to entertain it. I'm also open to the possibility that the Loch Ness monster actually exists, but that doesn't mean I think the claim currently has any credibility. Most of the evidence is very much *against* there being any kind of soul or part of a human being that can survive the destruction of the brain. If you wish the claim that human beings *can* survive the destruction of the brain to be taken seriously, especially within the scientific community, then you have to support that claim with evidence and reasoning. You can't just throw up your hands and say \"Why can't you just accept the possibility!\" because the truth is, we mostly do, but that doesn't mean it has any kind of credibility.", "gilded": 0, "created_utc": "1296226058", "subreddit": "Christianity", "score": 4, "controversiality": 0}
{"body": "*Tree fitty?!?*", "gilded": 0, "created_utc": "1296248010", "subreddit": "bestof", "score": 3, "controversiality": 0}
{"body": "I saw one news source...I think a yahoo link somewhere...describe it as \"crop circles\" with quotations, basically winking at the fact that only wackos believe they are extra-terrestrial. Made me think, though, what do you mean \"crop circles?\" That's what they are...it's a fact that they are crop circles...patterns in crops...the part in quotations should be the inkling that they are anything other than art.\n\nMy favorite program ever on the subject was a TV show on discovery or some such I saw years ago...they had a believer guy doing some kind of energy readings on the corn. OOOOOH it gives off radiation or some crap where the corn is depressed! Interesting, right? Then they had the skeptic who was actually a scientist saying that...well...stepping on the corn causes it. I lol'd. So funny how seemingly intelligent people will devote so much time and energy trying to believe something absolutely ridiculous.\n\nI used to watch those shows about Bigfoot and Nessie and other \"Mysteries of blah blah blah\" shows...ghosts and all that. I can't even stomach them anymore. Why waste an hour? Unless they're going to reveal at the end GHOSTS ARE REEEEEEAAAAL or BIGFOOT WAS SHOT AND KILLED!!! then who cares. hahahaha...", "gilded": 0, "created_utc": "1296251006", "subreddit": "skeptic", "score": -1, "controversiality": 0}
{"body": "Hey. I'm an Atheist and will do my best to answer your questions. An evolutionist I've never been called, although I think that's the most sound reasoning behind where we are today.\nFirstly: Land sharks. Evolution isn't a guarantee to happen as drastically as it did with us with all mammals. Sharks do predate us, by quite a bit, however they weren't around (in their current form: see megalodon) during the time that fish or sea life evolved into land creatures. We didn't evolve directly from fish, but from sea-life in general (there are specifics I just don't know them). Sharks evolved at their own pace of necessity and didn't need to chase our particular species onto land, as they still had plenty of food in the oceans via other sea-life. Even If we were (we weren't) the main absolute THIS IS WHAT SHARKS ONLY EAT, and we, over time, evolved into land creatures, they would either adapt to change with us, or just go after other food. The latter part of that statement is much less taxing to the species, thus they would have opted to go for other food.\nMars flood If theres evidence of a flood on Mars, I have no idea what that has to do with the happening or lack of happening of a great flood on earth. Sorry I don't see your point please restate your question.\nAccount for fools This should be one of the easier ones to answer. The movie Idiocracy does an excellent job of explaining this as well. Evolution, favors survivability and reproductive capacity. So, even though there are many fools and stupid less-than-the-fittest people, they are not going to starve to death from it because our society won't let them. If being stupid absolutely stopped you from eating your fill, then over time your genes would disappear. Secondly, evolution happens over many millions of years, our current Genus and Species of Homo and Sapiens have only been around for a couple million years.\nExplain why humans aren't perfect (why don't we have a third arm): Simply because we're not a perfect species. A third arm coming out of..somewhere else.. wouldn't exactly favor survival or reproductive capacity in the least. Seeing as our current two handed system is working well for the continuation of our genes, Evolution says, if it ain't broke don't fix it. Evolution doesn't actively change, it responds to changes in the environment with changes that would benefit us only after the changes in our surroundings start hurting us.\nExplain infant murder: This is referring to abortion I believe. If not sorry for the following text. Plainly it is a question of interpretation. You clearly interpret that to mean that abortion is literally killing children. Other people feel that its not and thus are morally okay with abortion. Personally I'm for a one and done law, which would bar repeat abortions. Better than nothing right?\nWhy no bodies? I'm not sure why this is a question, or if you're kidding, but I'll answer it. You see, organic matter decomposes. If bodies didn't decompose at all then you'd be exactly right and we'd be buried in dead organic matter. Bacteria, however, break down remains of humans and animals alike. that's why theres not mountains of bodies.\nWere do angels and demons fit into the Evolutionist tree of life? : I would firstly like to point out your little typo. Where* do angels and demons. And the fact is that angels and demons do not fit into the tree of life, as a body of an angel or demon has never been recovered, and there is no feasible evidence for their existence. Show us a body or evidence that isn't just writing and we'll show you some transitional forms! \nExplain talking snake in the garden threw evolution. : There is no evolutionary explanation for a talking snake. However, because there is no vocal cords of snakes doesn't mean your theory is correct. You still have to prove that indeed you had a snake that talked or provide remains of a talking snake. Also, the serpent you are referring to was the devil in disguise you believe. So supernatural powers such as speech would be available to him, I would think. Snakes do, however, have hips and leg bones. Explained by evolution as being left over as they made their transition to belly-movers.\nExplain the Loch Ness Monster threw evolution: Nessy is a lie. There have been multiple Loch-wide excursions with Sonar to detect Nessy and nothing has been found. The photos and witness reports you are referring to have since been proven fraudulent by the witnesses themselves and the photographers who took the photos.\nIf evolution is true, then why don't trees stretch up to the stratosphere? : Trees don't stretch into the stratosphere because they don't have the nutrients to. Of course they would love to be up there with all that unbroken up light from the sun, but they can't support themselves nutritionally or structurally. They're also competing with other trees for light and growth speed. To get that high would be a waste of energy which could be better spent expanding their root system, or broader leaves to catch more light, or more flowering seasons to spread their seed.\nWhy don't we act like monkeys: We don't act like monkeys because, number one, we're not monkeys. Nor are we evolved from monkeys. Us and modern primates are related, we're cousins. The great apes and the Bonobo are our closest relatives. Monkeys and humans are different species and thus behave differently. Humans also have a much larger brain capacity than monkeys, with complex problem solving skills and the like available to us, we needn't be throwing feces around.\n\nWhy are there still monkey? \nEvolution predicts the stronger species (humans) would crush and exterminate the weaker species(monkeys) it evolved from. Asked by ChristianSoldier\nChristianSoldier, firstly evolution doesn't predict anything. It especially doesn't predict that stronger species would crush and exterminate the weaker species. Again, we didn't evolve from monkeys. We.Did.Not.Evolve.From.Monkeys. The question is flawed in that evolution doesn't make predictions. Least of all the paradox put forth by you Christian Soldier.\nPlease account for quick extinctions. Again. Evolution does NOT say in any context that extinctions take millions of years. Quick extinctions are very easy to occur, and oftentimes do. They're usually caused by a change in the environment that the species in question cannot adapt to quickly enough, thus they die out. I would ask the question to this site, if all species were created by God in symbiosis, Why then are 99% of the species that have ever lived extinct?\nWere are ancestors and fossilizes remains of the dragon, satyr and unicorn? Thats a good question, I have no idea. This tells us that those things don't and never did exist.\nWhy are no human ancestors mentioned in The Bible? : If you believe that then there is no way I can convince you otherwise. Maybe because the writers of the bible didn't know about them?\n\nExplain wasps with evolution: Those specific wasps are only one species of the entire insect group. Anti-wasp poison is a foolish idea. Such a thing wasn't developed because something that can be biochemically engineered I assure you would also kill the spider.\nHow could Cain could procreate with his sisters if evolution was true? : You see, if evolution is true, as your question states, then this question is moot. Cain couldn't because he wouldn't have existed in the sense that the bible mentions. \nThe Genealogy of Henry III. You as a general fact, think that the earth is 6000 years old, or there abouts. If I am correct in assuming that I can also be sure in telling you that the scrolls are fraudulent. Modern systems of writing weren't around during the time of the Adam and Eve (as you put it). HZeroglyphics came around in about 3000 BC, and modern writing thousands of years after that.\nUnicorn Horns: Unicorns don't exist. Never have. Never will\nTransitional fossils for single celled organism. : This evolution would've occured in the ocean Billions of years ago. Single cell organisms also cannot leave a fossil because they have nothing hard to imprint onto rock or sand. Just goo.\nWhy is there still mud?: Mud is by definition dirt mixed with water. So long as those two elements of mud remain on earth and sometimes meet each other, mud will survive.\nWhy don't chemicals think?\nIf our brains are just a mishmash of biochemistry, how come chemicals like gasoline or bug spray can't think? Rev. Jim Osborne 1/11/10: Our brains are very specific organs. Firstly, the chemicals you are referring to are deadly to life. So naturally those chemicals wouldn't be able to think. They also don't have a nervous system or a brain to carry the electrical signals to and fro areas. The brain is remarkably complex and I am by no means a psychologist. \nWhy don't we have natural clothing?: Our original forms didn't. Our ancestors in Africa didn't need it as they were in Africa. As humans moved outwards, they utilized the environment to make clothing for them as they moved into colder and colder places. I can ask the same question to you. We've been wearing clothing forever, Why didn't god make some for us? Was his vision not perfect? Did he not foresee this problem?\n", "gilded": 0, "created_utc": "1296256349", "subreddit": "atheism", "score": -2, "controversiality": 0}
{"body": "Succubus trying to kill my baby!  maybe if i give it tree fiddy...", "gilded": 0, "created_utc": "1296261049", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1296265280", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "As a former IT guy: Go get fucked. You work for the users, not for yourself.\n\nIf you're managing an IT infrastructure in an office environment its your job to make sure people can do their fucking jobs.\n\nNow that i'm just a regular office monkey, and not an IT guy, I'm having to deal with other IT guys who are incompetent pricks that force us to use years old versions of flash and java (vulnerable to so many exploits, drive-by injections, browser lock ups and more). Consider yourself extremely lucky that most upper management consists of people from the paleolithic era who are unaware of anything going on.", "gilded": 0, "created_utc": "1296276610", "subreddit": "geek", "score": 26, "controversiality": 0}
{"body": "I'll put in about... tree fiddy.", "gilded": 0, "created_utc": "1296324668", "subreddit": "zombies", "score": 2, "controversiality": 0}
{"body": "Wow, a conservative leaning government that actually follows through with its ideology in the reasonable/moderate way they presented it during elections so as to be electable.  As a United Statesian, this almost feels like seeing Big Foot or the Loch Ness Monster.  ", "gilded": 0, "created_utc": "1296337600", "subreddit": "worldnews", "score": 6, "controversiality": 0}
{"body": "That there are undiscovered creatures on Earth? Absolutely. We find new ones all the time.\n\nThat there's a Loch Ness Monster? I personally doubt it. \n\nPart of what has me curious is where the line is when run of the mill undiscovered species that the scientific community generally accepts ends and cryptozoology begins.\n\nAt one point the giant squid was considered a cryptid, so obviously there's some overlap.", "gilded": 0, "created_utc": "1296366803", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "if i had a nickle every time someone posted this on Reddit I'd have oh about tree fitty ", "gilded": 0, "created_utc": "1296418187", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Don't need to go to Poland to see that; walking to the store three blocks away from home in Philly could arguably cost me a quarter of a pack and about a tree fiddy if I didn't turn most of them down, so \"alcoholics\" is a good distinction to make.\n\nStill, the language barrier here adds a bit of intrigue to the interaction--enough to enjoy the moment and engage each other like humans instead of the same old moocher-pedestrian shuffle.", "gilded": 0, "created_utc": "1296419024", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt;That there's a Loch Ness Monster? I personally doubt it.\r\n\r\nListen to this man; he knows what he's talking about. \r\n\r\n", "gilded": 0, "created_utc": "1296447816", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Why is chiropractic legally defined as medicine even though it lacks all scientific backing? Just because something doesn't work or doesn't exist, doesn't mean people aren't stupid enough to believe they work / exist. Someone might have thrown that in as a potential weapon or had someone who believed in them or heard of them got it added. The bill also talks about mind control weapons, which don't even exist yet. This law is about as far from evidence for the existence of chemtrails as the existence of books discussing the Loch Ness Monster proves it exists.", "gilded": 0, "created_utc": "1296468042", "subreddit": "politics", "score": 12, "controversiality": 0}
{"body": "That's nice, and your properly controlled repeatable, and repeated, experimental evidence for the efficacy of chiropractic is where exactly? You've just listed your problems, you didn't demonstrate in any meaningful way efficacy. People get better! Pains do go away. Until you're able to show large scale efficacy, your personal claims are about as valid as someone who claims that crystal \"therapy\" worked for them. Do yourself a favor and actually educate yourself on the subject. The best, and largest, studies of chiropractic have never once shown efficacy greater than the placebo effect.\n\nAnd btw, just because I'm sure you're the type to try this, but saying that a lot of people use chiropractors proves their efficacy is like saying that because a lot of people believe in the Loch Ness Monster and Big Foot proves that they exist. ", "gilded": 0, "created_utc": "1296482854", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "&gt;How many of them cite Leviathan\n\nI think you mean Leviticus. Leviathan was a fire-breathing sea dragon that, according to God, really, *really* existed.\n\nYahweh made Leviathan to frolic in the ocean.\n\nPsalm 104:26 - There the ships go to and fro,\n   and Leviathan, which you formed to frolic there. \n\nAs to the characteristics of this creature which Yahweh, really, *really* \"formed\"/made/created:\n\nJob 41 -\n18 Its snorting throws out flashes of light;\n   its eyes are like the rays of dawn.\n19 Flames stream from its mouth;\n   sparks of fire shoot out.\n20 Smoke pours from its nostrils\n   as from a boiling pot over burning reeds.\n21 Its breath sets coals ablaze,\n   and flames dart from its mouth. \n\nAlso, Leviathan had multiple heads, something like Medusa.\n\nPsalm 74 -\n14 It was you who crushed the heads of Leviathan\n   and gave it as food to the creatures of the desert. \n\nBut, apparently, Leviathan is some sort of immortal vampire-like (or maybe Frankensteinian) creature because, even though Yahweh already killed Leviathan once (Psalm 74) he is planning to kill him again when Jesus returns.\n\nIsaiah 27\nDeliverance of Israel\n \n1 In that day,\n\n   the LORD will punish with his sword—\n   his fierce, great and powerful sword—\nLeviathan the gliding serpent,\n   Leviathan the coiling serpent;\nhe will slay the monster of the sea. \n\nMaybe Leviathan is the Loch Ness Monster.", "gilded": 0, "created_utc": "1296501139", "subreddit": "DebateAChristian", "score": 5, "controversiality": 0}
