{"body": "To whom it may concern,\r\n\r\nI am writing to recommend Lechatcestmoi for the position of online poster. In her eight days as a Redditor, her posts have been thoroughly adequate. Her grammar and diction have been largely free of error. Her conherence has certainly been acceptable.\r\n\r\nIn conclusion, it is my firm belief that Lechatcestmoi will be able perform to the appropriate level under proper direction.\r\n\r\nRespectfully,\r\n\r\nNessie", "gilded": 0, "created_utc": "1270349617", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Looks like bout tree fiddy.", "gilded": 0, "created_utc": "1270402946", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "holy shit its nessie", "gilded": 0, "created_utc": "1270436717", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "or at least tree fiddy.\n\n**edit:** fuck i'm way too lazy to go look for the loch ness monster i sorry mister internets", "gilded": 0, "created_utc": "1270488465", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Photoshop, that's the top half of an elephants head.\n\nEdit; [context](http://www.creationtips.com/nessie2.html)", "gilded": 0, "created_utc": "1270510134", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "looks to me like a weed nessie made out of blunt wraps and headies using a sharpstone grinder on top of a national geographic.. but I am not stoned at the moment so hmm.. ", "gilded": 0, "created_utc": "1270510641", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "There's a lot of research on the diets of proto-sapiens and early homosapiens, and there are quite a few conflicting views. The [Wikipedia section on it](http://en.wikipedia.org/wiki/Paleolithic#Diet_and_nutrition) has dozens of citations and presents the primary views.\n\nEssentially it says that during the Paleolithic Era, the diet of a hominid was particularly affected by geography; it is proposed that the hominids of Africa were more reliant on plant gathering while those further north (Europe) relied on meats (lots of fish/shellfish apparently).   \n\nIt's near-impossible to ascertain though, because there isn't any definitive empirical evidence on their diets.", "gilded": 0, "created_utc": "1270513218", "subreddit": "science", "score": 16, "controversiality": 0}
{"body": "*I'm Nessie, and I approve of this message.* (＾ー＾)\r\n\r\n\r\n", "gilded": 0, "created_utc": "1270516401", "subreddit": "pics", "score": 157, "controversiality": 0}
{"body": "What!?! You gave dat monsta another damn tree fiddy?!", "gilded": 0, "created_utc": "1270518738", "subreddit": "pics", "score": 27, "controversiality": 0}
{"body": "\"hey nessie, how about a free roll?\" \n\n\"GAAAAHHH!!!\"", "gilded": 0, "created_utc": "1270522061", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I wanted to do that but didn't have the cash. I need about tree fiddy. ", "gilded": 0, "created_utc": "1270524789", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Awww.. cmere girl, just going to light you up and give ya a nice dry puff &lt;\"\n\n\nI request animated gif or video of the smoking of nessie, my night hath been made sir!", "gilded": 0, "created_utc": "1270539162", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Hey look, Nessie is on the cover of National Geographic!", "gilded": 0, "created_utc": "1270542844", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Nessie was her name. Needed her for Hazy Maze Cave, a star and the green cap :-)", "gilded": 0, "created_utc": "1270556906", "subreddit": "trees", "score": 3, "controversiality": 0}
{"body": "\"For the same reasons I don't believe in Leprechauns or the Loch Ness Monster.\"", "gilded": 0, "created_utc": "1270561917", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Sir Cort Godfrey of the Nessie Alliance summoned the help of Scotland's local wizards to cast a protective spell over the lake and its local residents and all those who seek for the peaceful existence of our underwater ally. ", "gilded": 0, "created_utc": "1270564849", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I believe Nessie also made an appearance in Earthbound, where the party called on her twice to cross a river in Winters. \n\nI'm sure most of us here are familiar with Earthbound, but if you haven't had the high pleasure of playing that profoundly AWESOME game, download an emulator and a rom of it, and see why it is so beloved!", "gilded": 0, "created_utc": "1270567073", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "Is that a smoke ring from the Nessie joint?", "gilded": 0, "created_utc": "1270568541", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "nessie the weed monster! nice", "gilded": 0, "created_utc": "1270585547", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Until we found out believe in Loch Ness monster is relatively harmless compared to believe in some variations of \"God\".", "gilded": 0, "created_utc": "1270588923", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "There's a difference between \"not believing in something\" and \"describing belief in that something as harmful in its practical application.\"  There's certainly some overlap, but they're not the same thing.\n\nI don't believe in Nessie, but I don't think that people who do are able to practice that belief in such a way that causes harm to others.\n\nI don't believe in the Abrahamic god, and I *do* think that people who do attempt to and succeed in practicing their beliefs in ways that harm others.", "gilded": 0, "created_utc": "1270590395", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Except you don't get persecuted for not believing in the Loch Ness monster. Your comparison is absurdly inaccurate.", "gilded": 0, "created_utc": "1270590662", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Dude, 'Monster' is not the preferred nomenclature.\n\n\nNessie is real.\n\n", "gilded": 0, "created_utc": "1270590689", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "He said it was about tree-fiddy... so I knew right then it was the loch ness monster.", "gilded": 0, "created_utc": "1270632848", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "Tree Fiddy to be exact.", "gilded": 0, "created_utc": "1270651504", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Were they also questioned on unicorns and the Loch Ness monster?", "gilded": 0, "created_utc": "1270660085", "subreddit": "worldnews", "score": 0, "controversiality": 0}
{"body": "Scared! Ha!\n\nI just don't want to spend the day debating you on the misinformation you've filled your head with any more than I would want to spend the day playing scrabble with my carpet.\n\nThink of it this way? Would you really want to spend any more time than you had to debating crypozoologists? They filled their heads with nonsense about bigfoot, and loch ness monsters, and so on. And they have books and books of misinformation in their head theyre willing to crap out. You have none of that, because you have real things to worry about. There's no incentive for debate here. Disproving crazy is useless. It won't work.\n\nBut seriously, I've wasted more time than I ever wanted to with you. Done.", "gilded": 0, "created_utc": "1270676995", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "loch ness monster's a cheap bastard.", "gilded": 0, "created_utc": "1270701037", "subreddit": "web_design", "score": 2, "controversiality": 0}
{"body": "Oh yeah, I still remember finding the Vorticon Alphabet in the 3rd episode and using it to translate signs written in Vorticon.  Also, riding Nessie around the planet.", "gilded": 0, "created_utc": "1270731907", "subreddit": "gaming", "score": 7, "controversiality": 0}
{"body": "I really dislike two parts of the \"paleo diet\" - no whole grains and no legumes.  There are few sources of vegetable protein as healthy as legumes, and whole grains can absolutely be incorporated into a healthy diet.\n\nFrankly, I am very hesitant to recommend any diet that completely excludes groups of food based on ideological purity (they didn't have legumes in the Paleolithic Era) rather than on scientifically sound health advice.\n\nI'm not saying it's a bad idea for a diet or that it doesn't work, just that it's not a cure-all for all people, and there are definitely problems with the strictness of the diet that it forces you into.\n\nThere's no goddamn reason not to eat beans.", "gilded": 0, "created_utc": "1270734000", "subreddit": "Fitness", "score": 2, "controversiality": 0}
{"body": "&gt;You say that I forgot about probability but I don't see what things count God out. Would you care to enlighten me?\n\nNo.\n\nThe burden of truth lies upon the believer. There are infinitely many things one can believe in. The fact that there exists nothing to disprove it does not automatically make it exist.\n\nThe Loch Ness Monster is an example of this. Some believe, some don't. But scientists do not accept it as something that exists because they have no evidence for it. Likewise, *there is no evidence for god*.\n\nThe stories tied up in believing in god *can* be disproved, but that of course does not remove all doubt of there being a god.\n\n**Unless you have evidence of god's existence (scientific evidence - *not* anecdotal), this discussion will simply come down to the fact that you are willing to make a leap of faith, and I am unwilling to believe in anything that cannot be demonstrably proven.**", "gilded": 0, "created_utc": "1270773649", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "about tree fiddy.", "gilded": 0, "created_utc": "1270815015", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "i'll second that.\n\nfurther, adding a random game from what i play - DoD:S\n\nyou ask for a server, option n/a or Other... wtf?\n\nand then while checkiong out the add game account / game character options, they're radio buttons, press cancel within the game character dialogue section, expecting the game character radio button to be unselected and close that dialogue but it cancels the whole ame add bit.\n\nthe two optional radio buttons are within another 'box' / frame, whatever so i expected them to be sepperate from the 'game' radio button.\n\n**ok, sorry for rambling or being blunt, i'm just listing things as i see them**\n\napart from that, i'm on a wee laptop, everything is big and *empty*\n\nthe buttons on the left of the home screen are too large and are your bog standard web 2.0 gradient style button - they look ugly.\n\nthe graphic on top of the nav and 'top console' side bars are pixilated, you're using png, you should be able to get a better line than that\n\nWhy the F*** are you displaying my name? This is a gaming site is it not? Use my Username! That is what is expected accross the web. maybe unless you ask for a *login* name.\n\non my profile you have added default information: DoB, Rhode Island? and a whole load of blank white boxes! how about hiding them out with the edit page?\n\nblank game pages\n\nAOL is listed as a state? both us and uk. also Loch Ness is listed under City? Ok, so we have strict definition of Cities, having only 5 in scotland so you've got towns and villiages too... but only **The Loch Ness Monster** Lives in Loch Ness!\n\nI want to click on the logo and be returned to the home page\n\n**EDIT:** Ok, next up, what advantage does this comunity give me? i see no use for it as is :(\n\n[ sorry aneurysm-Em, i've just gone and added my full rant in reply to your post D: ]", "gilded": 0, "created_utc": "1270829452", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "[Nessie](http://didyouknow.org/graphics/animals/nessie.jpg), so I can fuck with tourists at Loch Ness.", "gilded": 0, "created_utc": "1270856176", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Ah need 'bout tree fiddy.", "gilded": 0, "created_utc": "1270980090", "subreddit": "Favors", "score": 3, "controversiality": 0}
{"body": "I'm just the Loch Ness Monster, knocking at your door.\n\nEdit: Oh yeah, we're gettin' [all obscure](http://www.youtube.com/watch?v=Kj5Tys5KVgw) up in here.", "gilded": 0, "created_utc": "1271003186", "subreddit": "fffffffuuuuuuuuuuuu", "score": 5, "controversiality": 0}
{"body": "Godammit Loch Ness Monster!  I told you ain't got no three-fiddy!", "gilded": 0, "created_utc": "1271003459", "subreddit": "fffffffuuuuuuuuuuuu", "score": 4, "controversiality": 0}
{"body": "It keeps on coming back looking for [tree fiddy](http://www.youtube.com/watch?v=Q8iHPC-dGKY).", "gilded": 0, "created_utc": "1271021794", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Because Nessie needed a carport. \n\n-see lower right corner of image", "gilded": 0, "created_utc": "1271093088", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Shoulda said \"How about tree fiddy?\"", "gilded": 0, "created_utc": "1271097105", "subreddit": "politics", "score": 55, "controversiality": 0}
{"body": "Get the fuck away! She ain't no woman, she's the lockness monster! She ask you for tree fiddy? She may said it's cause she's poor, but she's the god damned lockness monster!\n\nAll seriousness though, for the sake of your mental stability, do not date this girl. There will be more girls coming along, but if she wants to move in that fast, she has emotional problems that she has to deal with, not you. By taking her in you are going to make your life miserable, trust me.", "gilded": 0, "created_utc": "1271104288", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "And your Loch Ness Monster!", "gilded": 0, "created_utc": "1271108954", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Damn it Loch Ness Monster! Get out of here!", "gilded": 0, "created_utc": "1271109684", "subreddit": "AskReddit", "score": 11, "controversiality": 0}
{"body": "Went out with this chick.  Got to her house, she gave me the usual hug, how are you, etc.  Then she asked me for tree fiddy.  Thats when I realized this was no girl, but a giant lockness monster. ", "gilded": 0, "created_utc": "1271115051", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Unbeknownst to all but the Pope and a few of his trusted minions, Jesus also defeated the Loch Ness Monster. Jesus is currently tracking the Yeti.", "gilded": 0, "created_utc": "1271127506", "subreddit": "atheism", "score": 12, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1271155624", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Tree Fitty.  ", "gilded": 0, "created_utc": "1271198094", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I AIN'T GIVIN YOU NO TREE FIDDY, GAWDAMN LOCH NESS MONSTER", "gilded": 0, "created_utc": "1271203667", "subreddit": "IAmA", "score": 0, "controversiality": 0}
{"body": "&gt;And we have yet to see a bsod!\n\nGod released a patch. We got the Bermuda Triangle and Nessie instead. They must *never* meet. ", "gilded": 0, "created_utc": "1271203906", "subreddit": "Christianity", "score": 2, "controversiality": 0}
{"body": "The same reason people still believe the validity of that [classic picture](http://imgur.com/TliTB.jpg) of the Loch Ness Monster even after the guy who took it admitted he faked it!", "gilded": 0, "created_utc": "1271215070", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt;&gt;&gt;Only Jon Stewart _and_ his writers _(as he contributes material as well)_ can come up with stuff this funny.\n\n&gt;&gt;FTFY.\n\n&gt;FIDDYCENT.\n\nI NEED ABOUT TREE FIDDY.", "gilded": 0, "created_utc": "1271247529", "subreddit": "politics", "score": 15, "controversiality": 0}
{"body": "Yes!! That's the bit he retroactively removed for Nessie and the Triangle!\n\nI mean, really. They were spazzes. Eventually, the streams would have crossed and boom, BSOD. At least Nessie's locked in her loch (lock . . . Loch? They sound the same! Further evidence!). ", "gilded": 0, "created_utc": "1271253505", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1271338010", "subreddit": "gaming", "score": 25, "controversiality": 0}
{"body": "And then I did a quick who-is on this \"Dr Brian\" character, and lo and behold it was *the Loch Ness Monster!*", "gilded": 0, "created_utc": "1271340712", "subreddit": "gaming", "score": 7, "controversiality": 0}
{"body": "**Nessie**, you owe me a new keyboard.  I just sprayed Diet Coke all over mine.", "gilded": 0, "created_utc": "1271346962", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Giving me tree fiddy", "gilded": 0, "created_utc": "1271349031", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Maybe about tree fitty?", "gilded": 0, "created_utc": "1271373646", "subreddit": "gaming", "score": 10, "controversiality": 0}
{"body": "I need about Tree Fiddy.", "gilded": 0, "created_utc": "1271453508", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Ghosts, magic, vampires, werewolves, probing aliens, yeti &amp; bigfoot, the loch ness monster, el chubacabre, dragons.\n\nIf you are an atheist you probably would like to believe in aliens since it has the odds stacked in them being out there.\nPeople like something magical, something bigger than them. ", "gilded": 0, "created_utc": "1271629164", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "I asked her how much it was gonna be, and she said \"I need about tree fiddy\".  It was around that time that I noticed this \"cashier\" was about eight stories tall and was a crustacean from the Paleozoic era.", "gilded": 0, "created_utc": "1271642120", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "Lol thats hilarious... I was thinking \"Where's the Loch Ness screen complete with Nessie?\"", "gilded": 0, "created_utc": "1271700992", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Just Cause 2 is just for dicking around basically, and it does that very well and you can have incredible amounts of fun in it. \nBut GTA IV, is just beautiful, the attention to detail is amazing. The story kept me interested all the way through, unlike in games such as Saints Row 2 where the story at some points, mind-numbing.\n\nI've had way many more laughs on GTA IV's multiplayer, running from the cops with a couple of friends in a dodgy little people carrier. The Loch Ness Monster \"glitch\" is hilarious when played on unsuspecting pals, their reactions are hilarious when they realise that they've been stranded ages away from land.\n\nJust Cause 2 is really good. GTA IV is probably one of, if no the best game this generation, IMO.", "gilded": 0, "created_utc": "1271793771", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "That'll be about tree fiddy.", "gilded": 0, "created_utc": "1271795741", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "Get outta here you damn loch ness monster I ain't giving you no tree fiddy!!!", "gilded": 0, "created_utc": "1271912620", "subreddit": "pics", "score": 9, "controversiality": 0}
{"body": "Ooh, it must have been about seven, eight years ago. Me and the little lady was out on this boat, you see, all alone at night, when all of the sudden this huge creature, this giant crustacean from the Paleolithic Era, comes out of the water.", "gilded": 0, "created_utc": "1271914190", "subreddit": "pics", "score": 8, "controversiality": 0}
{"body": "I was upset that Chef and the Loch Ness monster got nothing in the 200/201 episodes of southpark", "gilded": 0, "created_utc": "1271914916", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Aw, where is Mad Duck?  He was my favorite lesser enemy.\n\nEdit&gt; And Nessie?", "gilded": 0, "created_utc": "1271920657", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Biased, and awesome nessie. +1 is not enough", "gilded": 0, "created_utc": "1271967812", "subreddit": "lost", "score": 1, "controversiality": 0}
{"body": "Nessie", "gilded": 0, "created_utc": "1272002240", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Do me, do me now Nessie.", "gilded": 0, "created_utc": "1272002569", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Haha, meant to reply to Nessies comment. Sorry dude.", "gilded": 0, "created_utc": "1272021225", "subreddit": "lost", "score": 2, "controversiality": 0}
{"body": "When I used to use OS X, I would track these projects that were going to do a native implementation. They would all make some decent progress early on, then completely disappear. I imagine there's a loch ness monster awaiting anyone attempting to make it.", "gilded": 0, "created_utc": "1272037414", "subreddit": "haskell", "score": 2, "controversiality": 0}
{"body": "..Uh I need about tree fiddy.\n", "gilded": 0, "created_utc": "1272041354", "subreddit": "reddit.com", "score": 5, "controversiality": 0}
{"body": "Free titty &gt; Tree fitty", "gilded": 0, "created_utc": "1272044064", "subreddit": "fffffffuuuuuuuuuuuu", "score": 7, "controversiality": 0}
{"body": "&gt; I'm probably just going to start ignoring them, but I just wanted to share and see what you guys thought about their ideas.\n\nI was going to give you a point-by-point refutation of their arguments, but after reading the first few I can unequivocally say: They're lying. They're basing their opinions off of facts that are provably false, and if they had any integrity they would have researched them before spouting off their Hovindisms.\n\nExamples:\n\n* A) Carbon dating is false because it's based on the assumption that the amount of C-14 on Earth is constant.\n\nCarbon dating is not false, but is largely irrelevant these days anyways. C-14 only goes back a few thousand years, but we have dozens of other radiometric dating systems that cross-confirm eachother (including C-14), to consistently show the same measurements within a very small margin of error under properly controlled circumstances. \n\n* The Sun loses 5 feet an hour and if the Sun were billions of years old it would be burnt out.\n\nBullshit. The sun loses 4 *MILLION* metric tonnes per *second*. I mean, sure that's a lot. I mean, it seems like a lot anyways. Except the actual fact of the matter (haw haw, intentional pun), is that means that the sun will lose 1% of its mass every 160 BILLION years... The sun is closer to 10 billion years old, so... do the math, I guess.\n\n* What we think of as dinosaurs was really dragons and that most of them were killed by the knights. Also Nessie is a dinosaur and is real.\n\nHow do they explain the dinosaurs that are still flying around the earth today? What about the dozens of genara of dinosaur that looked NOTHING like anything colloquially referred to as a dragon? What about archosaurs (the ancestors of dinosaurs, crocodiles, and pterosaurs)?\n\n*  D) They believe the universe is large, but that the speed of light is faster than we think it is which explains how we can see stars that are further than 5000 light years (Which is when the universe began) away.\n\nTell them to show their work. I'd love to see how they can explain redshifted galaxies. I actually would. I hate big bang cosmology, and I would love to see a new paradigm replace it; something that has so far eluded all the best trained and well educated experts of every field for a decade.\n\n\n\nEDIT: Apparently I did a point-by-point refutation, which pretty much fubared my original paragraph. Oh well, live and learn beer.", "gilded": 0, "created_utc": "1272083180", "subreddit": "atheism", "score": 16, "controversiality": 0}
{"body": "I know what you're saying, but when we're discussing an issue like extraterrestrial life it's not the same as the Higgs boson. A lot of people see the concept of aliens in the same way they see creatures like bigfoot and the Loch Ness monster. If it was really was the general consensus that there is no such thing as alien life and if people had some sort of rationale for believing that without actually having any evidence for or against then it's pretty likely that there would not be much effort to detect alien life and that might be a huge oversight on our part.", "gilded": 0, "created_utc": "1272220432", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "It wasn't no alien, it was that Goddamn Loch Ness Monster again!", "gilded": 0, "created_utc": "1272246471", "subreddit": "WTF", "score": 17, "controversiality": 0}
{"body": "That's more than tree fiddy. I guess the executor doesn't care about Loch Ness monsters.", "gilded": 0, "created_utc": "1272265062", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "Posting now as Nessie, my other (=main) account.", "gilded": 0, "created_utc": "1272268493", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "True.  The [Water Moccasin](http://isofifty.com/wp-content/uploads/2007/12/dsc_5968.jpg) is EXTREMELY poisonous and is actually quite aggressive.  The cool thing about them, though, is that when they swim through the water, they often poke a large portion of their body above the water while the rest of their powerful body swims underneath the surface.  They sometimes look like serpents or mini-Loch Ness monsters.", "gilded": 0, "created_utc": "1272310119", "subreddit": "AskReddit", "score": 11, "controversiality": 0}
{"body": "Isn't there supposed to be a massive sturgeon chillin' in Lake Washington somewhere?\n\nThe closest us Washingtonians will ever get to a Nessie.", "gilded": 0, "created_utc": "1272317425", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I don't nessiessarily believes it exists, but I will just leave [this](http://imgur.com/HdjWJ.jpg) here.", "gilded": 0, "created_utc": "1272337590", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "&gt;Last week, Japanese scientists explaced... placed explosive detonators at the bottom of Lake Loch Ness to blow Nessie out of the water. Sir Cort Godfrey of the Nessie Alliance summoned the help of Scotland's local wizards to cast a protective spell over the lake and its local residents and all those who seek for the peaceful existence of our underwater ally. ", "gilded": 0, "created_utc": "1272386888", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "Hell yeah I would.  That guy owes me 'bout tree fiddy.", "gilded": 0, "created_utc": "1272387187", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "upvote for the tree fitty", "gilded": 0, "created_utc": "1272388262", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Tree fiddy!", "gilded": 0, "created_utc": "1272410763", "subreddit": "pics", "score": 9, "controversiality": 0}
{"body": "Maybe I didn't explain myself clearly.  \r\n\r\nThe point is that a journalist who hears the wrong homonym and writes it down is making the mistake.  The speaker is not making the mistake. If I say \"I have to go\" and the journalist writes, \"Nessie said 'I halve to go,'\" it's the journalist's mistake. \r\n\r\nA better example would be something like this: \r\n\r\n&gt;\"Bush said 'We need a smarter nucular [sic] program.\"\r\n\r\nBut in this case, most journalists would paraphrase him and write:\r\n\r\n&gt;\"Bush said the U.S. needs a smarter nuclear program.\" ", "gilded": 0, "created_utc": "1272503586", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Well, I'm naturally kinda afraid of the water because I almost drowned when I was five, and also I was never taught how to swim properly. I also HATE being underwater. Even submerging my head in a bathtub freaks me the fuck out. Deep water also scares me, even when it's perfectly clear and I can see the bottom. What I don't understand is how people can actually go in the ocean and swim around?! I mean, for fuck's sake, there are riptides, and sharks, and Loch Ness monsters, and all sorts of freaking scary shit in the water that WANTS TO EAT YOU! I actually once did go pretty far into the ocean with a boogie board (I was determined to get over my fear, you see), and I saw a FUCKING FIN. Turned out to be a dolphin, but a shark did show up an hour later. Fuck water, man. There's a reason why our earliest fish ancestors evolved enough to get the fuck out of there! Water is bullshit.  \r\n\r\nI also can barely rollerblade, I can't whistle, and I can barely blow bubbles in bubble gum. It's like stuff can come so naturally to other people, but it doesn't for me. ", "gilded": 0, "created_utc": "1272507632", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": " &gt;*Jackie Whitaker Ostermiller*  \n\n&gt;Dear Reddit Fans, Stay out of my personal life. If you don't know the whole story, you shouldn't judge. I am sorry you don't like me, I don't care. I am a kind giving person who loves cats. I have one cat right now other than Nessie. I couldn't fix her because she got pregnant, I am not the determining factor in he...r life,the police came and got her to protect me and my family, not that you care, but now you know.\n\n&gt;*Jackie Whitaker Ostermiller*\n\n&gt;some e-mail I got, and then clicked on the stupid link, reddit.com, it was absolutely degrading to read, I have never felt so bad about myself, and to think they have such intellegence to look peoples information up, but so stupid that they have the intellegence level of an ant\n\n&gt;*Shelli A. Challis-Prather*\n\n&gt;so if i whet to that email address i can put a coment on there?\n\n&gt;*Shelli A. Challis-Prather*\n\n&gt;i did not find any way to post something back to them. you are just going to have to learn that there are very small minds out there.\n\nthis was on her Facebook wall.  I never sent her anything, but I still can't feel bad that she's getting harassed after picking up an angry cat and having it put down because it attacked her. of course it attacked her. protect her and her family? what a fucking moron.\n\nmostly though, I just brought this over here because she was amazed at how smart someone was to look her up on FB, and her friend couldn't figure out how to post on Reddit.\n\nedited for more coherent formatting", "gilded": 0, "created_utc": "1272517143", "subreddit": "WTF", "score": 4, "controversiality": 0}
{"body": "He was probably building bombs in the orphanage.  [You know, after he blew up his foster parents in a plot to kill the Loch Ness Monster.](http://tf2wiki.net/wiki/Demoman#Bio)", "gilded": 0, "created_utc": "1272526345", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "Jackie Whitaker Ostermiller April 29, 2010 at 1:28pm\n\nRe: so, heres what the internet thinks of you, get ready for some fun\n\nYou know it really makes my day when people like you all are so boared and can't find anything else to do. So, you can think what you want about me, it doesnt' matter. I had no other choice but to call in someone that could help protect my family from this cat. I was no where near her kittens, My husband and I were asleep in bed when a stray cat got into our house, that is what got Nessie enraged. I would love to keep her, but I don't have a say in the matter. By the way, we were about to get her vaccenated and fixed when she got pregnant. So, going to pick her up,no, I was worried about trying to get back in the window after falling out of it when she came in and attacked.", "gilded": 0, "created_utc": "1272562409", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "You have more patience than me, gramps.  I stopped reading that shit after he mangled Big Bang cosmology.  Of course, now that you made the effort I'll have to take a look.\n\nHis citing of Homo Neanderthalensus as an ancestor to modern human is in error.  Modern biologists have determined based on genetic markers that we are not descended from Neanderthals, as they were a separate branch stemming from a common ancestor we both shared.\n\nThe father also doesn't quite grasp the whole \"burden of proof\" thing either.  Instead of demanding evidence for god's existence, he states that we can't \"rule it out\" because it hasn't been proven that he doesn't exist.  I suppose the father believes in Nessie and Bigfoot and Russel's teapot as well.\n\nAs you state, \"irreducible complexity\" is a thoroughly debunked concept.  Even Micheal Behe, who essentially founded the concept, concedes that both the eye and the bacterial flagellum are not irreducibly complex.  Ken Miller, a Christian biologist and brilliant man, demolishes the mouse trap analogy in [this video](http://www.youtube.com/watch?v=ieKDLtrBXs0).  Good game, dad.\n\n&gt; And we don't need a microscope to observe irreducible complexity. The eye, the ear and the heart are all examples of irreducible complexity, though they were not recognized as such in Darwin's day. Nevertheless, Darwin confessed, \"To suppose that the eye with all its inimitable contrivances for adjusting the focus to different distances, for admitting different amounts of light, and for the correction of spherical and chromatic aberration, could have been formed by natural selection,  seems, I freely confess, absurd in the highest degree.\" So Darwin even agrees that the chances of an evolutionary process just to create an eye are extraordinarily high and in fact, seem to be in conflict with the second law of thermodynamics. \n\nWatch this quote mine collapse.  If we continue reading Darwin from this sentence, you'll see that the father is dishonest or ignorant at best.  Darwin goes on to say:\n\n&gt; To suppose that the eye with all its inimitable contrivances for adjusting the focus to different distances, for admitting different amounts of light, and for the correction of spherical and chromatic aberration, could have been formed by natural selection, seems, I freely confess, absurd in the highest degree. When it was first said that the sun stood still and the world turned round, the common sense of mankind declared the doctrine false; but the old saying of Vox populi, vox Dei, as every philosopher knows, cannot be trusted in science. **Reason tells me, that if numerous gradations from a simple and imperfect eye to one complex and perfect can be shown to exist, each grade being useful to its possessor, as is certainly the case; if further, the eye ever varies and the variations be inherited, as is likewise certainly the case; and if such variations should be useful to any animal under changing conditions of life, then the difficulty of believing that a perfect and complex eye could be formed by natural selection, though insuperable by our imagination, should not be considered as subversive of the theory.** How a nerve comes to be sensitive to light, hardly concerns us more than how life itself originated; but I may remark that, as some of the lowest organisms in which nerves cannot be detected, are capable of perceiving light, it does not seem impossible that certain sensitive elements in their sarcode should become aggregated and developed into nerves, endowed with this special sensibility. \n\nWhoops.\n\nThe father also seems not to understand that while mutations are random events, natural selection is not random.  \n\nHis hypothetical is as NukethePope says, an infinite regress.  Who created the creator in this case?\n\nAnd lastly to Nuke.  You seem well educated and I'm glad you took the time to write our a well reasoned response.  I agree with 99% of what you said.  My only qualm is with this.\n\n&gt; The Internet is full of pimply-faced nerds who substitute Googling for any respect-worthy knowledge of their own, spouting bile because they're protected, in their parents' basement, by the anonymity of the Internet.\n\nI have more respect for someone who lacks an expensive education for whatever reason, but takes the initiative to use a $40/month internet connection to educate themselves however they can, than someone that spouts easily disprovable nonsense because they refuse to look for new knowledge like the father of the OP.  Regardless of their skin condition, age, or living arrangements.", "gilded": 0, "created_utc": "1272570504", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "Now tell me about Bat Boy and Nessie.", "gilded": 0, "created_utc": "1272642645", "subreddit": "WTF", "score": 0, "controversiality": 0}
