{"body": "What if I give you about tree fitty?", "gilded": 0, "created_utc": "1306900179", "subreddit": "bicycling", "score": 1, "controversiality": 0}
{"body": "Good stuff nessie. i no longer upvote, i just give digital high fives at random //slap", "gilded": 0, "created_utc": "1306903459", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "Like the Loch Ness Monster.", "gilded": 0, "created_utc": "1306915927", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Wait a minute, you're not a reddit commenter, you're the god damn loch ness monster!", "gilded": 0, "created_utc": "1306929156", "subreddit": "sex", "score": 6, "controversiality": 0}
{"body": "Loch ness monster?", "gilded": 0, "created_utc": "1306963538", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I can just imagine him thinking...\n\n\"WTF??? Don't guns work on ANY of these guys?\"\n\nExcept the Silurians of course, and in the Loch Ness Monster Episode.", "gilded": 0, "created_utc": "1307019252", "subreddit": "doctorwho", "score": 2, "controversiality": 0}
{"body": "In order to process the grains, you need specialized tools, which there isn't evidence for in the Paleolithic era. ", "gilded": 0, "created_utc": "1307020974", "subreddit": "Paleo", "score": 2, "controversiality": 0}
{"body": "Last week, Japanese scientists explaced... placed explosive detonators at the bottom of Lake Loch Ness to blow Nessie out of the water. Sir Cort Godfrey of the Nessie Alliance summoned the help of Scotland's local wizards to cast a protective spell over the lake and its local residents and all those who seek for the peaceful existence of our underwater ally.", "gilded": 0, "created_utc": "1307031909", "subreddit": "AskReddit", "score": 148, "controversiality": 0}
{"body": "Can I get about tree fiddy?", "gilded": 0, "created_utc": "1307044070", "subreddit": "IAmA", "score": 0, "controversiality": 0}
{"body": "[Sophie.](http://www.urbandictionary.com/define.php?term=Sophie)\n\n**Most accurate, minus the blue eyes bit:**\n\n&gt; Sophie is most of the time a brunette with blue eyes. People often assume her to be blonde, but often otherwise. She's Jewish. She doesn't have much confidence, although she is pretty, smart, fashionable, funny and unique. She commonly likes music and she is a Taurus, stubborn but unique.\n\n*Really, the hell? I'm a brunette, but light enough to be considered a \"Jewish blonde.\" That list of compliments may not be quite right, though. Oh, but I fucking love music and I'm a Taurus.*\n\n**Or:** \n\n&gt;Not to be confused with sofie. sofie is a name for slutty blondes, while sophie is a name for ocean loving brunettes.\n\n*Fuck yeah, oceans.*\n\n**This one is hilarious:**\n\t\n&gt; A little magic dragon who hides in her cave all day, then comes out at night to munch on the stars. Sophie likes to go on holidays to see her fancy man the loch ness monster, but she has a secret 'thing' with the kraken. Apart from it's not a secret anymore because i just told you. \n\n&gt; A person who is reffered to as 'a Sophie' is generally a crazy maniac who acts like a magic dragon and runs wild in public. \n\n&gt; Sophie's frequently misspell words but usually get them corrected by fantastic friends who somehow put up with their craziness. \n\n&gt; Sophie's like to hump people that run past them. And go to quiet places and shout: 'Aaaaaaaaaaarh I AM A KRAKEN FROM THE SEA'\n&gt; One word that would best describe a 'Sophie' would be- Maniac.\n&gt; 'I AM A KRAKEN FROM THE SEA'", "gilded": 0, "created_utc": "1307045978", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "i'll go tree fiddy", "gilded": 0, "created_utc": "1307052493", "subreddit": "guns", "score": 7, "controversiality": 0}
{"body": "tree fiddy?", "gilded": 0, "created_utc": "1307069733", "subreddit": "videos", "score": 5, "controversiality": 0}
{"body": "Considering the paleolithic era predates domestication of cattle by 5,000 to 2 million years... it doesn't really make sense to have dairy.\n\nBut a recent article demonstrated that moderate fruit is better at losing weight than no fruit.\n\nAll meat is good, regardless of fatty content.", "gilded": 0, "created_utc": "1307139153", "subreddit": "Paleo", "score": 5, "controversiality": 0}
{"body": "The Loch Ness Monster... when I tell people I believe in her they look at me like I'm a dumbass.", "gilded": 0, "created_utc": "1307162512", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "The existence of Nessie", "gilded": 0, "created_utc": "1307163188", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "What, like the paleolithic era? :)", "gilded": 0, "created_utc": "1307168101", "subreddit": "technology", "score": 5, "controversiality": 0}
{"body": "Nessie! :D", "gilded": 0, "created_utc": "1307192131", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "Clearly you're making the mistake of judging the game off of a prealpha build video you saw one time.  The graphics and animations have improved tremendously over time.  I implore you to look at more recent gameplay footage.  If you still think it's bad then you're just being picky..  and I would have no idea what would make you think GW2 is going to be any better in this department.\n\n&gt; haven't looked twice.\n\nMaybe you should.  Why would you judge the game off of a pre-alpha build?  Aren't you a gamer?  Why do you not know any better?\n\n&gt; laughable gameplay mechanics \n\nGuess you'll have to explain that one.  Just saying \"laughable\" doesn't exactly give any clue as to what you're talking about.  But considering you're the kind of guy to judge a game years before it comes out, I don't really see why I should take that seriously at this point.\n\n&gt; The game wouldn't have been impressive if it came out 4-5 years ago.\n\nAnd there's the hyperbole.  Sigh, I knew it was coming I was just hoping I'd be wrong.\n\n&gt; try to pay a visit to bioware's forums\n\nI go there quite often because I actually do my homework when it comes to games I'm interested in.  To sit here and tell me there's waning interest in TOR is like sitting here and trying to tell me you caught the Loch Ness Monster with your bare hands.  I'm going to be polite and let you finish but I'll be laughing behind your back.", "gilded": 0, "created_utc": "1307203666", "subreddit": "gaming", "score": 0, "controversiality": 0}
{"body": "I saw the loch ness monster", "gilded": 0, "created_utc": "1307221925", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "It's the Loch Ness Monster", "gilded": 0, "created_utc": "1307222729", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "As many have said, I used to be a devout Christian until I was 18. I took some philosophy and anthropology courses in college, and spent about four months doing research and really thinking about why I believed what I believed. I came out of the experience an atheist. This change was just the beginning of a new chapter in my life - I'm not extremely interested in science and skepticism. I've dropped my belief in Bigfoot, the Loch Ness Monster and the like. I've changed my opinions about morality almost entirely. My opinions on many \"major\" issues such as abortion, stem cell research, evolution, assisted suicide, and church/state separation changed entirely. And I'm much happier, as a result. ", "gilded": 0, "created_utc": "1307231495", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "There are no single attractive stoner women. They're like unicorns and the loch ness monster. There might be one or two out there, but they're dating some douchebag and no one ever sees them around.", "gilded": 0, "created_utc": "1307246750", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "[I aint given you no tree fitty, ya god damn lochness monster!](http://www.youtube.com/watch?v=B4C96ZTJIhU&amp;feature=related)", "gilded": 0, "created_utc": "1307253719", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "You should be able to roll it down if you have a big dick, you shouldn't if you have a normal dick.  Don't sweat it, you just don't have a loch ness monster.\n\nI haven't seen a chart for a while, but i think most condoms are right around 7\" long, and average is under 6\".", "gilded": 0, "created_utc": "1307305692", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Some of the options so far:\n\n\nThe Loch Ness Monster (Nessie)\n\nBillie Holiday\n\nSqueak\n\nMary Queen of Scots\n", "gilded": 0, "created_utc": "1307321981", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "The weirdest thing about DXM was how I'd do precisely the same amount each time... but every time was significantly more powerful than the time before.\n\nThe first time was like being drunk and woozy, with a nice body high.  The last time I completely lost my identity and took on the identity of a friend and encountered something like the Akashic Records.  wtf.\n\nI did four hits of LSD once, though, and I have to say it was way more (open-eyed) visual than DXM ever got for me.  I saw the Loch Ness Monster in a bayou, tiny blue ninjas in the bushes, etc.", "gilded": 0, "created_utc": "1307342022", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I agree with Nessie.  The food is very carb heavy, and if you order a salad they are usually really small.  They really skimp on the vegetables here.  There is usually a large variety of vegetables used, but they always lack quantity.  There is also meat or fish in everything that you order.\n\nThe reason why you lost weight is the portion sizes (and possibly humidity!)", "gilded": 0, "created_utc": "1307345611", "subreddit": "japan", "score": 1, "controversiality": 0}
{"body": "Ooh yeah little skank! Tell me im your daddy! I wanna see whats up your skirt. Ok sure I can donate to your Paypal how much do you want? $3.50? Ok sure lemme HEY wait a minute... hey... God damn lockness monster! Get yer own damn tree fiddy!!", "gilded": 0, "created_utc": "1307354297", "subreddit": "IAmA", "score": 24, "controversiality": 0}
{"body": "No you God damn Loch Ness Monster, I ain't givin' you no three fitty.", "gilded": 0, "created_utc": "1307354919", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "First up: the gravity’s not *stronger*, it’s just that when you’re pulled into, say, earth, the earth itself stops you well before you reach the centre. With a black hole, you get much closer without hitting anything, so gravity is stronger.\n\nBut, this leaves some unanswered questions. ‘Why does gravity get stronger when you’re closer to the centre of an object?’ \n\nThe force of gravity between two point-masses depends on the product of their masses and the distance between the two – F = (Gm1m2)/(r^2) (and relativistic effects which I shall ignore.)\n\nBut of course, most things aren't point masses. Black holes are *tiny*… but, say, the sun – it isn't even close!\n\nLuckily for physicists, Newton proved ([Shell theorem](http://en.wikipedia.org/wiki/Shell_theorem)) that for any sphere of uniform density (which the sun is close to), at any point outside the sphere, the gravitation force is *exactly* the same as what would been there if you replace the sphere with a point of equal mass in the centre. Basically, all the *extra* force caused by some of the mass being *closer* to you than the centre of sphere is cancelled out by the lost force from other parts being further away (proving it was one of the early applications of calculus).\n\nSo the sun’s external gravitational field is the same as a sun-massed black hole’s!\n\nBut then you have to look at the other fields generated. Since there are sun particles 1000s of kilometres away from the centre of the sun, any object that gets that close is going to hit them before reaching the centre. It’ll probably burn up, but even if it doesn't, it isn't just going to fall through to the centre. But lets say it *did* just go straight through (like a [neutrino](http://en.wikipedia.org/wiki/Neutrino)). Or maybe we could ask why the particles *already near the centre* don't collapse in. \n\nWell… shell theorem again. It says that when *inside* the sphere, gravitational force is proportional to how far you’ve got to go to reach the centre. If you take the surface force as 100%, halfway to the centre, the force falls to 50%. This is because all the mass *above* you is pulling you *up*! At the centre, it falls to zero - since you’re being pulled equally in all directions. This part is fairly intuitive once you think about it.\n\n(Extra: The shell theorem also shows that if we had a hollow earth, and you went inside, the gravity would be the same as if there were no earth at all.)\n\nEDIT – rephrased that last bit to incorporate the point given by Nessie.", "gilded": 0, "created_utc": "1307357960", "subreddit": "askscience", "score": 6, "controversiality": 0}
{"body": "42\n\n... no, wait! I can do better:\n\nAbout tree fiddy.", "gilded": 0, "created_utc": "1307366400", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Chef's Father: I remember when Chef was just a three-year-old little man, he came runnin' into me with a big smile and his little chef's hat on, and he says to me, \"Poppa, poppa.\" I said, \"What do you need, Chef, my boy?\" He said, \"I need about tree-fitty.\"\n\nChef's Mother: Tree-fitty!\n\nChef's Father: Well, it was about that time I begin to get suspicious. I said, \"Chef, my boy, why do you need tree-fitty?\" He said, \"My imaginary friend Boo-Boo the dinosaur wants it.\" So I went to my son's room, and sure enough, there was that damn Loch Ness Monster!\n\nChef's Mother: Lord, it was scary! ", "gilded": 0, "created_utc": "1307423023", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I am a female ent. I guess we're like the Loch Ness Monsters of the ent world? Some people claim to have seen us, but no one every believes them?", "gilded": 0, "created_utc": "1307441361", "subreddit": "trees", "score": 3, "controversiality": 0}
{"body": "* Theist: I think there is a big dude in the sky who made everything, and he cares about every one of us personally\"\n* Atheist:  Provide some evidence, please, or your claim is as ridiculous as leprechauns, unicorns, elves and the loch ness monster\n* Theist: Eh, I don't have any... you just have to have faith\n* Atheist: Sorry, but extraordinary claims require extraordinary evidence. Without any, there is no reason to accept your assertion\n\nHow exactly is Atheism as retarded as religion?", "gilded": 0, "created_utc": "1307446049", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "Loch Ness monster", "gilded": 0, "created_utc": "1307446269", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Nessie.\n\nI want to believe!", "gilded": 0, "created_utc": "1307452111", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I thought he was based on Nessie ", "gilded": 0, "created_utc": "1307467068", "subreddit": "pokemon", "score": 1, "controversiality": 0}
{"body": "You give that Mary tree fitty!?", "gilded": 0, "created_utc": "1307487080", "subreddit": "pics", "score": 30, "controversiality": 0}
{"body": "So this beautiful woman named Mary starts coming onto me. She's tall, blonde, and cute as a button. We get a drink and end up back at my place in no time. We're making out when things start getting hot and heavy and I reach down into her pants and all of a sudden she stops me and says, \"Imma need bout tree fiddy.\" And that's when I noticed that that girl Mary was about eight stories tall and was a crustacean from the protozoic era. The Loch Ness monster... And I said, “Dammit monster! Get the hell outta my house! I aint givin' you no tree fiddy!  It said, “how about just two-fitty?” I said, “Oh, now it’s only two-fitty!! What?! Is there a sale on Loch Ness munchies or something?!”", "gilded": 0, "created_utc": "1307498887", "subreddit": "pics", "score": 24, "controversiality": 0}
{"body": "Someone downvoted your replies, so I upvoted them back again. \n\nPlease don't downvote someone just because you disagree with him. Nessie is making a good argument, just one that I happen to disagree with. S/He doesn't deserve downvoting.", "gilded": 0, "created_utc": "1307502663", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Atheism is not a belief system.  There doesn't need to be a word for not believing in the loch ness monster, right?", "gilded": 0, "created_utc": "1307514856", "subreddit": "atheism", "score": 6, "controversiality": 0}
{"body": "Back in the paleolithic era, at the dawn of the Internet, where a 20,000-undergrad school had a pool of 20 2800-baud modems with which to connect to your email via PINE, all of our servers were named after Muppets.  Sometimes you logged into Statler, sometimes into Waldorf, sometimes into Gonzo, sometimes into Kermit...", "gilded": 0, "created_utc": "1307545000", "subreddit": "gaming", "score": 7, "controversiality": 0}
{"body": "Ok, Loch Ness Monster, you can have my two dollars!", "gilded": 0, "created_utc": "1307547245", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "*About*   Tree Fiddy.", "gilded": 0, "created_utc": "1307557545", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Well right about then, I realized that the dry cleaner was actually **THE LOCH NESS MONSTER!**", "gilded": 0, "created_utc": "1307569377", "subreddit": "AskReddit", "score": 66, "controversiality": 0}
{"body": "I CAN'T BELIEVE THIS CUNT GOT THIS SHIT FOR FREE - COCK CHEESE COSTS ME ABOUT TREE FIDDY", "gilded": 0, "created_utc": "1307579196", "subreddit": "spacedicks", "score": 3, "controversiality": 0}
{"body": "I went to a Lutheran high school, so I have the best ones.\n\"Pangea is a lie. Animals got to all the different continents by walking across the ocean on giant floating 'log mats' that were caused by Noah's Flood knocking over all the trees.\"\n\"Dinosaurs are still alive. The Loch Ness monster is proof.\"\n\"The universe is 6000 years old.\"\n\"You don't have to pay income taxes because it's not in the Constitution.\" (Before 1913, I suppose that would be true, but I wasn't told it in 1913)\n\"Don't read Harry Potter because it invites demons into your soul.\"", "gilded": 0, "created_utc": "1307592836", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "This is almost more of a skeptic question in general rather than an atheist one.  The main thing I would keep in mind is that I've seen a lot of frauds, fools, and loonies, but nothing supernatural.  If we only have anecdotal or written evidence, we can only justify belief in it provided that it is similar to things we are already aware of.\n\nAs an example, you can find numerous accounts of people claiming to see the Loch Ness Monster, but we don't have any experience with large plesiosaur-like creatures inhabiting fresh water lakes in northern europe.  If we did, that kind of evidence might be ok.\n\nThat being said [skepdic](http://www.skepdic.com/stigmata.html) has an article and they're usually pretty good.", "gilded": 0, "created_utc": "1307596193", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "id buy that for about tree fitty ", "gilded": 0, "created_utc": "1307624029", "subreddit": "AskReddit", "score": 51, "controversiality": 0}
{"body": "Fake black people are everywhere, one came to my door claiming to be black. He said it was Gona need about three fity, then I realized it was the Loch Ness monster.", "gilded": 0, "created_utc": "1307649658", "subreddit": "IAmA", "score": 0, "controversiality": 0}
{"body": "I'd go for the loch ness monster. The show would be about tree fiddy.", "gilded": 0, "created_utc": "1307665109", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I believe you're thinking of Loch Ness :p\nThat's a photo of Loch Lomond. Who knows, maybe that's why no one can find Nessie, she's moved down the road. ", "gilded": 0, "created_utc": "1307700124", "subreddit": "itookapicture", "score": 1, "controversiality": 0}
{"body": "I have one by the great Scottish impressionist Nessie McFartypants.", "gilded": 0, "created_utc": "1307707556", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "tree fiddy.\nFTFU", "gilded": 0, "created_utc": "1307721095", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "i need about tree fiddy", "gilded": 0, "created_utc": "1307737445", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I'd like to add a little story.\n\nI quit my job the other day over many problems, and my manager is hesitant to send my last check. It is for $350. God damn lochness monster stole my tree fiddy.", "gilded": 0, "created_utc": "1307740360", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "I'll need about tree fiddy.", "gilded": 0, "created_utc": "1307778451", "subreddit": "videos", "score": 0, "controversiality": 0}
{"body": "Tree Fidy?! God Dammed Loch Ness Monster!", "gilded": 0, "created_utc": "1307802816", "subreddit": "fffffffuuuuuuuuuuuu", "score": 2, "controversiality": 0}
{"body": "sure. i also believe in santa clause, the tooth fairy, the loch ness monster, bigfoot, and talking horses named ed.", "gilded": 0, "created_utc": "1307804979", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "That god damn Loch Ness monster always wants tree fiddy.", "gilded": 0, "created_utc": "1307809116", "subreddit": "fffffffuuuuuuuuuuuu", "score": 5, "controversiality": 0}
{"body": "i think they should bring back chef's parents, and have them be scientology freaks who just hassle everyone about scientology and the loch ness monster\n", "gilded": 0, "created_utc": "1307816299", "subreddit": "fffffffuuuuuuuuuuuu", "score": 2, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1307818389", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Dammit did you give em tree fiddy!", "gilded": 0, "created_utc": "1307830696", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "Very interesting read.\n\nMy theory, Loch Ness Monster mating season.", "gilded": 0, "created_utc": "1307833251", "subreddit": "worldnews", "score": 92, "controversiality": 0}
{"body": "Me too. Only I've seen him a hundred more times because he loves me more than you. I've also seen the loch ness monster, bigfoot, extraterrestrials, pteradactyls, and [Ho-Oh](http://www.pokemongym.net/index_files/Hooh.jpg).", "gilded": 0, "created_utc": "1307848245", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "You do know that this is how they get tourism dollars right?\n\nThe Loch Ness monster is the best example of this. ", "gilded": 0, "created_utc": "1307860221", "subreddit": "worldnews", "score": 0, "controversiality": 0}
{"body": "ABOUT TREE FITTY", "gilded": 0, "created_utc": "1307867478", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "Don't take this the wrong way or anything, but that's exactly like saying the cure for cancer is an omelet made from Loch Ness Monster eggs.\n\nThere's no such thing as a \"nanobot.\" Or really, there is, but we call them viruses, and they're bad for you.", "gilded": 0, "created_utc": "1307882561", "subreddit": "DoesAnybodyElse", "score": -6, "controversiality": 0}
{"body": "Erm, no. [Nanorobotics](http://en.wikipedia.org/wiki/Nanomachines) is an emerging field with massive potential, based upon science (and from the second paragraph in the article: *The first useful applications of nanomachines might be in medical technology,[9] which could be used to identify and destroy cancer cells.[10]*) \n\nThe Loch Ness monster is just a creature that may or may not be real (although if it is, it is *possible* that its eggs contains a factor of some sort that helps to combat cell mutation/RNA degradation, leading to a breakthrough in cancer. Not very *probable*, but still *possible*.)\n\nAlso, viruses are not universally bad for you (to say so would be making a generalization, and all generalizations are wrong ;) There are cases where the introduction of a virus into an already compromised system would help to combat the previous problem.  Also, viruses [are used in gene therapy](http://en.wikipedia.org/wiki/Viral_vector), which definitely has positive medical possibilities.", "gilded": 0, "created_utc": "1307885873", "subreddit": "DoesAnybodyElse", "score": 35, "controversiality": 0}
{"body": "Yes yes, we've all read Drexler, so we don't need Wikipedia quoted at us like we're children, thanks.\n\nThing is, you know what \"nanobots\" and the Loch Ness Monster have in common? *Neither one exists.*", "gilded": 0, "created_utc": "1307886125", "subreddit": "DoesAnybodyElse", "score": -12, "controversiality": 0}
{"body": "You know airplanes didn't exist until people were able to combine the sciences and technology to create one. Nanobots don't exist yet but they will. My bet for cancer is personalized gene therapy besed on the patients genome delivered by virus. Arguably one could create a Loch Ness Monster using the neccesary sciences and technologies in the future but I doubt it would be to heal things.\n\nEdited for spelling", "gilded": 0, "created_utc": "1307887306", "subreddit": "DoesAnybodyElse", "score": 4, "controversiality": 0}
{"body": "You know what the difference is? Nanobots don't exist, yet. At least, the ones that actually perform any medical function. There's no research and development going into making the Loch Ness monster, there aren't any avenues that are currently being pursued. Until science can prove conclusively that nanomachines of a certain size/nature cannot exist due to a fundamental property of the universe, the sentence will be \"nanobots don't exist, yet\". Anything else is just undue cynicism that has no place in a culture of discovery.\n\n(To be clear, I'm not advocating for unbridled optimism here either. Advancements in any field are subject to the same scrutiny of scientific verification before they're hailed as an advancement. What I am advocating for is unbridled curiosity, and the drive to push the boundaries of the possible to move society forward. Labeling something as conclusively impossible without having explored all possible options is ignorant at best, and arrogant at worst. Labeling something conclusively impossible at our current technological level is a more acceptable answer, and shows a willingness to be wrong.)", "gilded": 0, "created_utc": "1307887704", "subreddit": "DoesAnybodyElse", "score": 9, "controversiality": 0}
{"body": "&gt;There's no research and development going into making the Loch Ness monster, there aren't any avenues that are currently being pursued.\n\nWanna bet?", "gilded": 0, "created_utc": "1307888436", "subreddit": "DoesAnybodyElse", "score": 2, "controversiality": 0}
{"body": "TREE FIDDY", "gilded": 0, "created_utc": "1307891724", "subreddit": "nyc", "score": 4, "controversiality": 0}
{"body": "I had no idea the Loch Ness Monster had to be researched and developed.... ಠ_ಠ\n\n**EDIT** Your lucky, I was about to downvote you into Hades until I saw your posts on the Hydrogen Bomb.....\n\nWell played...well played indeed....", "gilded": 0, "created_utc": "1307895540", "subreddit": "DoesAnybodyElse", "score": 1, "controversiality": 0}
{"body": "I axe 'm what he wanted.  He said he needed about tree fiddy.  ", "gilded": 0, "created_utc": "1307907274", "subreddit": "videos", "score": 2, "controversiality": 0}
{"body": "I thought I was the only one with a mythical beast outside my smoking spot! There was a branch of a tree that resembled the loch ness monster and I kept trying to shoot it with a pellet gun. To this very day he still lurks up in that tree.", "gilded": 0, "created_utc": "1307907834", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "Loch Ness Monster is a Snowman?", "gilded": 0, "created_utc": "1307915589", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Damn loch ness monster.", "gilded": 0, "created_utc": "1307928829", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "tree fitty", "gilded": 0, "created_utc": "1307970198", "subreddit": "funny", "score": 8, "controversiality": 0}
{"body": "Sort of, yeah. When I'm cutting, I just have whey protein, lean meats, fruits and vegetables. Sometimes there are bigger carb sources in cheat meals. This comes pretty close to the \"paleo\" idea. So far I've lost about 35 pounds. \n\nHonestly though, I think that is just me pushing out my little personal demons. If there's pizza, I can eat a huge amount. If there's a big steak available, I'm stuffing my face until my stomach hurts. And omg pasta and potatoes, I can just eat pounds of it ...\n\nI really doubt, frankly, that we can actually eat like they did in the paleolithic era. Most people have no concept of food history. They think that corn is something we discovered. Buddy, we basically invented corn. Even things like wheat and rice are now seriously mutated by our selections for re-planting. Hell, have you seen what they do to a chicken? \n\nMore importantly, the idea that 'people used to do it that way before so it's better' is a well-known, paper-thin fallacy. ", "gilded": 0, "created_utc": "1308022090", "subreddit": "Fitness", "score": 10, "controversiality": 0}
{"body": "Tree Fiddy? Are you that god damn Loch Ness monster?", "gilded": 0, "created_utc": "1308084943", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Ah the \"it's not really free market because it's a disaster\" argument; the last resort of libertarians everywhere.  Free markets are a fantasy.  There will always be manipulators in the market whether government or corporate or both.  Let's not look for the loch ness monster by sinking our boat shall we?", "gilded": 0, "created_utc": "1308115965", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "tree fiddy? ", "gilded": 0, "created_utc": "1308133097", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1308133868", "subreddit": "Bitcoin", "score": 2, "controversiality": 0}
{"body": "Might as well look for the Loch Ness Monster, only in an ocean sized 'loch'. It's a great ruse.", "gilded": 0, "created_utc": "1308154122", "subreddit": "conspiracy", "score": 1, "controversiality": 0}
{"body": "I need 3 freedoms and a side of liberty, can I borrow tree fiddy?", "gilded": 0, "created_utc": "1308156450", "subreddit": "atheism", "score": 10, "controversiality": 0}
{"body": "Its the damn loch ness monster asking for loose change! ", "gilded": 0, "created_utc": "1308169228", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "&gt;i'ma need about two fitty.    \n\nTree Fiddy is the going rate for Loch Ness Monsters. \n", "gilded": 0, "created_utc": "1308170039", "subreddit": "videos", "score": 4, "controversiality": 0}
{"body": "The encore setlist at my show was fucking insane:\n\n- Crusher Destroyer \n- Crystal Skull \n- I Am Ahab \n- Capillarian Crest \n- Ol'e Nessie \n- Circle of Cysquatch \n- Aqua Dementia \n- Iron Tusk \n- March of the Fire Ants \n- Blood and Thunder ", "gilded": 0, "created_utc": "1308170584", "subreddit": "Metal", "score": 1, "controversiality": 0}
{"body": "Me too. I remember when i was little i had a fascination with the Loch Ness monster folklore and giant Whales. I used to think that the carpet i was walking on was water and i had to jump on tables and couches to escape the water \"monsters\".", "gilded": 0, "created_utc": "1308205692", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "&gt; there is no reason to think that farm animals enjoy the same degree of consciousness we do, they say they do, I say do they think ants are conscious - they say no, I ask them what's the difference - draw a line yadda yadda yadda\n\nThere is no line. Life and consciousness are a gradient. There are animals whose suffering we can be scientifically sure of (as much as we can be sure that *anything* suffers besides our individual selves). There are animals that float in a gray area. And there are animals we can be sure are just mindless automata. Someone who is vegetarian for ethical reasons would naturally remain conservative and avoid eating all but the automata just to be safe. This is the type of \"vegetarian\" I am -- I have no problem eating shrimp, and fish occasionally, but anything else I just stay away from. The hardware that supports consciousness appears *much* earlier in the evolutionary timeline than most people realize -- the neocortex is a key component, and *every* mammal has one.\n\n&gt; we still have the same body of someone in the paleolithic era and thus are sculpted by evolution to live off protein and fat with very little carbohydrates\n\nThat protein is really only abundant in meat is a myth. A \"complete\" protein is a food which contains all of the essential amino acids, and it's true that meat is a complete protein, but it's not the only complete protein. Vegetarian foods can be easily combined to form complete proteins -- beans and rice for example. Some are complete all on their own (soybeans, quinoa, etc).\n\nThe Jains have a diet for religious reasons that's very nearly vegan, and this religion predates Christianity by centuries. So it's safe to say that this is a time-tested diet. And these people only recently had the benefit of food fortification and supplements.\n\nHowever even if I did need to rely on supplements to get enough protein I would still be vegetarian. I'm not interested in what my ancestors had to eat; I live in a different world. In this world if I have the option of eating meat or the option of eating protein supplements, the supplements are the more ethical choice. If WWIII happens and we're living like our ancestors again, I'll go back to being a carnivore. But until then I can easily get by as a vegetarian, so why wouldn't I?\n\nI recommend reading Peter Singer (\"Animal Liberation\" in particular) for a better set of arguments than most vegetarians can give you. I've been trying to find a book of this caliber that's more up to date (factory farming and animal testing can still be brutal, but they're not as awful as they were when Singer wrote this -- in part because of the efforts of people like him since) but haven't had any luck so far.", "gilded": 0, "created_utc": "1308235019", "subreddit": "philosophy", "score": 23, "controversiality": 0}
{"body": "Nessie?", "gilded": 0, "created_utc": "1308249140", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Laboratory science may not be the only source of truth, but the realm of fairies and Loch Ness Monsters and ghosts hold no truth at all, as all of these have in common the feature of not existing. ", "gilded": 0, "created_utc": "1308253515", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "The Alpengeist, or something like that. It was fun, but it was a pretty gnarly ride. That stuff you did right above the ground freaked me out.\n\nThe worst thing that ever happened to me though was on the Loch Ness Monster. You know the safety bar they put on you? right before the first fall i realized i had *two to three inches of room*. Basically, if i didn't hang the fuck on the the bar, i would almost fall off. scary shit.", "gilded": 0, "created_utc": "1308268583", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Unicorns and Nessie are real.", "gilded": 0, "created_utc": "1308271844", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "The succubus. Chefs parents talkin bout the lochness  monster is the funniest shit. \"I need about tree fiddy\" is my all time favorite saying", "gilded": 0, "created_utc": "1308317410", "subreddit": "southpark", "score": 3, "controversiality": 0}
{"body": "That's absolutely correct. The word is \"***a**-theist*\", which basically means \"***not** theist*\", i.e. \"*no belief in a deity*\". Some people like to distinguish between lacking a belief in a deity and believing that *no* deity exists by using terms like *positive atheist* (a positive belief that no god exists), and *negative atheism* (lacking a belief in a god without having a belief that one doesn't exist).\n\nMany theists like to insist that anybody who doesn't claim with absolute certainty that no god exists is an agnostic rather than an atheist and that the two are mutually exclusive, but that's simply not true at all. Perhaps they're trying to discredit the word *atheist* that so many people use, but at the end of the day, it's just a label; it doesn't change what people actually *think*, and the truth is that most atheists look at the idea of a God in much the same way as they look at the idea of the Loch Ness Monster or Big Foot or ghosts or alien abduction or dragons or unicorns and so on. Most of us are simply unconvinced, in much the same way that we are unconvinced that the Loch Ness Monster exists. Of course,there's a possibility that it *might*, just as there is always the possibility that a God exists, but without good reason to do so, it would be silly to accept something like that as true.", "gilded": 0, "created_utc": "1308387724", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "Tree fiddy. ", "gilded": 0, "created_utc": "1308425862", "subreddit": "Art", "score": 3, "controversiality": 0}
{"body": "The only reason people downvoted this because you typed Three fiddy instead of TREE fiddy", "gilded": 0, "created_utc": "1308428059", "subreddit": "Art", "score": 3, "controversiality": 0}
{"body": "I wasn't sure if they were seals or a couple of loch ness monsters. Thanks for clearing that up!", "gilded": 0, "created_utc": "1308450672", "subreddit": "reddit.com", "score": 9, "controversiality": 0}
{"body": "wait, i thought there was only one loch ness monster...", "gilded": 0, "created_utc": "1308452659", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "They're either plesiosaurs with short necks (Nessie's children perhaps?) or giant axolotls. ", "gilded": 0, "created_utc": "1308455362", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "&gt;So I take it you believe that anything that exists in the universe can be measured in a quantitative manner?\n\nI wouldn't go that far, because there are obviously things we haven't encountered yet and I am no fan of *a priori* arguments. I do believe that understanding things quantitatively is—so far—our best way to attempt to understand them. To channel Sagan: \"If you know it quantitatively - grasping some numerical measure that distinguishes it from an infinite number of other possibilities - you are beginning to know it deeply.\"\n\n&gt;Would you call yourself an empiricist?\n\nNot in the sense that “I must see it to believe it”. My experiences with spectroscopy have taught me that there is far more that exists than I can immediately detect. And don’t get me started on idealists. That said, I think that the gathering and sharing of empirical evidence is a wonderful tool on anyone’s epistemological journey. Take alchemy as an example. A bunch of dudes keeping secrets and keeping their discoveries safe from scrutiny. Got them nowhere. They began to share their evidence with each other and a bit of a database emerges and what do we get? Chemistry. Empiricism is, I feel, a good way to go about deciding what’s true and not true because it’s successful and (damn near) self-correcting.\n\n&gt;Do you think empiricism is the most logical standpoint to speak from when rejecting theism in general?\n\nI think it is a powerful stance to take, yes. Possibly the most powerful one. That said, it’s certainly not the only one. I think a Logical approach can be useful, especially if the conversation goes into a metaphysical domain. Simple reasoning can go a long way, especially in dealing with poorly formed and poorly defined beliefs.\n\n&gt;If yes to 3, then what would you like to see being done to help promote empiricism?\n\nSimply letting people know to demand evidence to justify a claim. Just because a claim is made doesn’t mean it’s true. If that were the case, the Loch Ness Monster would exist. (and how freakin’ cool would that be?!) Basically, everyone should watch *Mythbusters.* Their science is a little on the simple side (let’s be real: nobody’s gonna watch a show with severe trials in it), but their idea is splendid. Claims need hard evidence behind them. \n\n**edit:** good questions!", "gilded": 0, "created_utc": "1308456854", "subreddit": "DebateAnAtheist", "score": 13, "controversiality": 0}
{"body": "How I wish that said, \"tree fitty\" ", "gilded": 0, "created_utc": "1308458629", "subreddit": "southpark", "score": 3, "controversiality": 0}
{"body": "Clearly that's the Loch Ness monster.", "gilded": 0, "created_utc": "1308461955", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Just like the non belief in Unicorns or Leprechauns or Santa, or Allah, or Big Foot, or Nessie, or Magic and Wizards and Dragons and all sorts of other stuff.\n\nYour religion is no different than any of those, just because you want to believe its true does not make it so.\n\nIt took you a while longer than most but you have now descended to the regular stupid arguments that most god bothering trolls use.\n\n", "gilded": 0, "created_utc": "1308484617", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Loch ness monster?", "gilded": 0, "created_utc": "1308486892", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I ain't givin you no tree fitty!", "gilded": 0, "created_utc": "1308499641", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Once upon a time, an atheist was vacationing in Scotland, walking along the grounds of Loch Ness. Suddenly the Loch Ness Monster appears, grabs the man in his jaws, flips him up into the air to reposition him for swallowing, and the man calls out \"GOD, SAVE ME!\"\n\nThe scene freezes, atheist dangling perilously in midair above the monster's maw. \n\n\"I thought you didn't believe in me,\" challenges God.\n\n\"Give me a break,\" pleads the atheist, \"I didn't believe in the Loch Ness Monster either!\"\n\n\n*(Not a commentary on anything, only something which makes me laugh.)*", "gilded": 0, "created_utc": "1308503923", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "bout tree fiddy", "gilded": 0, "created_utc": "1308504823", "subreddit": "leagueoflegends", "score": 8, "controversiality": 0}
{"body": "I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!", "gilded": 0, "created_utc": "1308506553", "subreddit": "leagueoflegends", "score": 3, "controversiality": 0}
{"body": "at the new MTGox adjusted rate thats about tree fiddy?", "gilded": 0, "created_utc": "1308516258", "subreddit": "mtred", "score": 1, "controversiality": 0}
{"body": "Keto is really focused on getting your carbs so low that you clean your liver out of glycogen so that you are only burning ketones.  As a result, your insulin spikes go away and you no longer act like a junkie. \n\nPaleo is really like Keto but focuses on what you eat. The theory is that everybody was fine back in the paleolithic era before farming began. As a result, you're still keeping carbs low but you're including some things and excluding others from Keto.\n\nMy suggestion would be to start with Keto for two or three weeks and then decide whether you want to switch over to Paleo. \n\nBy the way, I want to warn you in advance: WARNING: You may experience something called the Keto Flu. Keto Flu feels fairly dreadful as your body sends you some aches and nastiness to let you know that it's not happy. \n\nIf you ever saw the scene in the movie \"Ray\" where Ray Charles went through detox, this is like that but only goes on for about two or three days. It's unpleasant but you'll be losing some water weight in the interim so it's not all bad. \n\nAfter you go through the Keto Flu, you get to \"Induction\" where your body begins burning fat for the first time in a long, long time. What's weird is that Fat is a \"clean\" burn while Carbs are a fairly \"dirty\" burn. You'll appreciate the lack of highs and lows and the cravings will be gone. Rather than getting hungry (if you're doing it right) a lack of nourishment will produce a slight lethargy. Give yourself some low to no carb snack and you'll perk right up. \n\nPlease take BEFORE PICTURES. You will lose weight and you'll not want to go back to the cravings for a long, long time. \n\nWe look forward to seeing you on /Keto and eventually seeing your progress pics. \n\nDon't let us down.", "gilded": 0, "created_utc": "1308525151", "subreddit": "loseit", "score": 8, "controversiality": 0}
{"body": "But not in the paleolithic era which is when the setting of the comic occurs.\n\n*edit:  really reddit? *ಠ_ಠ* you're upvoting me here?  This comment didn't even make sense in context*\n", "gilded": 0, "created_utc": "1308525904", "subreddit": "pics", "score": 8, "controversiality": 0}
{"body": "What does \"brink of atheism\" mean?\n\nI am a person without beliefs, so being atheist is just a corollary.\n\nBut most people need something more selective than that.  So you could simply ask yourself, amongst sasquatch, UFOs, the loch ness monster, yoda or god, which are believable and why?  Why one over the other I mean.  Do you have a real reason?  Yoda has all sorts of moral teachings, sasquatches have at least as good evidence.\n\nWhy does your religion support itself with liars (aka apologists) and baby talk?\n\nThe bible doesn't say anything about abortion, yet your church is opposed to it.  The bible says you should kill your children for disobeying, and yet you don't.  Why not?  The emancipation of women and minorities has been a monumental elevation of our society.  The bible doesn't say one word on that matter.  The scientific discovery of *hygiene* has saved more lives than any religious effort.  Same with the [green revolution](http://en.wikipedia.org/wiki/Green_Revolution).  Of what positive *USE* is your religion?\n\nWhy is your book so sacred?  I know of nobody who learned Newtonian physics from Newton's writings.  I know of nobody who learned Geometry by reading Euclid.  I know of nobody who learned logic by reading  Aristotle.  I know of nobody who learned probability by reading Pascal.  Books on important topics get updated and replaced by better books.  A quick look at the Bible will see it referring to \"the firmament\" right there in Genesis -- the firmament is a canopy surface where the stars were supposedly affixed, and divided the universe between the earthly realm and the heavenly realm.  Astronomy has laid that obsolete idea to rest centuries ago.  Why do you still adhere to a book that can't correct itself on even that point?  Why won't anyone update that book to bring it in line with modernity?\n\nWhy does your religion persecute gay people?  What have they ever done to you?\n\nWhat has your religion taught you that lifetime atheists (like myself) don't know?  Do you really think I really am immoral because I haven't heard Jesus' word?  Atheists enjoy the highest standard of living and education, not because we are hedonistic and immoral, but because we don't throw 10% of our earnings away and we make moral decisions on a rational basis.\n\nWhat is this business about prayer?  Or eating that cracker with the wine where you are supposed to pretend that that's the body of you god that you are ingesting. Speaking in tongues, cutting off your foreskin, never cutting your hair, wearing veils ... its all the same thing, and its just silly.  They make you do all that and you don't feel the least bit like you are being trolled?\n\nAnd finally -- its just not real.  It's fake.  It's a big con.  Show me that its something else.  Why are you falling for that nonsense?\n", "gilded": 0, "created_utc": "1308543134", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "\"Three fiddy that a not christian that's the god damn  loch ness monster!!!\"\n\n(Chef's dad)", "gilded": 0, "created_utc": "1308543549", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "No doubt, it's Loch Ness Monster in Virginia, at Busch Gardens.\n\n\nReason why? First inversion I ever rode through on a coaster.", "gilded": 0, "created_utc": "1308543818", "subreddit": "rollercoasters", "score": 3, "controversiality": 0}
{"body": "I need about Tree Fiddy", "gilded": 0, "created_utc": "1308579426", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "* **SGU** - seems we have pretty good agreement, these guys are awesome.\n* **SGU 5x5** - a supplimental podcast from the SGU cast where they cover one topic for five minues\n* **Skeptoid** - I see you've included it, but I felt it deserved another mention. Brian Dunning goes into good depth explaining paranomal and woo claims, and does so in an endearingly cheesy radio-voice.\n* **Monster Talk** - one of my favorite podcasts.  Interviews with experts and researchers on topics like Bigfoot, Nessie and Chupacabra.\n* **Are We Alone?** - great science podcast hosted by Seth Shostak of SETI, and one episode each month is a dedicated skeptical episode.\n\nedit - if we're going to include atheist podcasts, I'll throw out a nomination for **The Atheist Experience**, as well as seconding ep0k's mention of **Chariots of Iron**.", "gilded": 0, "created_utc": "1308589232", "subreddit": "skeptic", "score": 2, "controversiality": 0}
{"body": "i just realized that this story is close to the \"i need 'bout tree fiddy\" loch ness monster bit from south park.", "gilded": 0, "created_utc": "1308590439", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "By the way, ArtPrize is a competition that takes place in Grand Rapids, MI from September-October.  Artists from all over the world enter.  The city is decorated as far as the eye can see with art.  The large squares have massive entries that are quite the spectacle.  Even random restaurants, cafe's, etc have Art Prize submissions.  Hell, even the [river](http://user.cloudfront.goodinc.com/community/etling/artprize-nessie-2oi2992.jpg) has some art in it.  Also, note the GIANT chair and table sitting on the bridge in that same picture lol.\n\n[Here's](http://media.mlive.com/artprize/photo/artprize-open-waterjpg-03938253ca5dd0cf.jpg) 2009's winner.", "gilded": 0, "created_utc": "1308628604", "subreddit": "reddit.com", "score": 92, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1308649594", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "(Grand Rapids Resident) I love ArtPrize but detest creations like Helping Mom One Penny at a Time and Steam Pig. However, the latter is most certainly the better embodiment of shallow concept, and putting money and marketing over actual concept.\n\nThe first year of ArtPrize there was a good number of 'things made big' to garner more votes. [Massive furniture](http://activerain.com/image_store/uploads/4/1/2/1/2/ar125384245221214.jpg) a horrid art deco style [loch ness monster](http://www.grandrapidsrealestatetrends.com/wp-content/uploads/2010/06/nessie1.jpg) (The Steam Pig team's first giant turd in the city) etc. Maybe I'm a pretentious twat but I prefer art with both great technical execution and a inspiring or somehow provoking concept behind it. I think Cavalry is very good and I'm glad it won.", "gilded": 0, "created_utc": "1308660245", "subreddit": "reddit.com", "score": 5, "controversiality": 0}
{"body": "tree fiddy, your mom", "gilded": 0, "created_utc": "1308665730", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Actually i do believe that one year a piece called \"Nessie\" was close to the top...or it could have been that painting of waves I think. Either way, there's nothing wrong with hyper-realistic art. I appreciate the talent it takes to make a piece of work like that. You have some very good points here, but personally, and this is just my opinion, I wouldn't go so far as to not call it \"artistic\".\n\nWhat is \"artistic\" is really up to the viewer's discretion, I think. How do you put that into a neatly defined box?", "gilded": 0, "created_utc": "1308666506", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Also being a Grand Rapids resident a fan of the arts I thought Cavalry was good and took a tremendous amount of talent but it was not creative in my opinion.  Sure the Steam Pig and Loch Ness Monster were oversized  creations just for the sake of being so but they WERE creative.  I still like the Loch Ness Monster and how it was placed in the Grand River and when the current was strong it looked like it was moving.  Art is in the eye of the beholder I suppose.", "gilded": 0, "created_utc": "1308676238", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "The real question should be why your friends don't care. Why do they have more generous standards for accepting the existence of a creator than they do for other unsupported claims? They presumably reject belief in the Loch Ness monster until presented with evidence for its existence but assert the existence of a creator without evidence for its existence. If your friends agree it's impossible to determine whether the creator does in fact exists, why don't they simply classify the creator as \"unknown\"?\n\nYou care because it matters whether influential beliefs are true or false. You care because it actually matters if children are taught mythology as science. You care because you don't believe a society based on false beliefs can progress, even if people happen to \"like\" those false beliefs.", "gilded": 0, "created_utc": "1308688042", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I did not misunderstand, you just have a really weak argument.  I know tigers exist, I've seen them, I can go see them.  If my friend tells me he went to the zoo and saw a tiger I have no reason to not believe him because he is not making an extraordinary claim.\n\n\nDo you believe in all the claims of people seeing the ghost of Elvis?  How about Bigfoot or the Loch ness Monster?  These are stories that people have told for generations, so does that mean they hold any merit?  How about the Greek gods?  We all know the stories of Zeus and Mt. Olympus that have been told for thousands of years.  Do you believe in that?    ", "gilded": 0, "created_utc": "1308690094", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "&gt; I can't imagine it's easy to automatically discount someone looking you straight in the eyes and unabashedly telling you that he saw a crucified and buried man once again alive and well.\n\nGo talk to some of the thousands of followers of gurus like Sathya Sai Baba who claim to have seen his miracles firsthand.  Those who have seen supernatural events through the practice of Falun Gong. Visit the tens of thousands of those who claim to have been abducted by aliens.  All those who claim to have seen Bigfoot or the Loch Ness Monster or Chupacabra or Yeti.  The many who have claim to have heard amazingly accurate, otherwise unexplainable information from a psychic.  Those thousands who have seen ghosts.  Talk to some Scientologists who claim to have seen thetans cleared of the mentally ill, fully curing them sans drugs.  The followers of witch doctors, who will sincerely proclaim their magical powers by witness.  Perhaps you could speak to all those who saw miracles performed by now-discredited con-man evangelists.  Talk to the multitude of Catholics throughout history who have claimed to have seen saints [levitate](http://en.wikipedia.org/wiki/Saints_and_levitation).  Or the Catholics who take Polaroids of the sun and claim to see the Virgin Mary in subtleties of the lightplay.  The 30,000 who claimed to witness [The Miracle of the Sun](http://en.wikipedia.org/wiki/Miracle_of_the_Sun)...\n\nYou'll soon see how easy it is.  Especially when those witnesses are somewhat primitive and non-skeptical.\n\n**edit**:  And by the way, what I've listed is a tiny, TINY fraction of the ridiculous events that many people will look you in the eyes and \"unabashedly\" tell you occurred.\n", "gilded": 0, "created_utc": "1308713899", "subreddit": "Christianity", "score": 8, "controversiality": 0}
{"body": "That's silly. It's clearly the Loch Ness Monster.", "gilded": 0, "created_utc": "1308752382", "subreddit": "reddit.com", "score": 12, "controversiality": 0}
{"body": "I'll need about tree fiddy", "gilded": 0, "created_utc": "1308755791", "subreddit": "reddit.com", "score": 9, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1308760096", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "but we would have. Same for ghosts, vampires, the loch ness monster, and all that other bull shit", "gilded": 0, "created_utc": "1308761345", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Hey everyone, this guy has friends, a job, a postman AND a gym membership.. Lucky!!! (is there a 'Napoleon Dynamite' font?)\n\nIf this is a serious question, the answer is simple, you've found no reason to accept the existence of gods, they are much less probable than bigfoot, nessie, unicorns, etc, and surely they wouldn't think it was odd that you lack belief in those.", "gilded": 0, "created_utc": "1308771297", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "He should sing that song backwards or give her tree fiddy, quick!", "gilded": 0, "created_utc": "1308771388", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt; I do believe that ID should be taught in schools,\n\nFrom your comment, I take it you mean that ID might be taught in religious studies.  But why favor something like ID over, say, the claims that aliens built the pyramids?\n\nI'd be in favor of scrapping \"religious studies\" and replacing it with \"World Superstitions\".  It could cover Bigfoot, the Loch Ness monster, and Yahweh.\n", "gilded": 0, "created_utc": "1308776786", "subreddit": "atheism", "score": 10, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1308781268", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "No. Just because we cannot be certain of anything doesn't mean every assertion is equally true. Do you believe that Vishnu, Jesus, Xenu, The Flying Spaghetti Monster and the Loch Ness Monster exist? I'm guessing no. \n\nAlthough our minds are not able to view the universe in a way where we can determine something \"certain\" we can use empirical data to decide something is almost certainly false. Which is why I don't believe in anything I listed above. \n\nOn a slightly different note, I don't believe anything. I can decide something has enough evidence and declare it \"true\" but I don't have any faith that something is true. If I doubt something, I research it until I can decide if the idea's worth thinking about or not.\n\nFaith is not a virtue. It's a detriment to critical thought.", "gilded": 0, "created_utc": "1308800924", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "It was about that time i realized she was 2 story tall monster from the Paleolithic era ", "gilded": 0, "created_utc": "1308807591", "subreddit": "reddit.com", "score": 4, "controversiality": 0}
{"body": "That's when the random girl on the street said, \"can I borrow 'bout tree fiddy?\"", "gilded": 0, "created_utc": "1308809053", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "No because the Zodiac killer is most likely dead or in jail. Serial killers don't just stop. Especially ones that are so public. Perhaps OP's sick days would be better served looking for the Loch Ness Monster, Bigfoot or better yet aliens.\n\nKeep watching the ski^i^i^i^i^i^i^e^s", "gilded": 0, "created_utc": "1308813583", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "She needed about tree fiddy", "gilded": 0, "created_utc": "1308825235", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I'll give you tree fitty.", "gilded": 0, "created_utc": "1308854220", "subreddit": "Warhammer", "score": 4, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1308860344", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "It's not just religions it's irrational thoughts, religion is just the most famous of them. It's a bad thing when you don't think your actions through before doing them imo.\n\nI will think less of [adults] that think fairies and the loch ness monster are real too. Either way, atheism has nothing that inherently binds us to a single opinion on any subject other than belief in gods. So there are many answers to why we do what we do.", "gilded": 0, "created_utc": "1308865428", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "&gt;In that regard atheists come across as almost as goofy as the religious (almost).\n\nI think that's a bit illogical.  Theists are the ones that have pushed the theory of gods' existence for millennia, the burden of proof is on them to uphold their arguments for their beliefs.  You don't consider people crazy that believe there is no Loch Ness monster, just because they're sure it doesn't exist.\n\nAs friendlyfire very eloquently pointed out, atheism isn't defined as the assertion that there **definitely** is no god.  Atheism, to me and I think a lot of people, is simply not devoting any thought or care towards the existence of a god one way or the other.  On my own, I have spent a great deal of time thinking about the universe and 'god', but that's separate from my [lack of] belief, more of a philosophical venture than religious.  Most atheists will agree that they believe it is very unlikely that a god exists, but we don't go out of our way to talk to each other about how sure we are of this belief.\n\nRemember, what you see on /r/atheism is not always 100% representative of atheists as a whole.", "gilded": 0, "created_utc": "1308866534", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "When are you coming? The Phoenix reddit group is pretty active and lively,  getting a crowd together to celebrate your birthday would be easy. =)\n\nUnless you're the Loch Ness Monster.", "gilded": 0, "created_utc": "1308875188", "subreddit": "phoenix", "score": 1, "controversiality": 0}
{"body": "Will you be searching for the Loch Ness monster on your lunch break next Friday? ", "gilded": 0, "created_utc": "1308888342", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "Will you be searching for the Loch Ness monster on your lunch break next Friday? ", "gilded": 0, "created_utc": "1308888355", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "you mean the loch ness monster right?\n", "gilded": 0, "created_utc": "1308927464", "subreddit": "evedreddit", "score": 1, "controversiality": 0}
{"body": "you mean the loch ness monster right?\n", "gilded": 0, "created_utc": "1308927524", "subreddit": "evedreddit", "score": 0, "controversiality": 0}
{"body": "Magmar - Vesuvius\n\nPinsir - Gatack\n\nLapras - Nessie\n\nExeggutor - OverEasy", "gilded": 0, "created_utc": "1308940986", "subreddit": "pokemon", "score": 1, "controversiality": 0}
{"body": "Then I realized that girl scout was a 30 foot high monster from the crustacean period asking me for tree fiddy ", "gilded": 0, "created_utc": "1308941332", "subreddit": "southpark", "score": 2, "controversiality": 0}
{"body": "It really depends on how you like your nicknames.  For me, it'd probably end up something like this:\n\n* Magmar - Volcano / Flames / Flamethrower\n* Pinsir - Claw / Bull\n* Lapras - I like ZaxKellens' idea of \"Nessie\"\n* Rhydon - I named mine Samson\n* Hitmonchan - Rocky / Boxer\n* Exeggutor - Yoke / Shelly / Scrambled", "gilded": 0, "created_utc": "1308941802", "subreddit": "pokemon", "score": 1, "controversiality": 0}
{"body": "Those names ARE really good, but I prefer the silly names...much like \"Nessie\"", "gilded": 0, "created_utc": "1308942157", "subreddit": "pokemon", "score": 1, "controversiality": 0}
{"body": "Haha, very nice.  Vesuvius and Gatack I don't get, but I am definitely using Nessie.  ", "gilded": 0, "created_utc": "1308942208", "subreddit": "pokemon", "score": 2, "controversiality": 0}
{"body": "For me it would depend on the pokemon and gender.\n\nMagmar- Mason\n\nPinsir- Pesche (Bleach reference)\n\nLapras- Agnus/Nessie (I'll go with Zax's suggestion. Nessie is a good name)\n\nExeggutor-Jinmenju (That's the monster that exeggutor is based of)\n\nHitmonchan- Jackie\n\nRhydon- Sancho/Lupe (Lupe is what I called my Rhydon)", "gilded": 0, "created_utc": "1308943652", "subreddit": "pokemon", "score": 1, "controversiality": 0}
{"body": " &gt; ICE and the FBI are concerned that the Mexican Government has recently purchased 50 Nessie units from Smith Myers Communications.  These Nessie units are designed to listen into Nextel Direct Connect radio traffic.  They can do this by scanning; BUT always may specifically target any Nextel device by number as well.  The FBI asked the Mexican Government to sign a n  “Intercept Agreement” stating that they would not use these devices to listen to U.S. Government radio traffic, and the Mexican Government declined to sign the agreement.  The implication is that obviously the Mexican Government intends to do a lot of listening.\n\nUno de los tantos emails ", "gilded": 0, "created_utc": "1308943852", "subreddit": "mexico", "score": 5, "controversiality": 0}
{"body": "&gt;Magmar - Eyjafjallajökull\n\n&gt;Pinsir - Clamps\n\n&gt;Lapras - Champ / Nessie\n\n&gt;Exeggutor - Treebeard\n\n&gt;Hitmonchan - Rocky, George, Tyson, Sandman, Mr.Dream\n\n&gt;Rhydon - Juggernaut", "gilded": 0, "created_utc": "1308947852", "subreddit": "pokemon", "score": 3, "controversiality": 0}
{"body": "So as of now, this is what I have decided (mostly) for certain:\n\nLapras-Nessie\n\nHitmonchan-Jackie\n\nExeggutor-LovlyBunch", "gilded": 0, "created_utc": "1308975579", "subreddit": "pokemon", "score": 2, "controversiality": 0}
{"body": "Naw man, about tree fiddy.", "gilded": 0, "created_utc": "1309021736", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I tried to photograph a ghost once, but the damn Loch Ness Monster got in the way.", "gilded": 0, "created_utc": "1309022604", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "Gnostics claim to know, yes, however they do not necessarily claim to know with absolute certainty. The only condition you have for being a gnostic is that you hold gnosis about the existence of god, i.e. having personal conviction that it does or does not exist. In other words, holding it to the same certainty as you do the existence of big foot, the loch ness monster, unicorns, leprechauns, dragons etc. \n\nThere's a difference between knowledge and knowledge. The philosophical impossibility of knowing that something, such as a god, does not exists doesn't necessarily affect your gnostic position that none exists. They are two different definitions of knowledge that often gets confused. A gnostic position doesn't necessarily manifest itself as a claim about reality either, as in most cases that is simply a strawman position due to equivocation of different definitions of knowledge. Gnosis is the process of knowing something, i.e. knowledge that *you* hold. That knowledge is not necessarily shared with other people, i.e. shared knowledge/reliable knowledge (JTB). \n\nI just wanted to clear that up, as way too often it is argued that the gnostic position is one that is making claims about reality, which simply isn't true. The gnostic position only applies to one self, not the rest of the world. \n\nSome people might claim that it is intellectual dishonesty to assert that no gods exists. I disagree. It is no more dishonest than not lending any credence to ideas such as ghosts, UFOs, the shadow government etc. In your mind you know such stories are false. IMO, to claim that you leave the door open to such wild theories while in actuality you do not is being dishonest to yourself.", "gilded": 0, "created_utc": "1309038500", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "\"I ain't givin' you no tree fiddy\"", "gilded": 0, "created_utc": "1309094782", "subreddit": "AskReddit", "score": 24, "controversiality": 0}
{"body": "Your description suggests mole or freckle, but your picture suggests Loch Ness monster.", "gilded": 0, "created_utc": "1309103287", "subreddit": "Health", "score": 11, "controversiality": 0}
{"body": "It should be \"I need tree fitty to pay that god damned loch ness monster!\"", "gilded": 0, "created_utc": "1309105462", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "It's actually a long story. Back in 1926 the world was still recovering from world war 1, or as people originally called it \"the great war.\" This was the years prior to the great depression, which many people attribute to the wall street crash of 1929, but actually has a basis in many other aspects of the economies in the 1920s, with lower levels of employment and income. Some have attributed it to the fact that people would wear onions on their belts, as was the style at the time. Anyway, though he wasn't in power at the time Kaiser Wilhelm was actually still alive and thriving, having being saved at the battle of the somme by a young Charles Lindbergh. At the same time the mayor of Scotland had been playing a round of golf with his friend and upon hearing of the news of the Kaisers safe return to Germany had accidently swallowed his cigar and died. This meant that the King of england had to attend the funeral, which was held on the shores of Loch Ness. Loch Ness had been chosen as the place to hold the ceremony because the mayor would often go down to the shore to taunt the Loch Ness monster by throwing big rocks into the water. anyway, where was I? Ok, that's right, my grandfather was 13 at the time and so would go down to the local candy store to purchase some chocolate mints. He originally liked getting caramel but had once found a finger in one that belonged to the local butcher. He had accidently cut off his finger one day when greta Garbo had walked into the store. You see back in those days, the Garbo family would often go to butcher shops and give free palm readings. On occasions John Barrymore would join her and make people lemonade while they got their palm reading, and that was why my grandfather had been drinking lemonade that day. \n\nTL;DR: see back 60 years ago people would often go out on a sunday, which people called First Monday, and go and play tennis in the backyards of the wealthiest men in town before having to go back to work on Second Monday. They would often bring their own tennis balls which people would often make out of twine or sometimes scarves. Occasionally they would also bring pets which they had taught to retrieve the balls for them. I remember my family use to own a pet badger which was considered the best ball retriever in town. That badger would often get into trouble for stealing peoples pies from their windowsills. This one time he had been taking a blueberry pie when out of nowhere came a bat who picked him up off the ground and carried him into the neighbouring state, where he became king of the moles and led them in a revolt which sparked the great Melbourne fire of 1954. After that people would often terrorise their children by telling them that if they didn't eat their greens the great badger Themistocles would come and burn them alive. My family didn't like this as my cousin had once been burnt by a hermit who had wandered down from his cave in search of a non stick fry pan, Non stick Fry pans having been invented 3 months prior. prior to that people would often simply use a heated rock to cook their food, but would have problems when they had to cook rice, which is the reason people often ate antelopes in those days.\n\nTL;DR #2: I think my snake is getting fat cause I feed it too much calcium", "gilded": 0, "created_utc": "1309107053", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "'bout tree fiddy.", "gilded": 0, "created_utc": "1309161916", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "That something without prior evidence turns out to exist doesn't negate the fact that asserting that something must exist merely because it has not been disproved is bad reasoning.  If \"Person A\" turned out to be right about one thing, does that mean that everyone person who has made that argument is also correct about the existence of the thing that they believe exists?  If this \"pebble\" turns out to be real, does that also mean that God, Zeus, and the Loch Ness Monster are all real, also?  No.. because the reasoning is still bad, even if the person is coincidentally correct.", "gilded": 0, "created_utc": "1309167733", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "There is something that gives people ideas that they were being abducted. There is no evidence whatsoever that the origin of those abductions are because of aliens. None. None. None. I don't know if you believe in god or not, but if you don't just look at all those reports of miracles, answered prayers etc.. If you don't believe them, it's reasonable that those abduction stories are comparable to those stories (and stories about bigfoot, nessie and all those other \"theories\"). Give me evidence that anything of those stories are true and not a dream/hallucination/lie/manipulated by a hypnosis.", "gilded": 0, "created_utc": "1309189358", "subreddit": "skeptic", "score": 1, "controversiality": 0}
{"body": "Atheism. I can't remember ever believing in god (germany). I had a slight interest in alien abductions/bigfoot/nessie. \"Wouldn't it be cool if they were real?\". Now i dismiss all bullshit.", "gilded": 0, "created_utc": "1309189729", "subreddit": "skeptic", "score": 1, "controversiality": 0}
{"body": "It's worth about three fifty. Save it in case you run into a [loch ness monster](http://www.youtube.com/watch?v=Q8iHPC-dGKY&amp;feature=related). ", "gilded": 0, "created_utc": "1309202603", "subreddit": "Favors", "score": 1, "controversiality": 0}
{"body": "my, what a troll you are!\n\nWhat are you going to do, harass me until I say Bigfoot doesn't exist?\nOk, I give up - bigfoot doesnt exist. Neither do leprechauns, unicorns, the Loch Ness monster, a smaller government and the check is in the mail.\n\nLast  word: \n http://beta.news.yahoo.com/inflatable-shark-among-300-species-discovered-philippines-135007930.html", "gilded": 0, "created_utc": "1309204041", "subreddit": "skeptic", "score": 0, "controversiality": 0}
{"body": "\"I respect everybodies opinion\", unless that persons opinion is that theists are stupid.\n\nI don't see many atheists directly telling religious people are stupid (though we'll all gladly insinuate it in discussions with each other).\n\nThe same way you wouldn't bother trying to have a false respect for people who believe in UFO abductions/Loch Ness Monster/[insert something you think is bullshit here], we don't feel the need to have that false disrespect in discussion with each other (which largely involves OMG I CAN'T BELIEVE HOW STUPID THEISTS ARE BEING THIS TIME).\n\nAre you sure the perceived \"OMG THEISTS ARE STUPID\" you're getting from the /r/atheist crowd, isn't just you noticing them discussing WHY religious belief is ill founded (which sounds a lot like calling religious people stupid if you don't care about the reasons why its ill founded).\n\nThe fact none of us have ever met any religious believer who's belief wasn't based on a logical fallacy makes it easy to think/call theists stupid as well.", "gilded": 0, "created_utc": "1309205499", "subreddit": "fffffffuuuuuuuuuuuu", "score": 9, "controversiality": 0}
{"body": "My father constantly does the whole \"Tree Fiddy\" thing when it comes to Asian shopkeepers. I shudder every time.", "gilded": 0, "created_utc": "1309221234", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "tree fitty!", "gilded": 0, "created_utc": "1309276637", "subreddit": "Economics", "score": 1, "controversiality": 0}
{"body": "Does an Asian Loch Ness Monster count?  http://en.wikipedia.org/wiki/Lake_Tianchi_Monster\nAnecdotal evidence suggests there could be as many as 20.", "gilded": 0, "created_utc": "1309286364", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "dont be stupid. Nessie is REAL.", "gilded": 0, "created_utc": "1309290163", "subreddit": "IAmA", "score": 6, "controversiality": 0}
{"body": "Do you currently ride the Loch Ness Monster to work?", "gilded": 0, "created_utc": "1309290698", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "You Wont Get My Tree Fiddy! - Just minding your own business then out of nowhere !!BLAM!! The God Daaamn Lockness Monster shows up and wants Tree Fiddy!", "gilded": 0, "created_utc": "1309299043", "subreddit": "Economics", "score": 2, "controversiality": 0}
{"body": "Well the problem with NDE's is that they're a bit understudied.  They mainly rely on anecdotal evidence as well.  [13%](http://profezie3m.altervista.org/archivio/TheLancet_NDE.htm) of people claim to have them when they're near death, so it should be testable.  Janice Holden did an experiment using a monitor outside of the patient's viewpoint to test and see if anybody really went out of body and could tell what the picture on it was, but never found results.\n\nThe problem with anecdotal evidence is that it can easily be used to constitute a lie. The existence of [werewolves](http://en.wikipedia.org/wiki/Werewolf#European_cultures) has been attested to by quite a bit of anecdotal evidence as well in the past.  It was only once the myth was popularly held to be ridiculous when that kind of story stopped showing up.  The Loch Ness monster provides a great example today, even though the Loch doesn't have the capacity to sustain a breeding population of that kind of animal and there is no corroborating transitional fossils in the area.\n\nAs per what is happening with these 13% of people, I'd imagine it's a side affect of oxygen deprivation in the brain.", "gilded": 0, "created_utc": "1309302189", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "&gt; But there are things observed, experiences and events that defy current explanation. Not just because we imagine, but because we experience.\n\nThis sounds awfully close to accepting *anything* no matter the evidence.  Just because we can't explain it now doesn't mean we won't be able to some day.  Until we can, there is absolutely no reason to expect anything that would fall outside our naturalistic thinking.  \n\nI know you try to keep open to all possibilities, as do I.  I just see no reason to keep \"open\" so something that is *only* possibility with no evidence.  You're going down a dangerous path trying to be open to all possibilities.  Some things are just plain false.  I would go so far as to say I disbelieve in the god described in the bible.  \n\nThe problems start in that every person has their own version of \"god\".  It's pointless and useless to be open to every single version until it is disproven (where it's supposed to intersect with reality and doesn't).  It's also pointless and useless to admonish others for not remaining \"open\" to those possibilities.  \n\nThere is absolutely no reason to entertain every possibility of *anything*.  Unless it has some sort of factual backup, why even entertain the idea?  (unless you're just enjoying random entertainment, but even then, a rational thinker won't ever seriously believe any of it exists...suspension of disbelief and all)\n\n&gt; There's just so much more to ourselves and the universe that we don't know, can't explain yet. I choose to remain open on the subject of ghosts. \n\nAnd you're the one that brought up the supernatural.  Ghosts are not part of the natural world and have been examined, and reexamined time and time again in an attempt to prove them.  *Nothing* says that they should or even would exist.  Same thing with Bigfoot, the Loch Ness Monster, etc.  That is an extraordinary claim, and would need the extraordinary evidence, but they haven't even found \"ordinary\" evidence.  Until they've been proven, there is no logical, rational reason to believe.  The fact that the possibility has been thoroughly examined and nothing has been found leads me to disbelief, not staying \"open\".  \n\n[If you open your mind *too* much, your brain will fall out (take my wife)](http://youtu.be/bBUc_kATGgg)", "gilded": 0, "created_utc": "1309324943", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Hey, it's me again. I felt bad about this other comment to you and wanted to apologize. I was very rude to you and that wasn't appropriate or justified. Sometimes my exasperation gets the better of me.\n\nIt may help you to hear a bit about where I'm coming from on this \"supernatural\" stuff.\n\nBack when I was your age (guessing here), it so happens I was also very interested in parapsychology and all that stuff. The 50's with the Roswell stuff (OK, that was before my time), the 60's with various famous psychics and mediums, the 70s with Uri Geller of the bent forks... interesting times!\n\nI was thrilled to hear that psychic phenomena were being explored by real science, both academically and (hush-hush) by the militaries and secret agencies of the USA and Russia. *The Men Who Stare At Goats* conveys a bit of the atmosphere of those times and efforts. I was looking forward to hearing how teams of psychics were solving crimes and finding missing persons, and maybe acting as secret weapons.\n\n2 or 3 decades passed, and what happened was this: People forgot about UFOs because Roswell turned out to be a bunch of unsupported hype. Actually, that's not true: People in the USA and other havens of superstition continue to believe in UFOs; but in civilized countries in Europe, people lost interest. Scientists established theoretically that Loch Ness was unable to sustain a viable populatin of Loch Ness Monsters, but to be safe they thoroughly searched the whole damn lake. No monster. The famous psychics turned up... nothing. A few of them were jailed for fraud, and failed to see it coming ;) Allison DuBois, Sylvia Brown (?) and others were carefully vetted by experts... their success rates were even below what could be expected from random chance. Uri Geller's fork-bending tricks were exposed, and his famous stunt of making clocks and watches run again via TV was nothing but a stunt with a logical, mundane explanation.\n\nI'll say this much: I was disappointed. I had been genuinely excited about this stuff. It promised \"escapes\" from the idea of a humdrum existence controlled by predictable phenomena. If ESP was possible, then some people were special. If people were special, I could be one of those people. My motivation, in short, was similar to the reasons people like to believe in religion. Having a powerful special friend, being selected for eternal life... all that cool stuff.\n\nSo my irritation stems in part from being reminded of how disappointed I was to discover that parapsychology, ESP and all that other stuff simply isn't. Scientists are no longer exploring that stuff, they've lost interest because they've convinced themselves that there's nothing to explore. Everything, without exception, has an explanation in human misperception and simple fraud.\n\nAmericans, for one, are still highly interested. But Americans will believe in any crap. I'm sorry to say, but to the best of human knowledge, there ain't nothing out there waiting to be explored and explained.", "gilded": 0, "created_utc": "1309345764", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "nice try, loch ness monster.", "gilded": 0, "created_utc": "1309357195", "subreddit": "WTF", "score": 4, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1309358789", "subreddit": "nsfw", "score": 6, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1309371888", "subreddit": "fffffffuuuuuuuuuuuu", "score": 4, "controversiality": 0}
{"body": "Can anyone find me concrete proof or evidence that Thor does not exist?\n\nCan anyone find me concrete proof or evidence that Russell's teapot  does not exist?\n\nCan anyone find me concrete proof or evidence that The Loch Ness monster does not exist?\n\nCan anyone find me concrete proof or evidence that Santa does not exist?\n\nActually the Loch Ness Monster question was the one that eventually tipped the balance for me from wishy washy agnosticsm to full blown atheism.\n\n", "gilded": 0, "created_utc": "1309373285", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "And all this time I thought Nessie was just a submarine. ...Piloted by Bigfoot.", "gilded": 0, "created_utc": "1309404417", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "Loch Ness Monster has mutated!", "gilded": 0, "created_utc": "1309422020", "subreddit": "worldnews", "score": 0, "controversiality": 0}
{"body": "Damn you Loch Ness Monster, I said get out of here!", "gilded": 0, "created_utc": "1309440022", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "Exactly!\n\n&gt; It's always better to simply let the evidence that exists take you where it will and not classify yourself or your actions as \"skeptical\" or \"believing\".\n\nThis is my issue with UFO sightings - there is never a clear picture, never decisive video, and always some sort of extraordinary eye-witness account. It's similar to big foot sightings or the loch ness monster, people want it to believe and that's why they do - not because of the evidence that is on the table.", "gilded": 0, "created_utc": "1309451906", "subreddit": "UFOs", "score": 1, "controversiality": 0}
{"body": "[The picture of inspiration, My Nessie!](http://i.imgur.com/g2V1Z.jpg)", "gilded": 0, "created_utc": "1309469828", "subreddit": "secretsanta", "score": 1, "controversiality": 0}
{"body": "Well, you must realize that although there is often no definitive \"in your face\" space craft that can clearly be seen in fine detail, there *is* indeed often various corroborative pieces of evidence that keep the phenomenon in question from being able to be classified as purely or strictly \"terrestrial\".  This is a very important thing to realize, because it means that although you may not know what it definitely and specifically IS (a Gray E.T. ship from the Zeta Reticuli star system, for example), you do not have enough info to say what it definitely is NOT (i.e. an unidentified flying object in general).\n\nAdditionally, there is actually some information that does indeed show quite clear photographic (and moving picture) imagery that is quite staggeringly clear indeed.  As but one example, look up [Carlos Diaz](http://www.sigh7ings.com/documentary/ships-of-light-the-carlos-diaz-ufo-experience/).  Some of the footage of crafts that he has photographed and filmed is crystal clear.  I remember when I first saw the footage, I just *knew* it was absolutely fake!  It was too close and too clear to be real!  Additionally, the actual movements of the crafts were jagged and stunted and looked *very* unlike the movements of ANY terrestrial, Earth-based flying vehicles (jet planes, etc).  The movements made the ufos look *very* fake to me.  That caused me to question the authenticity of the footage.  However, I also happened to have read a book written by a man who had a doctorate in Physics and who worked deep in the military for decades designing all their top secret aircraft technology (I forgot his name, darn it).  The book was actually very detailed and not easy to get through since it had many in depth mathematical equations and many diagrams.  The military physicist went on to explain in great detail at least one type of electromagnetic technology that, when combined with the manipulation of certain atoms that *do* exist (but have not been able to be created in any labs here on Earth because, as I recall, we don't have the technology or equipment to contain their radioactivity) CAN actually produce the type of ability in crafts that not only allow them to travel near (or beyond) the speed of light, but which make their movements, when stationary, quite jittery and erratic.  The physicist went on to describe *exactly* how the crafts in the footage by Carlos Diaz were moving.  It was actually quite stunning to corroborate these two pieces of information, because they were entirely separate and unrelated from one another, and were decades apart in time from when they were originally made public.  One piece of information was actually confirming the other without even intending it.\n\nSo yes.  There IS indeed footage out there that is more than the very annoying little light blip in the sky that almost looks like it could be ANYTHING.  While some of that type of footage is still pretty impressive (the fleets of independently flying orbs over Mexico *cannot* be denied or passed off as weather balloons), I will still say that a lot of that type of footage annoys the hell out of me as well - especially when people fly off the handle, overreact, and shout or post \"Real UFO!  Must SEE!!\" Argh.  I feel like punching those backward idiots in the face, actually.\n\n&gt; and always some sort of extraordinary eye-witness account.\n\nWhile there IS in fact quite a bit of anecdotal \"po dunk, hill billy, country bumpkin\" kind of information out there, and while a lot of these tales and stories can and should be looked at with a doubting eye, there is actually a LOT of verbal information and confirmation that is given which CANNOT simply be so easily discarded.\n\nBilly Bob's high school drop out account of the gray alien that had dinner with him and his dog during last Saturday's football cookout might be something the average person would be right in questioning.\n\nHowever, when Nobel Prize winning citizens, when Pulitzer Prize awarded academics, when former presidents of the United States and various other nations and continents, when globally recognized medical experts and practitioners, when highly trained military personnel whom we otherwise trust our lives with handling delicate nuclear equipment  *all* explain - in separate, well thought-through accounts which are NOT related to one another but which share many of the same characteristics - that they have seen, communicated with, or been in direct contact with intelligent beings that are not from this planet, then one would be a delusional, mentally incapacitated fool to still question whether or not something extraterrestrial is going on in this planet.\n\n&gt; It's similar to big foot sightings or the loch ness monster, people want it to believe and that's why they do - not because of the evidence that is on the table.\n\nYou say this simply because you are not aware of the evidence that in actuality exists.\n\nThis is not entirely your fault.  There is something happening on this plant where the rulers of it and those in charge, for some reason, don't want to let any information out with regard to the reality of what's actually happening on and around it.  Given that these ruling forces are in control of so much of the media and commercial outlets, they do indeed have a stranglehold on what 99.9% of the human inhabitants of Earth believe is and is not true.  Your lack of awareness is, therefore, *very* understandable.\n\nHowever, there is indeed a LOT of information out there that, in a very sound, logical, and scientific way, very much contradicts what we are for the most part forced to believe is true here.\n\nThis planet really isn't how you think it is; or how I think it is, for that matter.  I wouldn't doubt if I'm not THAT far along with regard to the truth of what's really going on.", "gilded": 0, "created_utc": "1309473960", "subreddit": "UFOs", "score": 1, "controversiality": 0}
{"body": "It looks like Nessie to me", "gilded": 0, "created_utc": "1309476424", "subreddit": "pics", "score": 0, "controversiality": 0}
