{"body": "It's just the little Athiest club or circlejerk as karmanaut put it. \n\nThey like to feel special in their little rebelious elite club of non believers. \n\nThe few times I mention my own beliefs have been when people ask me religious questions. It doesn't make any sense to me really. \n\nWho cares if you don't believe in something, I don't believe in the loch ness monster but I never tell anyone my beliefs on the loch ness monster when they are talking about big foot or los Chupacabra.", "gilded": 0, "created_utc": "1246478928", "subreddit": "AskReddit", "score": -5, "controversiality": 0}
{"body": "&gt; I don't believe in the loch ness monster but I never tell anyone my beliefs on the loch ness monster \r\n\r\nAgreed, which is why I find these atheists so interesting.", "gilded": 0, "created_utc": "1246479265", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "Because people don't use their non belief in the Loch Ness monster to make laws that discriminate against others just because they thing the Loch Ness monster would disapprove of those others.", "gilded": 0, "created_utc": "1246480945", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Nessie! When did you come over from MrCranky?", "gilded": 0, "created_utc": "1246492651", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "But something strange happened. A minute later he started to walk towards me with a bold look on his face. He came up to me and was about to say something. I sat, interested, and asked what do want? He said... about tree fiddy. Thats when I realized that my ex. was about eight stories tall and was a crustacean from the Paleozoic era. Yep, it was that goddamn lochness monster again. So I said, \"Now I've told you once and I've told you a thousand times, I ain't givin' you no damn tree fiddy! If you want you can come with me, and we'll see about getting you a job, and you can make your own damn money!\" Then he starts going on about how he's got a bus to catch and can't stay around, then he takes off down the street. Running scared from a job... fucking ex.'s", "gilded": 0, "created_utc": "1246889653", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "But who will inform us about Bigfoot, the Loch Ness Monster, and crop circles?", "gilded": 0, "created_utc": "1246935331", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "Exactly. It's the same as any other belief that one lacks. Do you believe in the Loch Ness Monster? No? Are you saying you are positive it's not down there? Probably not... just that you have no reason to believe in it and you think the claims for it are most likely either lies or mistakes.", "gilded": 0, "created_utc": "1247155456", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "It seems like a lot of people here have a lot of anger relating to the subject of story telling. A story doesn't have to be factual to have truth. There are different levels of consciousness that human beings go through developmentally. Imagine a 6 month old baby, 2 year old, 7 year old, 12 year old, and 18 year old seeing the same image. That's archaic, magic, mythic(fundementalist), rational, and pluralistic levels. They all will see the same images but have a different \"interpretation\" of what they see. Every interpretation is accurate at the stage the person is at. They are not wrong for their interpretation. There are simply higher interpretations that the lower meme, belief system, can't see but the higher meme can see the level below. Hence, when I speak to my 7 year old son about Santa, fairies, Loch Ness monster, etc., it's not important whether these beings or creatures exist but what is the meaning of the stories told about them. When my son believes in Santa, Santa is very real to him, like it was to me. I would never tell my son there's no such thing as Santa. I'll let him figure that out. It's not important whether this was an actual person like Kris Kringle. When he finds out Santa is no longer \"real\", he'll have his moment, just like me, get over his upset, then be at a higher level which he'll appreciate, just like me. ", "gilded": 0, "created_utc": "1247206931", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Ghosts do not exist.  Here are my rankings on the likelihood of so-called supernatural things actually existing, from most to least likely:\r\n* Aliens/UFOs.\r\n* Loch Ness Monster.\r\n* Bigfoot.\r\n* El Chupacabra.\r\n* God.\r\n* Ghosts.\r\n* Pyschics.", "gilded": 0, "created_utc": "1247250360", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "But something strange happened. A minute later he started to walk towards me with a bold look on his face. He came up to me and was about to say something. I sat, interested, and asked what do want? He said... about tree fiddy. Thats when I realized that my ex. was about eight stories tall and was a crustacean from the Paleozoic era. Yep, it was that goddamn lochness monster again. So I said, \"Now I've told you once and I've told you a thousand times, I ain't givin' you no damn tree fiddy! If you want you can come with me, and we'll see about getting you a job, and you can make your own damn money!\" Then he starts going on about how he's got a bus to catch and can't stay around, then he takes off down the street. Running scared from a job... fucking ex.'s", "gilded": 0, "created_utc": "1247262979", "subreddit": "WTF", "score": -3, "controversiality": 0}
{"body": "What was the average lifespan of a person in the Paleolithic Era?", "gilded": 0, "created_utc": "1247291675", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "There is rarely \"literally no evidence\" for anything, up to and including the Loch Ness Monster.", "gilded": 0, "created_utc": "1247526612", "subreddit": "Health", "score": 1, "controversiality": 0}
{"body": "Damn! I thought i saw a real Loch Ness Monster. :))\n", "gilded": 0, "created_utc": "1247610861", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "Yea, they haven't spent much money investigating the easter bunny, the loch ness monster, or Santa Clause, either.\n\nGrow a brain.", "gilded": 0, "created_utc": "1247756571", "subreddit": "reddit.com", "score": -12, "controversiality": 0}
{"body": "The Loch Ness Monster has a wife? Maybe you're not a monster after all. &lt;3", "gilded": 0, "created_utc": "1247840938", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "LOL\n\na bunch of specs on grainy photos are supposed to prove we landed on the moon? these photos are worse proof than the video of bigfoot and the photo of nessie.", "gilded": 0, "created_utc": "1247885459", "subreddit": "technology", "score": -3, "controversiality": 0}
{"body": "we can take crystal clear pictures of other galaxies millions, billions, and even trillions of miles away. yet the best picture we can get of the supposed sites we landed men on the moon, look worse than the bigfoot video and the picture of nessie?\n\nwere these pics taken in the early 70s when we couldn't take pictures better than this, or is NASA still using the same technology that takes 5 minutes to add  3 + 3 that they used to land man on the moon?", "gilded": 0, "created_utc": "1247885737", "subreddit": "pics", "score": -1, "controversiality": 0}
{"body": "Also, I suspect a multibillion dollar investigation into the Loch Ness monster would solve things for good!\n\nUnless it doesn't find anything... then maybe we'll never know!!", "gilded": 0, "created_utc": "1248055781", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Sorry for the late reply. I haven't seen much of Reddit since my return from holidays.\r\n\r\n\r\n&gt;It was the tree that gave them the knowledge, because they didn't have the knowledge until they ate from the tree, they couldn't properly judge\r\n\r\nNo knowledge whatsoever? I am skeptical. You will recall that there was a tree of life in the garden which nobody ate out of. (Genesis 3:22) The author of Genesis obviously didn't think that it was impossible to live without it, since he never ate of it and neither did Adam or Eve, so why should he think that good and evil is impossible to know without the tree?\r\n\r\n\r\n&gt;[T]hey did not know what death was because in Eden it did not exist\r\n\r\nDo you know what an out-of-body experience is? That's curious, if it doesn't exist. What about ghosts? The Loch Ness Monster? God? Chances are that you believe that at least one of those doesn't exist.\r\n\r\n\r\nNow for free will. Free will involves choice, and the potential for either good or evil. Adam may have been predisposed to do good instead of evil, but free will makes it so that there's still a potential for evil. God had nothing to do with the decision to eat the fruit. Adam caused himself to eat the fruit. \r\n\r\n\r\n&gt;Now how is that a violation of free will yet designing us so we will make this mistakes isn't?\r\n\r\nHe didn't design us to do any such thing. We designed ourselves to do that. You cannot make someone to freely do something. That is a contradiction in terms. He knew what we would do; however, knowing is not causing.\r\n\r\n\r\n&gt;Not make the problem in the first place if he doesn't want it?\r\n\r\nDitto.\r\n\r\n\r\n&gt;If it was going to be 4 then it had to be 4, otherwise it was not going to be 4 in the first place.\r\n\r\nYou are ignoring the *potential* for it not to be 4. In the first situation, where I rolled the dice in the past, you will probably agree that there was a potential for it not to be 4. The only variable I changed in the next situation was the time. Now I roll the dice in the present, and the answer is going to be 4. The very same potential exists. Why shouldn't it? It exists in the past. \r\n\r\n\r\n&gt;[T]his is god who has full control over everything who created Adam in such a way knowing that doing so would cause him to eat the fruit.\r\n\r\nGod had nothing to do with Adam's decision; otherwise, that's not free will. He can create him in such a way that the future outcomes are random, and not caused by Him. That's free will.\r\n\r\n\r\n&gt;Its like picking a number from 1 to 10 knowing that number will get multiplied by 10. Now you don't want to choose a number that ends up as 50 but you choose the number 5 anyway, knowing full well that it will end up as the number 50. And why are the numbers multiplied by ten? Because of another \"choose the number\" puzzle you made previously which you knew would affect the latest one and how it would affect it.\r\n\r\nThat's knowing *and* causing. It's possible for God to know and not cause. He has no biases to overcome.\r\n\r\n\r\n&gt;Well its just me but in Hosea 13:16, I wouldn't have smashed innocent children against rocks or torn apart pregnant women like god did.After all, they did nothing wrong. \r\n\r\nYou're [arguing from outrage](http://www.tektonics.org/lp/outrage.html). Besides, Hosea 13:16 is a prophecy, not a command! \r\n\r\n\r\n&gt;[Y]ou know what with the father doing the crime and the father and his sons and their sons onwards all getting punished, even the ones who weren't born yet.\r\n\r\nWhat are you talking about?", "gilded": 0, "created_utc": "1248111936", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt; No knowledge whatsoever? I am skeptical. You will recall that there was a tree of life in the garden which nobody ate out of. (Genesis 3:22) The author of Genesis obviously didn't think that it was impossible to live without it, since he never ate of it and neither did Adam or Eve, so why should he think that good and evil is impossible to know without the tree?\n\nWell for starters, Adam and Eve didn't have the knowledge of good and evil and in a land that is meant to be a paradise where you never grow old and die I doubt they would have gotten it without the tree.\n\n&gt; Do you know what an out-of-body experience is? That's curious, if it doesn't exist. What about ghosts? The Loch Ness Monster? God? Chances are that you believe that at least one of those doesn't exist.\n\nWhat point are you trying to get at? I don't believe that none of them exist, I just have no reason to believe that such unlikely things do.\n\n&gt; Now for free will. Free will involves choice, and the potential for either good or evil. Adam may have been predisposed to do good instead of evil, but free will makes it so that there's still a potential for evil. God had nothing to do with the decision to eat the fruit. Adam caused himself to eat the fruit.\n\nFree will does not come with the potential to do evil, it is the choice to do so within reason. If there is no evil, there is no influence and thus no motivation to do evil.\n\nThat and like I said, god created Adam knowing he would make the decision. Out of all the possible combinations he could have chosen, he chose to make one that he knew would go against his wishes. God created Adam knowing he would eat the fruit. How cn you really claim it was his own decision then?\n\n&gt; He didn't design us to do any such thing. We designed ourselves to do that. You cannot make someone to freely do something. That is a contradiction in terms. He knew what we would do; however, knowing is not causing.\n\nHaving full control over the creation and knowing the results of every combination can be considered causing what that person does. We didn't design ourselves at all. You can't really claim we have free will when we were made knowing what we would do when we could have been made in ways that we do not do the mistakes we do.\n\n&gt; You are ignoring the potential for it not to be 4. In the first situation, where I rolled the dice in the past, you will probably agree that there was a potential for it not to be 4. The only variable I changed in the next situation was the time. Now I roll the dice in the present, and the answer is going to be 4. The very same potential exists. Why shouldn't it? It exists in the past.\n\nIt seems you are ignoring the point. Yes there is potential but the dice is rigged knowing it will always end up on a certain number. There is nothing making it impossible for it to land on a different number but its set up so it will land on a specific one regardless.\n\nWhen you make a dice rigged to land face up with the number 4, the potential for it landing on any other number no longer matters as it will land on the number 4 and you know it.\nIts like playing russian roulette, spinning the chamber in such a way that you know it will end up with the bullet but you believe that because there is the potential it could end up on an empty barrel, you do it anyway despite knowing the outcome.\n\n&gt; God had nothing to do with Adam's decision; otherwise, that's not free will. He can create him in such a way that the future outcomes are random, and not caused by Him. That's free will.\n\nAre you even listening? The whole point I am getting at is if there is an all powerful creator who knows the outcome of everything, free will is an illusion.\n\nLook at it this way. If you throw a rock into a bush and hit a bird without knowing its there, thats an accident. If you throw it knowing the bird will be there, thats not an accident.\n\nWith god, lets ignore all the combinations for Adam and only focus on two. One is the one in the bible, the other is one practically the same except he is more likely to side with god than the former. God can make either of these, he knows the former will go against his wishes whereas the latter would not. He chose the former knowing full well that he would do what he did.\n\n&gt; That's knowing and causing. It's possible for God to know and not cause. He has no biases to overcome.\n\nFirst off, this is pretty much what god did, he chose a number knowing what would happen to it and it eventually turned into a number he didn't want. With Adam, he chose making him the way he did knowing what would happen to him and he eventually did something he didn't want.\nAs for biases, I doubt it considering he has a very jealous and vain nature.\n\n&gt; You're arguing from outrage. Besides, Hosea 13:16 is a prophecy, not a command!\n\nI find it pretty hard not to find outrage in ruthlessly killing children both young and unborn because a country had differing beliefs. You may claim it is an argument from outrage but it is clearly over the top. That and regardless of it being a prophecy, it is still a disgusting thing. That and in the bible, prophecies are seen as things that always come true.\n\n&gt; What are you talking about?\n\nRead my earlier posts, I explained it in alot of detail. Think of the father being Adam. The judge sentences him for his \"crime\". He also says that when his sons are born, they can also suffer for it, aswell as their sons and so on.\nGod punished Adam with exile from Eden and painful childbirth. He also did the same to Cain and Abel when they were born. He did the same punishment to the next generation and the one after that.\nIn short, you are getting punished for what Adam and Even did and you have to ask for forgiveness, even though you didn't do anything and its not your fault it happened", "gilded": 0, "created_utc": "1248116769", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I am an atheist. I do not believe in God (any and every god/gods) for the same reasons that I don't believe in Bigfoot, the Loch Ness monster, unicorns, dragons, little green men in flying saucers, Santa Claus, and so forth. If you want me to believe in their existence, then prove to me that they exist. No proof, no belief. Every believer that I've ever met shares one characteristic--they *want* to believe. It's an emotional response to some inner need of theirs.", "gilded": 0, "created_utc": "1248299402", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "The onus is you you because there is no clear and irrefutable evidence for God, so when you claim he exists you must support it. If I said aliens landed in Roswell or leprechauns exist, it would be unreasonable for me to say \"Well you can't prove it didnt happen/they dont exist, so its just as reasonable an opinion\" Or for a counter-example, a physicist could claim matter is a wave (which is highly counerintuitive), but they could present many experiments that support this claim. Its good for people to hold opposite opinions when both opinions are _reasonable_.\n\nThis response calls for a rather large aside: I believe the purpose of this debate is to determine whether or not god exists, not who is nicer or the motivation for engaging in a debate. I never argue about religion unless prompted (ie someone goes spouting off about religion or atheism or I know the person I am talking to enjoys debating). I debate about religion mainly for reason 3, I have never seen a religious debate ever change another person's mind so number 1 is almost always out of the question. I find people who are evangelical fairly irritating and presumptuous, I really don't want to know what they have to say about religion, I don't go around starting debates with random people to switch them to atheism, which people would probably find that irritating. Aguing about the existence of god is fairly anagous to arguing about politics in many ways. A person justify atheistic evangelicalism by saying that I am fairly certain I am right and I believe that it is important for other people to have beliefs that are true. I understand perfectly where you are coming from as I used to have very strong faith, so I propose that you open your mind and try a little thought experiment (I am not going to try to dissuade you from your faith).\n\n Suppose that on a fairly regular basis people you did not know approached you and tried to convince you that the moon landings were fake/ god was actually a giant cucumber that needs to be pickled and how we pickle god is by spreading the belief that god is a giant cucumber. This person approaches you and without provocation begins pontificating at you which absolutely no interest in hearing your arguments against what they say and tell you that you are a bad person for not believing them. They are also utterly convinced that they are right. This is how an evangelical appears to an atheist. Your faith seems as totally ungrounded as the next. I don't believe in your faith any more than I believe in cthulhu, the loch ness monster, or shiva. Can you imagine how annoying that would get\n\n Christianity (and faith in general) has several devices that makes it very convincing to some (including my former self) but they are unfortunately are not founded in reason:\n-Christianity is ingrained very rigorously from very early childhood.\n-There are lots of people that believe in Christianity\n-Many people respect the clergy\n-Christianity is very old\n-It is very comforting to believe in god(s)\n-Faith Community\n-Allows many people to share many values\n-etc\n\nIThe first, second and fourth devices are HUGE. They basically give more validity to Christianity than a modern day religious fringe group that would be readily dismissed.", "gilded": 0, "created_utc": "1248380748", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Haha, this reminds me of when I worked at CVS in our small town.  We didn't have a public toilet, but one for employees, so it didn't get used all that much.  One day, the pharmacist was sitting on the toilet and said he heard a \"blub blub\" sound.  When he went to flush, it wouldn't go down, tried plunging to no effect.\n\nSo they call the RotoRooter guy who comes out and starts trying to figure out the problem.  He realizes the toilet is not clogged, and that it's behind it somewhere.  \n\nLet me interject here that in this small town, there is no central sewage, so everyone has a septic tank, even businesses.  Apparently, something was wrong with CVS's septic and it wasn't draining, and hadn't been for a long time.  \n\nSo the RotoRooter guy realizes that there is a 200 foot pipe leading to the septic that is completely filled with poop.  Since there is no sewer system, he had to pump the poop somewhere.  That somewhere ended up being in the parking lot.  Right in front of the store.  There was a giant streak of brown on the carpet at the entrance.  Crazyness...\n\nAlso, it was a loong time before we stopped harassing the pharmacist about what must have been a massive dump.  We called it \"Nessie\"", "gilded": 0, "created_utc": "1248444702", "subreddit": "IAmA", "score": 26, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1248458053", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "Holy shit!\r\n[Nessie?](http://en.wikipedia.org/wiki/Loch_Ness_Monster)", "gilded": 0, "created_utc": "1248665541", "subreddit": "gonewild", "score": 8, "controversiality": 0}
{"body": "&gt; Theologians do not believe that he is either inside or outside the universe, as Dawkins thinks they do. His transcendence and invisibility are part of what he is, which is not the case with the Loch Ness monster.\n\nThis stuff reads like a satire.", "gilded": 0, "created_utc": "1248715828", "subreddit": "Christianity", "score": -2, "controversiality": 0}
{"body": "Congratulations. Unicorns now exist. Leprechauns, too. Fairies, elves, dwarves, bigfoot, loch ness monster, kobolds, dragons, chupacabra...", "gilded": 0, "created_utc": "1248721437", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "Though I agree with the sentiment I have to point out that Nessie is a girl.\n\nHmm, can a penis be considered a girl/given a girl's name?  The ones that I've known were given boy names/viewed as male....", "gilded": 0, "created_utc": "1248733562", "subreddit": "gonewild", "score": 3, "controversiality": 0}
{"body": "Back to the Loch with you, Nessie!", "gilded": 0, "created_utc": "1248783468", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1248812899", "subreddit": "WTF", "score": 6, "controversiality": 0}
