{"body": "OMG, They are from where I live! The lake footage is Okanagan Lake in the Okanagan valley in central BC and the song is about ogopogo, our 'nessie of the lake. This is hilarious. I need to find out more about these people.", "gilded": 0, "created_utc": "1204926224", "subreddit": "entertainment", "score": 4, "controversiality": 0}
{"body": "I was given a hit for saying that the absence of proof of God's existence did not disprove God's existence while simultaneously saying years of failed searching for the Loch Ness monster meant that it would be rational not to *believe* in Nessie.\n\nThis is crap, the two are not contradictory.  If the Loch Ness question were rephrased to say that years of failed searches *definitively* disproved Nessie's existence, then the two answers would be contradictory.\n\nIn short: bullshit!", "gilded": 0, "created_utc": "1205367443", "subreddit": "reddit.com", "score": 41, "controversiality": 0}
{"body": "Agreed\n\nSaying it is rational to not beleave in Nessie is not saying Nessie dosent exist just you have viewed the lack of evidence and consider that idea rational.\n\nYou have also considered the lack of evidence for god. But do not consider this evidence that god dose not exist. You did not say it is irrational to have faith  in god.\n\nYou did not say Nessie did not exist only that to think so is a rational view. ", "gilded": 0, "created_utc": "1205368317", "subreddit": "reddit.com", "score": 9, "controversiality": 0}
{"body": "I think it's related to the Nessie question:\n\n&gt; If, despite years of trying, no strong evidence or argument has been presented to show that there is a Loch Ness monster, it is rational to believe that such a monster does not exist.\n\nIf you answered yes here, you're saying it's rational to not believe in something when there is no evidence for it.", "gilded": 0, "created_utc": "1205370694", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Same hit, and I agree with you.\n\nWhen the question came up, I already expected the author to bring up the Loch Ness monster again, but then I consider the notion of Nessie and the notion of a deity to be in two very separate categories. Apparently some guy on the internet disagrees.", "gilded": 0, "created_utc": "1205405885", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "It decided to hit me with this one:\n\n&gt;Earlier you agreed that it is rational to believe that the Loch Ness monster does not exist if there is an absence of strong evidence or argument that it does. No strong evidence or argument was required to show that the monster does not exist - absence of evidence or argument was enough. But now you claim that the atheist needs to be able to provide strong arguments or evidence if their belief in the non-existence of God is to be rational rather than a matter of faith.\n\n\nUnfortunately for this test, the concept of the Loch Ness is that it is a corporeal creature that likely evolved through normal processes. One would EXPECT to find evidence of its existence.\n\nThe same cannot be said for an incorporeal god that is external to our existence.", "gilded": 0, "created_utc": "1205409065", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "&gt; You've just taken a direct hit!\n\n&gt; Earlier you agreed that it is rational to believe that the Loch Ness monster does not exist if there is an absence of strong evidence or argument that it does. No strong evidence or argument was required to show that the monster does not exist - absence of evidence or argument was enough. But now you claim that the atheist needs to be able to provide strong arguments or evidence if their belief in the non-existence of God is to be rational rather than a matter of faith.\n\n&gt; The contradiction is that on the first ocassion (Loch Ness monster) you agreed that the absence of evidence or argument is enough to rationally justify belief in the non-existence of the Loch Ness monster, but on this occasion (God), you do not.\n\nOn the first occasion, I was asked about the rationality of believing in the *physical* existence of a *physical* entity despite a lack of *physical* evidence.  In the second occasion, I was asked about the *metaphysical* existence of a *metaphysical* being based on *physical* evidence.  The two situations are not comparable.\n\n&gt; Earlier you said that it is not justifiable to base one's beliefs about the external world on a firm, inner conviction, paying no regard to the external evidence, or lack of it, for the truth or falsity of this conviction, but now you say it's justifiable to believe in God on just these grounds. That's a flagrant contradiction!\n\nNo, because the \"external world\" consists of the only world in which it makes sense to define externality: the physical world.  God (considering the substance, not the persons) is not a physical entity.  He doesn't exist in the physical world external to myself, and physical evidence *cannot* prove or disprove his existence.", "gilded": 0, "created_utc": "1205409719", "subreddit": "reddit.com", "score": 6, "controversiality": 0}
{"body": "Good link, I hadn't paid attention to whether there was an FAQ.\n\nRetaking the test, I still disagree with the assessment.  The first question asks \"If, despite years of trying, no strong evidence or argument has been presented to show that there is a Loch Ness monster, *it is rational to believe* that such a monster does not exist.\"  Question 14, however, says, \"As long as there are no compelling arguments or evidence that show that God does not exist, atheism is a matter of faith, not rationality.\"\n\nThe issue is that I think there a number of beliefs that are rational but not \"matters of rationality.\"  It's only irrational to believe in something that has conclusive evidence against it; to believe in something that has no conclusive evidence against it, but has no conclusive evidence for it is certainly rational, but still a matter of faith.  Fundamentally, the test is assuming that the set of rational beliefs and the set of beliefs decided as \"matters of rationality\" are identical, an assumption I would disagree with.", "gilded": 0, "created_utc": "1205435414", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "ah no ...Nessie where art thou ? You'd think that he might be easier to find dead eh!", "gilded": 0, "created_utc": "1205623683", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Thanks Nessie, this was the type of answer I was looking for. I have never been a fan of the English language but i can tell when something is just wrong.", "gilded": 0, "created_utc": "1205935014", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "You've heard of Nessie, Yeti and Big Foot all before.  Now read about yet another urban legend here: http://en.wikipedia.org/wiki/Lizard_Man_of_Scape_Ore_Swamp\n\n", "gilded": 0, "created_utc": "1206393419", "subreddit": "news", "score": 1, "controversiality": 0}
{"body": "Hi Nessie!\n", "gilded": 0, "created_utc": "1206628611", "subreddit": "science", "score": 1, "controversiality": 0}
