{"body": "If you want to be cheeky: Pastafarian\n\nIf you want to be accommodating: Non-believer\n\nIf you want to be loud and proud: Atheist\n\nIf you want to imply that religion is not important to you: None\n\nIf you want it to come across like you're not taking sides: Agnostic\n\nIf you want to be alternative: Empiricist\n\nIf you want to beat about the bush: Secular Humanist, Determinist, Hedonist\n\nIf you want to be intentionally vague: Yes, No or Maybe\n\nIf you want to be snide: Yeah, and I believe the Loch Ness Monster hangs out with unicorns, werewolves and pixies too.\n\nIf you want to be sarcastic: Baal, Zeus, Ra, Xipe Totec, Wotan, Quetzcoatl or Ixtab: Depends on the day of the week.", "gilded": 0, "created_utc": "1291191239", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Disobedience allows you to question that statement and think for yourself. Disobedience =/= do exactly the opposite of what you are being told\n\nWhy would he want me to put my finger in the electrical outlet? Should I do this? Is this right for me? What motives does Nessie have for telling me this? Is Nessie a good person?\n\nObedience in this case gives you one option, not putting your finger in that electrical outlet-- blind to why.", "gilded": 0, "created_utc": "1291215682", "subreddit": "TrueReddit", "score": 1, "controversiality": 0}
{"body": "I have a photo of the Loch Ness monster you might want to see.", "gilded": 0, "created_utc": "1291223987", "subreddit": "nosleep", "score": 3, "controversiality": 0}
{"body": "Listen, the burden isn't on me to prove there isn't a god, any more than I should prove that fairies, leprechauns, or the Loch Ness Monster doesn't exist.  You and others are the ones that are incessantly babbling about your imaginary friend so the burden of prove is really on you to come up with evidence.  Until then, your beliefs don't mean jack shit.  Just because you're confused as to the existence of god doesn't mean you have the right to shut me up.  I'm free to criticize religion and the supernatural whenever somebody mentions them first, as was the case in this thread.\n\nYou are trying to paint a picture of false equivalence, putting atheism on par with religion, but that really won't work.  Logic is better than \"faith\" and I have every right to say so.  If you don't know the difference, feel free to drink a nice warm cup of shut the fuck up.", "gilded": 0, "created_utc": "1291264845", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "*bout tree fiddy*", "gilded": 0, "created_utc": "1291281988", "subreddit": "reddit.com", "score": 17, "controversiality": 0}
{"body": "Loch Ness Monster. It's no myth. It's real http://www.metacafe.com/watch/38939/does_loch_ness_monster_exist/", "gilded": 0, "created_utc": "1291287863", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Who gave you tree-fitty you goddam loch ness monster", "gilded": 0, "created_utc": "1291291631", "subreddit": "WTF", "score": 42, "controversiality": 0}
{"body": "I say its about tree fiddy.", "gilded": 0, "created_utc": "1291292352", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Loch Ness Monster", "gilded": 0, "created_utc": "1291294817", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Champ. A sea monster like Nessie that lives in lake Champlain. So popular in our area he is the mascot of our minor league baseball team.", "gilded": 0, "created_utc": "1291299954", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "It's winter and Loch Ness is about to freeze over. Nessie hibernates in his mom's basement, which has internet access.  ", "gilded": 0, "created_utc": "1291313031", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I have never seen that video and I gasped when that creature's back breached the water. Incredible footage. I will never scoff at Nessie again.\n\nOH DAMN YOU GOT ME - edited because I went back to the footage and saw the comments stating it was from a movie. I thought I recognized Warner Herzog. I been pwnd.", "gilded": 0, "created_utc": "1291313109", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I'm from Maryland originally and we have [Chessie](http://en.wikipedia.org/wiki/Chessie_%28sea_monster%29).  It's a sea serpent that's sort of like Nessie from Loch Ness.  My step dad swears that he saw it once while he was out crabbing (something with a long neck that stuck its head up), but this was during the 70s when he was a recreational drug user.  ", "gilded": 0, "created_utc": "1291318436", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "What is offensive is the tone: It starts with the assumption that I'm right and you're not only wrong, but silly for believing in God.  \n  \nYou're probably objecting right now, but it's true, in two different ways:  \n * The suggestion that belief in God (or Allah), something that in one form or another has guided humanity for almost its entire existence, is exactly as relevant or believable as belief in the Loch Ness Monster.  \n * The attack on God(s) at all. An Atheist does not need to attack, discuss, or even address anyone else's faith, unless they're being attacked.  \n  \nConsider that second point carefully. This isn't an invitation to a dialog, it's an attack--an opening shot. In a mutually respectful environment, there is NO NEED for a dialog on such matters! I don't have to discuss religion with my friends or family because we get along just fine, regardless of our differences. Even if the environment is aggressive towards atheists (and in the big cities of Canada, I'd say it generally isn't), the best way to gain respect is to offer it first. DON'T make fun of people's beliefs, just politely say, \"I disagree.\"  \n  \nI have two nieces in their mid-late 20s. One is a deeply and profoundly religious woman, married with a family. The other is an avowed atheist, travelling the planet with her boyfriend and having a good time. They get together and do they argue religion? Do they discuss the morality of sex before marriage? No! They discuss family, friends, plans, the future, growing up together, and such things.  \n  \nThe \"need\" for a dialog between the various sides of the (a)religious spectrum is questionable at best, and these ads aren't the way to start the dialog at any rate.\n", "gilded": 0, "created_utc": "1291329680", "subreddit": "canada", "score": 1, "controversiality": 0}
{"body": "Yes, also our world leaders are merely puppets controlled by the molded plastic industry tyrants that secretly manipulate our minds using chemical weapons dispersed by plane contrails.  Not to mention the fact that they are also alien lizards have been secretly conspiring against the human race for hundreds of years. I bet you didn't know that the first Free Masons were actually plastic molders.  Coincidence? I think not.  JFK was said to have expressed unhappiness with the booming plastics market and planned on speaking out against the use of plastics, i don't need to tell you what happened to him.  9/11 happened just days before the WTO was to finalize a trade agreement that would increase the tariff on plastic goods imported into the US.  Have you turned on your sprinklers lately? Those suspicious rainbows you see are the result of chemicals that the kings of the molded plastic industry have introduced to our water supply to slowly turn us into slaves.  The chemicals work in conjunction with the microchips they have implanted in our bodies to create involuntary emotional reactions so that they can keep us from finding the truth.  Yes, oil companies, pharmaceutical firms, insurance companies, and banks pale in comparison to the evil that lurks behind those molded plastic ipod covers...\n\n\nEDIT: Crop-circles, loch ness monster, 2012, bigfoot.", "gilded": 0, "created_utc": "1291363252", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I'm skeptical about monogamy being common during the paleolithic era, but I see your point now.  Thanks for clarifying.", "gilded": 0, "created_utc": "1291424863", "subreddit": "Anarchism", "score": 2, "controversiality": 0}
{"body": "Wow, that is terrible.  I've been here 2 decades+, the first I have ever heard of anything like this.  Nessie mentions the potential for [buckwheat (soba) allergy](http://www.allallergy.net/fapaidfind.cfm?cdeoc=199), would have that checked.  ", "gilded": 0, "created_utc": "1291450804", "subreddit": "japan", "score": 4, "controversiality": 0}
{"body": "did you say Tree Fiddy?", "gilded": 0, "created_utc": "1291488233", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "What's funny is taking the same article and replacing \"dragons\" with \"dungeons.\" Here's a taste: \n\nDungeons should be like Big Foot or the Loch Ness Monster – often talked about but rarely, if ever, seen. Just because the first “D” in D&amp;D stands for dungeons doesn’t mean that you have to use them all the time. Overusing dungeons amounts to nothing more than abuse. Leave the dungeons alone and leave them out of your campaign.\n\nCall me old school but I believe that dungeons should be feared and revered. When the PCs face a Dungeon they should be scared. There should be no smug air of confidence. Any time a Dungeon is part of the combat there should be a very real chance that PCs will die. However, very few DMs seem to hold this belief any more. It seems that dungeons have become the standard go-to villain for many adventures, especially low-level adventures. Just look at a random sampling of LFR (Living Forgotten Realms) adventures and D&amp;D Encounters: Keep on the Borderlands and you’ll see exactly what I’m talking about. From where I’m sitting this amounts to nothing more than Dungeon abuse. Stop throwing dungeons at every party!", "gilded": 0, "created_utc": "1291497286", "subreddit": "rpg", "score": 3, "controversiality": 0}
{"body": "How is the evidence for any of these things better than the evidence for a subterranean Dwarven empire? In terms of demonstrability, what's the difference between souls and homoeopathy? What indicates the existence of a Deistic god and not a theistic or pantheistic god? When I answer these questions I quickly realise they're all in the same category of unsubstantiated claims.\n\nRuling out a belief is a terrible way to believe anything, believing everything until it is disproved is a total misunderstanding of logic. If you believe in ghosts, souls and deities are real until they're disproved, why not alien abductions, Atlantis and the Loch Ness monster? These are all rhetorical questions, I'm just trying to highlight a point.\n\nFree will is a different topic, and a big one. It doesn't apply to any of the 3 things you mentioned believing. It has no practical applications whatsoever actually (but it can be fun to think about). If you want to discuss free will, I'll have to ask you for a clear definition of what you mean by it.\n\nFinally, I commend you on being (even a little) unsatisfied with your beliefs, it's a rare and valuable thing regardless of what you believe. ", "gilded": 0, "created_utc": "1291507148", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "That's a good way to look at it.  I suppose though that when it comes to comparing the possibility of things like a subterranean Dwarven empire versus ghosts, there are a couple of points that might drive me to different conclusions.\n\nThe first would be the origin of the two idea.  The origin of subterranean dwarven empires as a concept is pretty traceable; even the inspirations for the fiction they first appear in can be reduced to pretty singular times and places.  The ideas of ghosts, on the other hand, appears to be relatively universal among human societies, suggesting either that it's just fiction with an origin much further back, or the idea has appeared in multiple places due to similar circumstances.  Of course that still wouldn't make ghosts real, but it does tend to form (in my mind, anyway) a circumstantial foundation of plausibility.  Or maybe if there were as many movies and stories and youtube videos about subterranean dwarven empires, I'd be more likely to consider them plausible, too, by virtue of exposure.\n\nThe second is personal experience.  I've had experiences that -could- be explained as ghosts, though I'm more inclined to believe any number of more rational other explanations.   Still, that leaves me primed to listen to other's stories without dismissing them out of hand.  I haven't had any experiences I'd be keen to blame on those underground dwarves of yours.\n\n&gt; If you believe in ghosts, souls and deities are real until they're disproved, why not alien abductions, Atlantis and the Loch Ness monster? These are all rhetorical questions, I'm just trying to highlight a point.\n\nSee, that's the thing.  I don't *believe* in any of these things, but some of them I think are more plausible than others, and I'm more willing to suspend judgement rather than dismiss them without direct evidence.  Atlantis has much more satisfying explanation in Mediterranean islands sinking due to volcanic activity than that a submerged continent has still evaded our mapping; All Loch Ness photos, to the best of my knowledge, have been shown to be staged; but there aren't answers for the better UFO evidence that seems as satisfying\n\n&gt; Free will is a different topic, and a big one.\n\nBy free will, I mean the absence of complete determinism.  I mean that without freewill, it would be possible given a complete understanding of the material in a brain and its surroundings in a closed system, you'd be able to predict its response with 100% accuracy.  Free will would mean that decisions aren't completely based on the position and composition of molecules a second before.\n\nAnd if free will exists, for me that seems to crack the dam of materialism (or physicalism, the better term NukethePope used below).  That's probably the logjam for me; if I could get past free will, I imagine the rest of it - the plausibility of ghosts, deities, etc. - would all go flowing away downstream with it.", "gilded": 0, "created_utc": "1291509227", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "And then I learned that the Loch Ness monster is actually a time travelling plesiosaur.", "gilded": 0, "created_utc": "1291553578", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "I was pretty upset when I saw Loch Modan. The fake Nessie corpse made up for it though.", "gilded": 0, "created_utc": "1291566514", "subreddit": "wow", "score": 6, "controversiality": 0}
{"body": "(Shamelessly copied and pasted)\n\nAnd I ask them, how do you think that? Why do you think the world's 12,000 years old? And they go, \"Well, we added up all the people born from Adam and Eve, added up their ages- roughly 12,000 years.\" Well, how scientific. I can't fucking argue with that kind of research. You think the world's 12,000 years old. \"That's right.\" Ok, can I ask you a question? \"Sure.\" It's a one word question. \"Fine.\" ...Dinosaur. If the world's 12,000 years old and the Bible covers it, why didn't someone bring up fucking dinosaurs? You'd think someone would have brought that up ...somewhere in the goddamn book. \n\n..And Jesus and the disciples walked down the path towards Nazareth but, oh, the path was blocked by a giant brontosaurus with a splinter in his paw. And the disciples did run a-screamin', \"What a big fucking lizard, Lord!\" \"I'm sure gonna mention this in my book\", ..said Luke. \"Well, I'm sure gonna mention it in my book\", ..said Matthew. \"I'm not sure what I saw\", ...said Thomas. Timothy nudged him. \"It was a big fucking lizard, Thomas!\" But Jesus was unafraid. And he took the splinter from the brontosaurus' paw and the brontosaurus became his friend. And Jesus sent him to Scotland where he lived in a loch oh, so many years attracting fat American families with their fat fucking dollars to look for the Loch Ness Monster. And oh, the Scots did praise the Lord. Thank you, Lord. Thank you, Lord. --Bill Hicks.", "gilded": 0, "created_utc": "1291662311", "subreddit": "reddit.com", "score": 12, "controversiality": 0}
{"body": "When I was a kid I thought the easiest way to find the Loch Ness Monster was by simply draining the lake...", "gilded": 0, "created_utc": "1291667558", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "I'd say about tree fiddy", "gilded": 0, "created_utc": "1291683355", "subreddit": "pics", "score": 33, "controversiality": 0}
{"body": "&gt; Thanks for addressing the issues, and not my character; it's appreciated.\n\nI never addressed your character, I was simply dismissive of your message.\n\n&gt; You haven't proven that He has/does not interact with individuals and could never prove that He has/does not because you cannot be at all places at all points in time. You also haven’t shown evidence of His impossibility either which must be assumed for your positive statement “God has not done any of these things” to be conclusive. Simply because He has not directly interacted with you does not mean He hasn't with anyone; thousands upon thousands of individuals claimed that He has.\n\nI already regret this interaction.  You stated this:\n\n&gt; If He spoke audibly to **you**...\n\nYour entire hypothetical was predicated on god interacting with me.  He hasn't.  So yes, I am justified in making the positive assertion that \"God has not done any of these things.\"  Moving on, your further reasoning is this:  \n\nIf I can't prove X (god) has not done Y (interacted with people), I am not justified to believe that X has not done Y.  So...\n\nIf you can't prove that leprechauns don't make cheese on alpha centauri, then you are not justified to believe that leprechauns don't make cheese on alpha centauri.  I await your proof.\n\n&gt; If you told me that Thor appeared to you today I would believe that you did in fact have a supernatural encounter with an entity claiming to be Thor.\n\nSo, you have only interacted with a supernatural being *claiming* to be Yahweh?\n\n&gt; Of course this would only be accepted as true if it is a given that you were not either lying/delusional which does account for some supernatural claims but not all of them as we have countless detailed testimonies from individuals who are not delusional.\n\nI don't see, in your world, how the distinction is made between the delusional and the non-delusional.  Please enlighten me.\n\n&gt; Of course you could then simply argue that they were lying. I'd have to counter that people who make a positive claim regarding supernatural activity and are subsequently persecuted for it would not willing suffer for a lie. This does not make sense psychologically\n\nPeople have been prosecuted for faiths other than yours, does that prove their validity?\n\n&gt; Scripture is supported historically and archeologically. To name a few examples:\n\nYour examples are irrelevant.  Your reasoning is: Real world entity X is in the text, therefore the text is true.  By your reasoning, because Spider Man comics are set in New York, Spider Man exists.\n\n&gt; Argumentum ad populum asserts that something is true because many believe it to be true which is not applicable here. I was restating eyewitness accounts of God, which is not an affirmation of popular belief but of firsthand experience.\n\nYour reasoning here: Many people have had experience X (of God), therefore X is real.\n\nHere is a short list of things that exist according to this logic:  All gods ever conceived, leprechauns, faeries, Bigfoot, the Loch Ness Monster, and aliens (of the flying saucer variety).\n\n&gt; You’ve inverted the process. Jesus didn’t/doesn’t compel His audience to accept a premise that He was/is God made flesh in a priori. Instead, His demonstrable premise included His ministry and works which then lead/leads to the inescapable conclusion that He was/is in fact God incarnate.\n\nWas Mohamed divinely inspired?  I assume no.  Why should I believe your holy text and not another holy text?\n\n&gt; will once again, pose a question that no serious atheist/naturalist has given me an answer to. Instead, I am usually met with silence. Can you conceive of one possible piece of evidence in favor of a personal, theistic Creator? Please, give me just one piece of evidence that you would deem admissible and convincing within the parameters of your materialist paradigm. Thank you.\n\nI am fairly confident of my grip on reality.  If a god appeared to me while awake, I would believe it to have occurred.\n\n", "gilded": 0, "created_utc": "1291712233", "subreddit": "DebateAChristian", "score": 3, "controversiality": 0}
{"body": "shoganai, Nessie, it takes a piece of everything to make a world.\r\nThank you to you too.", "gilded": 0, "created_utc": "1291725224", "subreddit": "japan", "score": 2, "controversiality": 0}
{"body": "I decided to throw my hat into the dog bowl (I'M NO GOOD WITH METAPHORS)\n\nFor shits and giggles I'll retort the summary as well\n\n&gt;Assuming god exists, arguments against theist claims are illogical/fallacious.\n\nYou could say the same about anything. 'If the Loch Ness Monster exists, arguments against its existence are illogical and fallacious'.  It's not a point because presuppositionalism doesn't prove anything.\n\n&gt;\"Interpreted metaphorically, there are no problems with the Bible.\"\n\nExcept that it's not factual and its morality is pretty shitty.  Which is not to mention that it is neither intended nor used as a wholly fictional work.\n\n&gt;Prior mythologies and texts must have been glimpses of the divine truth which was fully realised in Jesus\n\nI disagree with both of you on this.  In the telling of millions of stories, parallels are bound to occur because of basic story archetypes and coincidence.\n\nI've been trying to track down some of the more curious parallels, but I've yet to find really good sources for many of them.\n\n&gt;Natural selection is well-attested in general, but as a source of morality, it is no better attested than miracles\n\nHe switched from 'doesn't provide morality' to 'doesn't provide an ought'.  I pointed it out and refuted.\n\n&gt;Natural selection is itself a god-figure, and equally stupid (or not) as the Christian God.\n\nI didn't really get this out of the conversation.  Also, it's just playing around with the very ambiguous definition 'God'.  A god can be anything.\n\n&gt;Everything in this universe has a cause. Therefore, the universe must have a cause.\n\nFallacy of passing the buck/special pleading.", "gilded": 0, "created_utc": "1291726492", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "Reminded me of the Loch Ness monster in Amazon Women on the Moon: http://www.plesiosauria.com/amazonwomen.jpg", "gilded": 0, "created_utc": "1291732863", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "You may not believe Bigfoot exist, but then again you may not believe that the Loch Ness Monster exists.", "gilded": 0, "created_utc": "1291743152", "subreddit": "reddit.com", "score": 5, "controversiality": 0}
{"body": "1)  I was raised Roman Catholic, but was taught Sunday school at the church by my Protestant mother (and other, proper, cats).  I would go to service at the Salvation Army temple sometimes, my moms church.  When very young I'd go to bible camp and sing songs (sally anne, again) but I stopped probably around grade 4-5.  \n\nI'm an atheist now, and my parents are pretty liberal when it comes to a lot of things.  They certainly didn't let their theology get in the way of seeing these events for what they were - tragedy.  I know the parents of each of the first two were very religious, I don't know if that contributed much.  \n\n2,i) Pterodactyl 2,ii) Loch Ness Monster", "gilded": 0, "created_utc": "1291758640", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "&gt;You could say the same about anything. 'If the Loch Ness Monster exists, arguments against its existence are illogical and fallacious'. It's not a point because presuppositionalism doesn't prove anything.\n\nThat's not really an analogous argument. An analogous argument about the Loch Ness Monster would be an argument about what that monster prefers to eat or what (if any) scale configuration it had. And those arguments about **attributes** would be fallacious because they'd require taking the position that such a monster does exist.\n\n&gt;Except that it's not factual and its morality is pretty shitty. Which is not to mention that it is neither intended nor used as a wholly fictional work.\n\nThere are different types of writing in the Bible that I'd assume any textual critic would be able to tell you of. \n\n&gt;Fallacy of passing the buck/special pleading.\n\n[In a universe where everything is defined by cause and we can only observe effects of things with a cause it is not 'passing the buck/special pleading'.](http://en.wikipedia.org/wiki/Causality_(physics))", "gilded": 0, "created_utc": "1291806271", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt;That's not really an analogous argument. An analogous argument about the Loch Ness Monster would be an argument about what that monster prefers to eat or what (if any) scale configuration it had. And those arguments about attributes would be fallacious because they'd require taking the position that such a monster does exist.\n\nThey're not fallacious because you're either working in a hypothetical or proving a negative.\n\nIf I can prove that loch ness isn't big enough to support a breeding population of plesiosaur-sized animals, then I'm not using a fallacious argument.  If you can prove that it can, then you're making the case for the possibility of the loch ness monster.\n\n&gt;There are different types of writing in the Bible that I'd assume any textual critic would be able to tell you of.\n\nYes, I'm fully aware.  I know some of its supposed to be poetry, some of its supposed to be factual accounts, etc. etc.  \n\nBut at the very basic level of argument from document comes down to this:\n\nWhen we read or hear an account told by another person, we rely on that there is something that factually happened or existed behind what the person is saying.  This works for most things, though its of course tempered by credibility, corroboration and extraordinarity. But once you make a differentiation between two types of accounts, the problem is glaringly obvious.\n\n1) Natural claims\n\n2) Supernatural claims\n\nMany accounts of natural claims I've heard have turned out to be true (ie, something I could verify for myself), but I've never seen any case of supernatural claims leading to something verifiable.\n\nAs such, you would never be able to get me to believe an unverifiable supernatural claim based off of written accounts.  You could convince me about a certain war in Gaul under the roman empire using historical documents.  You couldn't convince me that the roman general levitated across the rubicon and shot down the gauls with his laser vision.\n\n&gt;In a universe where everything is defined by cause and we can only observe effects of things with a cause it is not 'passing the buck/special pleading'.\n \nIt's still passing the buck because you're only deferring the explanation to another level without explaining the cause of the prior level.  This leaves you saying 'Well God is the only thing outside the universe' which is special pleading.\n\nWhich is not to mention that causality is just the rearranging of energy and matter.  Creation ex nihilo is a separate category altogether.", "gilded": 0, "created_utc": "1291822635", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I never addressed your character, I was simply dismissive of your message.\n\n“You are my favorite comedian.” The intended subject in this statement is me, not my message.  \n\n\"Your entire hypothetical was predicated on god interacting with me. He hasn't. So yes, I am justified in making the positive assertion that \"God has not done any of these things.\" Moving on, your further reasoning is this:\"\n\nMy hypothetical builds on the assertion that even if God did directly interact with you, it could not be accepted as evidence according to your empirical standards for proof if you wish to remain consistent.  \n\n\"If I can't prove X (god) has not done Y (interacted with people), I am not justified to believe that X has not done Y. So...\"\n\nPeople can make positive statements. The question is whether those statements are or can be supported. \n\n\"If you can't prove that leprechauns don't make cheese on alpha centauri, then you are not justified to believe that leprechauns don't make cheese on alpha centauri. I await your proof.\"\n\nI await the supportive evidence which suggests their reality. \n\n\"So, you have only interacted with a supernatural being claiming to be Yahweh?\"\n\nThor and company don’t claim to be the one true living God – Yahweh does. He has also given us a means to know the truth of this statement, something Thor and company have not done.  \n\n\"I don't see, in your world, how the distinction is made between the delusional and the non-delusional. Please enlighten me.\"\n\nDelusion - a false belief regarding the self or persons or objects outside the self that persists despite the facts and occurs in some psychotic states.\n\n\"People have been prosecuted for faiths other than yours, does that prove their validity?\"\n\nIt shows that these people had a legitimate (in many cases supernatural) experience which lead them to accept their beliefs, whatever the message may be. Such occurrences are consistent with Scripture as Scripture explicitly acknowledges their reality. What I was arguing for there was the existence of supernatural occurrences themselves.\n\n\"Your examples are irrelevant. Your reasoning is: Real world entity X is in the text, therefore the text is true. By your reasoning, because Spider Man comics are set in New York, Spider Man exists.\"\n\nThe preserved written and oral history of a people is not analogous with the entertainment purposes of a comic book. The difference being, one is posited as truth the other fiction. Since Scripture is posited as truth and since we can observe the effects of that truth in many ways, it stands substantiated.   \n\n\"Your reasoning here: Many people have had experience X (of God), therefore X is real.\"\n\nMy reasoning here is: Because God exists, people experience God. In the same manner, we know logic exists because we see the effects of logic and not because we can prove logic. \n\n\"Here is a short list of things that exist according to this logic: All gods ever conceived, leprechauns, faeries, Bigfoot, the Loch Ness Monster, and aliens (of the flying saucer variety).\"\n\nAgain, I await the supporting evidence. All you’ve shown here is that people can make claims. We already knew that. The claims which merit closer inspection are those which include supportive evidence. \n\n\"Was Mohamed divinely inspired? I assume no. Why should I believe your holy text and not another holy text?\"\n\nI'm not telling you what you should and should not believe. What I am saying is that these accounts suggest a supernatural cause which cannot be discounted. If you take away the cause, you take away the effect. The effects of supernatural activity in this world have been innumerable, well documented, and ubiquitous with mankind. If you take away the possibility of supernatural activity, you must come up with an alternative cause for these effects, which cannot and has not successfully been done. \n \n\"I am fairly confident of my grip on reality. If a god appeared to me while awake, I would believe it to have occurred.\"\n\nAgain, if your own testimony regarding a supernatural event could be admissible, then other such testimonies must also be considered admissible. As it would be, naturalists/atheists/materialists don’t accept anecdotal evidence on principle. Thus this must include their subjective experiences as well.\n\nSo, the question lingers on which has gone unanswered by any atheist that I have asked. You demand proof yet cannot conceive of one single piece of evidence which could be offered as proof. Clearly, you either revise your position to state that no such evidence exists or you recalibrate your standards for proof. ", "gilded": 0, "created_utc": "1291831365", "subreddit": "DebateAChristian", "score": 1, "controversiality": 0}
{"body": "&gt;They're not fallacious because you're either working in a hypothetical or proving a negative.\n&gt;If I can prove that loch ness isn't big enough to support a breeding population of plesiosaur-sized animals, then I'm not using a fallacious argument. If you can prove that it can, then you're making the case for the possibility of the loch ness monster.\n\nIt is a fallacious argument to use a [bad analogy](http://www.don-lindsay-archive.org/skeptic/arguments.html#analogy). Discussing attributes of and existence of are separate arguments. You are trying to demonstrate why an argument is bad by making your own separate, not similar, bad argument.\n\n&gt;Yes, I'm fully aware. I know some of its supposed to be poetry, some of its supposed to be factual accounts, etc. etc. [snipped]\n\nWhich has nothing to do with your argument I commented about.\n\n&gt;It's still passing the buck because you're only deferring the explanation to another level without explaining the cause of the prior level. This leaves you saying 'Well God is the only thing outside the universe' which is special pleading.\n\nIt would be special pleading if that wasn't an attribute assigned towards God for Christians, Jews and Muslims et al prior to having to deal with that argument and/or if this argument required ignoring evidence that people think is contrary to it. They don't ignore that evidence often times but incorporate it. Special pleading in this instance would point a finger at the argument that if we observe everything must have a cause because the Universe is causal than the Universe must not need a cause or must have occurred non-causally.\n\nEDIT: I'd reply and all but this subreddit in its grand wisdom has decided to make me wait to post and your arguments are far less than compelling.", "gilded": 0, "created_utc": "1291937908", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "If Izzy had a spouse, she would be \"Nessie\" and she would be mine with &lt;3", "gilded": 0, "created_utc": "1291952999", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "No. BAD NESSIE!", "gilded": 0, "created_utc": "1292013733", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "The Loch Ness Monster forgives no one their three-fiddy.", "gilded": 0, "created_utc": "1292080200", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1292106579", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "It costs about tree fiddy.", "gilded": 0, "created_utc": "1292214667", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Counter-examples please! :)\n\nWhen I hear \"Beautiful Linux app\" I think of \"Yeti riding a unicorn surfing on the Loch Ness Monster\"\n", "gilded": 0, "created_utc": "1292215272", "subreddit": "software", "score": 1, "controversiality": 0}
{"body": "In reality?  A near-human person living in a cave couldn't explain thunder or earthquakes, so they made fables and legends to tell the tales of supernatural entities that rules these domains.  The first person to do that invented god.  As the years passed on, humanity discovered the true reasons for earthquakes and thunder and lightening, but in the wake of that knowledge, newer and bigger questions arose: what are the stars?  How does the universe work?  And so new gods were created to fill those gaps.  This process has been going on for the entirety of human history, and it still goes on today.  \n\nThink about history for a second.  Ptolemy, one of the greatest early minds (around 150 AD) discovered much about geography, and optics, but when he looked up at the stars which would wander across the sky in a chaotic manner, he was completely stumped.  \"I know that I am mortal by nature, and ephemeral, but when I trace at my pleasure the windings to and fro of the heavenly bodies, I no longer touch earth with my feet.  I stand in the presence of Zeus himself and take my fill of ambrosia.\"  \n\nThroughout history, when people reach the limits of their ability to understand the world around them, they invent gods to fill in the gaps of their knowledge.  Ptolemy wasn't the only one.  Newton laid the foundations of modern physics.  By many accounts, he was the smartest man to walk the Earth.  When Newton wrote about his three laws of motion, there was no mention of god.  When he wrote about his two body planetary model, there was no mention of god (EVEN THOUGH prior to his coming along, the understanding of planetary motion WAS ascribed to the gods because nobody understood it).  \n\nUnfortunately, Newton didn't quite have the math advanced enough to solve an entire model for the solar system -- it was much too complex for his 2 body model.  So when Newton goes to describe the solar system - when he is at the limit of his understanding of the universe - he invents a god to get him out of the woods.  \"The six primary planets are revolved about the sun in circles concentric with the sun, and with motions directed towards the same parts, and almost in the same plane. . . This most beautiful system of the sun, planets, and comets, could only proceed from the counsel and dominion of an intelligent and powerful Being.\"\n\nThese aren't isolated incidents.  Huygen solved Newton's solar system problem without talking about god at all... but when he talked about biology, he needed to invoke a supernatural power to fill the gap of his uncertainty.  So you see, god was invented a long time ago, out of man's discomfort with ignorance and inability to find true answers about the universe quickly, and god has been evolving in the minds of men ever since.  \n\nBut fear not.  A few hundred years ago, our ignorance about medicine and biology caused us to believe that god was directly involved in our lives with witches and demons and bleeding and faith healing and miracles.  The god we believe in today is MUCH less powerful than the gods we believed in centuries ago.  With every passing day, humanity learns more about the world and needs less to cop out with a cry of \"god did it.\"  In short time god will join the ranks of bigfoot and nessie. ", "gilded": 0, "created_utc": "1292221232", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "that god damn loch ness monster", "gilded": 0, "created_utc": "1292367664", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Bloody hell. Next you'll be telling people the secret of how to get Nessie to come out of the Loch...", "gilded": 0, "created_utc": "1292369838", "subreddit": "til", "score": 1, "controversiality": 0}
{"body": "Nessie?", "gilded": 0, "created_utc": "1292381434", "subreddit": "comics", "score": 3, "controversiality": 0}
{"body": "&gt; to know there is no god means to know everything in the universe\n\nHe needed to give a (more) strict definition of \"god\". I can't think of any commonly accepted definition for which that would be the case. I know there's no Loch Ness monster and that doesn't mean I know everything about Loch Ness (or the universe). Clear definitions are important, it's impossible to rationally discuss anything without them and if there's a problem with the definition it's easy to spot. There are few terms so ambiguous and in need of strict definitions as \"god\", so it's especially important here.\n\nGood arguing and I hope you aced that exam.", "gilded": 0, "created_utc": "1292424733", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "This is absurd! You don't *know* there is no Loch Ness monster. You *don't think* or *don't believe* there is such a creature, but to say you \"know\" something (as a fact) means that you have evidence that proves it to be the case. You're right in the importance of clear definitions of words, but, too, they must be used rationally.", "gilded": 0, "created_utc": "1292425877", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Are you serious? When all evidence flies in the face of something it's fully justified to make assertions of knowledge regarding this thing. I know there's no Loch Ness monster like I know there is no goblin who hides my socks. All evidence suggests there is none, like all evidence suggests there is no Thor. Note that it's not a lack of evidence one way or the other, but evidence against. (although a lack of evidence where evidence should be, can wualify as evidence against). Gnosticism is justified when a claim is testable, like the Loch Ness monster or the biblical creation myth.\n\nOur knowledge of facts, of what's real and what's unreal comes from demonstrability, not absolute certainties (of which there are essentially none in reality).", "gilded": 0, "created_utc": "1292426740", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "\"Tree fiddy.\" ", "gilded": 0, "created_utc": "1292434428", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "'Bout tree fiddy.", "gilded": 0, "created_utc": "1292439848", "subreddit": "trees", "score": 16, "controversiality": 0}
{"body": "Naw, just about Tree fitty. :P", "gilded": 0, "created_utc": "1292448699", "subreddit": "entwives", "score": 3, "controversiality": 0}
{"body": "Does it HAVE to be a LAPTOP?\nYou could buy components from a site like Newegg &amp; build a desktop with 5 times the power &amp; speed for tree fiddy... or get a refurb from eg. Dell ...or a second-hand with a good spec and a bit of warranty left on it?", "gilded": 0, "created_utc": "1292535997", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "And her grandma to confirm her identity, and Ghost Bigfoot riding the Loch Ness Monster in a $6000 suit.\n\nI'm only making sure.", "gilded": 0, "created_utc": "1292546702", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt; My \"Claim\" as stated by you wasnt any...\r\n\r\nWhat? I literally don't know what you're trying to say there.\r\n\r\n&gt; This is not a scientific theory on how God exist, but I do think that theres enough evidence for God existing\r\n\r\nThen present it. Support your claim.\r\n\r\n&gt; even Dawkins has acknowledge that a case for a Deistic God can be coherently formed.\r\n\r\nNo, what Dawkins says is that, if anything, the deistic case is at least somewhat *defensible* in comparison to the big theistic religions, which are not.\r\n\r\n&gt; And since you havent show me any proof to the contrary I mantain my position.\r\n\r\nThat's not how it works. If you make a claim, the burden of proof is on you to demonstrate it, not on me to prove you wrong. What you did there is a classic example of [shifting the burden of proof](http://www.fallacies.info/burdenofproof.html). It's quite easy to demonstrate why this is a complete fallacy. Watch...\r\n\r\n* *I am Jesus resurrected. You must accept that position unless you can provide proof to the contrary.*\r\n* *The loch Ness monster is real and we must accept that claim as true unless you provide proof to the contrary*\r\n* *The universe actually doesn't exist, and it is entirely in my imagination. I must accept this as true unless you provide proof to the contrary.*\r\n* *We are all living in a Matrix-like simulation, and we must accept that as true unless you can provide proof to the contrary.*\r\n\r\nThis is why such a thing as \"burden of proof\" exists. Stop trying to escape it.\r\n\r\nMeet your burden and support your claims, or retract them and admit that you are either unwilling or unable to defend them.", "gilded": 0, "created_utc": "1292580857", "subreddit": "Christianity", "score": 9, "controversiality": 0}
{"body": "&gt;I'm not saying genetic mutations don't occur (obviously they do as shown in virii, etc.), I'm saying that sin affects them for the worse.\n\nAnd I'm saying there's no evidence to support that what so ever. You do not need 'sin' for genetic mutations and diseases to make sense. Regardless of which, if God is benevolent why would he decide to torture his creation in such a sadistic manner? You've still failed to answer this. \n\n&gt;Yes, you should. If there is ever even a slight alternative explanation, you should examine it to make sure that it does not hold up. I'm not saying you should accept it as true, I'm saying you should at least give it a chance.\n\nWell, I've considered it. There's no evidence to support it and the proposition is just absurd. It's no different from me saying 'bad things exist because of evil, pixies.' \n\nIf you've heard of Occam's Razor you'll note that if we already have an explanation for something, somehow trying to add another explanation to the explanation that adds nothing to it while further complicating it and not being supported by any evidence is an exercise in futility. \n\n&gt;I meant that I would have to be certain 100% that God does not exist. If you can prove that to me without me dying, then I would absolutely turn away from Christianity. However, right now this seems to me to be the only way to know 100%.\n\nYou don't need 100% certainty to believe in or disbelief in anything. It's this focus on absolute beliefs that seems to hold back so many theists from breaking out of viewing the world in such black and white terms. It seems as though you're willing to accept God based on nothing but blind faith, but will not let him go unless you have the most absolute of evidence. This is exactly the wrong way to go around trying to establish reality.  This is the equivalent of me deciding that fire breathing dragons absolutely exist and then expecting absolute, impossible to attain evidence that they do not before I let go of that belief. Do you not see the issue here? \n\nThe  burden of proof is on you to show your beliefs are true and justify them. It is not up to me to falsify your claims that are simply unsupported by evidence or reality. Any more than you have to prove Pixies or the Loch Ness Monster don't exist. \n\n&gt;To be honest, I don't. But from what I've seen and from what others have seen (who, you could say, may or may not be projecting situations and ascribing them to God), I think God deserves a bit of credit.\n\nPersonal anecdotes are simply not satisfactory evidence for anything. Do you accept accounts of people who have viewed the miracles of Islam as true? How about ancient priestesses who claimed to speak to Apollo? What about people who say they've been abducted by aliens? The unverifiable, subjective, personal opinions and experiences of people are simply not reliable to be used as evidence especially when they deal in the supernatural or extraordinary, for anything unless they have a great deal of weight supporting them. \n\n&gt;Then how did the idea of a god ever come into someone's mind? I mean, sure, humans are creative, but the fact that religion is such a large part of many people's lives points to the idea of at least the possibility of a god.\nOf course 'god' ( and we mean Yahweh and Christ here) is a possibility, just like pixies could be, or Zeus, or Odin.  There's just no evidence of it and hence no reason to believe in it.  The deistic view of a creator god is also one far removed from the man made myths of Christianity.\n\nAs for why humans think up Gods, the explanation I gave you earlier about humans placing intelligence into things that don't have them gives us a good early indication. Natural phenomena is given a intelligent agent as it can then be appealed towards. To people living in a harsh environment, who survive alongside nature and rely on it having some way to at least believe they can control it would be very important. It also serves as an explanation. It can help psychologically with the concept of death and existence, you'll note every religion has some concept of an afterlife beyond this. The idea of simply not existing is one the majority of people simply can't deal with.  We're notorious at anthropomorphising everything as a species to the point where many of us have come to the belief that this entire universe is in place for us. Hence creating gods, as putting us here because we're special in turn makes us feel special and protected. More pleasant for some than believing we're just some other animal, a product of evolution, that eats shits, breeds and dies.  Just some basic ideas behind why men may create gods.\n\n You must also consider the huge variety of gods men have believed in, you don't believe in any of these either and you don't because you've never been given any evidence to do so. I just go one god further. If you'd been born in ancient Greece however, you'd likely put your faith in Zeus instead of the Christian God. If you'd been born in Saudi Arabia you'd put your faith in Islam. Yet if belief is so fickle and based on geography then how sacred is it? How honestly have you really examined your beliefs in contrast to every single other one? When you do so you may realise they're not all that different, yet you reject them but accept your own seemingly for no reason other than blind luck.\n\n&gt;EDIT: Also, my friend wanted to say something.\n\nHe still failed to answer the question. Every one of those figures got empirical evidence of God. As did the multiple witnesses to events. Do you think every Jew who saw the parting of the red sea was an absolute believer before it happened? No doubts at all?  But after, well, they had everything they needed. \n\nHe also failed to address Paul who was an ardent non-believer until he got empirical evidence or any of the witnesses to Christ's miracles all who first hand got the evidence that converted them. \n\nThat's all I'm asking for at the end of the day. Some evidence. This isn't an unreasonable demand by any stretch of the imagination. The fact that nobody can provide it and instead just makes excuses as to why it has to be absent shows me that Christianity as with all religions are simply unsubstantiated man made myths that require blind devotion and a suspension of critical thought. \n", "gilded": 0, "created_utc": "1292643258", "subreddit": "DebateAChristian", "score": 1, "controversiality": 0}
{"body": "This is bad science. They are starting with an assumption, and then proceeding to find evidence to prove their assumption. Where is the control group? \n\nAlso, \n\n\"The Paleo diet is based on the diet of our human ancestors from the Paleolithic era\"\n\nCan someone explain to me the logic here?  Are they implying that something like wheat pasta or white rice is actually bad for athletes?  Seriously?  Also, positive results from controlled portions and exercise is old news.  A recent nutritionist saw similar numbers from simply eating 1,800 calories worth of twinkies for 10 weeks.  \n", "gilded": 0, "created_utc": "1292665792", "subreddit": "crossfit", "score": 1, "controversiality": 0}
{"body": "I knew Nessie was real. also i knew she took her winters in the suburbs", "gilded": 0, "created_utc": "1292693054", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Nessie is a guy by the way and what we are seeing here is Nessie doing his favorite pass time which consists of smearing lip stick on his mouth in a poor fashion and then going down the list of people he needs to kill who made fun of him in highschool.", "gilded": 0, "created_utc": "1292693484", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Nessie! Well that's one off the  bucket list.", "gilded": 0, "created_utc": "1292694505", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1292699049", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "I ain't got no tree fiddy.", "gilded": 0, "created_utc": "1292700218", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Do you believe in Nessie? \n\n", "gilded": 0, "created_utc": "1292718402", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "God dammit Loch Ness Monster, I ain't givin' you no tree fiddy!", "gilded": 0, "created_utc": "1292729491", "subreddit": "science", "score": 16, "controversiality": 0}
{"body": "Are you saying Nessie is a dragon?", "gilded": 0, "created_utc": "1292736284", "subreddit": "gaming", "score": -1, "controversiality": 0}
{"body": "Gyrados looks much more like a chinese dragon than Nessie.", "gilded": 0, "created_utc": "1292738094", "subreddit": "gaming", "score": 8, "controversiality": 0}
{"body": "The source of this article is English Pravda, whose excellent reporting includes, today, articles like:  \"Loch Ness Monster is coming back?\" under Science, \"Wikileaks, the US secret bunker, the Gulf of Aden Vortex: Contact made?\" (about aliens), and my personal favorite, \"Spankin' Sarah Palin: A clown short of a circus.\"", "gilded": 0, "created_utc": "1292738153", "subreddit": "conspiracy", "score": 6, "controversiality": 0}
{"body": "Just like with God and the many miracles attributed to faith, I come down really hard on the side of \"no proof, no credibility.\" I am fully convinced all this ghost and supernatural stuff is complete bullshit. The explanation is not \"nobody knows,\" the explanation is a bunch of gullible people with active imaginations.\n\nIn the age of submarines with sonars, people have stopped reporting sightings of the Loch Ness monster; similarly, the Abominable Snowman, the Yeti and many other weird apparitions. The countless anecdotes of bullshit don't make a sufficiently strong case for rational people, and I'm fairly sure this ghost hysteria will similarly die down eventually.", "gilded": 0, "created_utc": "1292746593", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "&gt;We don't need to use Gods for this example. Hence why I proposed pixies. We could say the Loch Ness Monster, fire breathing dragons, the cyclopes or any other mythological entity that you very much likely do not believe in.\n\nI'm going to jump in on this point if you don't mind. Posing pixies in place of the idea of god is a false analogy. Many people grow up to adulthood before coming to a belief in god--through much study and introspection mind you; however, I don't know too many(none) that do the same with pixies, do you? \n\nThe concept of god has been a philosophical debate throughout mankind's existence. It is not an unreasonable assertion that if it takes intelligence to understand nature, then it could have taken intelligence to create it. Conflating pixies with god is merely an attempt to make belief in god appear to be an unreasonable position. We have many reasons to believe that god exists, we have no reason to believe pixies exist, and furthermore, no reason to even consider their existence. \n\nPlease note: I am not arguing for the existence of god, I am making the argument that belief in god is *not* the same thing as belief in Santa Claus, pixies or the Easter bunny.", "gilded": 0, "created_utc": "1292773030", "subreddit": "DebateAChristian", "score": 1, "controversiality": 0}
{"body": "Loch ness monster?", "gilded": 0, "created_utc": "1292794031", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1292911802", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1292949584", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy.\n", "gilded": 0, "created_utc": "1292950172", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "Wha? ... Is Nessie saying that you dated a daughter of a Grammar Nazi Moslem? (and she got terrorized till she break up with you?)", "gilded": 0, "created_utc": "1292954644", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "**GRINDERMAN 2**\n\n*My baby calls me the Loch Ness Monster  \nTwo great-big humps and then I'm gone*", "gilded": 0, "created_utc": "1292957358", "subreddit": "Music", "score": 1, "controversiality": 0}
{"body": "Now I'm no genius, but would you explain the difference between what you wrote and what Nessie alluded to?", "gilded": 0, "created_utc": "1292968130", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt;Like gravity the time of mans deeds shall run into Truth, Christ.\n\nMore incomprehensible, meaningless babble then.\n\n&gt;Just setting a base line for agreement, GOD finished his science project, man hasn't.\n\nWhich God? Odin? Zeus? Hera? Apollo?  Why do you keep assuming Yahweh exists when you can't show he does?\n\n&gt;The void of space, how big is it, all eleven that are hypothesized?\n\nSo your argument for the supernatural is that space is really, really big? You realise space is all a natural phenomena right? Very convincing. That's also a great argument for the Loch Ness Monster, I mean, that Loch is really, really big. \n\n\n&gt;Christ has no fear of science, but science surely fears Christ.\n\nThe only thing science has to fear of Christ is when he convinces people that diseases are caused by demons, causing them to perform exorcisms on children that end up abusing or killing them where as modern medicine actually works. \n\nSo, you're quite right. The spread of ignorance is rather an issue for science.\n\n&gt;Israel, Jews, Jerusalem\n\nReligious people prove religion? Does that mean ancient Greeks prove Apollo? Hindu's prove Brahma? Scientologists prove Xenu?\n\n&gt;That's exactly what man has done for 2K yrs. Time is not forever.\n\nStill waiting, still waiting. \n", "gilded": 0, "created_utc": "1292979298", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "Goddamn Loch Ness Monster! Get your own goddamn pizza!", "gilded": 0, "created_utc": "1292985398", "subreddit": "food", "score": 3, "controversiality": 0}
{"body": "Everything seems to get downvoted these days (it wasn't me downvoting).\n\nNessie's is the right spelling, I just went with two 'r's as that's what it has in english (and I was too lazy to check), so really I should be getting the downvotes.\n\nEdit: Even xTRUMANx's awesome fix has got a downvote.", "gilded": 0, "created_utc": "1292987957", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I got the same letter.\r\n\r\nWTF is it with letters starting off with my first name?  I would not call him Al; he should not call me Nessie. It's \"Senator Franken\" and \"Mr. Loch Ness Monster,\" thank you very much.\r\n\r\nIf you're on Senator Franken's communications staff, please take note. I am not kidding.  ", "gilded": 0, "created_utc": "1293000466", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "so your full name is Nessie Loch Ness Monster? I always assumed nessie was a nickname and you were Mr. Monster", "gilded": 0, "created_utc": "1293008365", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "&gt;referencing the end of the world and the return of Christ.\n\nThe end of the kingdoms, mans self rule, powers over this world.\n\n[silliness](http://www.reddit.com/r/atheism/comments/epiy4/since_a_big_argument_is_always_its_only_a_theory/c19xd2w), meaningless babble, Which God? Odin? Zeus? Hera? Apollo?, Loch Ness Monster, perform exorcisms on children that end up abusing or killing where as modern medicine actually works, Greeks prove Apollo? Hindu's prove Brahma? Scientologists prove Xenu?\n\n\n", "gilded": 0, "created_utc": "1293042590", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "&gt;The end of the kingdoms, mans self rule, powers over this world.\n\nSo, end of the world nonsense. \n\n&gt;silliness, meaningless babble,\n\nYou've certainly been coming out with a lot of both.\n\n&gt;Which God? Odin? Zeus? Hera? Apollo?\n\nYou don't consider any of those gods as valid? Why not? Because your god Yahweh is the one true god? Based on what? You assume your God is somehow worthy of higher consideration? Why? Give me one reason why I shouldn't consider your god and your belief system in the same manner that I do Norse or Greek Paganism, or Zoroastrianism, or Hinduism, or Islam or any other religion that man has come up with?\n\n&gt;Loch Ness Monster\n\nI think comparing mythological beings is pretty accurate.\n\n&gt;perform exorcisms on children that end up abusing or killing where as modern medicine actually works,\n\nYou think this is nonsense? It actually happens and isn't a laughing matter. It happens as a direct result of belief in Christianity which within the bible itself teaches that diseases come from demons, not germs. Christ exorcises demons from people to cure them. You can ignore it all you want, but children are dying and the blood is on your belief systems hands. \n\nThere's also plenty of examples of Christians ignoring modern medicine in the place of prayer and letting their children die. Is this also silly nonsense to you? \n\nhttp://atheism.about.com/b/2003/08/14/couple-chooses-prayer-over-medicine-baby-dies.htm\n\nhttp://www.themoscowtimes.com/news/article/4-year-old-boy-dies-during-exorcism/410420.html\nhttp://news.bbc.co.uk/1/hi/world/americas/3179789.stm\nhttp://www.timesonline.co.uk/tol/news/uk/article530085.ece\nhttp://www.usatoday.com/news/world/2009-05-20-childwitch_N.htm\nhttp://news.bbc.co.uk/1/hi/uk/4596127.stm\n\n&gt; Greeks prove Apollo? Hindu's prove Brahma? Scientologists prove Xenu?\n\nYou made the claim that 'Israel, Jews, Jerusalem' somehow prove your religion. I asked if believers in any other religion proved that too. You seemed to ignore this.\n\n", "gilded": 0, "created_utc": "1293044115", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "THE LOCH NESS MONSTER IS MULTIPLYING!", "gilded": 0, "created_utc": "1293093977", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I don't require any reasons because it's the default position. The default position is to not accept a claim until it has been sufficiently demonstrated. As long as theist claims fail to convince me, I remain an agnostic atheist by default. Here's an example that you may be able to relate to more easily.    \r\n \r\n**Other**: *The loch Ness monster clearly exists.*    \r\n**You**: Actually, I have no reason to think it does.    \r\n**Other**: *Well, prove that it doesn't!*      \r\n**You**: You made the claim. The burden of proof is on you.          \r\n**Other**: *Until you prove that the loch Ness monster doesn't exist, I'm going to keep believing it to be true, and I think you're prejudiced against people like me for not believing in it.*         \r\n**You**: Well all you have to do is provide the evidence and I'll accept it if it's good enough.      \r\n**Other**: *What reasons do you have for not believing in it?*    \r\n**You**: My position is the default one. You have to convince me. That's how it works.    \r\n\r\n\r\nIn this case, you're the one backing the existence of the loch Ness monster with such arguments, except instead of the loch Ness monster, you're talking about God. I'm the one saying \"Well, support that claim with evidence.\"\r\n\r\nYou responded in two ways. First, you made an attempt to give me evidence, or an argument; something to support your claim. You described the fine tuning argument. I responded with links to videos and websites which point out the problems with the argument, and you dismissed them without addressing them. Second, you tried to escape by saying that your belief is faith based, not evidence based. If you wish to truly assert that second point, then we can have a discussion about that, but in order to do so, you need to get past this idea you have that I somehow need to prove you *wrong*, or that I have some burden of proof.\r\n\r\nSo, as I said above. You have 3 choices now:\r\n\r\n1. You can try to continue the argument from fine tuning by addressing the problems I linked you to about it.\r\n2. You can retract that argument.\r\n3. You can ignore that argument and forget about it and try something else, such as supporting the faith based aspect of it.", "gilded": 0, "created_utc": "1293130190", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "How much did those cost? Ohhhhh bout tree fitty.....", "gilded": 0, "created_utc": "1293148902", "subreddit": "funny", "score": 8, "controversiality": 0}
{"body": "Dude you forget the part where the Loch Ness monster hid the location to the Holy Grail in a complex numerological code embedded in the Mayan calendar predicting global apocalypse in 2012.", "gilded": 0, "created_utc": "1293151067", "subreddit": "reddit.com", "score": 6, "controversiality": 0}
{"body": "The Loch Ness monster wouldn't be in that lake if it weren't for the Babylonian space-ship technology. ", "gilded": 0, "created_utc": "1293151692", "subreddit": "reddit.com", "score": 9, "controversiality": 0}
{"body": "6 hunnit? Well, that's more than tree fitty.", "gilded": 0, "created_utc": "1293153406", "subreddit": "funny", "score": 25, "controversiality": 0}
{"body": "In principle I agree. In practice you have to deal with something you don't have to deal with in mathematics: our imperfect knowledge of the universe. Do you really know _for sure_ that we can not have gotten something about the laws of nature wrong and god therefore is, after all, possible?\n\nOr what if you're simply hallucinating all of this? Or maybe you've made a logical error somewhere? Maybe a semantic error? \n\nWould you admit that at least one of these are within the realm of possibility?\n\nGiven normal levels of evidence, the kind we use for Santa Claus or the Loch Ness monster, it is correct to say that supernatural beings do not exist. But absolute certainty is unattainable.\n", "gilded": 0, "created_utc": "1293153884", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "God damn loch ness monster, i ain't givin you tree fitty.", "gilded": 0, "created_utc": "1293162137", "subreddit": "atheism", "score": 11, "controversiality": 0}
{"body": "Cryptozoology is actually the search for creatures of legend, like the Loch Ness Monster and Bigfoot.", "gilded": 0, "created_utc": "1293162444", "subreddit": "IAmA", "score": 38, "controversiality": 0}
{"body": "Tree fiddy?", "gilded": 0, "created_utc": "1293168298", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "A few points: I indeed read the links that you send me...all of them, and when I find things like these \n\n\"It is possible to imagine that a supernatural process or law causes the universe to come into existence, instead of a personal being.\"\n\n\"The more we learn about the universe, the more we observe the power of natural law in developing existence into complex and wondrous forms.\"\n\nThe first paragrapah is speculation with no scientific evidence and thats the conclusion for Christ sakes!, in words of Walter Bradley Ph.D. in Materials Science from the University of Texas in Austin.\n\n\"The design requirements for our universe are like a chain of 1000 links. If any link breaks, we do not have a less optimal universe for life -- we have a universe incapable of sustaining life!\".\n\nThe author acknowledges(your link) the implausibility of we existing just because, and the everything can be explained by the laws of nature, that may have been caused by a SUPERNATURAL occurrence, very much in tuned with what Prof. Hawkins thinks, and its all screams the gambers fallacy,\n\nhttp://en.wikipedia.org/wiki/Gambler's_fallacy\n\n\nThe problem is that the Laws of Nature and the LP  dont explain a single thing, they are merely a description of what happens under certain conditions. Didnt I said this before?.\n\nBut let me make some more points on this. Laws cant exist causally prior to the creation of all matter at 0. Self-creation is a self-refuting contradiction. For a thing to create itself, it would have to exist before it existed.\n\nAbout your example on the Loch Ness Monster, it´s charming and rhetorically clever but incoherent.\n\nYou cant possible put in the same place God and the LNM,  unicorns, santa, or even so, the famous teapot idea made famous by Rusell, we can conclusively said that none of this things exist, this argument btw is not very used because is very easy to prove otherwise..We can disregard LNM because many expeditions have been made and the result search was 0, if santa existed as easy to go to the north pole and search for  warehouses in the north pole, we can easily confirm this, not quite the same with God now isn it? and by being an agnostic atheist you have to demonstrate the bases on why are you NOT an agnostic, granted,  but as to why you are an atheist, wich is why Rusell define himself as only an agnostic, because he knew that it is fallacious to considers a lack of evidence for God resulting in atheisim.\n\nAt the end, we don’t know, my evidence for God is again, faith, moral law, fine tuning etc… I view this things as evidence that God exist, you are taking a leap of faith in saying that God probably doesn’t exist, im taken the same leap of faith, just in another direction.\n\nRead this article from Steve Martin, yeahp the comedian, when tempted to say that someone is ignorant even though they are happy…then read that entire series by people who are way smarter than you and me. \n\nI will spoil the conclusion of that entire program “At the end we don’t know”.\n\nSimple as that.\n\nhttp://www.pbs.org/wgbh/questionofgod/voices/martin.html\n", "gilded": 0, "created_utc": "1293181684", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "My sister found out and she pointed to where my parents hid the presents.  I told her to STFU and not say ANYTHING.  Do not ruin this!  They could tell me the present was from the loch ness monster or bigfoot and I would pretend to believe if it meant I got myself a Nintendo.", "gilded": 0, "created_utc": "1293181757", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I said \"we'll take a box of the graham crunch. How much will that be?\" Well she looked at me and said \"That'll be about tree fiddy.\" Well it was about this time I noticed that this girl scout was about 8 stories tall and was a crustacean from the protozoic era!", "gilded": 0, "created_utc": "1293184405", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "1. The universe is clearly *not* fine tuned to support life at all. The vast majority of the universe will **instantly** kill you and most other life forms if exposed to it. It is full of dangers such as radiation, black holes, exploding stars, colliding galaxies and meteors. And that's just in space. On our own planet, we have an abundance of ways to die: tidal waves, earthquakes, volcanic eruptions, landslides, floods. The universe is trying to kill us at every opportunity. Furthermore, it took about 10 **billion** years for life to begin. How can you claim that the universe is so fine tuned for life when it took *that* long for it to happen?\r\n2. You are placing life on a pedestal because of your own bias. One could just as easily make the same argument that it is the planets that are fine tuned to exist, or that the universe is fine tuned to produce carbon or other heavy elements, or that it is fine tuned to produce galaxies. According to the argument, all of these things are just as unlikely to exist as life based on the supposed fine tuning of the physical constants. Your assumption, that life is somehow more objectively special than the rest of the universe, is exposed right from the start.\r\n3. The improbability of this universe existing as it is has *never* been demonstrated. We have a sample size of one! Making any kind of probabilistic statement about a sample size of one is ludicrous.\r\n4. The argument assumes that this universe is the only universe in existence, and that it has continued to exist forever with the same constants. Neither of these assumptions has been demonstrated, and in fact, leading scientific theories are now starting to go in the direction of multiple universes. In order for the fine tuning argument to hold up, you have to demonstrate that the assumption that this universe, with these constants, is all that exists, is true. If it turns out to be false, the anthropic principle and probability easily explains it away.\r\n5. The fact that these constants are even fine tuned in the first place is very much contested! The man in the video I linked you to, Victor Stenger, has performed simulations which show that the long lived stars (which produce the heavy elements required for life) can exist in quite a broad range of the four fundamental physical constants. Another physicist, Fred Adams, has done similar simulations in which roughly 25% of the parameter space of the fundamental constants lead to universes in which life could potentially evolve.\r\n6. The fine tuning arguments makes the assumption that we, life made up of heavy elements such as carbon and oxygen, are the only possible form of life. This also is a major assumption that has not been demonstrated. Once again, it's a major bias. It's an argument by lack of imagination.\r\n7. Life is adapted to the universe via the process of evolution by natural selection; it is not the universe that has adapted to life. People who argue the latter arrogantly think that the whole universe had to be adapted around them, rather than consider the possibility that they adapted to the universe.\r\n\r\n&gt; Self-creation is a self-refuting contradiction. For a thing to create itself, it would have to exist before it existed.\r\n\r\nThen how do you explain how the designer of the universe exists? This statement leads to an infinite regression of creation.\r\n\r\n&gt; everything can be explained by the laws of nature, that may have been caused by a SUPERNATURAL occurrence\r\n\r\nSupernatural means anything external to the universe, including, for example, some other universe or some kind of multi-verse or a multitude of other possibilities. \"Supernatural\" doesn't automatically mean \"Some kind of conscious designer\".\r\n\r\n&gt; and its all screams the gambers fallacy\r\n\r\nUh, what? I don't think you know what the gambler's fallacy is.\r\n\r\n\r\n&gt; The problem is that the Laws of Nature and the LP dont explain a single thing, they are merely a description of what happens under certain conditions.\r\n\r\nIn a sense, the laws of nature are just a model, yes. But that model does have explanatory power. Why is the sky blue? We can explain that by using the model: the sky appears blue to us because of a phenomenon called Rayleigh scattering, where the shape of the molecules present in our atmosphere causes blue light to be scattered more than red and green light. That's an explanation. But I don't see your point. Yes, the laws of physics are a model which can be used to describe and explain things in the universe. So what?\r\n\r\n\r\n&gt; Laws cant exist causally prior to the creation of all matter at 0.\r\n\r\nWhy? What's so important about matter? Or perhaps you mean to say energy? Quantum theory works fine.\r\n\r\n&gt; You cant possible put in the same place God and the LNM, unicorns, santa, or even so, the famous teapot idea made famous by Rusell\r\n\r\nWhy not? Well... it looks like you're about to give an explanation below. I'll continue...\r\n\r\n&gt; we can conclusively said that none of this things exist\r\n\r\nNo you can't. As I said before, there is no such thing as absolute proof outside of the abstract.\r\n\r\n&gt; We can disregard LNM because many expeditions have been made and the result search was 0\r\n\r\nThat's not proof that the loch Ness monster doesn't exist. Just because we haven't found it yet, that doesn't prove that it doesn't exist. Furthermore, that's barely even evidence. Do you know how deep that loch is, or how big it is? It's *huge*! Furthermore, inside, it's completely pitch black. People have explored, I would hazard a guess, less than 0.01% of the loch. Even if there are 10 monsters in there, it is very probable that, unless they surface often, we would still never have found even one.\r\n\r\n&gt; if santa existed as easy to go to the north pole and search for warehouses in the north pole\r\n\r\nDon't you know Santa uses magic to make his warehouses invisible to humans? Also, we haven't explored most of the North pole. We just haven't been to the part where Santa's workshop is yet. Also, Santa's workshop is underground. So you haven't disproved Santa either.\r\n\r\n&gt; we can easily confirm this, not quite the same with God now isn it?\r\n\r\nActually, it's exactly the same. We **cannot** prove that the loch Ness monster doesn't exist. We **cannot** prove that Santa isn't real. We **cannot** prove that Russell's teapot doesn't exist (that's the whole point of it). We **cannot** prove that Carl Sagan's invisible garage dragon doesn't exist. We **cannot** prove that God doesn't exist. But none of these things are supported by *any* evidence, and are all extraordinary claims.\r\n\r\n&gt; and by being an agnostic atheist you have to demonstrate the bases on why are you NOT an agnostic\r\n\r\nUh, I *am* an agnostic. In what way is an agnostic atheist not an agnostic? It's in the *name*. I suspect you're objecting to the \"atheist\" part because you don't understand what atheism actually is. I think you're about to confirm my suspicions...\r\n\r\n&gt; but as to why you are an atheist, wich is why Rusell define himself as only an agnostic, because he knew that it is fallacious to considers a lack of evidence for God resulting in atheisim.\r\n\r\nYup. Suspicions confirmed. Atheism is most generally defined as: a lack of belief in a God.\r\n\r\n*Anybody* who does *not* hold a belief in a God is by definition an atheist. That makes Russel an atheist. That makes me an atheist. That makes people who have never heard of gods atheist. Atheism is *not* just those who hold a *positive* belief that no gods exist. Once again, it is the name given to anybody who *lacks* a belief in a god, for whatever reason.\r\n\r\n&gt; I will spoil the conclusion of that entire program “At the end we don’t know”.\r\n\r\nAnd we don't technically know if the loch Ness monster exists, or if Russell's teapot exists, or if Carl Sagan's invisible garage dragon exists, or if big foot exists, or if the universe is really all just in my imagination, or if we are really in the Matrix, or if I am really dreaming right now, or about any number of other infinite claims! Which is why we have to accept claims based on *evidence*.\r\n\r\nBut here's another question. If you claim \"We don't know\", why do you claim to believe in a God rather than say \"I don't know if a God exists or not\"? You just admitted that the latter is the case, yet you still believe. Aren't you contradicting yourself?", "gilded": 0, "created_utc": "1293191258", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1293209093", "subreddit": "pics", "score": 9, "controversiality": 0}
{"body": "Bout tree fiddy. ", "gilded": 0, "created_utc": "1293213834", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "but it's NWT no more, so I'd say he could get about tree fiddy for it in 50 years.", "gilded": 0, "created_utc": "1293335844", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "I so want nessie, bigfoot, living dinosaurs in the congo and the rest of the cryptozoological beasties to be real. Even today we are discovering new species on a nearly daily basis. \n\nBesides as far as plesiosaurs go, if any dinosaurs could have survived the extinction event, would it not be the deep water ones?", "gilded": 0, "created_utc": "1293363877", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "I know the location of the Loch Ness Monster and would be willing to let him know as well. However, it'll cost him about tree fiddy.", "gilded": 0, "created_utc": "1293423714", "subreddit": "pics", "score": 13, "controversiality": 0}
{"body": "In his sentence the word \"hoaxer\" is being used to describe people who, as a hobby, investigate hoaxes, conspiracies, and other such arcana like alien life on earth or the Loch Ness monster.\n\n\"As a hobby\" is an important distinction, because people who do this as real, serious professionals are called \"journalists\" or, nowadays, dangerous anti-American \"cyber-terrorists.\"\n\nNone of this has anything to do with Scientology, which is not a conspiracy theory but a religion, and so by definition false.", "gilded": 0, "created_utc": "1293425165", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Love this and apparently your brother would fit in well with my family. Can't wait for the Nessie for-sale ad to be added to Best of Craiglist.", "gilded": 0, "created_utc": "1293435390", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I am constantly being followed by the gaw dayum Loch Ness Monster who is trying to get tree fitty out of me!", "gilded": 0, "created_utc": "1293469954", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "lol no you didn't.  None needed.  Your shit has no supporting data.  No basis in reality and lastly has make believe logic.  I put it somewhere between the Loch Ness monster and Big Foots.", "gilded": 0, "created_utc": "1293520418", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "&gt; Can you give some more information about why you think the Paleo Diet is bad?\n\nSure thing! My problem with it is 2-fold. One is the theory behind it and the other is the fad-ness and misinformation.\n\n* The Paleolithic era began some 2.5 million years ago. 2 million years is enough time for a speciation event to occur. Who in their right mind would think that we are still genetically adapted to the same diet as a different species? We don't even share the genus with Australopithecines! The Paleo Diet asserts that we need to be more like our hunter-gatherer ancestors. Popular belief grossly overestimates the amount of hunting that went on in history. The fact is, they didn't get much meat. A true \"Paleo-diet\" would consist mostly of insects, nuts, leafy greens, and scavenging off dead carcasses. Plus the theory ignores epigenetics altogether. \n* The other problem I have with the Paleo Diet is that it has been inundated with misinformation. It has become a fad and a quick weightloss scheme. It is based on old misguided science from the 80s and now people act like it's the new savior of humanity. It's wrong for publishers to parade this fad diet around under the guise of \"science.\"\n\n&gt;What kind of diet would you recommend?\n\nYou're really already on the right track by actively thinking and pursuing new information for your diet. Take out a piece of paper and write down a diet that makes sense to you. Put down a few general rules like, \"less processed food\" or \"more protein.\" Then make a list of good healthy foods/meals that satisfy your goals. Put the list up where you'll see it and so you can be periodically reminded (a good time to look is before going grocery shopping).\n\n&gt;Also, as far as protein tasting good in oatmeal: from what I've seen there are two flavors I can choose from, chocolate and vanilla. Which should I get? And do you have any brand recommendations?\n\nI like chocolate slightly more. I just buy the cheapest protein I can find. I got fed up with trying to determine quality so I decided to save money instead haha. My ex room mate used to love muscle milk cookies and cream whey protein powder. He said it's quality and it tastes great. He is a marathon runner guy so I believe him. \n\nGood luck with everything! Hope I helped.", "gilded": 0, "created_utc": "1293521328", "subreddit": "Fitness", "score": 2, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1293538835", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "That will be Tree Fiddy", "gilded": 0, "created_utc": "1293559214", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "Because thats what happens when two tectonic plates strike together.... My explanation is backed by scientific fact and can be independently tested by anyone with the proper knowledge and equipment.   Your \"God caused the whole world to flood\" explanation is just as plausible and backed by the same amount of evidence as saying the loch ness monster flew out of the water and sprinkled magical fossils all over the world.", "gilded": 0, "created_utc": "1293596951", "subreddit": "pics", "score": 12, "controversiality": 0}
{"body": "The Loch Ness Monster. It has now been 659 days since I killed the beast and not a day goes by that I don't feel for what I've done. I'm sorry Nessie :(", "gilded": 0, "created_utc": "1293644866", "subreddit": "AskReddit", "score": 8, "controversiality": 0}
{"body": "When SHTF I will ride my unicorn to the pot of gold at the end of the rainbow so that I can pay Nessie to join my party. ", "gilded": 0, "created_utc": "1293646958", "subreddit": "guns", "score": 25, "controversiality": 0}
{"body": "I tol' that goddamn loch ness monster I'm not givin' him tree-fitty. ", "gilded": 0, "created_utc": "1293648553", "subreddit": "AskReddit", "score": 8, "controversiality": 0}
{"body": "Sounds like confirmation bias to me, Nessie", "gilded": 0, "created_utc": "1293671943", "subreddit": "reddit.com", "score": 9, "controversiality": 0}
{"body": "ALL MY CUBS ARE CUTE. I'LL SELL YOU ONE TO YOU FOR TREE FIDDY.\n\nONLY TREE FIDDY.\n\nExecpt for Timmy the War Cub....he's my favorite.\n\nEDIT: Sorry for my poor grammar. I'm a Polar bear, what do you fucking expect?", "gilded": 0, "created_utc": "1293686695", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "\"Tree fiddy\" He says. Well, that's when I realized he wasn't no polar bear, but he was the god damn Loch Ness Monster!", "gilded": 0, "created_utc": "1293711314", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "'bout tree fiddy", "gilded": 0, "created_utc": "1293754349", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "About 'tree fitty.", "gilded": 0, "created_utc": "1293759660", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Just the opposite, actually. The holographic principle asserts that you can imagine the universe as being an information structure \"painted\" in two dimensions on the cosmological horizon, and that all interactions in the universe occur as a consequence of the way they're \"encoded\" in that information structure.\n\nBut it's important to remember that the holographic principle is just a fantasy right now. There's a lot of work being done on post-Einsteinian gravitation these days, none of it mature enough yet to properly be called science. The holographic principle might evolve into something scientific someday, but right now — unless you happen to be actively working it, obviously! — it should be put on the same shelf as Bigfoot and the Loch Ness Monster: possible, but unsupported by any good evidence, and thus unlikely.", "gilded": 0, "created_utc": "1293802889", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
