{"body": "i think this a resounding success like meta trolling.\n\n\n    IDers:                   we think you need to tell pupils about other theories and-\n\n\n    Science teachers:  -And flaws in the so-called theory of evolution?\n\n    IDers:                  YES!!\n\n    Science teachers:  how about how the Loch Ness Monster totally disproves evolution \n                              and how darwin spent years worrying about ol' Nessie as he  referred ot her in his\n                              journals?\n\n    IDers:                 Perfect. thanks we knew you would see his power  and wisdom\n\n\n    Science Teachers: wha?   [quietly amongst themselves] did this just happen?        ", "gilded": 0, "created_utc": "1249095493", "subreddit": "Freethought", "score": 5, "controversiality": 0}
{"body": "\"Nessie appears to be a plesiosaur.\" Apparently this is a fucking quote and the basis for this claim. Luckily this, according to the article, is not part of the public system: \"...which is taught in about 50 private Christian schools in the UK...\" The problem I see would be to give this exam equivalent weight to the standardized one. \n\nJust more proof that fundamentalists are not happy wallowing in their own disgusting beliefs and that we have to be dragged in to give them confidence and support. If everyone believes it it's true right? If everyone believes 'nessie' is 'real' and that it 'disproves' evolution then it must be correct, right? \n\nThese people make no fucking sense about science or even spirituality anymore and they must be stopped. I would like to kill them, or maybe lock them away, but I think in reality the worst thing we can do to these disgusting, retarded, insane, power-hungry, greedy, corrupt, thinking fail people is to *learn about biology and the theory of evolution and then teach it to other people.*\n\nYes, the enemy of thinking cannot be stopped by violence, but by thinking. They are really bad at it after all. ", "gilded": 0, "created_utc": "1249109730", "subreddit": "Freethought", "score": 3, "controversiality": 0}
{"body": "Hang on, I'll see if I have tree fiddy.", "gilded": 0, "created_utc": "1249146520", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "I don't think the Loch Ness monster has been [fucking] since it doesn't appear to have managed to have gone forth and multiplied in the several centuries of its non-existence.", "gilded": 0, "created_utc": "1249289576", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "&gt;One of the textbooks tells pupils: \"Have you heard of the 'Loch Ness Monster' in Scotland? 'Nessie,' for short has been recorded on sonar from a small submarine, described by eyewitnesses, and photographed by others. Nessie appears to be a plesiosaur.\n\n&gt;\"Could a fish have developed into a dinosaur? As astonishing as it may seem, many evolutionists theorize that fish evolved into amphibians and amphibians into reptiles. This gradual change from fish to reptiles has no scientific basis. No transitional fossils have been or ever will be discovered because God created each type of fish, amphibian, and reptile as separate, unique animals. Any similarities that exist among them are due to the fact that one Master Craftsmen fashioned them all.\"\n\nI'm British and my monocle just fell out.\n\nHoly fuck.", "gilded": 0, "created_utc": "1249297581", "subreddit": "atheism", "score": 36, "controversiality": 0}
{"body": "Damn Loch Ness monster strikes again!", "gilded": 0, "created_utc": "1249301693", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "Are you kidding?  Nessie has often gotten busy - there are loch monsters in lakes all over the world. See the [Global Lake Monster Database](http://www.lakedragons.livingdinos.com/), for example, which \"unlike most lake monster websites [only includes] the ones that might be giant marine reptiles that supposedly died out hundreds of millions of years ago.\"  \n\nThe website theorizes that \"it is relatively clear that some of them became trapped in the lakes as the waters from Noah's Flood receded about 4,400 years ago,\" but the real explanation is a bit simpler: all of these lakes are connected by a vast underground tunnel network, so when one of Nessie's wee monsters reaches the proper age, it leaves Loch Ness through the tunnels and swims until it finds a lake that has no monster.\n", "gilded": 0, "created_utc": "1249319568", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1249319988", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Nitpick:\n\nTo me, Bigfoot seems more plausible than Nessie. The majority of large dinosaurs, especially sea dinosaurs, are long extinct while there are currently many varieties of great apes.", "gilded": 0, "created_utc": "1249418105", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I'd need about tree fitty.", "gilded": 0, "created_utc": "1249517555", "subreddit": "conspiracy", "score": 6, "controversiality": 0}
{"body": "You're not alone! In my family the most religious members are also into cryptozoology, as well as believing in bigfoot, loch ness monster, alien abductions, you name it. I, the lone atheist (AFAIK) don't believe in any of that crap.\n\nWhy, my grandpa's twin sister even thought the Geico cavemen were real and asked me where they found them after all these years... No joke! I said they're just regular people wearing wigs, makeup, and prosthetics. Her reply, \"what are prosthetics?\" &gt;.&gt;", "gilded": 0, "created_utc": "1249671072", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1249877939", "subreddit": "WTF", "score": 8, "controversiality": 0}
{"body": "The wild beast and the false prophet spoken of are symbolic for something and the lake of sulfur is symbolic of complete destruction silly.\n\nOr do you think we will find the wild beast? What is the wild beast? The sasquach? Loch ness monster? The yetti? Ogo pogo? Which beast do you think we will find? Or is it just a wild animal like a bear bears are wild right. Can it be a wild camel? \n\nLike I said you don't even know anything about god if you think he's gonna torture people in hell or burn them fool.\nI really think you should look up those 3 scriptures I gave you early today about the dead.\n", "gilded": 0, "created_utc": "1249952377", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "Hey man, Magnathorax just needs about tree fiddy to get home.", "gilded": 0, "created_utc": "1249963692", "subreddit": "pics", "score": 12, "controversiality": 0}
{"body": "tree fitty!?!", "gilded": 0, "created_utc": "1250016164", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "\"...whats tree fiddy?\"", "gilded": 0, "created_utc": "1250021763", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I went to a catholic school from kindergarten through 3rd grade and absolutely hated going to church. Around 8 years old, I asked for proof of miracles and I got the old \"have faith first then it becomes true\" bit.  I never took religion seriously after that.  I specifically asked my parents to send me to public school, which they did.  They were happy to save on the tuition, I guess.  I spent most of my teens and twenties as an apathetic-agnostic.  I wasn't sure if a god existed, but I didn't really care one way or the other, since it made no difference in my life.  I became a full blown atheist around age 27.  A lot of my friends were having kids and getting all \"churchy\" and that made me re-realize a lot of the issues I had with religion when I was a kid.  I started reading up more on atheism, agnosticism, deism, pantheism, etc, and came to the conclusion that it was all bunk and that there was no truth in any of it.  I see no evidence whatsoever for the existence of anything supernatural.  No ghosts, no UFOs, no bigfoot, no Loch Ness Monster, no astrology, and most certainly no gods.", "gilded": 0, "created_utc": "1250109981", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Nessie, your article just supports  jasontimmer's point that japanese don't do it for the reward...\n\"But most finders don't bother making any claims, and the objects and proceeds usually end up going to the Tokyo government.\"\n\nyou don't know what you're talking about...\ndomo arigato mr roboto", "gilded": 0, "created_utc": "1250110147", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "What about \"Nessie\" stew fresh from Loch Ness? Or a side of deep-fried el chupacabra ears?", "gilded": 0, "created_utc": "1250112473", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Yes, I do agree that there are less literal religious figures, but my main beef with the clergy is that they are essentially part of a grand, sweeping, centuries-long scam. They are functionaries who are paid to do little more than simply protect a myth. \n\nAnd the thought that such a functionary can even bring legal action against someone who derides that myth just galls me to the core.\n\nHonestly, I don't see how believing in Jesus or Allah or Vishnu is any different from believing in the yeti or the sasquatch or alien abduction or the Loch Ness monster, yet people who claim belief in those things are ridiculed even by the most fringe believers in the rapture or the virgin birth.", "gilded": 0, "created_utc": "1250122082", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "So, no one can find Nessie, cause a Death Row inmate ate it? Makes me wonder about Elvis. D:", "gilded": 0, "created_utc": "1250128382", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Ghosts, UFOs*, The Loch Ness Monster, Planet X, God.\n\nNone of them exist.\n\n*implied aliens, not simply unidentified and flying objects.", "gilded": 0, "created_utc": "1250177199", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Budget Bong?  And noone has suggested Coca-Co*a?  C'mon!! Seriously an empty 20oz (you're gonna drink it all anyway), a Stic Pen (parts removed), and a piece of aluminum foil.  About $3.50 in parts (was that the god damn'd Loch Ness Monster?) you got yourself a bong.\n\nUPDATE: I didn't see someone else did that with a water bottle, but best budget bong around-you don't mind if it gets broken or lost", "gilded": 0, "created_utc": "1250442968", "subreddit": "Marijuana", "score": 1, "controversiality": 0}
{"body": "&gt; Kids can only not tell the difference between fiction and reality if you *don't teach them the difference*.\n\nI have emphasized the point that applies specifically to religious teachings.\n\nThey can remember the difference, but can they understand why some stories are fairy tales while other are real? If a parent tells a kid that Little Red Riding Hood is real and the Bible is fiction, at what age will a kid figure out on his own that what he was told is false? Odds are, unless the idea is challenged, they could easily continue believing it while they're adults, until something happens to make them see the cognitive dissonance. There's even a chance that they'll never be able to resolve the dissonance, and if there are other adults who believe the same thing, they reinforce each other's beliefs.\n\nSince there isn't a society that believes in the truth of those particular fairy tales, there are lots of people and ideas to challenge anyone who thinks it to be true. They'll get laughed at for a few days in kindergarten by the other kids, who will forget about it and move on. In one way, Disney has helped make many of the fairy tales \"unbelievable\", but think back a century before they were Disneyfied, and they may have been passed down as true stories, stories like the legends of King Arthur and Robin Hood. There are adults who still believe in things like Bigfoot and the Loch Ness Monster.\n\nThe only difference between a fairy tale and a true story is what the adult tells the kid. The kid then takes this information and learns from it as part of their mental development. Tell a kid that Little Red Riding hood is a true story and the next time they visit grandma, they need to be sure it's not really a wolf in disguise, and you will cause mental issues, and it wouldn't help if grandma had a poodle she loved to dress up as a person.", "gilded": 0, "created_utc": "1250474498", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "The Mary J. Blige Foundation: celebrating its 10th year of searching for the Loch Ness Monster. \n", "gilded": 0, "created_utc": "1250475995", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "browsing down this page, i finally find the comment i can reply under. i'm probably going to go on a rant trying to type this out, but it needs to be said. okay fuck it, i'm not going to try to be civilized;\n\nFFFFFFFFUUUUUUUUUUUUUUUUUUCCCCCCCCCCCCCCKKKKKKKKKKKKKKKK THESE PEOPLE !!!!!!!!\n\n* \"belief system\" .... WTF? not believing in god is a belief system now? WWHHAAATTTT TTTHHHEEEE FFFUUUUCCCCKKKK ????!!!! AND I NEED TO ARGUE MY DISBELIEF???? RAAAAAAAAAAAGEEEE **DO I NEED TO ARGUE MY DISBELIEF IN THE TOOTH FAIRY, THE YETI AND THE LOCH NESS MONSTER ASWELL????!!!!!!**\n\n* Sience itself is a believe system now? FUCK OFF BITCHES! next time you get sick i hope you fucking pray instead of going to see a sciency doctor. as a matter of fact i'm reading tuns of articles about idiots who let their children die because \"they don't need medicine, they need prayer\". and you know what i think about that ??? **GOOOOD** I fucking **love** to think about how those parents feel afterwards, i hope they all fucking die of sorrow. (poor kids though)\n\n* NOW, ABOUT THE FACT THAT YOU DONT ACCEPT EVOLUTION AS SCIENCE: LET'S SEE YOUR SCIENTIFIC CREDENTIALS OR **STFU**. Scientists used the **exact same scientific procedure** to interpret the evidence on evolution that they used to interpret the evidence of ... let's say ... heliocentrism, or (even better) the **fact** that the earth isn't flat. \n\nFUCK YOU JULI\n\nFUCK YOU JULI\n\nFUCK YOU JULI\n\nFUCK YOU JULI\n\nFUCK YOU JULI\n\nFUCK YOU JULI\n\n\n\n", "gilded": 0, "created_utc": "1250505361", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "But can you make a picture with Elvis shaking hands with the squirrel  as disaster girl looks on? Additionally, the picture needs bigfoot, grey aliens, the Loch Ness monster and the Wonder Twins from the Super friends.", "gilded": 0, "created_utc": "1250744923", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Chef's Dad: 'You gave that monster tree fitty?'\n\nChef's Mom: 'He tricked me.'\n\nAh, the lolz... The episode when Cartman drank Kenny's ashes and had to be exorcised by Chef's parents still kills me...\n\nChef's Dad: 'Oh lord, they didn't bring a victim child.'\n\nChef's Mom: 'We weren't gonna ask where you got it.'\n\nClassic.", "gilded": 0, "created_utc": "1250776522", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "I missed that landover title and didn't get it for a long while actually.. even clicked the link [Questions that evolutionists refuse to answer](http://www.landoverbaptist.net/showthread.php?t=3498) from one of the comments and got to \"Explain the Loch Ness Monster threw evolution.\" before I thought something was wrong. I have just gotten to complacent in accepting newer and newer levels of stupidity I missed it.", "gilded": 0, "created_utc": "1250908673", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "I remember you History Channel and I used to like you.\r\n\r\nYou were this place that used to broadcast documentaries and informative programs based on things that happened *in the past*. Things that happened previous to the present moment.\r\n\r\nInterestingly, all of human experience is located there. In the past. Previous to the present moment. In *history*.\r\n\r\nCuriously, you called yourself \"The History Channel\".\r\n\r\nBack there in the past, I used to flick to your channel when I felt like knowing about the Roman Empire, or World War I trench warfare, or the age of chivalry in the time of Agincourt, or numerous other events that occured in the past.\r\n\r\nI flicked over to you recently...\r\n\r\nUFO's, Loch Ness monster research, Ice Road truckers, dimwit guys who cut down forests, are you serious that that is your programming?\r\nWhat corporate executive conference based on Nielsen reports recommended this departure? In a way, I suppose, it says more about the demographics of advertising than it does about anything else. Apparently, in order to reach the most viewers, you must dumb down your content to the lowest common denominator in order to score a ratings bonanza.\r\n\r\nFine. That's your business model and I will never watch you again.\r\n\r\nHowever, my fear is for the wider implication of The History Channel's fall from \"history\". That of the market driven need. Unfortunately, 90% of humans could care less about what happened before they 'mysteriously arrived' here and how we got to where we are now. (That thing called History you named your channel after might help explain it). Apparently, your market instead demands Nostramus, the Loch Ness monster, and UFOs.\r\n\r\nSitting back and watching actual 'history' play itself out, I see clearly how we humans are doomed. \r\n\r\nYou've decided that none of the History Channel's audience/growing demographic is actually interested in history. 'History' is not entertaining enough. We humans are doomed because a majority of us do not care about what came before. We do not care to learn from our mistakes because the reality of our past, our *history*, does not sell product.\r\n\r\nBut UFOs, Ice Road Truckers, and Nostradamus do.\r\n\r\nDumbed down content attracts dumb people.\r\n\r\nAnd sadly, for humanity's sake, dumb people are the majority. \r\n", "gilded": 0, "created_utc": "1251107675", "subreddit": "entertainment", "score": 81, "controversiality": 0}
{"body": "Most people don't actual enjoy the analysis of historical documents in context, much less the study of history (by which I mean the study of the discipline of history, rather than the exercise of said discipline). They're much more interested in what can be called the storytime version of history, which can be seen in historical-fiction type books and the various works of popular history (can you guess what I'm doing my masters in?).  The history channel should, I think not concern itself for the most part with historiography, which is largely of interest to those working in the field (although I would not be at all adverse to a few shows covering it) but rather deal with the aspects of history most likely to be interesting and relevant to the viewership.  That being said I agree that shows about nessie or whatever nonsense is being pumped out by the channel these days belongs elsewhere.", "gilded": 0, "created_utc": "1251137830", "subreddit": "entertainment", "score": 3, "controversiality": 0}
{"body": "fail. i want ness from mother/EB. or at least the EB monkey riding on nessie", "gilded": 0, "created_utc": "1251143013", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I would think Bigfeets should be in the endangered list, and replace it with the Loch Ness Monster and/or Manbearpig.", "gilded": 0, "created_utc": "1251154157", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Let me go on a ramble that may or may not answer your question, based mostly on what I think are the common things that Europeans don't quite realize about the US:\n\nThe US is really big. 3,000 miles coast to coast, 2,000 miles north-south. Four times the size of Europe, without including Alaska. The south alone is roughly the same area that Napoleon conquered. Whereas a European can travel 500 miles by train and pass through 6 countries, an American can travel 500 miles and not leave California. Also, we're really really far from other countries - New Boston to London is a 6-9 hour flight, and that's the closest big city to Europe. There's Canada and Mexico, yes, but most Americans live pretty far from either of those countries too. So if it seems that Americans never leave their country, and consequently don't get first hand exposure to the rest of the world - that's why.\n\nEuropean countries are really homogeneous. Sweden is 95% Swede. Denmark is 95% Dane. Even countries like the UK and France, which get a lot of immigrants - the population is 80% native, with most of the immigrants coming from other European nations. The US, by contrast, is very heterogeneous. We're 74% white, the rest split about equal part black and hispanic, with a percentage or two going to everyone else. We've always had large immigrant populations which came from a different place than the current majority, so we've always had the problem of a sizable minority that's both \"different\" and usually \"poor\".\n\nWhy does this matter? While, being socialist is easy when you're 95% the same ethnic group. But the first time single payer healthcare was proposed in the US was under Harry Truman after World War II, about the same time the rest of the world adopted it. It failed because a federal program would have meant de-segregating hospitals in the south. Racism has a long and nasty history in this country by virtue of the fact that we've always had a sizable minority population - and it's very easy to demonize welfare of any sort in the minds of the ignorant by portraying it as giving money from the hard working \"us\" and giving it to the lazy, stupid \"them\". Look at one of the most common lies being spread about healthcare reform - that it's going to use tax dollars to pay for illegal immigrants (which in the minds of those inclined to believe it, is \"all hispanics\"). It's simply not a problem that European nations have really had to deal with, particularly the more socialist ones.\n\nWe're a very rural population. Only about half of Americans live in cities. About 21% lives in sparsely populated rural areas. The rest live in suburbs. Here's the interesting thing - your political ideology correlates very highly with the density of the area you live in. Europe has more of its population in dense clusters, and it's more left wing. The US has more of our population in rural areas - that population is more right wing. While one can point to our puritan roots to explain why we're such a religious country, I believe that this accounts for it better - rural people are simply more likely to have strong religious convictions, this is generally true on both sides of the Atlantic.\n\nWhat's worse - our Constitution gives disproportionate power to those rural citizens. Most European democracies have a parliamentary system featuring a unicameral (sometimes bicameral) legislature. The US has a bicameral legislature, but our upper house is nothing like anyone in Europe has. The US Senate is quite possibly the worst institution in the country, and possibly the least democratic democratic body in the world. Why? Because California (population 50 million) gets two Senators. Wyoming (population 500k) gets two Senators. That's a 100:1 power differential. By my count, 51% of the US population is represented by 28 Senators. Thanks to an idiotic procedural rule called the filibuster, a 60 vote supermajority is needed to do much of anything, representing 83% of the population. This, quite simply, fucks up our politics and gives an outsize voice and power to the most reactionary, ignorant, and bigoted among us.\n\nThere's a lot that I like about our constitution, but the way the legislative branch is set up is simply fucked up (please note, it made perfect sense 200 years ago, just not now).\n\nNow - my impression, from speaking to Europeans, is that history education is more or less the same. A student in Britain will get a course in British history that focuses mostly on events that influenced the island, going back to the paleolithic era. They won't cover Africa in those course. Students in the US get the same course. Most Americans do get a \"world history\" course as well, though it depends on the school in question - but let's be honest, a year simply isn't going to give you a deep understanding or appreciation of \"world history\".\n\nMy hunch is that Europeans know more about the US not because of some \"world history\" class they took, but because we're a super power so it impacts Europe, and Europe gets our movies and TV shows. With the exception of some British TV, we don't get European TV shows here, owing mostly to the language barrier. An American has to go out of his way to learn about global politics; Europeans would have a tough time avoiding American politics, or at least America's actions.\n\nWhich I realize it's only that last point that you even raised, but mine is this. It's very easy to point to differences and assume that they're cultural in nature - Europeans simply think differently than Americans in such and such a way, yadda yadda. But I prefer to look at the structural differences first. Control for those, and the distance between Americans and Europeans starts to close dramatically.", "gilded": 0, "created_utc": "1251251448", "subreddit": "reddit.com", "score": 7, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1251277884", "subreddit": "nsfw", "score": 2, "controversiality": 0}
{"body": "Nessie drives a boat?", "gilded": 0, "created_utc": "1251295450", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Out of tree fiddy.", "gilded": 0, "created_utc": "1251295619", "subreddit": "IAmA", "score": 5, "controversiality": 0}
{"body": "It's the Loch Ness Monster pretending to look like a boat. Evolution in action!", "gilded": 0, "created_utc": "1251295722", "subreddit": "reddit.com", "score": 5, "controversiality": 0}
{"body": "I aint givin you no god damn tree fiddy you god damn lockness monster!", "gilded": 0, "created_utc": "1251302951", "subreddit": "nsfw", "score": 1, "controversiality": 0}
{"body": "could be a giant squid or nessie's turd", "gilded": 0, "created_utc": "1251306648", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "don't give him no tree fitty!", "gilded": 0, "created_utc": "1251315810", "subreddit": "offbeat", "score": 5, "controversiality": 0}
{"body": "As much as I'd like to believe it *is* Nessie, I'm afraid you're correct.", "gilded": 0, "created_utc": "1251317307", "subreddit": "offbeat", "score": 3, "controversiality": 0}
{"body": "&gt;There have been \"no \"credible sightings\" of Nessie for over a year.\r\n\r\nWait, so there have been credible sightings before?", "gilded": 0, "created_utc": "1251318466", "subreddit": "offbeat", "score": 3, "controversiality": 0}
{"body": "[This](http://maps.google.com/maps?t=h&amp;q=57.3,-4.45&amp;ie=UTF8&amp;ll=57.168784,-4.631832&amp;spn=0.002306,0.00537&amp;z=18) was pretty suspicious too...  Clearly Nessie is using that boat for cover to hide her nefarious doings.", "gilded": 0, "created_utc": "1251321778", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "I was sergeant in army and after spending a month in forest, we came back and someone from my platoon deposited a monster that big that the whole barrack came over to see it, it must have have been at least a weeks worth of poo, anyway, the story spreaded as wildfire and in the lineup that evening there were countless jokes about the loch ness monster and such. we never found out, who it was, but the anus could have beat **goatse**, it must have been huge, or at least, extremely stretchable", "gilded": 0, "created_utc": "1251325667", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "When I first saw that I thought they meant the white smear to the right (in other pictures it is on the left?!?!?) of the boat. I didn't think that they meant the boat was Nessie. ", "gilded": 0, "created_utc": "1251375656", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "Oh please, you young folk have no idea.\n\nYou should have been around before there were PCs.  99% of people thought *the* computer (there was only *one* in most of their minds) was a calculating machine that sent them bills every month.  A network was something that showed their favorite sitcom at the same time every week.\n\nTry to explain your programming job?  Half of them envisioned you feeding the Loch Ness Monster.\n", "gilded": 0, "created_utc": "1251378298", "subreddit": "programming", "score": 75, "controversiality": 0}
{"body": "&gt; feeding the Loch Ness Monster  \n\nI want that job. Programming, monster feeding on breaks - hell yeah. :)", "gilded": 0, "created_utc": "1251383417", "subreddit": "programming", "score": 4, "controversiality": 0}
{"body": "Feeding Nessie is way cooler than, \"My Windows ME has been acting funny lately; I wonder if you could...\"", "gilded": 0, "created_utc": "1251385040", "subreddit": "programming", "score": 23, "controversiality": 0}
{"body": "Only if Nessie looks exactly like a boat and its wake from above.", "gilded": 0, "created_utc": "1251399088", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Unless it's an integrated laptop graphics card, in which case updated drivers must be procured from the Loch Ness Monster.", "gilded": 0, "created_utc": "1251405621", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "It IS Nessie! And she's driving a speedboat!", "gilded": 0, "created_utc": "1251473575", "subreddit": "offbeat", "score": 3, "controversiality": 0}
{"body": "It IS not Nessie, it is Nessie's jet ski.", "gilded": 0, "created_utc": "1251475992", "subreddit": "offbeat", "score": 2, "controversiality": 0}
{"body": "I was really hoping for an olde worlde map of the earth with each creaturebeing depicted in its habitat - then I thought most of those would be in Greece? - I suppose there is the Yeti and the Loch Ness monster, the chupacabra, zombies in haiti, vampires in translyvania that kind of thing, I'd make one but I suck at drawing.", "gilded": 0, "created_utc": "1251482780", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Rocket launcher. OMG, Nessiedoppelganger, is that you??", "gilded": 0, "created_utc": "1251594373", "subreddit": "japan", "score": 3, "controversiality": 0}
{"body": "Atheism doesn't make people enlightened, and it never promised it would. \n\nSpeaking to people of faith:\n\nWhen we (atheists) attack religion, even your religion, we are not attacking you personally. I know it sometimes feels that way, but that is because you do not recognize a distintion between self and faith. We see that you are deluded and we attack the delusion. Perhaps it is not the most helpful response, but it is the natural one. You would not stop to think of the emotional response you would recieve before correcting someone's assertion of geocentrism, or flat-earth theory. You would think them foolish and oversensitive if they responded to your presentation of facts (we have charted the orbits of the planets around the sun, we use orbiting communication satallites, etc.) by saying you were rude or bigoted or closed-minded. You might even think them insane if they take every counter-point, every evincement of evidence as a personal attack and begin asking why all heliocentrists or round-earthers are so bitter against those of different faiths. \n\nSpeaking to kelseyanne1021:\n\nYou ask why we are arrogant, it is because we must constantly argue with people who act as I described above. We are not bitter because we must argue with people who disagree while we are certain we are right. We are arrogant because we can prove it, everything we assert. We are bitter because the bar for proof keeps moving, because we cannot win against the deluded. No other concept recieves the same reverence as religion. You ask if it is even remotely possible god exists; the answer is of course it  is possible! So are the following myths: bigfoot, loch ness monster, alien abductions, and wizards. No one is asks why we don't remain agnostic about those things. What if the bigfoots (bigfeet?) are simply hiding? Perhaps they are a subterranian species of ape that surfaces only occasionally to star in blurry amuteur cinematography. What if the lochness monster can disappear into another dimension or its skin absorbes radar waves? What if the aliens are so advanced they can escape any modern means of detection? What if the wizards are invisible through magic?\n\nYou also wonder if there can be value in the delusion. I respond that it is not necessary, nor is it productive. The notion of drawing life lessons from works of fiction may not be entirely without merit. I, however, have read the bible cover to cover, and am entirely comfortable making the statement that taking only and entirely positive messages from the bible requires a dangerously delusional point of view. The god of the old testement is a fascist, a tyrant , and a sociopath. The god of the new testement is schizophrenic, at times reversing the laws and dictates of the old testement, and at others reminding us they will stand until the end of time when the most powerful wizard in the land seprates the just from the unjust. I could recomend an extensive list of fictional characters who would make a better model by which to live. I could name numerous philosophers who more rigorously persue virtue and offer much better perspective and advice. \n\nI said in another thread that good doesn't need the bible to inspire it, but evil requires justification the bible is happy to provide. This may not be entirely true. Perhaps many genuinely benefit from the guidance the bible offers. I just think they would be better off following the gospel of Luke Skywalker or Batman; at least those guys are morally consistant. ", "gilded": 0, "created_utc": "1251663775", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "A monster coming from under my bed and tickling me. I have very vivid memories of sleep terrors where this exact thing happened.\n\nArrows falling from the ceiling and stabbing into my arm pits. I never slept or laid down with my arms above my head for this very reason.\n\nA comet hitting the earth and killing us all.\n\nDieing in a recurring dream of mine where I was riding on pacman's back through the inside of an Atari 2600, trying to escape to an open field outside of the console. Coincidentally this exact thing happened one night when one of the ghosts caught me (Inky, the blue one) and I never had the dream again.\n\nI had a \"my buddy\" doll and I was scared it was trying to kill me after I watched Child's Play for the first time.\n\nHaving my ankles sliced open by that kid in Pet Semetary. I ran and jumped in and out of bed for years.\n\nMy cousins fishing for my gold fish ignoring the fact that I had a habit of removing them from the tank and \"playing with them\" in the kitchen sink.\n\nArmageddon. Damn Pentecostal fundamentalists...\n\nSomewhat related to the previous fear, being watched through the television by the government. A well respected sunday school teacher told me they do this regularly.\n\nNesse, better known as the loch ness monster, eating me while swimming in the sea or beside the river by my house.\n\nAny type of music played in the early to late 80's. I remember hiding under the bed while my babysitter was playing New Kid's on the Block and songs like \"joyride.\" I remember it use to make me physically sick to my stomach as well.\n\nGhosts and alien abduction, of course.", "gilded": 0, "created_utc": "1251674138", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Ole Nessie...", "gilded": 0, "created_utc": "1251702718", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
