{"body": "ill give him tree fiddy", "gilded": 0, "created_utc": "1272683469", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "ill take your tree fiddy and raise you tree niney", "gilded": 0, "created_utc": "1272683958", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "For tree fiddy?", "gilded": 0, "created_utc": "1272694376", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "spoiler alert for future news stories: anytime anyone claims to have found anything biblical, mythical, or folklorish, it didn't really happen. oh but the the 12th imam has been reborn as a yeti and has been captured alive and he's got stigmata wounds and calls himself jesus and rides the loch ness monster!", "gilded": 0, "created_utc": "1272695642", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "OMFG! ... Yeah...  I dont see anything other than some people with horrid skin rash, mixed in with UNLABELED pictures of POCKET LINT.\r\n\r\nHow about an actual picture? Oh I get it , these *are* your \"actual pictures\"!\r\n\r\nWith all due respect Im gonna go ahead and call Bullshit. There are much less believable things out there with much more convincing \"proofs\". I buy the Nessie photo and the Bigfoot film more than this.", "gilded": 0, "created_utc": "1272741901", "subreddit": "conspiracy", "score": 3, "controversiality": 0}
{"body": "I read this like how a cowboy stops his horse.\n\"WooOOOOOOoooah, Nessie!\"", "gilded": 0, "created_utc": "1272775144", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "My favourite part was 2:52 of part 2 when the caller enthusiastically agreed that evidence would have to be provided of Loch Ness monster *before* he were to believe it exists, yet he can’t manage to use the same thought process when it comes to a god.", "gilded": 0, "created_utc": "1272811094", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Although the hair analogy has been used here, I prefer the \"Loch Ness Monster\" approach. (Feel free to substitute \"fairy\", \"bigfoot\", or anything else in place of \"Loch Ness Monster\".)", "gilded": 0, "created_utc": "1273072549", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Although the hair analogy has been used here, I prefer the \"Loch Ness Monster\" approach. (Feel free to substitute \"fairy\", \"bigfoot\", or anything else in place of \"Loch Ness Monster\".)\n\nLet's say that someone tells you that they have seen the Loch Ness Monster. You ask them for evidence, e.g. pictures, and they cannot provide it. Thus, due to their inability to substantiate their claim you reject it. You might even classify yourself as \"a-lochnessmonsterist\".\n\nSimilarly, let's say that someone tells you that they \"know\" that there are gods (at least one). You ask them to substantiate their claim using evidence. When they can't you reject their claim. In this case you would call yourself an atheist.\n\nAs such, there are no \"sects\" in atheism or anything like that. Religious sects are theists disagreeing about what divine beings exist and how to interpret old books (\"ancient texts\", however you prefer). Atheists reject the god(s)-claim, so there are no such sects.\n\nAlso, atheism isn't any more descriptive than \"red head\". People with red hair may be born in Europe or anywhere else, they may practice a religion or not, and may have any number of other things in common (or not). The only thing they have in common is that they have red hair.\n\nSimilarly, the only thing that atheists have in common is that they reject the claim that god(s) exist. Atheists can be any height, weight, ethnicity, or like different subjects of study (science/art/history/etc.). The *only* sentiment that one atheist has in common with another is that they both reject the claim that god(s) exist. That's it.", "gilded": 0, "created_utc": "1273072586", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Tree Fiddy", "gilded": 0, "created_utc": "1273160058", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Tree fiddy.  Damn you Loch Ness Monster!", "gilded": 0, "created_utc": "1273161993", "subreddit": "nsfw", "score": 2, "controversiality": 0}
{"body": "about tree fitty", "gilded": 0, "created_utc": "1273166698", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "&gt; So you only have negative beliefs? You only don't believe in things? It seems to me that you trust the validity of science and let that characterize your general outlook on life. Guess what, that is a worldview!\n\nNo, not believing in something is not the same as believing in something's negative. Yes, this is semantics. It is extremely important in rational discussions.\n\n&gt; It seems to me that you trust the validity of science and let that characterize your general outlook on life. Guess what, that is a worldview!\n\nStraw man much? Of course that's a worldview, but that is *not* atheism. Naturalism, humanism, and similar things are worldviews. \n\n&gt; Exactly what I was talking about with people disrespecting us. If you did respect us, you would not even have to take that jab.\n\nAw, you poor misunderstood Christian! I was not disrespecting you with that statement. I was stating a motherfucking fact, and I get really sick of the attitude that we as a society must hold ourselves back for the people who are incapable of penetrating the god-box in their brain and thinking rationally. Getting offended is the only thing you have left because you have not a legitimate leg to stand on. Welcome to modern society, where superstitions have no place.\n\nI do not respect your beliefs. That says nothing about me respecting you as a person.\n\n&gt;Science cannot prove or disprove God exists.\n\nAs Def-Star said, science establishes the veracity of claims made about gods. Currently we can not prove nor disprove the existence or lack thereof of a supernatural being. **SO WHAT?** Does this mean we need to take all unprovable beliefs seriously? We can not disprove the existence of aliens, unicorns, leprechauns, and the thousands of other gods and being that have been believed in over the course of human existence. This simply puts the Christian dogmas on the same ground as Bigfoot, the Loch Ness monster, and Zeus.\n\n\n", "gilded": 0, "created_utc": "1273167960", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "Relax, this is the internet.\n\nWe already know what you think of our faith.  Do not be mindless and repeat it OVER AND OVER AND OVER again.\n\nSeriously?  Lumping Christianity into the same pile as the Loch Ness monster?  What a tired comparison.\n\nAnyways, a question was put forth to Christians on reddit and I answered it.  What does it matter if something is a worldview or not?  The main point I addressed in the original post was that I was annoyed at this very thing.", "gilded": 0, "created_utc": "1273169028", "subreddit": "Christianity", "score": 0, "controversiality": 0}
{"body": "I find it highly amusing that you think I am the mindless one when I am merely expounding on ideas that you seem mis- or uninformed about, and you refuse to listen to them.\n\nI am not repeating it OVER AND OVER AND OVER again. Hyperbole much?\n\nYes, Christianity is on the exact same footing as the Loch Ness Monster, seeing as how there is absolutely no verifiable evidence of either one.\n\nIf you don't see why having a distorted view of reality or an idea is a bad thing, then I can't help you.\n\nYou seem to be annoyed when people disagree with you. Have you actually considered that your beliefs possibly *are* stupid and are *not* worthy of respect?", "gilded": 0, "created_utc": "1273181094", "subreddit": "Christianity", "score": 0, "controversiality": 0}
{"body": "Nessie!", "gilded": 0, "created_utc": "1273284198", "subreddit": "WTF", "score": 5, "controversiality": 0}
{"body": "I've been there.  When I went there were a lot of handicapped people there who really seemed to need to believe.  It's much more sad than it is funny.  In fact, it's almost all sadness.  Be sure to attend one of the presentations though.  They are by the fossils towards the right of the building.  And get a picture of the loch ness monster. I was surprised to see him show up. He's in the lake outside the cafeteria.", "gilded": 0, "created_utc": "1273284867", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "correlation != causation.\n\n\nI would be very surprised if this effect was because of the name calling in itself.  I wouldn't be surprised, however, if farms who care about the cows enough to give them names also spend more money on better food and better conditions.\n\nEDIT: typo reported by Nessie", "gilded": 0, "created_utc": "1273290317", "subreddit": "offbeat", "score": 10, "controversiality": 0}
{"body": "It's sane to assume in the negative about the existence of a given entity until otherwise demonstrated by evidence.  Consider the question of unicorns, angels, fairies, the Loch Ness Monster, and bigfoot to see why.  \n", "gilded": 0, "created_utc": "1273293332", "subreddit": "comics", "score": 1, "controversiality": 0}
{"body": "Or maybe they're creative and skilled at silly stuff like this and it only takes them a short amount of time...orrrrrrr maybe this is what they do with their free time instead of playing on the internet...\n\nSorry to sound bitchy...but someone just said shit like that to me. I scribble a silly little picture on my orders at work before I hand 'em to the girls who enter them. Most of them laugh and like the pictures (hearts, flowers, loch ness monster, bunnies, etc.). Takes me less than the amount of time it takes everyone to fix themselves a cup of coffee (I'm the only one who doesn't drink coffee). \n\nOne girl sneered, \"I wish I had enough time to draw pictures\". \n\nIrritated me to no end. I told her when she got to be fast like me, she'd be able to.\n\n/rant", "gilded": 0, "created_utc": "1273319007", "subreddit": "food", "score": 13, "controversiality": 0}
{"body": "tree fitty?", "gilded": 0, "created_utc": "1273460572", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "\"Damn you loch ness monster!\"", "gilded": 0, "created_utc": "1273468862", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I just need tree fiddy!", "gilded": 0, "created_utc": "1273475004", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "FUCK THE LOCH NESS MONSTER", "gilded": 0, "created_utc": "1273497592", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "TREE FIDDY", "gilded": 0, "created_utc": "1273500555", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "I confiscated a note from a 2nd grader once.. the note read: \"I need about tree fitty.\" And that's about the time that I realized that the 2nd grader was actually a giant crustacean from the Paleolithic era...", "gilded": 0, "created_utc": "1273512417", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "If the OP actually thinks that this is compelling evidence of assassinations and a cover up, you should be embarrassed at the level of your credulity, however, if, as i suspect, you're not, let me be embarrassed for you.\n\nWhat a load of fantasist nonsense, go back to looking for the Loch Ness Monster or Bigfoot, you'll be on more solid ground.", "gilded": 0, "created_utc": "1273553146", "subreddit": "videos", "score": 5, "controversiality": 0}
{"body": "Or in the immortal words of south park:\n&gt;Chef's Father: That's right. I said, \"I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!\"\n\n&gt;Chef's Mother: I gave him a dollar.\n\n&gt;Chef's Father: She gave him a dollar.\n\n&gt;Chef's Mother: I thought he'd go away if I have him a dollar.\n\n&gt;Chef's Father: Well, of course he's not gonna go away, Mary! You give him a dollar, he's gonna assume you got more! ", "gilded": 0, "created_utc": "1273613294", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "When I was in college back in the Paleolithic era (late 80s) I worked part-time at a computer store.  Xenix systems were very popular for small businesses.  Some custom-made applications weren't available for Novell Netware with MS-DOS clients, which was the most popular environment at the time.\n\nWe had several doctors, dentists, law offices and small city government offices running Xenix.  The typical setup was a high-end 80286 PC (usually 12MHz) and later 80386s starting at 16Mhz. I think they had a 2 - 4 MB of RAM.  Hard disks were either 40 or 80 MB. There were usually a couple of terminals connecting to the host's serial ports.  [Wyse](http://en.wikipedia.org/wiki/Wyse) made the most popular terminals at the time.  If there would be more than 4 terminals we had to add a special I/O card with up to 8 serial ports.\n\nSometimes customers would get the Xenix box, a few terminals, and a couple of PCs that would run various MS-DOS applications but also run terminal emulation software to access the Xenix-based apps.  No multitasking on MS-DOS, of course.  They had to run one app, finish with it, and then start another one.", "gilded": 0, "created_utc": "1273640611", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "Bigger question is what the fuck attacked it, ripped off its fin and killed it?\n\nThe Loch Ness Monster obviously", "gilded": 0, "created_utc": "1273664326", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "No? My full name is Ronessa. People call me Nessa now, but as a kid my family called me Ness or Nessie. ", "gilded": 0, "created_utc": "1273675151", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt; To be totally on the atheist side and be gnostic, would mean we would have some sort of irrefutable proof in the \"lack of the existence of god or gods or religion in general\".\n\nNo! You don't!\n\nYou don't need to justify a lack of belief in God in the same way you don't need to justify a lack of belief in Zeus, or fairies, or leprochauns, or Harry Potter, or the Loch Ness Monster. Someone else made all those things up without providing proof that they ever even existed. If they believe they exist, then THEY need to prove to ME that they exist, or at the very least they need to show me logically that they PROBABLY do, and then I will admit that they probably do as well. \n\nIn the same way that people are innocent until proven guilty, ideas need not justification to be refuted until they're proven probable. \n\nWhat you're doing is asking me to disregard everything I know about anything and admit that I need to justify my non-belief in something that someone else made up and that is IMPOSSIBLE by all standards of the word. Can't you see how irrational that is?", "gilded": 0, "created_utc": "1273754847", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "About tree fitty.", "gilded": 0, "created_utc": "1273775846", "subreddit": "Frugal", "score": 1, "controversiality": 0}
{"body": "yes i understand that. but Nessie talked as if otoushi is ALWAYS charged. and its not. thats all. ", "gilded": 0, "created_utc": "1273842456", "subreddit": "japan", "score": 1, "controversiality": 0}
{"body": "And den I noticed dat dat internet guy was actually a crustacean from the paleolithic era.. ", "gilded": 0, "created_utc": "1273885747", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Well, if by \"learn\" you mean \"get told by your teachers but knew wasn't true\" then,\n\n* The earth is only 6000 years old and monkeys did not turn into people (one of those things is true but poorly phrased I suppose) - my 6th grade world history teacher\n\n* The Loch Ness monster is a good proof against evolution - my 7th grade civics teacher\n\n* The founding fathers were highly religious and many of their quotes of devotion can be found in a book called Sayings of our Fathers - my 9th grade government teacher who made us copy down one of these quotes every day. I refused to most of the time.\n\nBut seriously, I thought that the U.S. government system was the closest to perfection a government system could be. Turns out checks and balances aren't all they're cracked up to be and the majority isn't always right.", "gilded": 0, "created_utc": "1273955036", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I'm working on a [Log Cabin blanket](http://www.ravelry.com/projects/weffey/log-cabin-blanket), which is my second knitting project. I was bored of just knitting squares Friday night, so I thought I'd give toy a try, and ended up starting on a [Loch Ness Monster](http://www.ravelry.com/projects/weffey/loch-ness-monster). I'll finish off Nessie this weekend, and will chalk it up to a \"valiant effort\" and try to learn how to knit in the round better before attempting it again.", "gilded": 0, "created_utc": "1273960666", "subreddit": "knitting", "score": 1, "controversiality": 0}
{"body": "Herro, I am ownah of a rocal chinese arestarant..I buy two cats right NOW. GIVE DEM GOOD HOME. I onry have about tree fitty. I BUY NOW!", "gilded": 0, "created_utc": "1273983749", "subreddit": "reddit.com", "score": 35, "controversiality": 0}
{"body": "\nHa Long Bay is northern Vietnam's biggest attraction, one of the most magnificent natural splendors of the Far East. \"Ha Long\" means \"Where the Dragon Descends into the Sea.\" From the emerald-green waters of Ha Long Bay some 3000 limestone and dolomite islands (. or \"grottos\") rise jaggedly from the Gulf of Tonkin like medieval stone cathedral spires, or the scales on a dragon's back. Local lore has it that an enormous dragon created the bay, grottos and outcroppings as it thrashed its way toward the open sea to prevent the intrusion of enemy navies. Today, local fishermen still report encountering a giant sea beast called Tarasque, sort of the Nessie of the South China Sea.\n With five traditional wooden Chinese style Ha Long Bay sailing will bring you through the limestone cliffs and emerald waters of lan ha bay and Ha long Bay, giving us the chance to take in the stunning scenery of this World Heritage Site.Please contact us through www.Catbasailing.com  ", "gilded": 0, "created_utc": "1274030715", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy.", "gilded": 0, "created_utc": "1274082497", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "The Loch Ness Monster episode was the best for that.", "gilded": 0, "created_utc": "1274103412", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I would have preferred a picture of the Loch Ness Monster.", "gilded": 0, "created_utc": "1274162841", "subreddit": "gaming", "score": 10, "controversiality": 0}
{"body": "That'll be, tree fiddy.", "gilded": 0, "created_utc": "1274163900", "subreddit": "gaming", "score": 20, "controversiality": 0}
{"body": "tree fiddy?", "gilded": 0, "created_utc": "1274183566", "subreddit": "gaming", "score": 0, "controversiality": 0}
{"body": "How does the loch ness monster fit in?", "gilded": 0, "created_utc": "1274184631", "subreddit": "gaming", "score": 5, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy.", "gilded": 0, "created_utc": "1274187744", "subreddit": "gaming", "score": 9, "controversiality": 0}
{"body": "i just give him tree fiddy the week before!", "gilded": 0, "created_utc": "1274190634", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "$2 + tree fiddy - fiddy = $5", "gilded": 0, "created_utc": "1274200091", "subreddit": "gaming", "score": 3, "controversiality": 0}
{"body": "His name is 'tree fiddy?'", "gilded": 0, "created_utc": "1274224249", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Hence my comment.  By the way I said Christ/Christs very specifically in reference to \"Christ\" meaning the anointed one (etc) and the many wandering preachers who were trying to win that title by fulfilling the old testament prophecies about same.  \n\nAs opposed to the later amalgamation of these accounts into one character which became the wandering preacher archetype that someone decided to specifically name Jesus Christ.\n\nSorry if that was unclear to you Nessie.", "gilded": 0, "created_utc": "1274251799", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Ach! Back to the locke with ye Nessie!", "gilded": 0, "created_utc": "1274260600", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I'd pay about tree fitty", "gilded": 0, "created_utc": "1274271807", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Back to the loch with your nessies!", "gilded": 0, "created_utc": "1274321542", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1274324554", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Usenet is a myth like bigfoot, the Loch Ness monster, and the state of Wyoming.", "gilded": 0, "created_utc": "1274327967", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Spooky imagery, but I think this \"debt reset = rule of law is dead; rioting and anarchy - news at 11\" fear that is overwrought, for a couple reasons:\n\n1) Were a big debt forgiveness/reset/whatever happen, it seems to me to likely be a \"death of a million cuts\" rather than a dramatic single event.\n\n2) People are already not paying mortgages and taxes; this is no secret.  In fact, the government is passing laws legalizing this (e.g., federal mortgage-debt-forgiveness tax elimination).  No riots yet (teabaggers don't count, imho)\n\n3) When vastly more draconian measures were enacted in The Depression (see: FDR's NIRA and the actions taken by the NRA) there was no rioting.  When banks shut down and people lost their savings there was a mostly glum acceptance, rather than anarchy and tar &amp; feathering bank presidents/poli's.  Even in cases of straight-up fraud.  In contrast, during that time period the French were actually rioting; we just gritted our teeth and bit the pillow.  Whether this is a good trait (or not) is up to personal taste, of course.\n\n4) You can't get blood from a stone.  If you confiscate the assets of debt defaulters you'll get what, tree fitty?  Actually, in the end, they're going to have to do what they've always done: gone after the rich people.  See: WW2-era income tax rates (63% in 1932, 79% in 1936 -- plus a raft of other taxes such as inheritance tax, estate tax, etc).  And really, why not??  ", "gilded": 0, "created_utc": "1274397402", "subreddit": "Economics", "score": 3, "controversiality": 0}
{"body": "Hairless otter. \nHey, did you hear they hired BP to find Nessie? \"if it's in there, it will die.\"", "gilded": 0, "created_utc": "1274456720", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "I believe you mean TREE FITTY!", "gilded": 0, "created_utc": "1274462936", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt;Others speculate it may be the mythical Ogopogo, the Chupacabra  or some other marine monster, like the Loch Ness Monster.\n\nFark me the science is strong on this one.... Salinity of Loch Ness = 0", "gilded": 0, "created_utc": "1274533164", "subreddit": "skeptic", "score": 1, "controversiality": 0}
{"body": "Tree fitty", "gilded": 0, "created_utc": "1274542031", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "&gt;The Mongolian death worm is a creature *purported* to exist in the Gobi Desert. It is generally considered a *cryptozoological*  creature (cryptid): one whose sightings and reports are disputed or unconfirmed.\n\nThat would be in about the same category as Nessie.\n\nLoch Ness monsters are believed to exist on Earth. That is a true statement. But that doesn't mean it exists.", "gilded": 0, "created_utc": "1274654434", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "I had a reply all written out but I accidentally clicked on the x on the tab.  Honest.  So apologies if this hastily written one pales in comparison, (I doubt it, considering the original).\n\nGranted, most, if not all, of the zoologists and zooligical journalists listed there can be classified as cryptozoologists.  I don't presume to know how the scientific community views cryptozoologists.  But I would imagine they view them similarly to how I imagine they view, maybe say, SETI (good, if not noble, intentions, just a bit out there) at best, to UFOlogists (batshit crazy) at worst.\n\nIf you take out the obviously absurd claims about the creature (lightning attack, instant-death touch poison, ability to turn things yellow), you presumably will end up with a believable, plausible creature.  Its size is not too fantastical, cryptids are usually human-sized or much larger, which usually raises the question of how much energy they need to stay alive and how they can obtain said energy inconspicuously.  [Sand-swimming creatures](http://en.wikipedia.org/wiki/Pink_Fairy_Armadillo) do exist.   The usual template of a cryptid, bipedal &lt;animal&gt;+man type is not followed.  Unlike Nessie, the description of the creature didn't change as movies and knowledge of general sciences dispersed among the populace.  \n\nThe Gobi desert is a harsh environment.  Whether or not the Gobi desert was part of the Silk Road or path of the Golden Horde would affect the chances of discovery, but I am not particularly versed in Mongolian and Chinese geography.  \n\nYes, the expeditions are used to sell TV time, books and entertainment news articles.  Then again so are real news events and real animal documentaries.", "gilded": 0, "created_utc": "1274667941", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "I don't believe so - I've never got the photos off the camera, so I haven't posted them to reddit.\n\nThere is a similar edible work of art [here](http://www.supersizedmeals.com/food/article.php/20080212-The_Meat_Ship), which was done first, although I didn't copy the idea. Great minds think alike, I guess. My monster was, imho, better than this one - it was like the Loch Ness monster. I didn't make little cannon for the crew, though.\n\nI've also done a sausage-meat pig (well, several actually - they're very tasty), but I don't think I submitted those to reddit either.\n\nThe sausage-meat, in all cases, was a blend of sausage meat (duh!), finely chopped mushrooms, black pudding, and bacon, seasoned with black pepper and sage.", "gilded": 0, "created_utc": "1274705313", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Weapons\n\n    * 8,000 triangles\n    * 512 x 512 texture\n\nEngineer buildings\n\n    * Dispenser:\n          o 10,000 triangles\n          o 512 x 512 texture\n    * Teleporter:\n          o 3000 triangles\n          o 512 x 512 texture\n    * Sentry Turrets\n          o 10,000 triangles\n          o 512 x 512 texture\n\nHats\n\n    * 800 triangles\n    * 256 x 256 textures\n\nMaking sure that your items are within theme of TF2 and your class is very important for this contest! So, check out the bios of the Team Fortress 2 classes – straight from Valve – to better theme your items.\n\n \n\nScout\nThe youngest of eight boys from the south side of Boston, the Scout learned early how to problem solve with his fists. With seven older brothers on his side, fights tended to end before the runt of the litter could maneuver into punching distance, so the Scout trained himself to run. He ran everywhere, all the time, until he could beat his pack of mad dog siblings to the fray.\nAdditional: Meet the Scout\n\n \n\nSoldier\nThough he wanted desperately to fight in World War 2, the Soldier was rejected from every branch of the U.S. military. Undaunted, he bought his own ticket to Europe. After arriving and finally locating Poland, the Soldier taught himself how to load and fire a variety of weapons before embarking on a Nazi killing spree for which he was awarded several medals that he designed and made himself. His rampage ended immediately upon hearing about the end of the war in 1949.\nAdditional: Meet the Soldier\n\n \n\nPyro\nOnly two things are known for sure about the mysterious Pyro: He sets things on fire and he doesn’t speak. In fact, only the part about setting things on fire is undisputed. Some believe his occasional rasping wheeze may be an attempt to communicate through a mouth obstructed by a filter and attached to lungs ravaged by constant exposure to his asbestos lined suit. Either way, he’s a fearsome, inscrutable on-fire Frankenstein of a man. If he even is a man.\n\n \n\nDemoman\nA fierce temper, a fascination with all things explosive, and a terrible plan to kill the Loch Ness Monster cost the six year old Demoman his original set of adoptive parents. Later, back at the Crypt Grammar School for Orphans near Ullapool in the Scottish Highlands, the boy’s bomb-making skills improved dramatically. His disposition and total number of intact eyeballs, however, did not.\n\nWord of his proficiency with explosives spread, and it was not long before Crypt Grammar received two visitors: Demoman’s real parents, who lovingly explained that all Demomen are abandoned at birth until their skills manifest themselves, a longstanding, cruel, and wholly unnecessary tradition among the Highland Demolition Men. His unhappy childhood had ended. But his training had just begun.\nAdditional: Meet the Demoman\n\n \n\nHeavy\nLike a hibernating bear, the Heavy appears to be a gentle giant. Also like a bear, confusing his deliberate, sleepy demeanor with gentleness will get you ripped limb from limb. Though he speaks simply and moves with an economy of energy that’s often confused with napping, the Heavy isn’t dumb, he’s not your big friend, and he generally wishes you’d just shut up before he has to make you shut up.\nAdditional: Meet the Heavy\n\n \n\nEngineer\nThis amiable, soft-spoken good ol’ boy from tiny Bee Cave, Texas loves barbeque, guns, and higher education. Natural curiosity, ten years as a roughneck in the west Texas oilfields, and eleven hard science PhDs have trained him to design, build and repair a variety of deadly contraptions.\nAdditional: Meet the Engineer\n\n \n\nMedic\nWhat he lacks in compassion for the sick, respect for human dignity, and any sort of verifiable formal training in medicine, the Medic more than makes up for with a bottomless supply of giant needles and a trembling enthusiasm for plunging them into exposed flesh. Raised in Stuttgart, Germany during an era when the Hippocratic Oath had been downgraded to an optional Hippocratic Suggestion, the Medic considers healing a generally unintended side effect of satisfying his own morbid curiosity.\n\n \n\nSniper\nIn his former life as a tracker of dangerous game in the unforgiving Australian outback, the Sniper would spend months by himself. Prolonged isolation taught him a valuable lesson: You don’t have to rely on other people if you never miss.\nAdditional: Meet the Sniper\n\n \n\nSpy\nHe is a puzzle, wrapped in an enigma, shrouded in riddles, lovingly sprinkled with intrigue, express mailed to Mystery, Alaska, and LOOK OUT BEHIND YOU! but it is too late. You’re dead. For he is the Spy — globetrotting rogue, lady killer (metaphorically) and mankiller (for real).\nAdditional: Meet the Spy\n\n \n\nCheck out Valve’s Team Fortress 2 style guide for more information.\n\n \n\nYou must submit all the raw model &amp; texture files for your items at the Team Fortress 2 Contribute Page. Each item from your set is to be submitted individually. If you know how to create them, including the Source engine compilation files for your items is very helpful as it allows us to easily test your items. However, this is not required for your submission.\n\n    * Required:\n          o Model source formats: .QL, .OBJ, or .MT\n          o Materials source formats: .TGA/.PSD\n          o Correctly completed Notes Template\n          o “Anything else we should know?” section of the Contribute Page filled out properly. \nSee notes below for information.\n\nIMPORTANT: Copy &amp; paste this template for the “Anything else we should know?“ section of your submission. There is important information your notes MUST contain to be eligible for this contest. Using this template will ensure those details are given properly.\n\nPolycount username:\nWork in Progress Thread URL:\nTheme name:\n\n    * Optional Source compilation files:\n          o Model compilation format: .DMX, .SMD, .QC (required if your item has jigglebones, \nor other custom .QC commands)\n          o Materials compilation formats: .TXT\n    * Optional compiled files:\n          o Model compiled formats: .MDL and all associated .VTX, .PHY, and .VVD files\n          o Materials compiled format: .VTF, .VMT (required if your materials have custom shaders)\n\nNOTE: Updates and fixes to items may be re-submitted at any point after the contest. Be sure to specify that you are submitting a fix in the “Anything else we should know?” section of the Team Fortress 2 Contribute Submissions Page and the older item will be replaced.\n\n \n\n    * Your own unique “self made” versions of your items which indicate that you are the original author\n    * Your themed items released for Team-Fortress 2 in an exclusive Polycount Pack update to the game\n    * Team Fortress 2 poster signed by the team\n    * A variety of random Team Fortress 2 and/or Valve Software swag\n\n \n\nQ. Can you run down the important dates for this contest?\n\nA. Absolutely!\n\n   1. Contest begins: Monday, May 24th\n   2. Last date to submit your items for the contest: Monday, June 28th 2010 at 00:01 PST\n   3. The winners are announced: Monday, July 12th 2010.\n\n \n\nQ. So wait, you’re telling me that not only are you doing a CONTEST with Valve, but you actually think you’ll announce the winners when you say you will? You’re crazy.\n\nA. It was this sort of magic that convinced Valve we’re wizards, you see?\n\n \n\nQ. What if I want to do something outrageous, like a clown suit for the Heavy? Can I still submit that?\n\nA.’You’re more than welcome to submit whatever you like for this contest, and if its the best clown suit Valve’s ever seen you might even see it get released some day. But to win this contest, we’re challenging you with keeping your item theme within the TF2 universe. With that said, we wouldn’t be surprised to hear that you wrote a convincing back-story in your submission as to why the Heavy has a clown suit and some how Valve just couldn’t resist making it part of the TF2 universe. (Don’t tell them we wrote that, we’ll deny everything!)\n\n \n\nQ. If I do a building for the Engineer, are all 3 levels for that building considered 1 entry? Or do I need to do 2 additional ‘items’ in order to submit? Also, do I have to do the 3 levels or can I do 3 ‘Level 1′ buildings?\n\nA. Each level for your building is considered 1 item (of the 3 item minimum). So you can submit 1 Building with all 3 of its levels and that would be acceptable. However, please don’t submit just 1 or 2 levels for your building – Valve gets stabby when we make them do more work then originally planned.\n\n \n#\nPolycount Exclusives\n\n    * Creator of Crazybump, Ryan Clark\n\n#\nRecent Posts\n\n    * The Team-Fortress 2 ‘Polycount Pack’ CONTEST\n    * Jacob Charles Dietz, Shields\n    * Creator of Crazybump, Ryan Clark\n    * A boy uncertain of his sister’s fate… Enters LIMBO\n    * Drawing on the Apple iPad\n\n#\nArchives\n\n    * May 2010 (8)\n\nnews forum contact us about wiki us shop eu shop twitter\n© 2010 polycount.com\n", "gilded": 0, "created_utc": "1274738076", "subreddit": "gaming", "score": 5, "controversiality": 0}
{"body": "I ain't givin' you no tree fiddy you goddamn lochness monster!", "gilded": 0, "created_utc": "1274767701", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "And not ONE thing about Punishing those That Hire illegal immigrants!!! wow why am i not surprised? Thats like complaining about the rats in your house but leaving that big pile of cheese on your living room floor.\r\n\r\n\r\nBusnessies that hire illegals are afraid this'll be made mandatory\r\nhttp://www.uscis.gov/portal/site/uscis/menuitem.eb1d4c2a3e5b9ac89243c6a7543f6d1a/?vgnextoid=75bce2e261405110VgnVCM1000004718190aRCRD&amp;vgnextchannel=75bce2e261405110VgnVCM1000004718190aRCRD\r\n\r\nMake it so", "gilded": 0, "created_utc": "1274809649", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I said, \"what do you want, aliens?\" And the leader of the aliens, he look me right in the eyes, and he said, \"About tree fitty.\"", "gilded": 0, "created_utc": "1274821102", "subreddit": "nosleep", "score": 1, "controversiality": 0}
{"body": "Ok.  So you know my first comment to you was sort of flirting as I like trivia and useless knowledge.  And then Nessie made that comment to me and so then I looked at his comment history and made the quip that I did...but at this point - please just nevermind me...life's just too short.", "gilded": 0, "created_utc": "1274910264", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Jesus's historical existence was first questioned by a German scholar in the 1700s. Can't remember his name.\n\nSince then, academia has wrestled with the question, the overwhelming majority of mainstream historians consigning Jesus to the realm of dubious national characters (like King Arthur or David and Solomon in Israel). Just as no contemporary accounts from any other nation on Earth mention King David or King Solomon, no contemporary sources mention Jesus.\n\nNot a one.\n\nThis is striking for a character who allegedly caused such an uproar. Judas Maccabee [the Jewish revolutionary who started a rebellion against Rome] has tons of contemporary reports. Likewise Spartacus, in ancient Rome, has dozens and dozens of outside sources writing and talking about him.\n\nJesus of Nazareth? Not a one.\n\nNo legitimate mainstream historian puts much stock in the existence of a man who has no primary sources describing him. You just get the cottage industry of \"Bible historians\" and \"apologists,\" usually associated with religious universities and whose pay-checks depend upon claiming Jesus existed. *Actual* historians wince when they listen to these History Channel types . . . you know: the \"experts\" who give testimony about the Loch Ness Monster or UFOs or Nostradamus.\n\nPeople who claim Jesus has any basis in historical facts are about on par with them academically. \n\n* Footnote: Anyone see the basic cable TV show, \"The Naked Archaeologist\"? Man, that guy comes up with ludicrous crap every week. Just last week, he was claiming that ancient Hebrews invented the alphabet. Yep. Not Phoenicians, like our history books state. Or the Greeks. Not at all. The Israeli \"archaeologist\" claims that the Hebrews did it—contrary to just about every authority on the subject. He also claims that Solomon and King David were real, even when Israeli Universities don't hold that position. I love me some History Channel pseudo-experts! Long live Bigfoot! ", "gilded": 0, "created_utc": "1274914034", "subreddit": "AskReddit", "score": 16, "controversiality": 0}
{"body": "Bigfoot, the Loch Ness Monster, Yeti, et al", "gilded": 0, "created_utc": "1274937343", "subreddit": "IAmA", "score": 10, "controversiality": 0}
{"body": "Usually photos like this are quite blurry, making verification impossible.\r\n\r\nBigfoot, Loch Ness Monster, helpful police officer...", "gilded": 0, "created_utc": "1274939193", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "I'm a very good swimmer and have swam all my life, but dear God I have a pathological fear of *natural* bodies of water that I can't see through.\n\nIn a lake or whatever I always feel like the Loch Ness monster is going to come eat me, or some other dark creature will drag me under.", "gilded": 0, "created_utc": "1274950319", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "Keegans point was that not only are forms of tribal war emergent of socioeconomical systems, but also systems of cultural understanding. So even war between the ancient states might have looked more \"ritualistic\" then war between some now-living tribal peoples.\n\nSo the thing we know to be \"war\" is not inevitable. It is a chosen path. \n\nTribal living was, and is, undoubtedly hard. But the evidence seems to suggest that throughout the paleolithic era (the vast majority of human existence) war was not a popular pastime. There is no paleolithic artwork showing humans fighting humans. There are no obviously martial artistic artifacts. \n\nThe paleolithic lifestyle, hard as it may have been, was probably mostly concerned with leisure dance and art. The very recent agricultural revolution (starting about 14,000 years ago) co-incides generally in the archaeological record with a massive drop in living standards, diet quality and life-expectancy. \nNot to mention the rise of war as a popular pastime.\n\nPersonally, I'm inclined towards the romanticism of \"walking away\".\nFor a poetic history of peoples who have done this in the New World, check out Hakim Bey's TAZ. Free to read online.", "gilded": 0, "created_utc": "1274969748", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "They'll cost you about tree fitty.", "gilded": 0, "created_utc": "1274984985", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Woman!  Don't give that monsta no tree fitty!", "gilded": 0, "created_utc": "1274985891", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "Theology: Debating the colors of the flippers on the Loch Ness Monster.", "gilded": 0, "created_utc": "1275011833", "subreddit": "atheism", "score": 7, "controversiality": 0}
{"body": "Obviously there are many foods out there that are shit. We're exposed to chemicals and pesticides that can very well be the causes of cancers and other diseases but what you're not taking into consideration is that more people would die without the advancements of western civilization. Why do you think we don't have famines anymore? How is it that with our disease ridden lifestyles we still have a longer life expectancies?  What were they dying of at such early ages, awesomeness? I applaud you for thinking twice about what you eat, we can all use more of that, but the truth is we're very fortunate to be picky about what kind of food we're gonna put in our mouths in the first place. Go back to the paleolithic era and you would likely end up starving, feeding a panther your leg, or getting a nice gangrenes infection on your balls. =P", "gilded": 0, "created_utc": "1275022511", "subreddit": "funny", "score": 9, "controversiality": 0}
{"body": "Tree fitty.", "gilded": 0, "created_utc": "1275058477", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Don't you give that monopoly no tree fiddy!\n\nWhy don't you start about a buck-two-five or so?", "gilded": 0, "created_utc": "1275143371", "subreddit": "WTF", "score": 13, "controversiality": 0}
{"body": "Nessie, how did you get on the list? Don't blow smoke with your friend :)", "gilded": 0, "created_utc": "1275182539", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks, the beef is on page 7.\n\nIt doesn't specifically reference creationism or ID, which is nice, however the controversies it lists are stupid and are the exact same excuses creationists use to discredit evolution. It could go two ways, a) creationists are dim-witted fuckwits who make up shit, or b) evolution is an unreliable theory.\n\nWhy Noah's Ark? Why not Big Foot and Loch Ness monster? Why compare these to evolution?\n\nAnyway, as I said it can go both ways, but now religion has its foot further in the door.\n\n-- lifted from the PDF --\n\n&gt; Unit 2a - Representing and Interpreting the Ancient Past\n&gt; \n&gt; Controversies\n&gt; \n&gt; Students develop their historical skills in an investigation of TWO of the following controversial issues:\n&gt; \n&gt; a) human origins (e.g. Darwin’s theory of evolution and its critics)\n&gt;\n&gt; b) dating the past (e.g. radio-carbon dating, tracing human migrations using DNA)\n&gt;\n&gt; c) fakes and forgeries (e.g. Piltdown Man, the Treasure of Priam, Noah’s Ark, the Turin Shroud)", "gilded": 0, "created_utc": "1275194073", "subreddit": "australia", "score": 7, "controversiality": 0}
{"body": "At least we get to see what Nessie looks like when she washes up on shore.", "gilded": 0, "created_utc": "1275255368", "subreddit": "WTF", "score": 4, "controversiality": 0}
{"body": "What everymn said. \nAfter 47 years, the JFK assassination is still considered a 'mystery'. Lots of people claim they knew a guy who knew a guy who was there, but nobody will ever conclusively know what happened. Nor will Roswell, Bigfoot, the Loch Ness monster or the cancellation of Firefly ever be understood by the common people. \n911 will forever be a conspiracy theory. ", "gilded": 0, "created_utc": "1275266925", "subreddit": "conspiracy", "score": 1, "controversiality": 0}
{"body": "How many Scottish girl scouts does it take to ring a doorbell? None it was da damn lochness monster, all up in here asking for tree fiddy.", "gilded": 0, "created_utc": "1275278547", "subreddit": "funny", "score": -2, "controversiality": 0}
{"body": "Next up, Loch Ness Monster mating rituals!", "gilded": 0, "created_utc": "1275333665", "subreddit": "skeptic", "score": 1, "controversiality": 0}
