{"body": "Goddamnit lochness monster I said I ain't gonna give you no damn tree fitty! ", "gilded": 0, "created_utc": "1317428178", "subreddit": "nosleep", "score": 16, "controversiality": 0}
{"body": "&gt;I've already told how empiricism is flawed\n\nPlease share your improved method of determining factuality, better than observable, testable, repeatable outcomes. Really, there is none. Our understanding of reality constantly improves through observation, testing and repetition.\n\n&gt;this isn't just interpretation\n\nMany Chiristians rely upon and interpret both the New and Old Testaments, and quote from both. If you need examples, I'd be happy to provide. \n\nIn fact early on many \"Christians\" argued about the question of the divinity of Jesus. Check out the [First Council of Nicea](http://en.wikipedia.org/wiki/First_Council_of_Nicaea) (or other subsequent early councils), [Arianisn](http://en.wikipedia.org/wiki/Arianism), etc. However I find interpretation vs. non-interpretation about as productive as arguing over how many angels fit on the head of a pin.\n\n&gt;If someone said it didn't exist\n\nIn fact I understand quite well, it's just not how you're used to framing the situation (I think I should clarify: my position is not \"negative\", merely \"null\"): I'm saying there's no evidence to suggest existence, and that's not a good reason to believe something, particularly something as life-altering as a religion. \n\nFor example: If I were to tell you that there was an enormous asteroid headed for Earth sometime in the future and you'd better start digging a hole so you're safe, it's my job to convince you of the fact. If I can provide absolutely no evidence to support my assertion, it's not your job to believe it unless you can prove me wrong. Furthermore, if you don't start digging a hole, you're not basing any actions on your beliefs. You're simply not acting on a statement for which there is no evidence.\n\n&gt;There's no evidence to suggest the non-existence of God either.\n\nThe fallacy of [Argument from Ignorance](http://en.wikipedia.org/wiki/Argument_from_ignorance). Again, though there's no evidence of Loch Ness Monster (I'm just fond of the rascal if he were real...), just because there's no evidence so suggest the non-existence of Loch Ness Monster doesn't mean that I should believe in Loch Ness Monster. The burden of proof rests on those that proposed the factuality of the Loch Ness Monster to produce good evidence. Same for religion.\n\n&gt;Isn't that what belief in all things is, including atheism\n\nAtheism is not a belief, it's an absence of belief. \n\nI think this has run its logical course, so let me add my personal opinion at this point: In the end, people don't have religious beliefs because they find them factually correct. Fact require proof. Faith is belief without proof. \n\nI find people believe in religion for a wide variety of other reasons: It provides them with community; their family shares the belief and it would alienate them to change; they've based much of their world view on the belief and it would be stressful to have to change; it provides the with security, knowing there is some sort of ultimate order; it makes them feel better thinking they will have life after death; there are society pressures to conform; they don't want to admit they were incorrect.\n\nNot believing has little to offer, other than reason and clarity. Non-belief is not necessarily comforting or easy. Perhaps some atheists find it great or comforting to not believe in an afterlife. I am not one of them. However, I'm rational. I have to apply the same standards to religious belief as I do to any other element of the world around me.\n\nI'm also conscious of the effects of a profound change in beliefs. I think for those that are heavily invested in their beliefs, a shift can be traumatic. Therefore, I don't take leading people away from their beliefs lightly. \n\nYou as well and thanks so much for being so friendly, intelligent and cordial! I'm from the States and perhaps feel the effects of religious adherence in a different way than you lucky Brits... I think that can affect an atheist's attitude towards the urgency of addressing organized religious beliefs as well.", "gilded": 0, "created_utc": "1317435279", "subreddit": "DebateReligion", "score": 1, "controversiality": 0}
{"body": "I believe in El Chupacabra because I've seen one.\n\nA few years ago some friends and I were driving through the southern portion of Arizona. We were on a long road trip, so two of us were sleeping in the back while two of us where in the front. My friend was driving and I was in the passenger seat just keeping him company, picking music and making sure he didn't fall asleep.\n\nIt was probably around 1 a.m. and we were on a highway next to a large cliff to our right. There were no other cars on the road. Suddenly, something leaped out of the darkness to our left and landed in the road directly in front of the headlights. It sort of stopped for a second and then jumped back off the road and off the cliff.\n\nIt had large hind legs and smaller front ones. It was definitely naked and bald all over - no hair from what I could see. It's skin was a light brown color, maybe a little gray mixed in. It looked eerily human like, but also had animal qualities. It had no hair on its head, small, beady eyes and gnarled teeth. I'm not sure what the hell it was, but I call it a Chupacabra as I'm not sure what else to categorize it as.\n\nAs far as Bigfoot goes, its certainly possible, but until there is hard evidence such as a body, it'll never be something I 100 percent believe in. \n\nThe Loch Ness Monster was a hoax IMO.", "gilded": 0, "created_utc": "1317453939", "subreddit": "Paranormal", "score": 4, "controversiality": 0}
{"body": "And you're subject to the beating the dead horse fee, about tree fiddy.\n\nAnd a cake made entirely of icing.", "gilded": 0, "created_utc": "1317455377", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "How bout tree fitty?\nFTFY", "gilded": 0, "created_utc": "1317471900", "subreddit": "pokemon", "score": 2, "controversiality": 0}
{"body": "Lies, I zoomed in and it was made of lies and squares! Nessie is a deceiver sent here to lead us off the perfect path.", "gilded": 0, "created_utc": "1317493297", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "**Normal weapons**\n\nWeapon             | Price             |\n:-----------------|:------------:|\nNatascha             | 1 scrap\nFrontier Justice     | 1 scrap\nThe sandman        | 1 scrap\nThe Ullapool caber  | 1 scrap\nThe Lock-N-Load   | 1 scrap\nJarate                  | 1 scrap\nFlare gun              | 1 scrap\nSydney sleeper      | 1 scrap\nConnivers Kunai     | 1 scrap\nNessies nine iron    | 1 scrap\nAxtinguisher          | 1 scrap\n\n\n\n\n\nS. Weapon            | Price             |\n:------------------|:-------------:|\nS. Sydney sleeper  | 1 reclaimed\nS. Pain Train         |1 scrap\nS. Backburner        | 2 reclaimed\nS. Shotgun            | 2 reclaimed\nS Powerjack (2kills) | 1 reclaimed\n\n\nI don't know if the kills destroy the price or not =\\", "gilded": 0, "created_utc": "1317495348", "subreddit": "log1k", "score": 1, "controversiality": 0}
{"body": "Yes I am.\n\nIn the same way that it is impossible to disprove the existence of Santa Clause, The Tooth Fairy, The Loch Ness Monster, Unicorns, The Flying Spagetti Monster and God.  \n\nThere is no way of measuring, detecting or experiencing these in an objective way and so that is why I don't believe in any of them.", "gilded": 0, "created_utc": "1317556229", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Goddamn Loch Ness monster...", "gilded": 0, "created_utc": "1317557581", "subreddit": "explainlikeimfive", "score": 2, "controversiality": 0}
{"body": "TIL why Nessie has a boomerang dick", "gilded": 0, "created_utc": "1317567197", "subreddit": "atheism", "score": 18, "controversiality": 0}
{"body": "If someone were to capture an animal fitting the loch ness monster's description, and put it in a zoo, or they were to get high-quality non-blurry HD photos/videos of it, most \"loch ness deniers\" would accept it as real, however.", "gilded": 0, "created_utc": "1317571804", "subreddit": "explainlikeimfive", "score": 2, "controversiality": 0}
{"body": "14 weapons (or 2 rec 1 scrap if you want metal) for Crates #1, #3, #4, dueling mini-game, and Nessie's Nine Iron?", "gilded": 0, "created_utc": "1317573452", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "Oh, ok.  \n\nAdjusted offer (minus the 1 rec for #1):  8 weapons (or 1 rec 1 scrap if you want metal) for the Crates #3, #4, dueling mini-game, and Nessie's Nine Iron?", "gilded": 0, "created_utc": "1317577303", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "I need about tree fitty.", "gilded": 0, "created_utc": "1317587011", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "\"I ain't giving you no tree-fitty you goddamn Loch Ness monster! Get your own goddamn money!\"\n", "gilded": 0, "created_utc": "1317588405", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Other weapons and changes:\n\nThe Demoman got an Eyelander reskin called **Nessie's Nine Iron**, which looks like a golf club.  The Pyro got an Axtinguisher reskin called the **Postal Pummeler**, which looks like a large mailbox.\n\nDr. Grordbort's Victory Pack was a set of 2 Soldier weapons modeled after some of the futuristic guns the WETA Workshop has built.\n\n**Cow Mangler 5000**: A Rocket Launcher with 5 shots that do 10% less damage.  The weapon uses no ammo; instead, it has a \"Mangler\" bar that shows how many shots you have.  The weapon reloads by cranking a handle on the side, and it reloads 5% slower than the other Rocket Launchers.  Alt-fire charges up a shot; this charged shot takes 4 seconds to fire, slows the Soldier down to 1/3 of his normal speed, and uses up all 5 of his shots, but in return, it has a higher base damage, is guaranteed to mini-crit the target, and also sets players on fire for 5 seconds.  If the charged shot hits an Engineer building, it'll be disabled for 4 seconds.  The downsides to the Mangler are 80% less damage vs. buildings, and you cannot be crit or be crit boosted by anything.  Another hidden feature (or maybe it's a bug) is that reflected shots from the Cow Mangler do full crit damage.\n\n**Righteous Bison**: A laser pistol with 4 shots that also requires no ammo.  It fires significantly slower than the Shotgun, and fires a moderately slow projectile that pierces enemies and buildings, but cannot be reflected.  The shot does about 20 base damage, but usually hits a player 2-3 times.  This weapon also does 80% less damage vs. buildings, but can randomly crit/be crit boosted.\n\nEnemies killed by either laser weapon suffer a unique disintegration effect, similar to killing enemies with an energy ball in Half Life 2.\n\nDeus Ex weapons:\n\nEngineer:\n\n**Widowmaker**: This weapon uses metal as ammo and doesn't have to reload.  Currently, a single shot costs 60 metal (soon to be reduced to 30), and any damage done is returned as metal.  It's a great tool for defensive Engineers, as sitting next to a Dispenser means you can fire many shots without ever having to reload.\n\n**Short Circuit**: This replaces the Engie's Pistol with what looks like a futuristic Taser on his arm.  It costs 35 metal to fire, but destroys any and all enemy projectiles in a certain range in front of the Engineer automatically.  The Short Circuit does practically no damage (5 base) and can't randomly crit, so it's an entirely defensive weapon.  Enemies killed (lol) by the Short Circuit are given the distinctive disintegration death, similar to the Grordbort weapons.\n\nSniper:\n\n**Machina**: A futuristic rifle that can't shoot without being scoped.  It also does 15% more damage and pierces targets on a fully-charged shot.  The downside is that it leaves a very distinct tracer leading right back to you every time you take a shot.\n\nSpy:\n\n**Diamondback**: A new Revolver that does the same base damage as the Ambassador.  Destroying an Engineer building gives you a guaranteed crit, similar to how the Frontier Justice works with Revenge crits.  It's a very good choice against Gunslinger Engineers, as many of them will just let their sapped gun die and throw down a new one.\n\nA cool thing about the Machina and Diamondback is that they actually have different firing sounds for different situations.  A fully charged Machina shot will have a deeper, more powerful sound, and getting multiple kills with the piercing shot will play a fanfare to the whole server.  The Diamondback has different sounds entirely, one for regular shots, and one for forced crits from sapping enemy buildings.\n\nThere are also Strange weapons.  They can only be uncrated from Series 19 crates and beyond, and they track the number of kills you make with them.  At a certain number of kills, they gain a new prefix; Strange is the first, then Unremarkable, then Scarcely Lethal, and so on.  Here's a list of them all with the series found in parentheses:\n\nScout:\n\n* Scattergun (23)\n* Pistol (23)\n* Boston Basher (23)\n* Sandman (23)\n\nSoldier:\n\n* Rocket Launcher (20)\n* Direct Hit (20)\n* Black Box (29)\n* Shotgun (20, 21, 28)\n* Pain Train (20)\n\nPyro:\n\n* Flamethrower (25) - does not count reflect/world kills\n* Backburner (25) - see Flamethrower\n* Flare Gun (25)\n* Shotgun (20, 21, 28)\n* Powerjack (25)\n\nDemoman:\n\n* Grenade Launcher (19)\n* Stickybomb Launcher (19)\n* Chargin' Targe (19) - counts number of Targe bash kills\n* Eyelander (19, 29) - counts number of heads taken, meaning you can get multiple heads from another Eyelander Demo or Bazaar Bargain Sniper\n\nHeavy:\n\n* Minigun (21)\n* Natascha (21)\n* Shotgun (20, 21, 28)\n* Gloves of Running Urgently (21)\n\nEngineer:\n\n* Frontier Justice (28)\n* Shotgun (20, 21, 28)\n* Pistol (23)\n* Wrench (28) - counts Sentry kills and weapon kills, levels on Sentry kills\n* Jag (28) - see Wrench\n\nMedic:\n\n* Syringe Gun (26)\n* Crusader's Crossbow (26)\n* Medi Gun (26) - counts Ubercharges and kill assists, levels on Ubercharges\n* Bonesaw (26)\n\nSniper:\n\n* Sniper Rifle (27)\n* Sydney Sleeper (27)\n* Jarate (27) - levels on number of enemies coated\n* Razorback (29) - levels on number of Spies shocked\n* Bushwacka (27)\n\nSpy:\n\n* Revolver (24)\n* Ambassador (24)\n* Knife (24)\n* Conniver's Kunai (24)\n\n(2/2)", "gilded": 0, "created_utc": "1317600117", "subreddit": "tf2", "score": 6, "controversiality": 0}
{"body": "I got tree fiddy.......", "gilded": 0, "created_utc": "1317606969", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "It was about that time that I noticed this heavy was about 8 stories tall and was a crustacean from the Paleozoic era so I said,\n\nDAMN IT LOCK NESS MONSTER get off my fort I ain't givin' you no tree fiddy", "gilded": 0, "created_utc": "1317609355", "subreddit": "tf2", "score": 57, "controversiality": 0}
{"body": "A) Macro ratios are decidedly different for people eating paleo than people eating grains. This should be self-explanatory. We don't really need to argue about this, but someone eating meat, greens and pasta are going to be getting more carbs than someone just eating meat and greens. I used to be paleo, I track macros and calories day-to-day. I ate lots of fruit on paleo and I was still eating less than 100g of carbs a day (closer to ~60) which is typically considered low carb.\n\nB) Do your homework. [Sadly, wikipedia is a good place for you to start](http://en.wikipedia.org/wiki/Paleolithic_diet#Rationale_and_evolutionary_assumptions). The whole premise of the diet is that our ancestors ate like this so we should too. However, there is no conclusive evidence that our ancestors did survive on a paleo diet. In fact, we've found refined grains and cereals being eaten as far back as 30,000 years ago.\n\nC) That's not why they're banned on paleo. They're banned because an anthropologist said we didn't eat them during the paleolithic era. That evidence is a secondary motivation.\n\nD) Diabetes is caused by a continuous excess of carbohydrates in a diet. Minimize, sure, but there's no reason to cut out all carbohydrates. I implore someone to try and become diabetic by eating fruit.", "gilded": 0, "created_utc": "1317656870", "subreddit": "Health", "score": 6, "controversiality": 0}
{"body": "Where does the loch ness monster live?\n", "gilded": 0, "created_utc": "1317661352", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "Well, to be fair, that's the point for some people. For others, the point of keto is to lose weight. The point of paleo can be the principle that foods unavailable to us during the paleolithic era are inherently unnecessary to a healthy diet (not just wheat and other grains).", "gilded": 0, "created_utc": "1317665299", "subreddit": "keto", "score": 1, "controversiality": 0}
{"body": "They said I was crazy. I knew it was a 8 story tall crustacean from the Paleozoic era! My wife gave it a dollar. Now the goddamed thing keeps coming back for more money. Says he want's about tree fiddy now.", "gilded": 0, "created_utc": "1317668615", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "No. Diet doesn't imply a short term fix. Diet implies what you eat. If you look up any animal in an encyclopedia, there will be a section labelled \"Diet\". It's not because the raccoon is trying to lose weight, it's just what they eat.\n\nA \"paleo lifestyle\" would be a hunter-gatherer lifestyle, where you live  in the woods with a tribe of people and wipe your ass with leaves. They certainly didn't have the internet in the Paleolithic Era, so I know already that you're not living a \"paleo lifestyle\".", "gilded": 0, "created_utc": "1317673870", "subreddit": "Health", "score": 3, "controversiality": 0}
{"body": "Can you tell me why low craft numbers are worth so much?  I saw someone seeing a Nessie's 9 Iron - normally worth a scrap, but his was craft #2, so he was getting multiple bud offers, I think.\n\nWhat's the appeal to know that someone crafted it early?", "gilded": 0, "created_utc": "1317675850", "subreddit": "tf2trade", "score": 2, "controversiality": 0}
{"body": "Godzilla destroyed the Titanic to cover Bigfoot's involvement in 9/11 and the Loch Ness monster's fake moon landings. It's true, ive read it on the internet, and the internet never lies.", "gilded": 0, "created_utc": "1317677570", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1317678761", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1317680302", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "Damn Loch Ness monster! ", "gilded": 0, "created_utc": "1317682762", "subreddit": "pics", "score": -1, "controversiality": 0}
{"body": "And one day, he said:\"Can i get abouta tree fiddy?\" ", "gilded": 0, "created_utc": "1317683980", "subreddit": "pics", "score": 247, "controversiality": 0}
{"body": "You mean Nessie?", "gilded": 0, "created_utc": "1317690167", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "Good- Loch Ness. http://imgur.com/G2k7p.jpg  My wife and I went in October, 2007. It's stunning that such a beautiful, world-famous lake is so unspoiled. If it were in the US, it would be surrounded by condos, strip malls, and the \"Nessieland\" theme park.  \nBad- This. http://imgur.com/u1fzE.jpg  The first time I ever saw the World Trade Center was on September 13, 2001. I had only ever been to NYC once before this, and we didn't go any further down than the Empire State Building. Quite a shock to come around a corner and see WTC7 lying in the road.", "gilded": 0, "created_utc": "1317690879", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Not exactly like a Loch Ness Monster sighting is it?", "gilded": 0, "created_utc": "1317701328", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Did she give it tree fiddy?", "gilded": 0, "created_utc": "1317709832", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Total amount of money possibly gained from all loose pennies that have been in a 25 foot radius of my body throughout my life.\n\nI'd say maybe tree fiddy.", "gilded": 0, "created_utc": "1317718724", "subreddit": "AskReddit", "score": 40, "controversiality": 0}
{"body": "You goddamn Loch Ness Monster! Get your own goddamn money!", "gilded": 0, "created_utc": "1317739069", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "This actually reminds me a lot of my relationship I had, she used to call me dinosaur or midget, we had a \"son\" a plastic dinosaur and she is a red head. Yesterday it was de third panel, we will have to part our own ways perhaps never getting to the last panel, but regardless of this sadness I feel at the time I know its for the best, maybe some day we will reunite maybe not, I just hope she will find happinessie.", "gilded": 0, "created_utc": "1317739984", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "About tree fitty.", "gilded": 0, "created_utc": "1317740280", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "i WOULD have tree fiddy, but the damn Loch Ness Monster came right up and stole it from me!", "gilded": 0, "created_utc": "1317740930", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "About tree fiddy. ", "gilded": 0, "created_utc": "1317753155", "subreddit": "WTF", "score": 946, "controversiality": 0}
{"body": "No you god damn loch ness monster, I ain't givin you no tree fiddy!", "gilded": 0, "created_utc": "1317753902", "subreddit": "WTF", "score": 310, "controversiality": 0}
{"body": "DAMMIT WOMAN!  You keep givin' the monster tree fiddy, he gon' keep on comin' back!", "gilded": 0, "created_utc": "1317756074", "subreddit": "WTF", "score": 234, "controversiality": 0}
{"body": "I WOULD have tree fiddy, but the frequent soundboard prank calls got really fucking annoying after a few occasions, however.", "gilded": 0, "created_utc": "1317756509", "subreddit": "botcirclejerk", "score": 1, "controversiality": 0}
{"body": "I just gave him tree fiddy last week.", "gilded": 0, "created_utc": "1317756591", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I had one of these come to my door dressed as a girl scout asking for tree fiddy.", "gilded": 0, "created_utc": "1317758218", "subreddit": "WTF", "score": 15, "controversiality": 0}
{"body": "Are you fucking retarded? Dragons don't exist.  \n  \nIt's a baby Nessie of course!", "gilded": 0, "created_utc": "1317761733", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "Then they can seek the Loch Ness Monster, the Florida Swamp Thingy, and the elusive Deer Park Trout.", "gilded": 0, "created_utc": "1317762944", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Tree fitty", "gilded": 0, "created_utc": "1317770448", "subreddit": "tf2", "score": 1, "controversiality": 0}
{"body": "Nice one. I've unboxed once, the festive winter crate, and got my Magnificent Mongolian. If I ever unbox later I'll hope to be as lucky as you. The best I can offer for it would be my Nessie's Nine Iron #2, which I'm told could fetch 1-2 buds with a low crafting number weapon collector, but I've had it a month or two now and I have yet to find a buyer. Just wishful thinking on my part, but if you love using the eyelander and prefer the nine iron to the eyelander or UHHHH, and also really want to have the second one ever crafted, don't hesitate to start up a trade with me.", "gilded": 0, "created_utc": "1317771176", "subreddit": "tf2trade", "score": -4, "controversiality": 0}
{"body": "About tree fitty", "gilded": 0, "created_utc": "1317774189", "subreddit": "pics", "score": 38, "controversiality": 0}
{"body": "That is 3.74â‚¬ for me.\n\nI would buy it for tree fiddy.", "gilded": 0, "created_utc": "1317776639", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "That's certainly one of the reasons. I was watching a documentary on the Loch Ness Monster on Discovery a while ago and biological experts were saying that there would have to be at the very least a population of 30 of the animals at any one time as dropping below that number would not be sustainable for any species. The point being made in that case was that if the Loch Ness Monster somehow existed there would need to be quite a lot of them.", "gilded": 0, "created_utc": "1317777653", "subreddit": "DebateAChristian", "score": 2, "controversiality": 0}
{"body": "Sitting right here on my office desk I am telling you that yeti doesn't exist. Other fancy investigations still carried out include include looking for ghosts, aliens/UFO's, loch ness monster(scotland) etc. Complete waste of time and taxpayers money.", "gilded": 0, "created_utc": "1317794875", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Slendy has always come across to me as a more sinister and confrontational version of the Shadow People, to which I am aware of as I have seen them.\n\nBut it is strange that there are historical accounts of figures that are of great height, slender in stature, sometimes multi limbed and faceless that seem to appear just before or just after random disappearances where there was very little evidence.\n\nTake The Loch Ness Monster, that didn't gain any worldwide knowledge until 'video' was shot of it in the lake even though it was a prank. My theory is that he is something that resembles what a media version of Freddy Krueger would be but not as violent, he would pick on fears, fears of vulnerability, the dark, bumps and sounds in the night, etc and choose to appear then... but he would 'stalk' his prey so to speak before appearing to them.\n\nI don't know, it is another one of those Legends that is hard to dispel and prove at the same time, fictionalized events or not, there is something to this...", "gilded": 0, "created_utc": "1317813270", "subreddit": "Slender_Man", "score": 1, "controversiality": 0}
{"body": "i feel like it's almost historically wrong to smoke that. years and years of looking for nessie, and you're just blazin her up.", "gilded": 0, "created_utc": "1317826487", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "How 'bout tree fiddy?", "gilded": 0, "created_utc": "1317826971", "subreddit": "trees", "score": 11, "controversiality": 0}
{"body": "I believe that would be the only time id give that god damn loch ness monster mah tree fiddy", "gilded": 0, "created_utc": "1317829492", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "[repost of a repost of a repost.](http://karmadecay.com/designerhigh.com/blog/wp-content/uploads/2011/07/Nessie-Blunt.jpg)", "gilded": 0, "created_utc": "1317836182", "subreddit": "trees", "score": 6, "controversiality": 0}
{"body": "damn you loch ness monster", "gilded": 0, "created_utc": "1317841748", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "It's nice to fantasise about the existence of the Loch Ness monster and with all the under water caves there could of once been some creature but there isn't enough fish/other creatures for anything to live off in the Loch now. The Loch has been mapped out by scientists and there's nothing there.\n\nHowever, the photographs of Big Foot - isn't that classed as physical evidence? Why do we need to \"study\" or \"catch\" one. \n\n", "gilded": 0, "created_utc": "1317846629", "subreddit": "Paranormal", "score": 1, "controversiality": 0}
{"body": "If that's true, it means that for about every ten people who believe in big foot, the loch ness monster, and ESP, only one believes that congress is doing well.", "gilded": 0, "created_utc": "1317849580", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "NESSIE! \n\n\nIS A WHORE", "gilded": 0, "created_utc": "1317849953", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "Tree Fitty.", "gilded": 0, "created_utc": "1317856402", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "[Official Wiki on the Eyelander](http://wiki.teamfortress.com/wiki/Eyelander)\n\nFirst bullet in the Bugs section:\n\n* Decapitating a Sniper using the Bazaar Bargain who has heads on his counter will collect those heads as if they were taken from another Demoman with the Eyelander, Horseless Headless Horsemann's Headtaker or Nessie's Nine Iron.", "gilded": 0, "created_utc": "1317864871", "subreddit": "tf2", "score": 1, "controversiality": 0}
{"body": "Deep in the lake, duh. Like the loch ness monster. Or maybe deep in the ocean, like godzilla.", "gilded": 0, "created_utc": "1317867202", "subreddit": "pokemon", "score": 1, "controversiality": 0}
{"body": "&gt; Good job of avoiding the evidence.\n\nAvoiding the evidence? For a supernatural component of near death experiences? Really? NDE's are well understood in scientific terms, this is not new news. Please, do your research properly before making such ridiculous, patently false claims.\n\nhttp://www.skepdic.com/nde.html\n\nThere. Are you going to 'avoid' that evidence? It links to a bunch of other stuff too, make sure you don't 'avoid' any of that. Remember, if you 'avoid' any of it, then I win the argument, by your reasoning. \n\n&gt; But hey, you're not alone, and you're not the first, and you even reinforce the validity of the arguments in the essay by behaving as predicted, oh dear fundamaterialist you ;)\n\nFunda...materialist...oooh boy. We are so done. I'm not in the mood to engage with nutjobs. I gave you a lot of my time, being patient and fair, and this is what I get back? You think you can throw a few links out, and if I don't comprehensively shut them down, then *you've* won? Give me a break. As if there is a shortage of crazy websites *claiming* to have evidence for the loch ness monster or psychics. *It doesn't mean they're right*. What if I do refute them? You throw a few more links (from the endless supply) and the process starts over. No. It stops now. Get your head together, seriously. ", "gilded": 0, "created_utc": "1317870895", "subreddit": "skeptic", "score": 1, "controversiality": 0}
{"body": "\"Avoiding the evidence? For a supernatural component of near death experiences? Really?\"\n\nYes, yes and yes.\n\n\"NDE's are well understood in scientific terms, this is not new news. Please, do your research properly before making such ridiculous, patently false claims.\"\n\nOh the irony. First of all, with \"scientific\", do you mean materialistic?\n\nSecondly, there is not any good non-supernatural explanation for NDEs. That's why I linked you the book by the oxford-trained philosopher Chris Carter. He thoroughly documents the data in a fair light, and explicitly show why the materialistic arguments not only lack explanatory power, but even how materialism is demonstrably falsified by the NDE (and DBV) data.\n\n\"http://www.skepdic.com/nde.html\n\nThere. Are you going to 'avoid' that evidence? It links to a bunch of other stuff too, make sure you don't 'avoid' any of that. Remember, if you 'avoid' any of it, then I win the argument, by your reasoning.\"\n\nAnd I can do you one better than the skepdic-link, which I've already read many times over:\nhttp://www.infidels.org/library/modern/keith_augustine/HNDEs.html\nThere you have *the* NDE skeptic that is always referenced when the debate tends to go deep, as his writings were even published in the peer-reviewed JNDS (Journal of Near-Death Studies) where he met with response from all the scientists in the field. And I've read his entire writings many times over as well, so don't act like I'm biased and have only looked at one side of the debate when you throw in the first thing a quick google search handed you.\n\nAnd here is how I deal with your side of the argument: I've read those two skeptical sources AND the book by Chris Carter, and I can confidently state that Chris refutes the proposed counter-points brought up by both Keith and the skepdic-link. THAT's why I urged you read his book, or at the very least the reviews on amazon.\n\n\"Funda...materialist...oooh boy. We are so done. I'm not in the mood to engage with nutjobs.\"\n\nOh my god, you have refuted NDEs! Just call us nutjobs, and it's all done! You're being empirical and reasonable again! :D\n\nNo. I can call you a nutjob as well by saying that you are generically stupid by just adhering to the contemporary beliefs of most academic philosophers, but unfortunately I learnt long ago in my autodidactic journey that ad hominems are useless.\n\n\"I gave you a lot of my time, being patient and fair, and this is what I get back?\"\n\nI've only given you arguments, and you appeal to ridicule. Who's wasting who's time?\n\n\"You think you can throw a few links out, and if I don't comprehensively shut them down, then you've won?\"\n\nDude, please, it's not a contest, nor is it a matter of *winning*. It's about a mutual exchange of ideas in order to assure that we're both coming closer to the truth. You know, what skepticism and inquiry ought to be about?\n\n\"Give me a break. As if there is a shortage of crazy websites claiming to have evidence for the loch ness monster or psychics.\"\n\nI have never researched the proposed evidence for the loch ness, so I will withhold judgment on that. I have however researched to some extent the proposed evidence for PSI and/or psychic phenomena, and at least some of it is very sound. Of course, your fundamaterialism alarm will go off on that as well, as the actual evidence isn't what's pertinent regarding these matters in your internal worldview. Materialism is correct, and evidence is not relevant to its truth. Right?\n\n\"What if I do refute them? You throw a few more links (from the endless supply) and the process starts over. No. It stops now. Get your head together, seriously.\"\n\nYes, can you imagine that there are other people who have debated these things extensively, and a couple of links are never going to be enough? Oh my god, I can't categorically debunk every non-paranormal claim out there by attempting (never mind succeeding) to refute a few links, kill me now!\n\nI'm giving you the best goods that are out there and that are presented concisely, so that you'll have a better way of familiarizing yourself with them quickly.\n\n:)\n\nI don't blame you though, as I was once in your materialistic/physicalistic shoes. Peace", "gilded": 0, "created_utc": "1317873186", "subreddit": "skeptic", "score": 0, "controversiality": 0}
{"body": "Nessie's right. You'll find *most* decades are essentially divided into two or more genres of music.", "gilded": 0, "created_utc": "1317879791", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "'bout tree fiddy", "gilded": 0, "created_utc": "1317883526", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt;Tree fiddy\n\nFTFY", "gilded": 0, "created_utc": "1317923538", "subreddit": "AskReddit", "score": 317, "controversiality": 0}
{"body": "GODDAMN LOCH NESS MONSTER!!!", "gilded": 0, "created_utc": "1317925872", "subreddit": "AskReddit", "score": 98, "controversiality": 0}
{"body": "Do you then believe in leprechauns, the Loch Ness Monster, Bigfoot, faeries, talking animals, the Flying Spaghetti Monster, dragons, Santa Claus, and flying saucers?  Because all of these things cannot be proven to not exist.\n\nHow and where do you draw your line?", "gilded": 0, "created_utc": "1317930831", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "nah dont go givin' that ghost no tree fiddy woman!", "gilded": 0, "created_utc": "1317938330", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "&gt;GORAMN LOCH NESS MONSTER!!!\n\nFTFY", "gilded": 0, "created_utc": "1317944712", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Tree fitty?", "gilded": 0, "created_utc": "1317945452", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I've only bought 2 summer keys, but I've found 3 hats in my 300 hours of play and I sold them for keys. I've opened 4 crates, and I got a Nessie's Nine-Iron and Prairie Heel Biters from the summer crates, and a Strange Black Box and Strange Ambassador for the other ones.", "gilded": 0, "created_utc": "1317952662", "subreddit": "tf2", "score": 1, "controversiality": 0}
{"body": "On the counter next to the pictures of Nessie and Bigfoot.", "gilded": 0, "created_utc": "1317954445", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "Ridiculous. This all goes back to the loch ness monster. ", "gilded": 0, "created_utc": "1317957386", "subreddit": "skeptic", "score": 6, "controversiality": 0}
{"body": "Wait, you're saying the Loch Ness Monster causes autism?\n\nHey, it's more plausible than blaming the vaccines.", "gilded": 0, "created_utc": "1317957642", "subreddit": "skeptic", "score": 8, "controversiality": 0}
{"body": "I think I see the loch ness monster's shadow, mouth open, heading your way from just behind the cameraman...", "gilded": 0, "created_utc": "1317958451", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Imma need a 'bout tree fiddy. \n\nedit: Downvote monsters man...sheesh. ", "gilded": 0, "created_utc": "1317961495", "subreddit": "reddit.com", "score": -2, "controversiality": 0}
{"body": "Wasdat? DAMN YOU LOCH NESS MONSTER!!!!", "gilded": 0, "created_utc": "1317961633", "subreddit": "reddit.com", "score": -3, "controversiality": 0}
{"body": "All he wants is tree fiddy.", "gilded": 0, "created_utc": "1317962757", "subreddit": "skeptic", "score": 7, "controversiality": 0}
{"body": "\"look at this cool loch ness monster model I found!\"", "gilded": 0, "created_utc": "1317965784", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "I need about tree fitty.", "gilded": 0, "created_utc": "1317967006", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "He came back... asking me AGAIN FOR TREE FIDDY ", "gilded": 0, "created_utc": "1317973261", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I'm quite convinced that all beds are not solids, but amorphous solids. At first, at night, they start of like a rock. Then once you fall asleep, they turn into some sort of marshmallow euphoria cloud that keeps sucking you in no matter how many times you try to get out of it. Maybe beds are really high-tech gizmos that conform to our DNA and reach the perfect level of comfort in the morning so we can't get out of bed. This would all, of course, be a master plan by the Loch Ness Monster to get our tree fiddy.", "gilded": 0, "created_utc": "1317993177", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1318007005", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "My biology teacher at a community college  told us that he was suppose to teach us about evolution that day, but he wasn't going to because he didn't believe in it.   Which wasn't that shocking, it's Oklahoma, that's not that uncommon.  Then he proceeded to use that day to teach us about something he did believe in, the Loch Ness Monster. \n\nGotta say, it took guts to do that.  He looked right at me when he talked about what he was going to do that day.   My dad was his boss and I did get him fired for that.", "gilded": 0, "created_utc": "1318011741", "subreddit": "AskReddit", "score": 24, "controversiality": 0}
{"body": "This had better be a blunt made to look like Nessie. I would be so proud", "gilded": 0, "created_utc": "1318019584", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "Looks like Nessie's vacation spot...", "gilded": 0, "created_utc": "1318037001", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I need about tree fiddy", "gilded": 0, "created_utc": "1318039152", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Did she ask you for tree fiddy? Cuz She asks me all the time. She's just playin us for the damn tree fiddy.", "gilded": 0, "created_utc": "1318041140", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "And she needed about tree fiddy", "gilded": 0, "created_utc": "1318041664", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "ima need about tree fiddy.", "gilded": 0, "created_utc": "1318042078", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Except that's completely the opposite of what I said. I don't believe there's no god. I simply say that no god claim has been presented that carries sufficient evidence.\n\nIf they can't get that, then there's nothing more you can do.\n\nActually, ask them if \"Not Believing In Santa/Allah/Faeries/Unicorns/Sasquatch/Nessie\" is a religion, too.", "gilded": 0, "created_utc": "1318050957", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Goddamn Loch Ness monster...", "gilded": 0, "created_utc": "1318055391", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Guh, back to the locke with you Nessie.", "gilded": 0, "created_utc": "1318081614", "subreddit": "Metal", "score": 1, "controversiality": 0}
{"body": "I would like to buy 1 of your enforcer, a splendid, and a nessie's nine.\nAdd me: Kifli28", "gilded": 0, "created_utc": "1318086896", "subreddit": "tf2trade", "score": 1, "controversiality": 0}
{"body": "[cawdor](http://en.wikipedia.org/wiki/Cawdor_Castle) and [macduff](http://en.wikipedia.org/wiki/Macduff's_Castle) castles (of macbeth fame) are pretty cool places... you can always go to inverness and look for the loch ness monster.", "gilded": 0, "created_utc": "1318091286", "subreddit": "travel", "score": 1, "controversiality": 0}
{"body": "how bout for tree fitty", "gilded": 0, "created_utc": "1318114295", "subreddit": "nosleep", "score": 2, "controversiality": 0}
{"body": "People have been chasing the Loch Ness monster for generations, and they use the above argument to justify their belief. I'm not just making shit up, there are actually people out there who do that. If that specific example isn't suitable for you, I could modify it to say that you could claim there are miniature pterodactyls living in the jungle in Botswanna with the same argument, or any other scenario that passes your test for \"reasonableness\". \n\nEveryone trying to defend Jobs here needs to just let it go. The man can be a legend without being all things to all people. So he wasn't a big philanthropist. Big shit. That doesn't mean he didn't improve a lot of lives. ", "gilded": 0, "created_utc": "1318115698", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "&gt; The man can be a legend without being all things to all people. So he wasn't a big philanthropist. Big shit. That doesn't mean he didn't improve a lot of lives.\n\nall this, agreed - we agree on the heart of why we're reading this crap.  but, to venture back into the mud of pointless argument: \n\n&gt; People have been chasing the Loch Ness monster for generations, and they use the above argument to justify their belief. \n\nand most of us recognize that as absurd.  \n\nthe point you are missing is that it is very plausible that Jobs chose to remain anonymous in his giving, so it is a logical jump to claim knowledge of his philanthropy.  we can provide supporting examples of anonymous charitable donations - you can't point to worthwhile support for the absurd analogies you've come up with.  \n\nlet me make a risky argument that might not work out as well as i hope: it's kind of like claiming a male public figure (politician etc) is a homosexual, because you've never seen him appear to be romantic with a woman or saying publicly and explicitly that he's not gay.  however, you don't know if that person is just private in their love life, or actually a closeted homosexual.  it's not reasonable to make a claim about the sexual preferences about that person, other than to speculate.  it remains reasonable that the person's preferences are kept private.  similarly, just because we didn't see jobs making donations, and he didn't explicitly say \"i give!\" does not mean we know he didn't.  ", "gilded": 0, "created_utc": "1318116950", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "'bout tree fiddy", "gilded": 0, "created_utc": "1318140676", "subreddit": "battlefield3", "score": 4, "controversiality": 0}
{"body": "I was raised in a fundamentalist Christian household, but I was sort of a precocious little ass. I LOVED dinosaurs, and by the time I was six or seven I knew from the books my parents had lovingly bought me how many millions of years ago was the paleolithic era or the mesozoic era or whatnot. (I don't care very much for dinosaurs anymore: I remember the names of things, but not really what or when they were. Still, the best dinosaur is the [Ankylosaurus](http://www.youtube.com/watch?v=4vSY_rB928c).)\n\nI had to renounce all of my scientific knowledge, bit by bit, as my parents constantly reminded me that the whole \"millions and millions of years ago\" kind of stuff didn't really jive with Genesis, and that the dinosaurs went extinct because there wasn't room on the Ark. (Seriously.)\n\nAnyway, adopted fundamentalist ways and beliefs. Rejected rational inquiry as the Devil's temptations. Worried constantly that I would be devoured by Satan, who was in the habit of seeking whom he could devour. Went to a private school where we watched videos by the [Reverend Doctor Kent Hovind](http://en.wikipedia.org/wiki/Kent_Hovind) during biology class.\n\nTo make an already long story less long, I go to college, have atheist friends, and for Xmas, I ask my folks for \"What's So Great About Christianity,\" by Dinesh D'Souza, at that time a prominent Christian apologist/papist/C.S. Lewis plagiarist in response to the Harris/Hitchens/Dawkins trifecta. \n\nBut in the book, D'Souza explained the theory of evolution by natural selection, and the Big Bang, and how they were an essential part of a modern Christian's interpretation of the bible, Genesis in particular. So here I was: confronting an apostate who I really wanted to cite to my non-religious friends. In any church I had ever been to, this man would have been a lure of the devil, trying to snag believers away from the Word of God.\n\nBetween that and Mark Twain and \"History of the Decline and Fall of the Roman Empire\" by Edward Gibbons, it wasn't long before I dropped all the evangelical nonsense and reverted to my childhood state of scientific rationalism, where I happily remain. I'm still scared as fuck of hell, but I have a shrink for that. \n\ntl;dr- The work of a Christian apologist combined with science, literature and history to overwhelm a deeply ingrained religiosity. ", "gilded": 0, "created_utc": "1318177057", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Is worm when their necks strech out? I'd thought of that as Tactical Loch Ness Monster Mode.", "gilded": 0, "created_utc": "1318182293", "subreddit": "battlefield3", "score": 2, "controversiality": 0}
{"body": "[about tree fiddy](http://i.imgur.com/oGbem.jpg)", "gilded": 0, "created_utc": "1318189204", "subreddit": "fffffffuuuuuuuuuuuu", "score": -16, "controversiality": 0}
{"body": "He owes me about tree fiddy.", "gilded": 0, "created_utc": "1318201051", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "PLEASE draw a Loch Ness monster fighting a Fighter Jet.\nI NEED THIS FOR REDDIT GIFTS and I don't know how to do it!", "gilded": 0, "created_utc": "1318207631", "subreddit": "fffffffuuuuuuuuuuuu", "score": 3, "controversiality": 0}
{"body": "To start off, I used to deliver pizza. One New Year's eve (99 - 00 to be exact), I had to go deliver some pizza to some place in downtown NYC. I got to the building, and went inside. Of course the destination was some 20 floors up.. And once I got there, I found out it was all some prank. (I should've read it first - who the hell is named I. C. Weiner?)\n\nWell I decided I might as well take a break, have some pizza, and watch the ball drop. What else could go wrong? My GF had just dumped me earlier that day, my bike got stolen so I'd be walking back to the pizza place, and now I was out the cash for the pizza and the six pack that I was supposed to deliver.\n\nThe ball dropped, and in the moment I accidentally leaned too far back in my chair, falling down to the floor and rolling backwards. Did I mention that this was a cryogenics facility? Well it was. Straight into the tube I went.\n\n1000 years went by. Damn did a lot change! I met this cool cyclops named Turanga Leela, and a robot named Bender Rodriguez. We did all sorts of crazy shit, most of it at the fault of my great great great great great great great great great great great great great great great great great great great great great great great great great great great great great great nephew, Hubert, who sent us on these crazy missions from his delivery company, Planet Express. That place was always going out of business.\n\nThe really crazy part started when that cyclops noticed that I had a tattoo of Bender on my ass, and later on, these nudist aliens that took over our company (whole other story, but I'll get into that later) noticed as well. Upon closer inspection, it was a code that, when spoken aloud, would summon a \"time sphere\" which could be used to travel back in time, without paradoxes. After the aliens decided they wanted me dead so that I couldn't use the code against them (they had gotten lots of shit from throughout history and didn't want me foiling them), I used the code to come back to 2000 and now here I am. :D\n\nI'm currently searching for a narwhal that I took care of at a water park since I came back. They had to let poor Leelu into the wild to make room for some stupid \"Loch Ness Monster\" fake. :/\n\nWell, that's my story. TOP THAT, REDDIT. :D", "gilded": 0, "created_utc": "1318222228", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "I'm torn between Nessie and honey badger.", "gilded": 0, "created_utc": "1318237109", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1318246784", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "TIL Loch Ness Monster just wants to become part of the 1%", "gilded": 0, "created_utc": "1318248712", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Men are just more private about the things they know they shouldn't believe in. \n\n*edit: [Interesting research](http://www.brisbanetimes.com.au/opinion/blogs/sceptic-science/do-women-want-to-believe-20110105-19fr2.html)\n\n&gt;But Perth teacher and researcher Kylie Sturgess has found that the difference between women and men isn't so much in their propensity to hold paranormal beliefs as it is in the kinds of paranormal beliefs they're likely to hold. \n\n&gt;\"Women are more likely to be at the 'social' end of paranormal beliefs,\" Sturgess says. \"They're more likely to believe in things like mediums, astrology, psychic healing, and ghosts.\n\n&gt;\"Men, for instance, are more likely than women to believe in the alien astronaut theories of Erich von Daniken, and more cryptozoological things like the Loch Ness monster.\"\n\n&gt;Studies have also shown that men are also more likely to believe in conspiracy theories, creationism and the notions of historical revisionists, while women are more likely to believe in telepathy and New Age theories.\n", "gilded": 0, "created_utc": "1318253633", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "This is from the book *Why People Believe Weird Things* by Michael Shermer:\n\nFor a variety of reasons related to the subject matter and style of reasoning, creationism, revisionism, and UFOlogy are guy beliefs. So while gender is related to the target of one's beliefs, it appears to be unrelated to the process of believing. In fact, in the same study that found more women than men believe in precognition, it turned out that more men than women believe in Big Foot and the Loch Ness monster. Seeing into the future is a woman's thing, tracking down chimerical monsters is a man's thing. There are no differences between men and women in the power of belief, only in what they choose to believe.\n", "gilded": 0, "created_utc": "1318254224", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Let's compare that to the typical skeptical response to other things. I mean, you mentioned:\n\n&gt; Ghosts, science, woo etc etc.\n\nLet's try substituting one of these in:\n\n\"I accept the question of ghosts is unanswerable, therefore I CHOOSE to believe they exist. Furthermore, I accept the question of whether that particular absurdly-bad-quality bit of film captured an actual ghost or whether there's a more rational explanation is *also* unanswerable, so yeah, I believe that, too. And while we're at it, the Loch Ness Monster also exists, since the question of whether it exists is unanswerable unless we drain the entire fucking lake.\"\n\nWhat makes God special in this case?\n\n&gt; He is willing to change his views if you show him otherwise and his choice does not define him. He will openly admit it is not a rational belief, but he wants to do it because it makes him feel better.\n\nAll of these things can apply equally to woo. My father knows what homeopathy is, and knows it's not rational to believe it works, but continues to take certain homeopathic remedies because they \"work for him.\" He may have good reason to do this -- after all, a faith-based placebo can still cause the body to heal itself, so I'm not sure I actually want to convince him that he's wrong -- but he's certainly not being a good skeptic, wouldn't you say?\n\n&gt; I think such a person can still be a good skeptic. He will follow evidence based views in everything else...\n\nWell, certainly. A scientist can also be a good scientist, despite believing all sorts of crazy things Sunday mornings -- or, hell, even believing stuff like Homeopathy -- so long as he can leave those at the door when it comes to actual research.\n\nEven so...\n\n&gt; just in this one thing he disagrees with most skeptics.\n\nBut again, unless there's some reason God is special, we're back where we started. \"Oh, I'm a skeptic, too! I'm skeptical of Bigfoot, Nessie, and ghosts. I'm also skeptical of big pharmaceutical companies, and I like alternative medicine. I guess I just disagree with the skeptical community on *this one thing.*\"\n\nNow, I suppose I agree with Hal Bidlack in that we should not be deriding deist skeptics, we shouldn't be telling them \"You can't be a skeptic,\" or \"You can't debunk other woo.\" But at the same time, I don't see why their deism should be immune to the same skepticism we apply to the claims of, say, Christian Science.", "gilded": 0, "created_utc": "1318266458", "subreddit": "atheism", "score": 7, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1318279047", "subreddit": "gaming", "score": 7, "controversiality": 0}
{"body": "about tree fiddy\n\nand no 1k viewers is no where near enough", "gilded": 0, "created_utc": "1318282226", "subreddit": "leagueoflegends", "score": 1, "controversiality": 0}
{"body": "tree fiddy \n\nhttp://www.youtube.com/watch?v=9cn7xfBpZ3M&amp;feature=related#t=0m44s", "gilded": 0, "created_utc": "1318282409", "subreddit": "iphone", "score": 1, "controversiality": 0}
{"body": "GIMME MY TREE FIDDY", "gilded": 0, "created_utc": "1318283097", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "&gt; About tree fiddy\nFTFY", "gilded": 0, "created_utc": "1318286154", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "All I need id tree fiddy", "gilded": 0, "created_utc": "1318288029", "subreddit": "gaming", "score": 17, "controversiality": 0}
{"body": "DAMMIT MONSTA, YOU AINT GETTIN NO TREE FIDDY", "gilded": 0, "created_utc": "1318289185", "subreddit": "gaming", "score": 10, "controversiality": 0}
{"body": "tree fiddy, that is my FINAL offer\n", "gilded": 0, "created_utc": "1318291561", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "if my suspicion is correct, and he IS the loch ness monster, then this game will be sold within the hour ", "gilded": 0, "created_utc": "1318291596", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "And it was 'bout that time I realized this girl scout was 20 stories tall and a creature from the paleolithic era!", "gilded": 0, "created_utc": "1318292172", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "About 'tree fiddy.", "gilded": 0, "created_utc": "1318294182", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "You gave dat monsta tree fitty? Now he aint neva gonna leave us alone!!\n\nback to 98", "gilded": 0, "created_utc": "1318295600", "subreddit": "AdviceAnimals", "score": 6, "controversiality": 0}
{"body": "About *tree fiddy", "gilded": 0, "created_utc": "1318296704", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Tree fiddy", "gilded": 0, "created_utc": "1318297253", "subreddit": "fffffffuuuuuuuuuuuu", "score": 8, "controversiality": 0}
{"body": "A giant resounding YES.  The biggest problem would be dealing with her shitty ass brick phone from the paleolithic era", "gilded": 0, "created_utc": "1318302753", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "i hope thats sealed up enough as to wear no air can get into it :3 perfectly preserved joints.... ill give you tree fiddy", "gilded": 0, "created_utc": "1318304808", "subreddit": "trees", "score": 4, "controversiality": 0}
{"body": "Finally! I expect crystal clear images of Bigfoot and Nessie within the next week", "gilded": 0, "created_utc": "1318305070", "subreddit": "videos", "score": 2, "controversiality": 0}
{"body": "Aw man. Big Foot and the Loch Ness Monster are fucked.", "gilded": 0, "created_utc": "1318307700", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "You were probably tippin' that goddamned Loch Ness monster.", "gilded": 0, "created_utc": "1318310506", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "God damnit loch ness monster!", "gilded": 0, "created_utc": "1318310915", "subreddit": "Minecraft", "score": 11, "controversiality": 0}
{"body": "Tree Fiddy?!!?", "gilded": 0, "created_utc": "1318345736", "subreddit": "firstworldproblems", "score": 81, "controversiality": 0}
{"body": "well of course he's gonna keep comin round, u keep givin him tree fiddy", "gilded": 0, "created_utc": "1318353977", "subreddit": "firstworldproblems", "score": 6, "controversiality": 0}
{"body": "Saw this yesterday as well. We called it Nessie. ", "gilded": 0, "created_utc": "1318355784", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "It was about dat time I realized it was a crustacean from the Paleolithic Era! ", "gilded": 0, "created_utc": "1318359446", "subreddit": "firstworldproblems", "score": 1, "controversiality": 0}
{"body": "You turned my silent weeping from this comic/thread into full-on, teary-eyed lolgasming. Thank you very much. I hope you find your treefiddy and get rid of that Loch Ness monster.", "gilded": 0, "created_utc": "1318361047", "subreddit": "fffffffuuuuuuuuuuuu", "score": 3, "controversiality": 0}
{"body": "Is that the Loch Ness Monster in the background?", "gilded": 0, "created_utc": "1318362659", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Nessie sure, sharks are far too cliche. ;)", "gilded": 0, "created_utc": "1318366644", "subreddit": "Minecraft", "score": 1, "controversiality": 0}
{"body": "I need about tree fiddy\n", "gilded": 0, "created_utc": "1318368188", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Oh. Sorry. Here's her address:\n\nL'Keisha Johnson\n\nTree Fiddy Fi Ghetto Ave. \n\nGetdawatanigguh, F.L. \n\nPO Box - FiddyNaFodyFo\n", "gilded": 0, "created_utc": "1318376763", "subreddit": "pics", "score": 31, "controversiality": 0}
{"body": "The plural of \"anecdote\" is not \"data.\"\n\nIs there science behind unicorns, leprechauns, Godzilla or Nessie?\n\nBelieve what you want to believe (it's obvious you're going to anyway), but don't call your beliefs \"science,\" because they're NOT science.  They're beliefs that you subscribe to because you WANT to believe, just like the theists.", "gilded": 0, "created_utc": "1318379974", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1318383527", "subreddit": "buildapc", "score": 13, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1318387509", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "You aint got no tree fiddy!", "gilded": 0, "created_utc": "1318387548", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Generally you're going to want Calc of one variable, but two+ semesters worth. There is a lot to learn here, and the concepts carry on for a while. \n\nThe way to go with math could very well be [pauls online math notes](http://tutorial.math.lamar.edu/). It is extremely well written and a lot of kids of my university use it to supplement (or replace) our in class material. If you know High School level math, this will take you through all the calculus and linear algebra you'll need to know. Calculus 1+2 should go first, then you can choose calc III or differential equations, and I would probably suggest learning those before Linear Algebra (not because you couldn't learn linear algebra without them, but because it is good to have completed those four calculus classes before moving on). \n\n\nOn the physics side, Intro to Mechanics, Intro to E&amp;M, and Intro to modern physics are the basics of all you need. If you could get your hands on a copy of University Physics by Young and Freedman that would be ideal, as it covers all these topics in one long book (typically taught in three semesters at university). The book is $200, but I hear the internet has a way to provide the book AND solutions for about tree fiddy or less. \n\nIf you follow this book, I would suggest Calc I (and maybe II) before intro to Mechanics, Calc III before Intro to E&amp;M (not necessary, but definitely very helpful) and differential eq before Intro to Modern Physics. Also be aware that if you look into any physics after this, you will need to have taught yourself linear algebra.\n\nAt least, these cover virtually all the pre-reqs at my and many other universities before you can take quantum mechanics, the last pre requisite before particle physics and cosmology. \n\n\nedit: Calc of one variable is Calc I, II, and Differential Equations. Calc of multiple variables is Calc III.", "gilded": 0, "created_utc": "1318387884", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "about tree fitty", "gilded": 0, "created_utc": "1318390311", "subreddit": "fffffffuuuuuuuuuuuu", "score": 29, "controversiality": 0}
{"body": "\"God damnit Loch Ness monster, I ain't givin' you no tree fitty.\"", "gilded": 0, "created_utc": "1318390797", "subreddit": "fffffffuuuuuuuuuuuu", "score": 19, "controversiality": 0}
{"body": "They also have the Loch Ness Monster.\n\nGo figure.", "gilded": 0, "created_utc": "1318400116", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "I'll fix it for you! For the low price of tree fitty.", "gilded": 0, "created_utc": "1318416058", "subreddit": "Minecraft", "score": 1, "controversiality": 0}
{"body": "DAUM! Nessie axe me bout you! Don worriez, I put in a gud wurd fo ya nigguh!", "gilded": 0, "created_utc": "1318419033", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "lol as long as someone draws a picture of a Viking battling the Loch Ness Monster in the lake!   ", "gilded": 0, "created_utc": "1318444067", "subreddit": "NKU", "score": 0, "controversiality": 0}
{"body": "bout tree fiddy", "gilded": 0, "created_utc": "1318448814", "subreddit": "pics", "score": 123, "controversiality": 0}
{"body": "Then you realize that it ain't no Rhinoceros, it's the gosh darn Loch Ness Monster! .... and you just gave him tree fiddy last week", "gilded": 0, "created_utc": "1318451367", "subreddit": "funny", "score": 54, "controversiality": 0}
{"body": "* What we currently consider modern humans are thought to have arisen almost 200,000 years ago. \n* Migration out of Africa is estimated at 70,000 years ago. \n* The Paleolithic Era ended about 10,000 years ago. \n* Therefore Paleolithic Africans would be humans that stayed in Africa through part of the remainder of the Paleolithic Era.\n\nI am no expert in the way these genealogy companies work, but presumably there would be no point for them to consider everyone \"an African ancestor at some point\" and at least cut off the common genes from before \"out of Africa\".", "gilded": 0, "created_utc": "1318453278", "subreddit": "askscience", "score": 2, "controversiality": 0}
{"body": "I ain't giving you no tree-fiddy you God damn Loch Ness Monster! Getcha own God damn money!", "gilded": 0, "created_utc": "1318456750", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "WELL GOD DAMN IT NO WONDER HE KEEP COMIN ROUND HEAH ASKIN FO TREE FIDDY!!!", "gilded": 0, "created_utc": "1318457809", "subreddit": "funny", "score": 46, "controversiality": 0}
{"body": "I'll do it for tree fiddy...", "gilded": 0, "created_utc": "1318465706", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "The Loch Ness Monster fighting a Fighter Jet", "gilded": 0, "created_utc": "1318467571", "subreddit": "ICanDrawThat", "score": 1, "controversiality": 0}
{"body": "There were no fruit trees during the paleolithic era?\n", "gilded": 0, "created_utc": "1318477441", "subreddit": "Health", "score": 0, "controversiality": 0}
{"body": "Just about tree fiddy ", "gilded": 0, "created_utc": "1318481582", "subreddit": "RedditThroughHistory", "score": 2, "controversiality": 0}
{"body": "I was thinkin' more aroun' tree fiddy.", "gilded": 0, "created_utc": "1318519243", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Dragon if it can be mythological. Loch Ness Monster if it can't", "gilded": 0, "created_utc": "1318519998", "subreddit": "AskReddit", "score": 21, "controversiality": 0}
{"body": "I'm like 45% sure the loch ness monster is fictional. It's completely logical but I don't know if something that awesome can exist...", "gilded": 0, "created_utc": "1318520266", "subreddit": "AskReddit", "score": 10, "controversiality": 0}
{"body": "It was that Goddamn Loch Ness Monster.", "gilded": 0, "created_utc": "1318522873", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "I lent him tree fiddy", "gilded": 0, "created_utc": "1318523143", "subreddit": "AskReddit", "score": 15, "controversiality": 0}
{"body": "I'm waiting for Adobe to use their new anti blur technology on old Loch Ness Monster photos. \"Enhance!\". \"Looks to be a dirty sock over a whiffle ball bat\". ", "gilded": 0, "created_utc": "1318525041", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "well thats about the time he realized that it was really a 60 foot crustacean from the paleolithic era", "gilded": 0, "created_utc": "1318528408", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Sure, pally. And I'm friends with the Loch Ness Monster.", "gilded": 0, "created_utc": "1318533859", "subreddit": "videos", "score": 2, "controversiality": 0}
{"body": "About tree fitty", "gilded": 0, "created_utc": "1318537010", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Dammit woman! You give a loch ness monster a dollar, he's just gonna assume you got more!", "gilded": 0, "created_utc": "1318537220", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Yep... see also:\n\nhttp://departments.bloomu.edu/philosophy/pages/content/hales/articles/proveanegative.html\n\n&gt; It is widely believed that you canâ€™t prove a negative. Some people even think that it is a law of logicâ€”you canâ€™t prove that Santa Claus, unicorns, the Loch Ness Monster, God, pink elephants, WMD in Iraq and Bigfoot donâ€™t exist. This widespread belief is flatly, 100% wrong. In this little essay, I show precisely how one can prove a negative, to the same extent that one can prove anything at all.", "gilded": 0, "created_utc": "1318542966", "subreddit": "atheism", "score": 4, "controversiality": 0}
{"body": "I ain't givin no Loch Ness Monster no tree fiddy.", "gilded": 0, "created_utc": "1318544297", "subreddit": "Frugal", "score": 0, "controversiality": 0}
{"body": "thanks for the kind words. i spent 6 years as a volunteer firefighter. i've done the 'wet stuff on the red stuff' thing for a bit. EMS is really where it's at for me. career medic? yes! i'm 13 years in and still going strong. i also grew up in the EMS/Fire business. my dad was a FF/Medic for 30+ years. he was actually in the class of the first volunteer paramedics in NYS way back in the paleolithic era. it's in my blood and was almost second nature to me when i finally got into public service when i was old enough. i dabbled in hospital work and it just wasn't for me. the streets are where its at.", "gilded": 0, "created_utc": "1318566905", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1318566912", "subreddit": "AskReddit", "score": 16, "controversiality": 0}
{"body": "\"Tree Fitty!\"", "gilded": 0, "created_utc": "1318567673", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "im shocked over, no not the actual prices but the whining about them in america! Oh my gawwwddd tree fiddy fora gallooon! in sweden its 8.20 per gallon and norway is worse.", "gilded": 0, "created_utc": "1318573702", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1318575422", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "i was talking to a mutual friend and she was saying how she didnt like the water.  I said what are you afraid of the loch ness monster and she said no my daughter drown 2 years ago.  One of the most awkward moments of my life. ", "gilded": 0, "created_utc": "1318596818", "subreddit": "AskReddit", "score": 198, "controversiality": 0}
{"body": "What she didn't realize was that her daughter was about eight stories tall and a giant crustacean from the Paleolithic Era lookin' for about tree fiddy.", "gilded": 0, "created_utc": "1318602570", "subreddit": "AskReddit", "score": 9, "controversiality": 0}
{"body": "You should have screamed \"Damn that Loch Ness Monster!\" and ran away.", "gilded": 0, "created_utc": "1318608139", "subreddit": "AskReddit", "score": 35, "controversiality": 0}
{"body": "If only she had tree fiddy...", "gilded": 0, "created_utc": "1318615462", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Unless your boyfriend's dong could crush a small building.\n\nSeriously. His friends call it \"Nessie.\"", "gilded": 0, "created_utc": "1318635654", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "loch ness monster", "gilded": 0, "created_utc": "1318637802", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Id give ya bout tree fiddy", "gilded": 0, "created_utc": "1318640842", "subreddit": "gaming", "score": 3, "controversiality": 0}
{"body": "Must have forgot his tree fiddy.", "gilded": 0, "created_utc": "1318643763", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Oh hahaha got it!\nEdit: In that case: Tree Fitty", "gilded": 0, "created_utc": "1318646792", "subreddit": "LadyBoners", "score": 8, "controversiality": 0}
{"body": "August 22, 565 - The \"Loch Ness Monster\" is first spotted/reported.", "gilded": 0, "created_utc": "1318650498", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "You got it backwards. Autism causes Bigfoot.\n\nAnd Nessie, too, probably.\n\n", "gilded": 0, "created_utc": "1318667893", "subreddit": "skeptic", "score": 0, "controversiality": 0}
{"body": "Nessie causes Thimerisol. Or vice versa.", "gilded": 0, "created_utc": "1318668401", "subreddit": "skeptic", "score": 3, "controversiality": 0}
{"body": "And that fee is TREE FIDDY", "gilded": 0, "created_utc": "1318710254", "subreddit": "reddit.com", "score": -4, "controversiality": 0}
{"body": "Because I'm holding my penis?\n\nI'm not sure about you, but I don't like to talk while I hold my sea monster.\n\nWait until you and your friend has unzipped the Loch Ness monster and everything should be fine.", "gilded": 0, "created_utc": "1318726210", "subreddit": "OneY", "score": 1, "controversiality": 0}
{"body": "You're not going to have any way to charge, just jump. With that known, let's examine your demoknight melee options:\n\n\n* **Eyelander/HHHH/Nessie' Nine Iron**: No criticals, lower health. If you can kill twice, you are golden. The grenade launcher, if you can be good, can get you a lot of early damage to decap with. Useful, but you need to make sure you are going to land those hits.\n* **Scotsman's Skullcutter**: Larger melee range, more damage, but slower? Getting into their base and then rack up the kills. A Eyelander will get less damage, but faster as time goes on. If you are less sure of your abilities, I would say this is going to be a better weapon.\n* **Claidheamh MÃ²r**: That increased charge duration? Not happening. Lack of health, no criticals... the only thing going for it is the +37% melee range. Eyelander is surely better.\n* **Half-Zatoichi**: Full health on a kill? Useful. Can't switch? Not so much. You better make sure you are on your game, and hope that you're able to kill as many people as you can.\n* **Persian Persuader**: No random criticals? Meh. Halves the time needed to charge? Worthless. All ammo as HP? Might be useful. After a kill, pick up their weapons to get HP. I would say that the Half-Zatoichi is better in this case though, since this requires you to lose your stick bombs (not a big deal) but then also have to contend with picking weapons up.\n\nAnd non-Demoknight weapons:\n\n* **Bottle/Scottish Handshake/Frying Pan/Conscientious Objector/Saxxy**: Beat the crap outta 'em. You have basic melee range, so unless you can be a stealth demo (coupled with the 'nade launcher), you're probably screwed.\n* **Pain Train**: You are weak to bullets. So... Scout, Heavy, Engie, Sniper, and Spy. Enemies. But you can cap quicker! So if made use of well enough, you can cap before they know what hit them.\n* **Ullapool Caber**: Suicide? Yes. Basically all you have at that point. You get 1 kill basically. Hope that you kill, and then get out of there. Might possibly be the only one where the Ali Baba's Wee Booties/Bootlegger is better than the Grenade Launcher. But just by a bit.\n\nNow let's look at Primaries:\n\n* **Grenade Launcher**: Lots of shots, pills hurt -- in the right hands, quite deadly. But that's a demoman anyways, right?\n* **Loch-n-Load**: A \"better\" Grenade Launcher, but you need to be much more accurate. Only use if you are totally sure you can hit.\n* **Ali Baba's Wee Booties/Bootlegger**: Increases health by 25 (and increases charge turning by 100%, but that's worthless). Useful? +25HP is always useful. You will be without ranged ability. I hope that 25 HP can save you more than a Grenade Launcher can. Stick with the Grenade Launcher or Loch-n-Load so you won't die as much.\n\nPersonally? Stick with the Grenade Launcher. And for melee, I'd say Half-Zatoichi or Scotsman's Skullcutter, only because I can't demoknight.", "gilded": 0, "created_utc": "1318735499", "subreddit": "tf2", "score": 3, "controversiality": 0}
{"body": "TREE FITTY!!", "gilded": 0, "created_utc": "1318743315", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "[The Water Horse](http://www.imdb.com/title/tt0760329/)\n\nIt's about the Loch Ness monster. Think The Iron Giant, ET, How to Train Your Dragon, or any other movie where a kid finds a creature, has to hide it from everyone else, and then the military gets involved. \n\nUnfortunately, the boy actor is terrible, but everyone else is good, and the special effects were amazing.", "gilded": 0, "created_utc": "1318769949", "subreddit": "movies", "score": 3, "controversiality": 0}
{"body": "I thought I saw the Loch Ness Monster but it turned out I didn't.", "gilded": 0, "created_utc": "1318780497", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "I saw the Loch Ness monster once.  So I yelled, \"What do you want from us monster?\" And the monster bent down and said, \"I need about tree-fiddy.\"  I gave him a dollar.", "gilded": 0, "created_utc": "1318784300", "subreddit": "AskReddit", "score": 17, "controversiality": 0}
{"body": "Being an atheist simply means you don't believe in gods. That's it. Souls, supernatural creatures, miracles and magic and the loch ness monster are completely separate topics. Believing in a soul without believing in a god simply means you're an atheist but not a skeptic.\n\nDo I believe in a soul? No. There's insufficient evidence to support such a notion, and a growing body of evidence demonstrating that our minds and personality are an emergent property of our brains.", "gilded": 0, "created_utc": "1318784739", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Bullshit. Nessie is a toy boat, Champy is a log, Ogogpogo is a freaking pelsiosaur!", "gilded": 0, "created_utc": "1318785449", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "That bastard! I gave him tree fiddy earlier that day.  Think he's spending it on drugs?", "gilded": 0, "created_utc": "1318785635", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "About tree fiddy", "gilded": 0, "created_utc": "1318788287", "subreddit": "Libertarian", "score": 9, "controversiality": 0}
{"body": "I thought I saw the Loch Ness Monster once. It was a shopping trolley. ", "gilded": 0, "created_utc": "1318793839", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "i thought the boat was the loch ness monsters cousin... i was disappointed ", "gilded": 0, "created_utc": "1318807010", "subreddit": "EarthPorn", "score": 1, "controversiality": 0}
{"body": "I think Lapras is more like the Loch Ness Monster", "gilded": 0, "created_utc": "1318808728", "subreddit": "pokemon", "score": 3, "controversiality": 0}
{"body": "My friend made up a drink on the spot once, and made me drink it. He called it The Loch Ness Monster. 1/2 oz gin, 1/2 oz whiskey, 1/2 oz tequila, garnished with a wedge of pickle.\n\nYour move.", "gilded": 0, "created_utc": "1318823938", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "But Nessie isn't in the Netherlands and Aladdin isn't in West Africa. ", "gilded": 0, "created_utc": "1318827099", "subreddit": "funny", "score": 23, "controversiality": 0}
{"body": "Agnosticism makes little sense, it states you cannot prove god either exists or does not exist, however that requires you have have a pretense that he could exist. We do not have a similar word for unicorns, dragons, gnomes, Loch Ness monster, paddington bear, cyclops, mermaid etc, etc.\nAll appear in myth and legend, usually written down, yet oddly we don't think these exist..\nAngostisism is there merely for people to afraid to outright say no.", "gilded": 0, "created_utc": "1318833751", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "When playing Seafarers we use a Loch Ness monster we call \"Nessy\" for the pirate and a dinosaur we call \"The Armordillo\" for the robber. \nhttp://i.imgur.com/NrE6i.jpg", "gilded": 0, "created_utc": "1318837443", "subreddit": "Catan", "score": 3, "controversiality": 0}
{"body": "all those alien, ghost, and loch ness monster shows just got f'd in the a", "gilded": 0, "created_utc": "1318856298", "subreddit": "reddit.com", "score": 4, "controversiality": 0}
{"body": "I have not, but I have always found it interesting that in the current age of phone HD video cameras everywhere, we do not see much hard, incontrovertible evidence coming forth, compared to the old rare bigfoot, UFO or loch ness monster pics and video. \n\nI mean, I know there's some out there, but there's a statistical aberrance here - if we're to accept that these creatures exist, X number of creature encounters happened per year in the past, and Y number of those encounters were randomly caught on film, it reasons that more cameras should result in more encounters caught, and clearer cameras should result in more undeniable evidence to be brought to the general public. \n\nI think the reverse has happened - digital cameras as opposed to analog VHS and film cameras have made it harder to pass off a rare grainy shaky film of a guy in a gorilla suit as a creature. Also the ease in creating hoaxes using photoshop, etc. has basically taken the thrill out of hoaxing. Nothing's shocking compared to movie CGI, and it takes something more than a potentially edited photo to overcome people's natural skepticism.", "gilded": 0, "created_utc": "1318857407", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "or worlds smallest Loch Ness monster", "gilded": 0, "created_utc": "1318863275", "subreddit": "pics", "score": 15, "controversiality": 0}
{"body": "No, but I am a believer in Bigfoot. I am also an Atheist, a huge fan of James Randi, I don't believe in ghosts or the supernatural, and believe in none of the other major cryptids (Loch Ness Monster, Chupacabra etc.)\n\nJust keep this in mind; a true sceptic doesn't just dismiss an idea because they think it's stupid.", "gilded": 0, "created_utc": "1318863699", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "How could you not know nessie was from Scotland? Also no jokes about the Irish and their drinking?", "gilded": 0, "created_utc": "1318865059", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "nessie isnt in germany and rasta's arent in italy as far as im aware!?", "gilded": 0, "created_utc": "1318867633", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "They're in cahoots with the Loch Ness Monster.", "gilded": 0, "created_utc": "1318867733", "subreddit": "skeptic", "score": 2, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1318868439", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "**The Soldier Overview**\n\nThe soldier has a high health pool(200HP) but is a relatively slow class.  He is capable of using any of this banners in addition to his melee weapon.  The soldier's place in medieval mode is often limited, due to his inability to easily overcome his speed issue, and the amount of effort required to fully charge his banners.\n\nThat being said, the banners, once they are charged, are incredibly powerful in medieval mode.\n\nThe soldier's melee weapons generally do not Synergize with his secondaries, so I will not cover loadouts, rather I will cover the weapons individually.\n\n**Banners**\n\n* Buff Banner:  Grants mini-crits to you and your team.  Synergizes well with Bushwhacka snipers.  Coordinate with your snipers and push/defend with this banner.  Every hit they land will deal 195 damage while you have it active.\n\n* Battalion's Backup:  Grants immunity to crits and a sizable damage reduction bonus.  In medieval mode, this is good for pushes, since the crit rate for melee hits is significantly higher(15-25%) than ranged attacks(2-12%)\n\n* The Cohncheror:  Grants healing to your team when they hit enemy players.  Similar to Mad Milk's functionality, but it applies to all nearby team mates, rather than a single, or group of enemies.\n\n**Melee Weapons**\n\n* The Disciplinary Action:  The Soldier's \"Long Range\" melee weapon.  It has a 70% larger reach, but deals 20% less damage.  It also helps the Soldier overcome his speed issues without injuring himself, but he will need the assistance of another team mate to do it.  Striking another player with this(friendly) will increase both your speed and their speed.  Synergizes well with heavies, who also tend to have speed problems.\n\n* The Half-Zatoichi:  Any enemy killed with this weapon fully restore's the soldier's (or demo's) health.  In terms of surviving, this is the soldier's best bet in the melee slot.  The major downside is that anyone else wielding a half-zatoichi can one-hit kill you, which you can also do to them.  You cannot switch to your banners until after you have killed someone with this weapon.\n\n* The Pain Train:  This weapon is a direct upgrade from the soldier's shovel in medieval mode.  Since bullets are not used in this mode, you can use this weapon without suffering a penalty.\n\n* The Equalizer:  This weapon is less useful in medieval mode than it is in standard games.  The weapon does less damage starting out than the soldier's other weapons, but does eventually outpace the other ones while he is near death.  Using this weapon is a bit of a gamble in medieval mode.  If you are pushing a point with your team, or holding off a push, the taunt will void the immediate area, though will open you to attack as well.\n\n-----\n\n**The Demoman Overview**\n\nMr. Degroot is one of the two classes who has access to all of his weapon slots in medieval mode(The other being the Sniper).  He has moderately high health(175) and is slightly slower than most classes.  The demoman easily overcomes his speed challenge thanks to his shield weapons, which take the place of his sticky launcher.  The demoman's frequent bursts of speed make him nearly impossible to escape from without having the scout's mobility.\n\nThe Demoman's(Demoknight, really) ability to charge makes him one of the toughest fighters in medieval mode.  The Ali Baba's Wee Booties(and the Bootlegger) allow him to turn mid-charge, and grant him 25+ health, which helps offset(or completely offsets) health penalties from some of his other weapons.\n\n**Recommended Loadouts:**\n\nThe Demoknight has 2 options for his shields, and only one option for his boots(the other is cosmetic.)  I do not recommend using the Chargin' Targe for Medieval Mode.\n\n\n**Chargin' Targe Vs. Splendid Screen**\n\n* The Targe offers more damage resistance vs Explosions.\n\n* The Targe offers more damage resistance vs. Fire\n\n* The Splendid Screen grants critical melee hits at any point in the charge. The targe only does it at the end, and mini-crits at half way.\n\n* The Splendid Screen's damage charge impact damage range is 85(Up to 170 with 5 heads from the eyelander), and can be inflicted during any point of the charge.  The targe can only impact at the end of the charge.\n\n\n**Notes: **\n\nIn Medieval mode, the only explosions that exist are from demos using the Ullapool Caber.  The resistance against one specific weapon is hardly worth sacrificing the other bonuses.  The shields do not offer resistance against self-inflicted damage, so using the Targe with the Caber will offer no additional bonuses.\n\nIn Medieval mode, the only sources of fire damage are from snipers with lit arrows, and pyros with Sharpened Volcano Fragments.  Snipers are fairly common in medieval mode, but pyros are hit-and-miss for attendance in games.  Arrows are still relatively easy to dodge, being projectiles.  The resistance is not worth losing the screen's combat bonuses.  \n\nThe Splendid Screen's combat advantages works against any class, regardless of which weapons they are using, making it far more applicable in Medieval mode.\n\n\n*Therefore, my recommended base load out is this:*\n\n\n* Primary: The Splendid Screen\n* Secondary: Ali Baba's Wee Booties/Bootlegger\n* Melee: Any of the below.\n\n\n**Melee Weapons**\n\n* Eyelander/HHHH/Nessie's Nine Iron:  -25 health, can collect heads for more health and speed. These weapons have a 37% larger range, but **do not randomly crit**. The health penalty is offset by the boots.  Kills made by these weapons add a 'Head' to the demoman, which increases his speed and his maximum health. He also receives a  damage bonus to his shield charge impact, making the charge itself lethal to light classes(max 170 health) and devastating even to the heavy.  \n\n* Cladheamh Mor: -15 health(resulting in 10+ health overall with the boots), and a 37% larger range.  This weapon increases the duration of your charges by an additional half second, letting you got slightly further when you charge.  This weapon cannot randomly crit.\n\n* Scottsman's Skullcrusher: 20% more damage, 37% larger range, but -15% speed on the user.  This weapon *can* randomly crit.  The reduced speed doesn't mean much with the ability to charge, but it will prevent you from pulling off certain charge tricks, such as ramp-jumping.\n\n* The Persian Persuader: Hands down, this weapon is the best for surviving as a demoknight.  Medieval mode already rewards drops of health for killing enemies.  You can collect their weapon and restore more health as well.  This weapon also halves the time required to recharge your shield's charge, meaning you can execute more bashes and charge-crits with this weapon.\n\n* The Pain Train:  Medieval mode doesn't have bullets, so this weapon doesn't have penalties.  It hits as hard as and has the same range of the bottle, but it captures twice as quickly.  \n\n**Honorable Mention:**\n\n* The Ullapool Caber:  I don't recommend this weapon but, for the sake of a trick, it needs to be mentioned.  The Ullapool Caber does 149 damage on its first hit(Critting for 300).  There is an explosion around where the hit lands, which passes the damage on to nearby enemies.  Charging and critting with the Ullapool Caber will kill whoever it hits(Except Dahkola Bar Heavies), and severely injure(or kill, if they're light classes) anyone near by.  This is good for charging into a cluster of enemies, but after the first strike, the caber's damage is severely limited(35 per hit, crits for 105.)  You will need to restock in order to regain its original strength.\n\n", "gilded": 0, "created_utc": "1318868558", "subreddit": "NewToTF2", "score": 7, "controversiality": 0}
{"body": "Based on his definition of evidence, does that mean he believes in alien abduction, the Loch Ness monster and Bigfoot? Does he believe in the Piltdown Man, whose petrified corpse was observed by thousands of viewers?\n\nJust because people make a claim doesn't mean their claims are accurate. They could be engaging in confirmation bias, only seeing what they want to see. They could be deliberately lying, to try to prove a point they can't establish in any other way. They could simply be credulous and falling victim to someone else's scam. There are lots of possibilities inherent in them, and we generally have a clue that the claim is bogus when we have no way to falsify it.\n\nNo one outside of religious scripture has been observed to remain dead for three days and come back to life. That's all the evidence we need to question the claim of resurrection.", "gilded": 0, "created_utc": "1318870996", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "God damned Loch Ness monster.", "gilded": 0, "created_utc": "1318874723", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "I'm a scientist, I like to get sourced arguments for stuff when I can (especially when they already exist).\n\n&gt; I've been on it for a while and I've lost weight, gained muscle and not getting fat even though I overeat all the time.\n\nI assume you used to be fat? I've never really had that problem, I've always been fairly fit. People often are very overweight and go on some sort of diet (paleo or keto or both) and suddenly they think it's some magical cure for all of the world's problems because it's much better than their previously *very crappy* eating habits (which got them into their predicament in the first place).\n\n*This is my biggest deciding factor*: For millions of years we've done just fine by simply not over-eating and eating when we're hungry. In the past 40 years overconsumption of food has risen *dramatically* and is causing most of our health problems.\n\nAlso: we survived millions of years without sauces and hot sauces, or cooking oils. Do you use coconut oil to cook your food while you're doing paleo? Guess what, people didn't have the tools required to make oil in the paleolithic era. Do you cook your food over a spit or in a camp fire? Nope, you probably use a stove or sometimes even a microwave, didn't exist in the paleolithic era. In fact, why cook any food at all, why not just eat it raw? Do you use a refrigerator to store your food, why would you do that?\n\nWe also survived millions of years without proper sanitation practices, but that didn't exactly benefit us either. Your argument that because we did something for a long time means it's right is a *shitty* one and I was using an extreme example (single celled organisms) to illustrate that.\n\n&gt; but it doesn't necessarily mean that it's good for ou\n\nIt doesn't necessarily mean it's *bad* for you either, which is what I think you're failing to understand. For what it's worth I eat mostly \"paleo\" anyway with the addition of milk and dairy (because I have lactose persistence) and oats, and also recently barley; both of which I soak in water to remove the lectin content. Although I do have cheat meals quite often because I'm not anal about it. My diet hasn't ever really steered me too wrong unless I was overeating like a motherfucker (always by choice, eating til I was positively stuffed) and even then the fattest I've ever been was 5'9 180 and about 20% body fat. Even then I could still run a 7 minute mile without any problems and deadlift and squat 1.5x my body weight.", "gilded": 0, "created_utc": "1318876383", "subreddit": "Paleo", "score": 2, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1318877225", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "He didn't put Nessie into Germany. But I guess there are a couple bakeries in Berlin that sell baguettes.", "gilded": 0, "created_utc": "1318877500", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Can i get about tree fiddy?", "gilded": 0, "created_utc": "1318878057", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster!", "gilded": 0, "created_utc": "1318879097", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "That's pretty cool! Do you like reading about Nessie and the Yeti as well? I am such a loser but whenever I read those stories I go on a two-week \"I am going to find evidence of them existing\" binge lol!", "gilded": 0, "created_utc": "1318888344", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Ah, yes. The elusive non-white libertarian. You know, bigfoot? The Loch Ness Monster? Log Cabin Conservatives?", "gilded": 0, "created_utc": "1318901442", "subreddit": "progressive", "score": 7, "controversiality": 0}
{"body": "87-95. Henchmen 86 and 87 are talking about Champ vs. the Loch Ness Monster and 21 interjects with Ogo Pogo. 86 mentions the car accident and is demoted, and sent to rake leaves.", "gilded": 0, "created_utc": "1318927932", "subreddit": "venturebros", "score": 2, "controversiality": 0}
{"body": "That character seems so out of place to me. Why the hell they decided to throw the Loch Ness monster in there, I'll never know...", "gilded": 0, "created_utc": "1318984077", "subreddit": "darksouls", "score": 1, "controversiality": 0}
{"body": "If you have a blood sugar issue (ie diabetes) you should really connect with your doctor and/or get second or third opinions about what will work for you.\n\nAssuming that is not what is actually happening, there is a lot of information online about fruit and weight loss:\n\n[How To Speed Up Weight Loss](http://www.peertrainer.com/diet/why_fruits_and_vegetables_help_you_lose_weight.aspx) - which also talks about how fruits and veggies are fantastic for curbing cravings, btw - so relevant to the topic to boot! Yay :)\n\nWhile a lot of the recipe ideas in this article are not paleo, the boosting of fruit intake is the overall message to notice: [Ten Ways to Fight Fat with Fruit](http://www.ivillage.com/10-ways-fight-fat-fruit/4-a-142438)\n\nUltimately you need to make your own choices but I would be concerned about ignoring a major food group that our bodies are designed to eat and process properly (which, ultimately, is the entire goal of the paleo diet - to eat what was available during the paleolithic era during which time our genetic history adapted to eat fruits, vegetables, meats, and seeds/nuts pretty exclusively - our bodies have not had very much time to adapt to eating grains, beans, potatoes, refined sugars and so forth which is the basis for eliminating or decreasing those items in a paleo diet). Including fruit does NOT mean gorge on fruit. ;)\n\nIf, however, you HAVE been medically advised to avoid fruits, you might consider getting some nutritional opinions from doctors that are both well versed in whatever your blood sugar issues are as well as the paleo diet and can advise you on the methods to properly obtain ALL of the vitamins and minerals, amino acids and so forth your body needs to function while not exacerbating your medical condition.", "gilded": 0, "created_utc": "1318989617", "subreddit": "90daysgoal", "score": 1, "controversiality": 0}
{"body": "[Reddit Armory](http://steamcommunity.com/id/redditarmory) [Inventory](http://steamcommunity.com/id/redditarmory/inventory/) ([SteamGroup](http://steamcommunity.com/groups/redditarmory))  - Tue Oct 18 23:15:15 2011 CST/US\n\n**Low-Inventory items are bold**. Updated every 30 min [here](http://armory.wiretapped.us/redditcode.html). Totals include all known armory accounts.\n\n------------\n\nItem Name|Count|Slot|Vintage|Strange|7d +/-|30d +/-\n---|:--:|:--:|:--:|:--:|:--:|:--:|:--:\n | | | | \n[Ali Baba's Wee Booties](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=Ali+Baba's+Wee+Booties&amp;go=Go)|[11](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 7 redditarmory2: 4\")|primary| | |-1|+1\n[Bonk! Atomic Punch](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=Bonk!+Atomic+Punch&amp;go=Go)|[14](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 10 redditarmory2: 4\")|secondary|[3](http://wiki.teamfortress.com/wiki/Vintage)| | |-1\n[Conniver's Kunai](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=Conniver's+Kunai&amp;go=Go)|[16](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 8 redditarmory2: 8\")|melee| | |+1|+1\n[Crit-a-Cola](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=Crit-a-Cola&amp;go=Go)|[18](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 10 redditarmory2: 8\")|secondary| | |-1|-3\n[Darwin's Danger Shield](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=Darwin's+Danger+Shield&amp;go=Go)|[14](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 12 redditarmory2: 2\")|secondary| | | |-3\n[Fists of Steel](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=Fists+of+Steel&amp;go=Go)|[15](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 10 redditarmory2: 5\")|melee| | | | \n**[Frying Pan](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=Frying+Pan&amp;go=Go)**|[4](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 4 redditarmory2:  \")|melee| | | |+3\n[Gloves of Running Urgently](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=Gloves+of+Running+Urgently&amp;go=Go)|[15](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 11 redditarmory2: 4\")|melee| | | |-1\n[Jarate](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=Jarate&amp;go=Go)|[19](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 10 redditarmory2: 9\")|secondary|[5](http://wiki.teamfortress.com/wiki/Vintage)| | |-2\n[L'Etranger](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=L'Etranger&amp;go=Go)|[19](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 13 redditarmory2: 6\")|secondary| | |-1|-3\n[Mad Milk](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=Mad+Milk&amp;go=Go)|[24](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 11 redditarmory2: 13\")|secondary| | | |-3\n[Natascha](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=Natascha&amp;go=Go)|[17](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 9 redditarmory2: 8\")|primary|[7](http://wiki.teamfortress.com/wiki/Vintage)| | | \n[Nessie's Nine Iron](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=Nessie's+Nine+Iron&amp;go=Go)|[15](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 10 redditarmory2: 5\")|melee| | | |+2\n[Sharpened Volcano Fragment](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=Sharpened+Volcano+Fragment&amp;go=Go)|[11](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 11 redditarmory2:  \")|melee| | | |**-11**\n[Sun-on-a-Stick](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=Sun-on-a-Stick&amp;go=Go)|[12](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 12 redditarmory2:  \")|melee| | |-1|**-12**\n[The Ambassador](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Ambassador&amp;go=Go)|[16](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 10 redditarmory2: 6\")|secondary|[8](http://wiki.teamfortress.com/wiki/Vintage)| | |+1\n[The Amputator](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Amputator&amp;go=Go)|[19](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 10 redditarmory2: 9\")|melee| | | |+1\n[The Atomizer](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Atomizer&amp;go=Go)|[17](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 12 redditarmory2: 5\")|melee| | | |-4\n[The Axtinguisher](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Axtinguisher&amp;go=Go)|[14](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 11 redditarmory2: 3\")|melee|[1](http://wiki.teamfortress.com/wiki/Vintage)| | |+1\n[The Back Scratcher](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Back+Scratcher&amp;go=Go)|[13](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 10 redditarmory2: 3\")|melee| | | |-1\n[The Backburner](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Backburner&amp;go=Go)|[12](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 8 redditarmory2: 4\")|primary|[3](http://wiki.teamfortress.com/wiki/Vintage)| | |+2\n[The Battalion's Backup](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Battalion's+Backup&amp;go=Go)|[14](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 9 redditarmory2: 5\")|secondary| | | |-4\n[The Bazaar Bargain](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Bazaar+Bargain&amp;go=Go)|[12](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 11 redditarmory2: 1\")|primary| | | |-2\n[The Big Earner](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Big+Earner&amp;go=Go)|[13](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 11 redditarmory2: 2\")|melee| | | |+1\n[The Black Box](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Black+Box&amp;go=Go)|[12](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 10 redditarmory2: 2\")|primary| | | |-2\n[The Blutsauger](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Blutsauger&amp;go=Go)|[15](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 9 redditarmory2: 6\")|primary|[2](http://wiki.teamfortress.com/wiki/Vintage)| | |-1\n[The Boston Basher](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Boston+Basher&amp;go=Go)|[14](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 8 redditarmory2: 6\")|melee| |[2](http://wiki.teamfortress.com/wiki/Strange)|+2|+3\n[The Brass Beast](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Brass+Beast&amp;go=Go)|[14](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 6 redditarmory2: 8\")|primary| | |-1|+1\n[The Buff Banner](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Buff+Banner&amp;go=Go)|[17](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 10 redditarmory2: 7\")|secondary| | | |-2\n[The Buffalo Steak Sandvich](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Buffalo+Steak+Sandvich&amp;go=Go)|[19](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 11 redditarmory2: 8\")|secondary| | | |-1\n[The Bushwacka](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Bushwacka&amp;go=Go)|[15](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 11 redditarmory2: 4\")|melee| | | |-3\n[The Candy Cane](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Candy+Cane&amp;go=Go)|[16](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 11 redditarmory2: 5\")|melee| | | |-3\n[The Chargin' Targe](http://wiki.teamfortress.com/w/index.php?title=Special%3ASearch&amp;search=The+Chargin'+Targe&amp;go=Go)|[16](https://steamcommunity.com/id/redditarmory/inventory/ \"redditarmory: 9 redditarmory2: 7\")|secondary|[4](http://wiki.teamfortress.com/wiki/Vintage)| | |+4\n&lt;snip - too long&gt;", "gilded": 0, "created_utc": "1318998191", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "&gt;that would be foolish\n\nThanks for calling a large chunks of us \"fools\". à² _à² \n\n&gt;as there could be a god that has not yet chosen to contact us, who knows?\n\nWhat relevance does it have to the topic of belief? Believing that there are no gods is not the same as asserting that there are absolutely no gods. Demanding absolute certainty for the non-existence gods is placing an unreasonable demand and is very dishonest. Not even science has standards set that high. If it did, we wouldn't be able to accept reality to be real. \n\nI'd bet that you believe that leprechauns don't exist. Or Santa, or dragons, the loch ness monster, big foot etc. either for that matter. There's still a next to infinitesimal chance that these exist, but do you require absolute certainty to believe that they do not? If you don't, then why are you special pleading for god?", "gilded": 0, "created_utc": "1319010833", "subreddit": "atheism", "score": 0, "controversiality": 0}
{"body": "Read ehrman, the bible is historically and monumentally inaccurate and the argument that something \"might\" exist if it cannot be proven to exist, is not an argument FOR the existence of anything. With this same argument you would believe in bigfoot, chupacabra, nessie, ufos and santa claus. now I've never seen a camel in person but I'm pretty sure they exist based on the testimony if people that have seen more than it's footprints", "gilded": 0, "created_utc": "1319055262", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "So, what's your position on unicorns, aliens, loch ness monster, bigfoot?\n\nDISBELIEF does not require evidence.  It's simply the lack of belief.  I didn't 'choose' to not believe in a deity.  I simply don't believe.  It's not something I can flip a switch between (not without some convincing evidence, anyway.)\n\nBelief is a binary state.  Belief and disbelief are the only two positions.  Either you believe in a deity, or you do not. ", "gilded": 0, "created_utc": "1319058190", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Yes, like Big Foot, Nessie, Santa, and others...\n\nThere is no empirical evidence for any of this nonsense.", "gilded": 0, "created_utc": "1319065373", "subreddit": "DebateReligion", "score": 1, "controversiality": 0}
{"body": "tree fiddy?", "gilded": 0, "created_utc": "1319076518", "subreddit": "4chan", "score": 11, "controversiality": 0}
{"body": "Thank you so much for the advice.... and I'm sorry to be so slow in responding. I know that's very poor reddit etiquette, but what can I say- I'm a n00b. \n\nIsn't Paleo a tad extreme? I'll do some more reading into it, as you do make it sound veeery interesting, but that's a diet where you only consume things available to people living in the paleolithic era, right? \n\nI'm also curious as to what effect lifting would have on the body-fat issue. I'm not opposed to it, but when I asked a personal trainer a few years ago about what types of activities are likely to yield a decrease in bely fat, he told me that it was a cardio-centric affair and that it's a misnomer that anything could target any specific fat and that if I wanted to lose any fat anywhere it was going to be lost from the stores ALL over my body gradually/all at once. \n\nHope I haven't non-responded this one into oblivion! \n\nAnd thanks again- \nBen", "gilded": 0, "created_utc": "1319081541", "subreddit": "loseit", "score": 1, "controversiality": 0}
{"body": "Me too!  I'm not sure if it was intended, but it made me think of that south park episode where chef's parents keep getting fooled by the loch ness monster.", "gilded": 0, "created_utc": "1319086037", "subreddit": "jobs", "score": 2, "controversiality": 0}
{"body": "Know what he said? \"Tree fiddy\"", "gilded": 0, "created_utc": "1319094380", "subreddit": "4chan", "score": 2, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1319095608", "subreddit": "AskReddit", "score": -2, "controversiality": 0}
{"body": "Is that...Nessie?", "gilded": 0, "created_utc": "1319096192", "subreddit": "photocritique", "score": 2, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1319121628", "subreddit": "AskReddit", "score": 8, "controversiality": 0}
{"body": "god damn Loch Ness monster! get your own money!", "gilded": 0, "created_utc": "1319125259", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1319126546", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "* \nA Philip Rivers Runs Through It\n* \nMassaquoi-et Riot\n* \nThe Book Of Eli\n* \nI Believe In Newtonian Physics\n* \nAddai-me A Dozen\n* \nAddai-mond In The Rough\n* \nJahvid Best In Show\n* \nFrank Blood and Gore\n* \nRo- Romo Your Boat\n* \nA. J.olly Green Giant\n* \nRollin' Blounts\n* \nKing In De' Cassel\n* \nThe Daily Show and Tolbert Report\n* \nAll Along the Hightower\n* \nArrelious on All Counts\n* \n1 Large Reggie-Lovers Pizza\n* \nTed Ginn &amp; Juice\n* \nKenny's Britt-le Bones\n* \nImma Need Bout Crabtree Fiddy\n* \nTitus Young &amp; The Restless\n* \nThe Woody Woodhead-ers\n* \nHelu-llujah!\n* \nDexter McCluster: Miami Homicide (for Wk 9)\n* \nRoethlisberger and Fries\n* \nA Schaub Story\n* \nNyquil Vick Puts Me To Sleep\n* \nPimpin' Ain't Breesy\n* \nManning Up\n* \n10-4 Rodgers That\n* \nAaron It Out\n* \n(Don't Beat) My Foster Kids\n\n", "gilded": 0, "created_utc": "1319131234", "subreddit": "fantasyfootball", "score": 1, "controversiality": 0}
{"body": "And the loch ness monster.", "gilded": 0, "created_utc": "1319132595", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "i saw the biggest turd imaginable..it had to weigh at least 20 courics...someone left it in the bathroom in my frat house and they had to be proud because they didn't even wipe! that sick bastard wanted everyone to see the small african child that escaped from his anus...the thing had to be at least 2-3 inches in diameter and was sticking out of the bowl at least 8-10\" (i like to call those the loch ness monster)", "gilded": 0, "created_utc": "1319136263", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "It was about then when I noticed tired1 was actually eight stories tall and was a Giant Crustacean from the Paleolithic Era", "gilded": 0, "created_utc": "1319148993", "subreddit": "AskReddit", "score": 15, "controversiality": 0}
{"body": "TREE-FITTY!!! you're that damned loch ness monster again arnt'cha?!!!", "gilded": 0, "created_utc": "1319149334", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "I'll bet you thought that was a Loch Ness Monster asking for money. \n\nNope, Chuck Testa.", "gilded": 0, "created_utc": "1319155294", "subreddit": "WTF", "score": -7, "controversiality": 0}
{"body": "You neva' give someone Tree fitty.", "gilded": 0, "created_utc": "1319158659", "subreddit": "WTF", "score": 12, "controversiality": 0}
{"body": "Are you sure the pizza delivery guy wasn't the Loch Ness monster?", "gilded": 0, "created_utc": "1319172329", "subreddit": "AdviceAnimals", "score": 2, "controversiality": 0}
{"body": "Where the fuck are my car keys? I'm late for work!\n\n\"I dunno, but you know what I do know? That one time 12 years ago you rode the Loch Ness Monster roller coaster two times in a row, and you flicked off the camera both times. The ride manager stopped you and told you he'd have you kicked out of the park if you did anything like that again. People were staring at you.\"\n\n\n....God damn you, brain.\n\n\"in 3rd grade you accidentally called your teacher Mom.\"\n\nYOU SHUT YOUR WHORE SYNAPSES!\n\n\"Why are you lying to Reddit? It was 7th grade. Everyone laughed at you.\"\n\n.....\n\n\n*edit*\n\nMy idea of my brain appears to be GlaD0s", "gilded": 0, "created_utc": "1319181134", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "You're right, I'm pretty pissed off at the Loch Ness monster.", "gilded": 0, "created_utc": "1319184845", "subreddit": "atheism", "score": 29, "controversiality": 0}
{"body": "I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!", "gilded": 0, "created_utc": "1319203061", "subreddit": "RandomKindness", "score": 16, "controversiality": 0}
{"body": "The problem with the theist standpoint you describe is that logically, existence of something must be supported by evidence; nonexistence is the default assumption. This type of logic has been shown to work in every single circumstance, and is a basic tenet of logic.\n\nRejecting that tenet leads to the default belief not just in, say, Jehova. It should lead you to believe in EVERYTHING you have ever heard of or conceived of that has not been disproven. You should therefor believe in all the Greek gods, Norse gods, Hindu deities, pagan spirits, dragons, werewolves, chupacabra, unicorns, fairies, munchkins, gnomes, little green aliens who molest you while sleeping, the a boogeyman under your bed, and the Loch Ness monster.\n\nIf you agree that that would be absurd, you can understand why rational people cannot consider theism to be rational.", "gilded": 0, "created_utc": "1319212964", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "No, you damn Loch Ness monster!", "gilded": 0, "created_utc": "1319213749", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "I need about tree fiddy.", "gilded": 0, "created_utc": "1319213776", "subreddit": "IAmA", "score": 697, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1319213783", "subreddit": "IAmA", "score": 4, "controversiality": 0}
{"body": "I get your point, as it's one used very commonly, but as it is for the majority of things, the onus is on the theists to prove that a God exists, not on us to prove it doesn't exist, because, and I say this without exaggeration, it is *impossible* to prove something doesn't exist.\n\nIt is literally as simple as that, Loch Ness Monster, Leprechauns, Unicorns, Chupacabra, Slenderman et al aren't disprovable, you can see that they're incredibly unlikely and evidence for them is sketchy at best, but you go right ahead and try to disprove them, you'll be met by a brick wall.\n\nAnd, I'd like to say, that most atheists don't say there is definitely **no** God, but that it is incredibly unlikely that one exists, which is why most atheists are agnostic-atheists, and those who claim to be pure atheist without any shadow of a doubt must have some insight that the rest of the world does not.\n\nAnd now for something completely different, yet still OT. The thing that's always bothered me about it is the fact we live in a scientific universe. If there was a creator for all things, why do atoms, quarks, leptons, dark matter etc exist? He could've made us single entities with no constituent parts, just a blob of matter that looked identical to him that just worked, because you know, omnipotence and all that. But it's not, everything is made up of smaller, far more complicated things. Why would one go through so much effort to make a human, by making protons, neutrons and electrons, then making elements, then making compounds, then going on to make DNA, ribosomes etc. to make organs to build it all into a shell and label it 'Human'?\n\nI'm not actually directly asking you that, I'm just musing out loud as this thread is fairly related. ", "gilded": 0, "created_utc": "1319215579", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "tree fiddy? TREE FIDDY?! ", "gilded": 0, "created_utc": "1319217614", "subreddit": "IAmA", "score": 17, "controversiality": 0}
{"body": "NO WONDER HE KEEPS COMING BACK IF YOU KEEP GIVING HIM TREE FIDDY!", "gilded": 0, "created_utc": "1319217818", "subreddit": "IAmA", "score": 5, "controversiality": 0}
{"body": "I aint giving no monster no tree fiddy now", "gilded": 0, "created_utc": "1319218001", "subreddit": "IAmA", "score": 21, "controversiality": 0}
{"body": "You did what?! I tol' you not to give him no god damn tree fiddy!", "gilded": 0, "created_utc": "1319218508", "subreddit": "RandomKindness", "score": 6, "controversiality": 0}
{"body": "The Loch Ness monster.", "gilded": 0, "created_utc": "1319219467", "subreddit": "IAmA", "score": 32, "controversiality": 0}
{"body": "i aint got  tree fiddy, but you all get upvotes for knowing that episode.   you monsta's....", "gilded": 0, "created_utc": "1319222728", "subreddit": "IAmA", "score": 14, "controversiality": 0}
{"body": "I'd just gidden him tree fiddy the week befo'", "gilded": 0, "created_utc": "1319222883", "subreddit": "IAmA", "score": 12, "controversiality": 0}
{"body": "And I said, \"Damnit Monsta, I aint givin you no tree fiddy! Now you get on outta here!\"", "gilded": 0, "created_utc": "1319223836", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "Well i gave em tree fiddy just the other day", "gilded": 0, "created_utc": "1319225058", "subreddit": "IAmA", "score": 0, "controversiality": 0}
{"body": "mmmmhmmmmm tree fiddy sounds about right", "gilded": 0, "created_utc": "1319226752", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "Tree fiddy dont grow on trees in this family woman!", "gilded": 0, "created_utc": "1319227247", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Nessy (as in the Loch Ness Monster).", "gilded": 0, "created_utc": "1319227261", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "\"I... I need about tree fiddy\"", "gilded": 0, "created_utc": "1319246687", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "You misunderstand Occam's Razor. You do not cut with indiscretion. You only cut when your explanation when a belief has absolutely nothing to do with the evidence. \n\nFor example, I cannot cut away Quantum Mechanics merely because it's complicated. Quantum Mechanics is necessary to explain phenomenon such as the double-slit experiment.\n\nI also cannot cut away the complicated and roundabout *Relativity*. Trying to cut such a theory would leave various orbital eccentricities unexplained, not to mention the fact that the operation of all GPS satellites relies on Relativistic principles. \n\nIn fact, trying to cut away Relativity and Quantum Mechanics would leave the world more complicated and roundabout than with such theories. \n\nNow let's contrast the things which we do use Occam's Razor to cut away: Teapots orbiting Mercury. Flying Spaghetti Monsters. Bigfoot. Nessie. Souls.\n\nThe most wonderful thing about Occam's Razor is that it tells us to only worry about phenomena when we actually need to worry about them. We don't need to worry about a potential \"Old Ones\" named Cthulhu who is out to torment us, until we finally have evidence that he exists. We don't need to worry about teapots orbiting Mercury, until we finally observe one doing so. \n\nLikewise, why should anyone worry about souls when none has ever seen, heard, or felt one, ever?  ", "gilded": 0, "created_utc": "1319250796", "subreddit": "PhilosophyofScience", "score": 7, "controversiality": 0}
{"body": "It's all yours for about tree fitty. You can go ahead and give it to me as a preorder.", "gilded": 0, "created_utc": "1319257549", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Tree fiddy. FTFY", "gilded": 0, "created_utc": "1319257624", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "But what you'd doing is like asking a bunch of doctors what they think would happen if faith healing stopped working for a week, or asking the scottish if they'd feel safer without the loch ness monster.\n\nIt's an absurd question; the answer you've got is the best possible given the circumstances.", "gilded": 0, "created_utc": "1319275134", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "and the Loch Ness monster wrapping around the bottom of the shirt.", "gilded": 0, "created_utc": "1319287698", "subreddit": "soccer", "score": 4, "controversiality": 0}
{"body": "How about a Dragon, the loch ness monster, a lion, and something to do with northern ireland all fighting. Best design ever.", "gilded": 0, "created_utc": "1319288569", "subreddit": "soccer", "score": 3, "controversiality": 0}
{"body": "Hahaha true. I used to try to sell anything and everything as a kid. Homemade beaded keychain? That'll be tree fiddy. Terrible hand drawing of the ninja turtles fighting crime? 50 cents and it's yours", "gilded": 0, "created_utc": "1319293218", "subreddit": "IAmA", "score": 5, "controversiality": 0}
{"body": "You just are mad at God. I know I am, just like I am mad at Santa, bigfoot, the Loch Ness monster, Easter bunnies, Zeus, and invisible Bob who travels with an 8' praying mantis named Ted.", "gilded": 0, "created_utc": "1319294316", "subreddit": "atheism", "score": 138, "controversiality": 0}
{"body": "I ain't givin' you no damn tree fitty.", "gilded": 0, "created_utc": "1319295262", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "They don't have a national animal, i can't see why george best shouldn't be theirs.\n\nAlso, turns out scotlands national animal is the unicorn. seriously, if you're going to have a made up animal, at least make it the loch ness monster.", "gilded": 0, "created_utc": "1319296748", "subreddit": "soccer", "score": 2, "controversiality": 0}
{"body": "&gt;the Loch Ness monster\n\nAll I wanted was three fiddy.", "gilded": 0, "created_utc": "1319301469", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I bet the 2% make around tree fitty ", "gilded": 0, "created_utc": "1319302643", "subreddit": "circlejerk", "score": 1, "controversiality": 0}
{"body": "nessie!\n", "gilded": 0, "created_utc": "1319308207", "subreddit": "creepy", "score": 2, "controversiality": 0}
{"body": "I AIN'T GIVIN YOU NO TREE FIDDY YOU GOD DAMN LOCH NESS MONSTAH. YOU GET OUTTA OF MY INTERNET.", "gilded": 0, "created_utc": "1319309959", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy.", "gilded": 0, "created_utc": "1319311869", "subreddit": "creepy", "score": 6, "controversiality": 0}
{"body": "Loch Ness monster?", "gilded": 0, "created_utc": "1319316417", "subreddit": "creepy", "score": 1, "controversiality": 0}
{"body": "NESSIE?!?!?", "gilded": 0, "created_utc": "1319317082", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Nessie? ", "gilded": 0, "created_utc": "1319317512", "subreddit": "creepy", "score": 1, "controversiality": 0}
{"body": "At about that time i realized that it wasnt a cute little centaur at all but a giant monster from the paleolithic era!\n\n\nTHE LOCHNESS MONSTA!!!!\n\n\nShut woman lemme finish my story!", "gilded": 0, "created_utc": "1319317995", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Well because the loch ness monstah likes to disguise himself. Sometimes it's as a little cute girl scout tryna sell cookies. In dis case, he came as a centaur with the sexual body of 50 Cent to tryna trick my wife into lettin him into the house and taking tree fiddy from her bank account. GOD DAMN LOCH NESS MONSTAH YOU STAY AWAY FROM MY BANK ACCOUNT. YOU AIN'T GETTIN NO TREE FIDDY!", "gilded": 0, "created_utc": "1319319225", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "&gt; Lack of evidence for a God doesn't equate to evidence for a lack of God.\n\nSure but the lack of evidence makes it indistinguishable from Thor, Yetis, Loch Ness Monster, Invisible Pink Unicorns, etc.\n\n", "gilded": 0, "created_utc": "1319321791", "subreddit": "atheism", "score": 6, "controversiality": 0}
{"body": "I think I found the Loch Ness Monster.", "gilded": 0, "created_utc": "1319323300", "subreddit": "creepy", "score": 2, "controversiality": 0}
{"body": "loch ness monster", "gilded": 0, "created_utc": "1319327560", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "About tree fiddy?", "gilded": 0, "created_utc": "1319334391", "subreddit": "creepy", "score": 1, "controversiality": 0}
{"body": "no, that's cryptography. You're thinking of someone who chases bigfoot and nessie", "gilded": 0, "created_utc": "1319342959", "subreddit": "pics", "score": 91, "controversiality": 0}
{"body": "Ron Paul rigged the result to help the lizard people fly UFOs to capture the loch ness monster!\n\nAlso: ELVIS!", "gilded": 0, "created_utc": "1319363556", "subreddit": "conspiracy", "score": 8, "controversiality": 0}
{"body": "bout tree fiddy", "gilded": 0, "created_utc": "1319378792", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Hey, JewishGun. Thanks for posting. First off, let me just clarify that I personally never try to make any claims regarding atheism. There are no claims to make. The burden of proof is always on the religious person to prove their supernatural claims. If anybody asks you why you're an atheist, a good response is: I simply haven't been given a good reason to believe.\n\nIf you're having trouble in a conversation with a theist, regardless of whether they're Jewish, Christian, Muslim, or anything else, just listen to what they're saying and then ask them what their evidence for this is. Or better yet, why do you believe that? You'll find that their belief will always stem from one or two things: 1) their holy book or 2) personal experience. Well, great. Now you have two things to combat.\n\n1) How do they know what it says in their holy book is true? You'll find this, most of the time, goes back to circular reasoning. They believe that the book is true because it was written or inspired by their god. And they believe their god wrote it or inspired it because the book says so. You can point that out to them. The other argument that I hear a lot is that the book is so old and so many people follow it. That's an easy one to dismiss. If you wrote a religious text right now and buried it for one thousand years and then it was uncovered, read, and followed by millions, does that make it, by default, true? Of course not.\n\n2) Ask them about the people who claim to be abducted by aliens. Or how about all the people that have seen Bigfoot/Yettis/Loch Ness Monster/etc.? Do they believe all of those stories? If the answer is no, well why not? (P.S. Because aliens aren't in the Torah is not a good excuse. There's lot of stuff that isn't in there.) The reason is that personal anecdotes are not good evidence. There's no way to prove that it happened and there's no good reason to believe any of it. If however, they claim that they DO believe all of those stories and that aliens, Bigfoot, etc. exist... well then they're just crazy. They're probably beyond help at that point. Get out of that conversation.\n\nI hope this helps you out. Remember, it all comes down to good reasons. If they can't present you with a good reason, why should you believe? Take those reasons and tear 'em up. :)", "gilded": 0, "created_utc": "1319393240", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "What about tree fiddy?", "gilded": 0, "created_utc": "1319393323", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "Religion was never brought up in my family.  I know that my mother is non-practicing Christian.  My father is likely atheist - but we've never, ever talked about religion.  I spent my teenage years and my 20s being middle of the road agnostic.  Today I look back on that time as not really having thought about the problem enough.\n\nIn my early 30s I came across a website called [Battleground God](http://www.philosophersnet.com/games/god.php).  It's an online tests that asks you a series of questions and looks for inconsistencies in your philosophy.  The question that nailed me was, to paraphrase, \"Why do you disbelieve the Loch Ness Monster in the absence of evidence, and yet God is exempt from this same logic?\"\n\nI was well down the road to atheism and soon thereafter I read Richard Dawkins' \"The God Delusion\" which sealed the deal - describing my agnosticism to a tee.  \n\nToday I consider myself an anti-theist (religion, on the whole, does more harm than good) and a high \"6\" on the [Dawkins scale](http://en.wikipedia.org/wiki/Spectrum_of_theistic_probability#Dawkins.27s_formulation) (There's probably no God - and the definition of God is such that there's no way to prove It doesn't exist.)\n\nI've got two kids.  We've taught both to be critical thinkers and to question *everything*, especially what their parents have said.  We told them what we believed, but told them also that the existence of God is something they need to figure out for themselves.  We talk frequently about all world religions. They're now 11 and 13 and neither believes in God.  They're completely free to continue to examine the question and change their minds, and they'll be welcome in our home regardless.", "gilded": 0, "created_utc": "1319416559", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Some may find sorting by quantity easier, so here's one that way.  \n  \nFor the latest totals check: [http://armory.wiretapped.us/](http://armory.wiretapped.us/)  \n(Thanks Virindi!)  \n.  \n\n**Here's what The Reddit Armory (1+2) currently has 11/28:**  \n.     \n  \n**By Total Quantity**   \n   \nItem                        | Norm | {Vin} | Total \n:---------------------------|:---:|:-----:|:-----:  \nPip-Boy  |  0  |    | 0  \nThe Bootlegger  | 0  |    | 0  \nThe Conscientious Objector  |  0  |    | 0  \nThe Purity Fist  |  0  |    | 0  \nThe Scottish Handshake  |  0  |    | 0  \nUnarmed Combat  |  0  |    | 0  \nWanga Prick  |  0  |    | 0  \nThe Frying Pan  | 4  |    | 4  \nThe Widowmaker  | 8  |    | 8  \nThe Machina  | 9  |    | 9  \nSharpened Volcano Fragment  | 10  |    | 10  \nThe Short Circuit  | 11  |    | 11  \nAli Baba's Wee Booties  | 12  |    | 12  \nThe Ullapool Caber  | 12  |    | 12  \nThe Sun-on-a-Stick  | 13  |    | 13  \nTomislav  | 13  |    | 13  \nGloves of Running Urgently  | 14  |    | 14  \nThe Black Box  | 14  |    | 14  \nThe Brass Beast  | 14  |    | 14  \nThe Candy Cane  | 14  |    | 14  \nThe Postal Pummeler  | 14  |    | 14  \nThe Righteous Bison  | 14  |    | 14  \nNessie's Nine Iron  | 15  |    | 15  \nThe Original  | 15  |    | 15  \nThe Sandman  | 10  | 5  | 15  \nCrusader's Crossbow  | 16  |    | 16  \nThe Enforcer  | 16  |    | 16  \nThe Fan O'War  | 16  |    | 16  \nThe Gunboats  | 13  | 3  | 16  \nThe Sandvich  | 15  | 1  | 16  \nThe Shortstop  | 16  |    | 16  \nThe Solemn Vow  | 16  |    | 16  \nYour Eternal Reward  | 16  |    | 16  \nBonk! Atomic Punch  | 13  | 4  | 17  \nConniver's Kunai  | 17  |    | 17  \nNatascha  | 10  | 7  | 17  \nThe Cow Mangler 5000  | 17  |    | 17  \nThe Mantreads  | 17  |    | 17  \nThe Quick-Fix  | 17  |    | 17  \nThe Splendid Screen  | 17  |    | 17  \nThe Vita-Saw  | 17  |    | 17  \nThe Winger  | 17  |    | 17  \nThe Bazaar Bargain  | 18  |    | 18  \nThe Concheror  | 18  |    | 18  \nThe Force-A-Nature  | 17  | 1  | 18  \nThe Huntsman  | 14  | 4  | 18  \nThe Loch-n-Load  | 18  |    | 18  \nThe Persian Persuader  | 18  |    | 18  \nThe Powerjack  | 18  |    | 18  \nThe Reserve Shooter  | 18  |    | 18  \nThe Scotsman's Skullcutter  | 18  |    | 18  \nThe Soda Popper  | 18  |    | 18  \nThe Southern Hospitality  | 18  |    | 18  \nThe Warrior's Spirit  | 18  |    | 18  \nDarwin's Danger Shield  | 19  |    | 19  \nDetonator  | 19  |    | 19  \nFrontier Justice  | 15  | 4  | 19  \nJarate  | 14  | 5  | 19  \nThe Ambassador  | 11  | 8  | 19  \nThe Big Earner  | 19  |    | 19  \nThe Boston Basher  | 19  |    | 19  \nThe Buff Banner  | 19  |    | 19  \nThe Chargin' Targe  | 16  | 3  | 19  \nThe Degreaser  | 19  |    | 19  \nThe Diamondback  | 19  |    | 19  \nThe Disciplinary Action  | 19  |    | 19  \nThe Eviction Notice  | 19  |    | 19  \nThe Pain Train  | 19  |    | 19  \nThe Sydney Sleeper  | 19  |    | 19  \nCrit-a-Cola  | 20  |    | 20  \nMad Milk  | 20  |    | 20  \nThe Amputator  | 20  |    | 20  \nThe Axtinguisher  | 19  | 1  | 20  \nThe Battalion's Backup  | 20  |    | 20  \nThe Blutsauger  | 18  | 2  | 20  \nThe Buffalo Steak Sandvich  | 20  |    | 20  \nThe Bushwacka  | 20  |    | 20  \nThe Claidheamh MÃ²r  | 20  |    | 20  \nThe Cloak and Dagger  | 16  | 4  | 20  \nThe Dalokohs Bar  | 19  | 1  | 20  \nThe Dead Ringer  | 19  | 1  | 20  \nThe Equalizer  | 16  | 4  | 20  \nThe Family Business  | 20  |    | 20  \nThe Fists of Steel  | 20  |    | 20  \nThe Flare Gun  | 14  | 6  | 20  \nThe Half-Zatoichi  | 20  |    | 20  \nThe Jag  | 20  |    | 20  \nThe Kritzkrieg  | 17  | 3  | 20  \nThe Market Gardener  | 20  |    | 20  \nThe Overdose  | 20  |    | 20  \nThe Razorback  | 18  | 2  | 20  \nThe Scottish Resistance  | 20  |    | 20  \nThe Tribalman's Shiv  | 20  |    | 20  \nThe Atomizer  | 21  |    | 21  \nThe Back Scratcher  | 21  |    | 21  \nThe Backburner  | 18  | 3  | 21  \nThe Direct Hit  | 21  |    | 21  \nThe Holy Mackerel  | 21  |    | 21  \nThe Homewrecker  | 21  |    | 21  \nThe Killing Gloves of Boxing  | 17  | 4  | 21  \nThe Liberty Launcher  | 21  |    | 21  \nThe Ubersaw  | 18  | 3  | 21  \nL'Etranger  | 22  |    | 22  \nThe Eyelander  | 17  | 5  | 22  \nThe Shahanshah  | 22  |    | 22  \nThe Wrangler  | 23  |    | 23  \nThe Gunslinger  | 24  |    | 24  \n.   \n   \n**By Item**   \n     \nItem                        | Norm | {Vin} | Total \n:---------------------------|:---:|:-----:|:-----:  \nAli Baba's Wee Booties  | 12  |   | 12  \nBonk! Atomic Punch  | 13  | 4  | 17  \nConniver's Kunai  | 17  |    | 17  \nCrit-a-Cola  | 20  |    | 20  \nCrusader's Crossbow  | 16  |    | 16  \nDarwin's Danger Shield  | 19  |   | 19  \nDetonator  | 19  |   | 19  \nFrontier Justice  | 15  | 4  | 19  \nGloves of Running Urgently  | 14  |   | 14  \nJarate  | 14  | 5  | 19  \nL'Etranger  | 22  |   | 22  \nMad Milk  | 20  |   | 20  \nNatascha  | 10  | 7  | 17  \nNessie's Nine Iron  | 15  |   | 15  \nPip-Boy  |  0  |   | 0  \nSharpened Volcano Fragment  | 10  |    | 10  \nThe Ambassador  | 11  | 8  | 19  \nThe Amputator  | 20  |    | 20  \nThe Atomizer  | 21  |   | 21  \nThe Axtinguisher  | 19  | 1  | 20  \nThe Back Scratcher  | 21  |   | 21  \nThe Backburner  | 18  | 3  | 21  \nThe Battalion's Backup  | 20  |   | 20  \nThe Bazaar Bargain  | 18  |   | 18  \nThe Big Earner  | 19  |   | 19  \nThe Black Box  | 14  |   | 14  \nThe Blutsauger  | 18  | 2  | 20  \nThe Bootlegger  | 0   |   | 0  \nThe Boston Basher  | 19  |   | 19  \nThe Brass Beast  | 14  |    | 14  \nThe Buff Banner  | 19  |    | 19  \nThe Buffalo Steak Sandvich  | 20  |    | 20  \nThe Bushwacka  | 20  |   | 20  \nThe Candy Cane  | 14  |   | 14  \nThe Chargin' Targe  | 16  | 3  | 19  \nThe Claidheamh MÃ²r  | 20  |   | 20  \nThe Cloak and Dagger  | 16  | 4  | 20  \nThe Concheror  | 18  |    | 18  \nThe Conscientious Objector  |  0  |   | 0  \nThe Cow Mangler 5000  | 17  |   | 17  \nThe Dalokohs Bar  | 19  | 1  | 20  \nThe Dead Ringer  | 19  | 1  | 20  \nThe Degreaser  | 19  |   | 19  \nThe Diamondback  | 19  |   | 19  \nThe Direct Hit  | 21  |    | 21  \nThe Disciplinary Action  | 19  |   | 19  \nThe Enforcer  | 16  |   | 16  \nThe Equalizer  | 16  | 4  | 20  \nThe Eviction Notice  | 19  |   | 19  \nThe Eyelander  | 17  | 5  | 22  \nThe Family Business  | 20  |   | 20  \nThe Fan O'War  | 16  |    | 16  \nThe Fists of Steel  | 20  |   | 20  \nThe Flare Gun  | 14  | 6  | 20  \nThe Force-A-Nature  | 17  | 1  | 18  \nThe Frying Pan  | 4  |   | 4  \nThe Gunboats  | 13  | 3  | 16  \nThe Gunslinger  | 24  |    | 24  \nThe Half-Zatoichi  | 20  |    | 20  \nThe Holy Mackerel  | 21  |   | 21  \nThe Homewrecker  | 21  |    | 21  \nThe Huntsman  | 14  | 4  | 18  \nThe Jag  | 20  |   | 20  \nThe Killing Gloves of Boxing  | 17  | 4  | 21  \nThe Kritzkrieg  | 17  | 3  | 20  \nThe Liberty Launcher  | 21  |   | 21  \nThe Loch-n-Load  | 18  |    | 18  \nThe Machina  | 9  |   | 9  \nThe Mantreads  | 17  |   | 17  \nThe Market Gardener  | 20  |   | 20  \nThe Original  | 15  |   | 15  \nThe Overdose  | 20  |   | 20  \nThe Pain Train  | 19  |    | 19  \nThe Persian Persuader  | 18  |   | 18  \nThe Postal Pummeler  | 14  |   | 14  \nThe Powerjack  | 18  |   | 18  \nThe Purity Fist  |  0  |   | 0  \nThe Quick-Fix  | 17  |   | 17  \nThe Razorback  | 18  | 2  | 20  \nThe Reserve Shooter  | 18  |   | 18  \nThe Righteous Bison  | 14  |   | 14  \nThe Sandman  | 10  | 5  | 15  \nThe Sandvich  | 15  | 1  | 16  \nThe Scotsman's Skullcutter  | 18  |    | 18  \nThe Scottish Handshake  |  0  |   | 0  \nThe Scottish Resistance  | 20  |    | 20  \nThe Shahanshah  | 22  |   | 22  \nThe Short Circuit  | 11  |   | 11  \nThe Shortstop  | 16  |   | 16  \nThe Soda Popper  | 18  |   | 18  \nThe Solemn Vow  | 16  |   | 16  \nThe Southern Hospitality  | 18  |    | 18  \nThe Splendid Screen  | 17  |   | 17  \nThe Sun-on-a-Stick  | 13  |    | 13  \nThe Sydney Sleeper  | 19  |   | 19  \nThe Tribalman's Shiv  | 20  |    | 20  \nThe Ubersaw  | 18  | 3  | 21  \nThe Ullapool Caber  | 12  |    | 12  \nThe Vita-Saw  | 17  |   | 17  \nThe Warrior's Spirit  | 18  |    | 18  \nThe Widowmaker  | 8  |   | 8  \nThe Winger  | 17  |   | 17  \nThe Wrangler  | 23  |    | 23  \nTomislav  | 13  |   | 13  \nUnarmed Combat  | 0   |   | 0  \nWanga Prick  | 0   |   | 0  \nYour Eternal Reward  | 16  |   | 16  \n.   \n   \n**Stranges**  \n      \nItem                        | Qty  \n:---------------------------|:----:  \nStrange Boston Basher  | 2  \nStrange Powerjack  | 1    \n.   \n", "gilded": 0, "created_utc": "1319418092", "subreddit": "tf2trade", "score": 5, "controversiality": 0}
{"body": "&gt;In theism, at least it is allowed that we may exist. \n\nWell isn't that nice of theism to allow you to possibly exist. Science also allows us to exist. Since the Big Bang does NOT say we came from nothing. The Big bang and Evolution are far more believable and have far more REAL evidence than the magic invisible man made us. They are the best scientific explanation we got. Their incompleteness does not mean, \"GOD did it\", is an acceptable answer.\n\nYour quest to find a scientific answer(which deals in phenomena of the material universe and their laws) to explain a supernatural phenomenon like God(which exists outside of the laws of nature and only in our minds) is futile. Accepting \"evidence\" outside of science is why people believe in fortune tellers, Astrology, ghosts, demons, and the Loch Ness Monster. Sometimes we can show through science that these people are wrong. Other times they believe just on faith and are beyond hope. The more a claim is part of the natural world the easier it is to prove or disprove through science. Things like Gods, spirits, and invisible pink unicorns on the other hand can not be touched by science. How could they be? \n\nNobody here is arguing Solipsism. ", "gilded": 0, "created_utc": "1319418941", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Nope. I have no evidence that there is a god. This indicates nonexistence. Take the Loch Ness monster as an analogy--there is no evidence for its existence, so the conclusion is that it doesn't exist. Should hard, objective evidence turn the other way, so too my mind.", "gilded": 0, "created_utc": "1319421456", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "That's gonna be about tree fitty. ", "gilded": 0, "created_utc": "1319428425", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "It is partially a joke, but it's being realistic too, real men are the hunters back in the paleolithic era.", "gilded": 0, "created_utc": "1319429143", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "I ain't givin you no tree fiddy!", "gilded": 0, "created_utc": "1319435428", "subreddit": "community", "score": 2, "controversiality": 0}
{"body": "Nice try, but that is clearly the Loch Ness Monster.\n\nMore like \"ThisIsNotADogHello\" AMIRITE???", "gilded": 0, "created_utc": "1319438925", "subreddit": "aww", "score": 4, "controversiality": 0}
{"body": "I'll give you tree fiddy for your soul. I owe one to someone.", "gilded": 0, "created_utc": "1319440141", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I have watched all of them, including the recreations of the lost episodes. I have a blog where me and my wife review them.  I would say the fact that he is never referred to onscreen as \"Doctor Who\" is a pretty good suggestion.\n\nIn the original BBC draft documents the character was going to be called \"Doctor Who\".  However, this was quickly abandoned and any reference to \"Doctor Who\" is made in reference to not knowing his real name (ie....BARBARA:  \"But, Doctor Foreman?\".....DOCTOR:  \"Doctor Who?\")  He has never been referred to onscreen as \"Doctor Who\", but was very quickly during the First Doctor's tenure referred to as \"The Doctor\".\n\nAlso, there is no established Doctor Who canon.  There is no George Lucas or Gene Roddenberry to say what is and what isn't...the BBC has made NO statements about Doctor Who canon, so it has fallen into that gray area of \"whatever you want to be canon IS.\"  Myself, I consider only what's aired on television to be canon, though even this gets muddles as the show has given 2 different explanations for the Loch Ness Monster and 3 different reasons for the sinking of Atlantis over the years.  See where I'm going with this?\n\nBut, by your logic, the fact that it's never been stated that Doctor Who ISN'T a proper moniker...the same could be said for the fact that they've never stated his name is NOT Cedric.  So, there you go....Cedric.  Well done.\n\ntl;dr you're still wrong", "gilded": 0, "created_utc": "1319447316", "subreddit": "doctorwho", "score": 3, "controversiality": 0}
{"body": "they should charge like tree fiddy for each book u checkout", "gilded": 0, "created_utc": "1319472043", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Tell me about it....\n\nBut when the customer is paying you money, what are you going to do?\n\n*\"Why, sure I'll hide all those Linux kernel messages so that people wont know your product is running off of Linux! Would you like me to shine your shoes for an extra tree fitty?\"*", "gilded": 0, "created_utc": "1319479686", "subreddit": "linux", "score": 10, "controversiality": 0}
{"body": "&gt;To be gnostic you have to \"know\".\n\nI know what gnostic means. A gnostic atheist holds the statement \"there is no god\" to be true, much to the same extent one would hold the non-existence of leprechauns, the loch ness monster, the abominable snow man etc. Likewise, the gnostic theist holds the statement \"there is a god\" to be true, much to the same effect that one would to the statement that there will be a tomorrow. We can't know with absolute certainty that there will be a tomorrow, but it is a pretty safe bet to make beyond any reasonable doubt - That's what knowledge means in the gnostic sense of the word. It is not about absolute certainty or claims about reality, it is about holding something to be true. \n\n&gt;It implies having that knowledge already.\n\nAs long as you understand that there's a difference between gnosis (which gnostic is derived from) and episteme. \n\nBoth translate to knowledge, but they're not really the same thing. \n\n", "gilded": 0, "created_utc": "1319483003", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I just found one from 1946! I brought it over to a neighborhood bank and the teller told me it was worth about tree fiddy. \n\nIt was about that time i noticed the teller was about 8 stories tall and was a crustacean from the Paleozoic Era. Damn Loch Ness Monsta. ", "gilded": 0, "created_utc": "1319487590", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "He aint no T-rex.  He knocked on my door, when I answered, he bent down and said \"I need about tree fiddy\". I said \"Damnit monster, get off my lawn, I ain't giving you no tree fiddy!\"", "gilded": 0, "created_utc": "1319499141", "subreddit": "todayilearned", "score": 10, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy. ", "gilded": 0, "created_utc": "1319513607", "subreddit": "tf2trade", "score": 8, "controversiality": 0}
{"body": "Did she ask for Tree Fiddy? ", "gilded": 0, "created_utc": "1319514383", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "doesn't taste as bad as it sounds, and will make you slam your face into the sidewalk drunk all for only around tree fiddy", "gilded": 0, "created_utc": "1319546330", "subreddit": "battlefield3", "score": 1, "controversiality": 0}
{"body": "I need about tree fitty.", "gilded": 0, "created_utc": "1319567609", "subreddit": "technology", "score": -1, "controversiality": 0}
{"body": "Great idea !! Last week one guy just randomly sent me a trade request and said: \"This [Nessie Nine Iron] for your Hat [Vintage Triboniophorus Tyrannus]\"\n\nI just laughed at him and close the trade... next time i'll keep them busy by playing stupid\n", "gilded": 0, "created_utc": "1319574095", "subreddit": "tf2", "score": 6, "controversiality": 0}
{"body": "What about lack of belief? I am an atheist and I don't have a belief in the Loch Ness monster, aliens visiting earth, Brahma, Vishnu and Yahweh.\n\nAre all of these separate religions.", "gilded": 0, "created_utc": "1319575818", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1319587135", "subreddit": "funny", "score": 10, "controversiality": 0}
{"body": "A whole tree fiddy?", "gilded": 0, "created_utc": "1319592456", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "hands down, no doubt in my mind I am gonna say you are a New Yorker! :)  Good luck gettin tree fiddy, that won't go far in NY! LOL", "gilded": 0, "created_utc": "1319593286", "subreddit": "RandomKindness", "score": 2, "controversiality": 0}
{"body": "HE ASKED ME FOR TREE FIDDY", "gilded": 0, "created_utc": "1319593385", "subreddit": "atheism", "score": 20, "controversiality": 0}
{"body": "dont you go givin that thing no tree fiddy!!", "gilded": 0, "created_utc": "1319595971", "subreddit": "atheism", "score": 8, "controversiality": 0}
{"body": "My mom told me a story of when she was pregnant with me, she saw an ad on one of those papers saying they found the Loch Ness Monster, she got extremely excited and started showing everyone she was by. She was 16, and unaware that they were not real. It has been 21 years since that incident and I make fun of her for it every chance I get.", "gilded": 0, "created_utc": "1319598881", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "Two eyes, two ears, a chin, a mouth, 10 fingers, two nipples, a butt, two kneecaps, a penis...  I have just described to you the loch ness monster.  And the reward for its captor?  All the riches in Scotland.  So I just have one question: Why are you here?", "gilded": 0, "created_utc": "1319637241", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I think that problem is the crux of my arugment -- with no evidence something exists, we do not assume the argument from the position of it does. I think with any other entity logic dictates the assumption it did not, and we use evidence to prove it does.. which leads to the arguements over the validity of the evidence.\n\nWith religion, however, theists mistake faith for evidence, and then merge belief and fact. \n\nTake the Loch Ness monster, for example: most of the evidence found attempts to prove existance, as opposed to the contrary. The couter-arguments exist mainly by invalidating that evidence showing that it doesn't actually prove what it was claimed to prove (or blatantly falseified). When talking about Nessy no one tells you to \"prove it doesn't exist\" because that would assume there is sufficient evidence to substantiate saying it does in the first place.", "gilded": 0, "created_utc": "1319639520", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "lucky you.. i only got tree fitty", "gilded": 0, "created_utc": "1319670982", "subreddit": "classicrage", "score": 2, "controversiality": 0}
{"body": "And he is coming for your tree fiddy!  Don't you give it to him!", "gilded": 0, "created_utc": "1319694181", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "about tree fiddy", "gilded": 0, "created_utc": "1319704912", "subreddit": "AskReddit", "score": 11, "controversiality": 0}
{"body": "That would be a skeptic. There are atheists on this forum who still believe in ghosts, pantheism, souls and the Loch Ness monster. Atheists are guaranteed to be skeptics on one topic only: gods. I think we *should* be skeptical about everything, but that's just my opinion.", "gilded": 0, "created_utc": "1319713236", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "No, its the same as Nessies Nine Iron. -25 health and no crits. No upsides. I think, anyone know different?", "gilded": 0, "created_utc": "1319719434", "subreddit": "tf2", "score": -5, "controversiality": 0}
{"body": "http://wiki.teamfortress.com/wiki/Demoman\n\nNessies Nine Iron/Eyelander/UHHHH - all same ", "gilded": 0, "created_utc": "1319720037", "subreddit": "tf2", "score": 6, "controversiality": 0}
{"body": "And about tree fitty.", "gilded": 0, "created_utc": "1319722812", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "When 8 saw the title I had to see what it was my dog is named Nessie and I have never heard it used by anyone half the time people don't even know it refers to the loc ness....lol\nYour foam art is great! You should enter one of those competitions ", "gilded": 0, "created_utc": "1319731080", "subreddit": "Coffee", "score": 0, "controversiality": 0}
{"body": "&gt;Like I said scientists say the numbers are to slim for a random big bang and that mot likely there is a creator but mot don't know WHO.\n\nCitation?\n\nJust because there is a lack of information on a subject doesn't mean your hypothesis is right.\n\nFaith based on what?  If you have faith just because your parents had it because their parents had it all you have is a long line of people that believe stories.  When you have no reasons behind your beliefs, what are they?  Superstitions. \n\nHow is Jesus more real than Zeus, the Loch Ness Monster, or Apollo?\n\nIf you don't even know why you believe what you believe, I call you childish and simple minded.\n\n", "gilded": 0, "created_utc": "1319731363", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "bout tree fitty", "gilded": 0, "created_utc": "1319732373", "subreddit": "gifs", "score": 86, "controversiality": 0}
{"body": "You don't seem to understand what constitutes good evidence. There are hours of video that claim to show Nessie, Big Foot, and UFOs, as well.\n\nLike I said, you are a prime example of why I am not giving the movement my full support. You make grandiose claims with nothing to back yourself up. Anyone who casts any doubt on aspects of the movement are suddenly cop-sympathizers or are \"uninformed\". By resorting to such tactics, you are no better than the people who you claim are trying to silence you.\n\nThis is nothing but a giant fallacy and I have no desire to debate with you if you're not willing to be rational.", "gilded": 0, "created_utc": "1319732650", "subreddit": "occupywallstreet", "score": 1, "controversiality": 0}
{"body": "Aww c'mon now don't go givin' him no goddamn tree fiddy!", "gilded": 0, "created_utc": "1319738691", "subreddit": "fffffffuuuuuuuuuuuu", "score": 21, "controversiality": 0}
{"body": "About tree fitty.", "gilded": 0, "created_utc": "1319739291", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "As by Nessie's examples given, it doesn't seem terribly different in English, although it may be less nuanced.\n\nYes, I forgot about this usage as well. It seems that ï½žã¾ã—ã‚‡ã†ã‹ always involves I, the speaker, somehow, whereas ï½žã¾ã›ã‚“ã‹ is only about the addressee's action?", "gilded": 0, "created_utc": "1319739302", "subreddit": "LearnJapanese", "score": 1, "controversiality": 0}
{"body": "I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster!", "gilded": 0, "created_utc": "1319740503", "subreddit": "gifs", "score": 19, "controversiality": 0}
{"body": "As a person of European ancestry, I can assure you that squinting my eyes to reduce water or snow reflection does not expend any substantial energy, so there's no inherent advantage in having narrower eyes for that purpose.\n\nMy vote:  Epicanthic folds are primarily random, and are largely inconsequential in regard to evolution by natural selection.  Many of the differences we consider indicative of \"ethnic groups\" primarily developed as a result of limited gene-pools during the Paleolithic Era (and earlier), and it stands to reason that some \"racial\" developments occurred simply as a result of a constrained gene-pool during those times.  There's no clear-cut advantage to epicanthic folds in modern-day sexual selection, so I tend to think it's a case of random evolution.\n\nTo cite another example, the freckles that most of my immediate family exhibit have no evolutionary advantage whatsoever, yet there they are.  In fact, freckles are a liability in modern-day sexual selection.  (They do however tend to code in parallel with extremely fair skin, which *does* give an advantage in northern and foggy environments {such as that the British Isles}, where the absorption of sunrays for the production of Vitamin D *is* of critical importance.)  \n\nLet's face it, humans didn't leave our genetic Garden of Eden (the Great Rift Valley of East Africa) very long ago from an evolutionary standpoint.  In fact, it's been a blink of an eye in that regard.  That's why we humans are still so similar to each other, and that most of our differences are merely superficial.\n", "gilded": 0, "created_utc": "1319749410", "subreddit": "evolution", "score": 8, "controversiality": 0}
{"body": "No.  Sorry, I don't accept that bullshit.  If the bible is god's word, it is infallible.  If it's flawed or ANY of it doesn't apply an more, it can't be the word of your supposed god.  The god Christians like to speak of doesn't make mistakes.  \n\nYou either accept the bible 100% or not at all.  Your logic holds no ground.\n\nWhat the hell would a being with the power to create the universe set into motion some type of game like this for anyways? That's petty.  To create the world and an adversary in order to tempt and then test a bunch of beings smaller than him for his own amusement?  It's idiotic. It makes no sense and only those without the ability to apply critical thinking believe in such fairy tales.\n\nZeus, Thor, and the Loch Ness monster make as much sense as Jesus. ", "gilded": 0, "created_utc": "1319749960", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "[That's like what? Tree fitty? Just 'bout tree fitty.](http://i.imgur.com/h0FrK.jpg)", "gilded": 0, "created_utc": "1319755500", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "I don't have enough....can you give me tree fiddy? And don't mind my long tail...I'm not the Loch Ness monster...it's a um halloween costume.", "gilded": 0, "created_utc": "1319756354", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Bout tree fiddy", "gilded": 0, "created_utc": "1319762567", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Saw the pic and instantly thought it was a family of Loch Ness monsters. \n\nI was disappoint ", "gilded": 0, "created_utc": "1319764110", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Wow a family of loch ness monsters...o wait..", "gilded": 0, "created_utc": "1319767485", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I thought that he lost his eye (and his adoptive parents) when he tried to blow up The Loch Ness Monster. This changes everything.", "gilded": 0, "created_utc": "1319780348", "subreddit": "tf2", "score": 3, "controversiality": 0}
{"body": "One year, I just got a roll of Ace bandages and a pair of sunglasses, rolled them over my head, wore a long coat and went as \"The Invisible Man.\"\n\nAnother year I put pomade in my hair, made it all sorts of crazy, put dark makeup under my eyes, didn't shave, and wore my robe and slippers and just carried a coffee mug in my hand, a newspaper under my arm and a toothbrush in my mouth. I was \"Hungover.\" \n\nThey were both very successful costumes and cost about a tree fiddy...", "gilded": 0, "created_utc": "1319781844", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "&gt;It's too coincidental.\n\nhttp://en.wikipedia.org/wiki/The_Succubus\n\nYou give the Loch Ness Monster tree fiddy and it knows it can get money from you.", "gilded": 0, "created_utc": "1319791683", "subreddit": "nfl", "score": 1, "controversiality": 0}
{"body": "No, like the Loch Ness monster.  *It's not real!!!*", "gilded": 0, "created_utc": "1319793886", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "I still believe the Loch Ness Monster is real. \n\nI logically know that there's no way it can be, but I did a report on it when I was in sixth grade and was fascinated by the history and lore surrounding it. \n\nEven when the famous [\"gargoyle head\"](http://www.cryptomundo.com/wp-content/uploads/rines1975a.jpg) picture was revealed to be nothing more than [a stump](http://www.loch-ness.org/images/headpic2.jpg) I still refused to completely give up on the hope that one day someone will find irrefutable proof that the Loch Ness Monster is real. ", "gilded": 0, "created_utc": "1319806716", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "It is pronounced \"about tree fitty\"", "gilded": 0, "created_utc": "1319811074", "subreddit": "guns", "score": 6, "controversiality": 0}
{"body": "It really didn't mean anything at the time, though. I suppose this would be like finding out the Loch Ness Monster is real.", "gilded": 0, "created_utc": "1319814038", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "&gt; It really didn't mean anything at the time, though\n\nNaw, I was just letting you know this isn't a WoW specific thing (I don't even really play WoW. I'm still waiting for WC4)\n\n&gt;I suppose this would be like finding out the Loch Ness Monster is real.\n\n... What?\n\nUh, I'll just reply \"yes\".", "gilded": 0, "created_utc": "1319814308", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "So about tree fiddy?", "gilded": 0, "created_utc": "1319814870", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "Thanks. I should also have mentioned, Hovind believes that even today there are still dinosaurs living in remote jungles and waters. It would only have been a few thousand years since the Flood, after all. So for him, dragon reports were real, the Loch Ness Monster is real, etc. I remember excitedly telling my parents as much after reading his stuff, and I don't think they were quite as keen on that particular hypothesis. Evidently even they had to draw the line somewhere.\n\nHowever, I was horrified to learn that my sister was taught something similar in her senior year of high school. She went to the same school as me, but they've managed to get even worse since I graduated.", "gilded": 0, "created_utc": "1319819718", "subreddit": "DebateAnAtheist", "score": 2, "controversiality": 0}
{"body": "A green bean and/or the Jolly Green Giant.\n\nI was supposed to be the Loch Ness Monster.", "gilded": 0, "created_utc": "1319820957", "subreddit": "AskReddit", "score": 77, "controversiality": 0}
{"body": "I ain't givin' you no tree-fitty, you goddamn Loch Ness Monster! Get your own goddamn money!", "gilded": 0, "created_utc": "1319826564", "subreddit": "AskReddit", "score": 14, "controversiality": 0}
{"body": "'Bout tree fiddy!", "gilded": 0, "created_utc": "1319833755", "subreddit": "fffffffuuuuuuuuuuuu", "score": 10, "controversiality": 0}
{"body": "...only then was it that I noticed this grizzly bear was 60 feet tall and had huge flippers for arms and legs and it wasn't a bear at all - it was the goddamn Loch Ness Monster trying to get my tree-fiddy again.", "gilded": 0, "created_utc": "1319840213", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "I also used to be creeped out by Nessie in the underground lake.", "gilded": 0, "created_utc": "1319847471", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "The Shafer and Johnston text is ludicrously stupid. Almost as bad as the idea that somehow, this idea has been conspiratorially propagated by a shadowy cabal of \"liberals/liberal press\" since the late '60s! AND NESSIE IS THERE AND BIGFOOT AND YETI! Come along and play since you're clearly impaired and probably sopping with your own excrement. Another Osh Kosh Bagosh outfit ruined, huh? That's okay, we'll teach you about this \"butt chocolate\" yet, my boy.", "gilded": 0, "created_utc": "1319865260", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "[I was wondering about the loch ness monster too](http://www.merriam-webster.com/dictionary/loch%20ness%20monster)", "gilded": 0, "created_utc": "1319895210", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Vegas here too! Can you loan me some money??? How 'bout.... tree fiddy?", "gilded": 0, "created_utc": "1319896195", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Can I get about tree fiddy?", "gilded": 0, "created_utc": "1319900667", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I won't be going but the Reporter is throwing a bib party up there with costume prizes. I think there were a few ads in the last edition. \n\nI have some friends that have a band and they are playing at Vanessie tonight. There is supposed to be a costume contest, drinks, blah, blah, blah going on. Stop by if you like, I'll be dressed up as MacGuyver. \n\n", "gilded": 0, "created_utc": "1319904015", "subreddit": "NewMexico", "score": 1, "controversiality": 0}
{"body": "But the magician book I bought off Craigslist for tree fiddy had diagrams and everything.", "gilded": 0, "created_utc": "1319908584", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "At least tree fitty layers deep if you ask me.", "gilded": 0, "created_utc": "1319910096", "subreddit": "todayilearned", "score": 0, "controversiality": 0}
{"body": "tree fiddy", "gilded": 0, "created_utc": "1319920642", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "&gt;Gnostic Atheists: How and/or why are you so sure? \n\nGiven my past experiences and my knowledge, I can know that there is no god much in the same way that I can know that there is no loch ness monster, leprechauns, unicorns etc. \n\nI suppose you could call it induction. \n\n&gt;Agnostic Atheist - No god. But I'm open to the idea there could be.\n\nA gnostic atheist isn't necessarily closed off against re-evaluating their position, if any new evidence should arise. A gnostic atheist simply holds \"there is no god\" to be a true statement.\n\nBeing a gnostic atheist isn't about choice. You don't choose to know that there is no loch ness monster. Sure, it might be possible that one exists, but given what we know, we can be sure beyond any *reasonable* doubt that there isn't one.", "gilded": 0, "created_utc": "1319923667", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I'm worth about tree fiddy.", "gilded": 0, "created_utc": "1319933336", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "I hopped onto Dr. Who just at the end of Pertwee and rode the entire Tom Baker run. I think that because he was a lot of people's first doctor as well as the fact he had such a long run as well as public television here showing his episodes without commercials and all just created a perfect storm. You also have to credit his companions. Sarah Jane and Harry, the Brigadier for a bit, Leela, Romana (both of them), K9 and so on. We also learned a lot more about the Doctor during his run with great Gallifrey episodes.  He went all about the place as well from fighting the Loch Ness monster to the Minotaur to surviving killer robots and even turning into a cactus! It was just mad fun all around.", "gilded": 0, "created_utc": "1319983218", "subreddit": "doctorwho", "score": 1, "controversiality": 0}
{"body": "Hi, \n\nI was in the house and I thought I would give it a go as I haven't really played around with the clone stamp tool. my attempt is here. I am unsure about the paw but I think its just the way Nessie is sitting. \n\n[The JPEG is here](http://imgur.com/DwPa4), I have saved the photoshop file so can easily redo anything / take it out.", "gilded": 0, "created_utc": "1319989250", "subreddit": "picrequests", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1320005371", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Woman! Don't give no deadlift monster no tree fiddy!", "gilded": 0, "created_utc": "1320012437", "subreddit": "Fitness", "score": 1, "controversiality": 0}
{"body": "\"Moral Landscape\" is another great read by Sam Harris. I lent a copy to my roomate's Christian brother (who believes dinosaurs walked with man, everyone that isn't a Christian will/deserves to burn in hell, and that the goal of science is to disprove God). I'm waiting for him to get back to me with his response to the book. The argument that religion is necessary for morality is pretty pathetic, and that is a great book on the topic.\n\n In return, he gave me a book called \"Paul meets Muhammed\", a debate on the resurrection of Christ written by a Christian Theologian. Obviously, the debate \"proves\" that the resurrection occurred, validating Christianity. I have never read the bible or Qu'ran. Great book trade... The premise of the book is, \"A Hypothetical debate using anecdotes to \n\"prove\" a supposed physical occurrence with no physical evidence\".  To me, it is akin to proving that the Loch Ness monster, or any other myth, exists simply because there are people that say it does.", "gilded": 0, "created_utc": "1320013163", "subreddit": "atheism", "score": 5, "controversiality": 0}
{"body": "The first thing I see when I look at this is nessie from Mario 64.", "gilded": 0, "created_utc": "1320015844", "subreddit": "Minecraft", "score": 1, "controversiality": 0}
{"body": "I know what being an Atheist means.\n\nAt least i know what it means to me.\n\nIf there is another word for believing there is no God please let me know what it is, because all the bullshit logical arguments attempting to tell me i have no proof there is no fictitious character made up by human beings (who have amazing imaginations) just don't impress me.\n\nNo, i do not believe in the Loch Ness Monster.\n\nDo i *really* have to prove it does not exist?", "gilded": 0, "created_utc": "1320022180", "subreddit": "atheism", "score": -1, "controversiality": 0}
{"body": "Also, everyone here is quite aware of why no one believes in the Loch Ness Monster. No one is saying you should believe in unsubstantiated nonsense. At the same time, you still need to use the words correctly if you want to have civil conversation with others in general, and specifically when a discussion is about the nature of atheism, you need to play by the rules of the definition of that word. ", "gilded": 0, "created_utc": "1320023672", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Dude. I love you.. I do.. but how do people get on reddit for 4 years and get over 50k comment karma without having a basic geopolitical understanding of every major nation? Dubai isn't something *brand new*, it's had this level of tourist appeal for about ten years not to mention that most of recent city was built on tourist dollars. It was essentially just founded and developed on oil.\n\nI just.. just.. don't.. just.. how?\n\n*Edit: This was not really an attack, I just didn't fathom or believe there were people on reddit that didn't google, wikipedia or otherwise research everything and anything they didn't know that comes up; as often as Dubai and UAE come up in comments as well as the constant TIL's about the place anyway. Sorry, my expectations were too high; I guess I was wrong for expecting that much. It is hard to know how other people reddit and everyone I know who is on reddit does the same amount of constant research and information gathering. I wrongly assumed everyone did considering our primary audience.*\n\n*Edit: lol, Nessie was being sarcastic. Everyone who responded to this including me needs to fix our sarcasm detectors :p*", "gilded": 0, "created_utc": "1320024212", "subreddit": "pics", "score": -3, "controversiality": 0}
{"body": "I'm quite sure Nessie knows things you don't.", "gilded": 0, "created_utc": "1320024566", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "An it was just about that time I realized that wasn't no Jessica Alba.... It were a dam Loch Ness monster!", "gilded": 0, "created_utc": "1320028581", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "I didn't really read either of your posts since I was over this thread the moment Nessie explained that he was being sarcastic so every reply to his original post including mine is extremely irrelevant now. It seems like your sarcasm detector is just as broken as mine and everyone else's on here.\n\nAssume what you want, I guess and enjoy your life.", "gilded": 0, "created_utc": "1320030152", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Might I remind you, Friend Nessie, of the Zeroth Law? ", "gilded": 0, "created_utc": "1320047227", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "I hope somebody [gave her](http://www.youtube.com/watch?v=9cn7xfBpZ3M&amp;feature=related) about [tree fiddy](http://i.imgur.com/sYhUy.jpg).", "gilded": 0, "created_utc": "1320052399", "subreddit": "funny", "score": -1, "controversiality": 0}
{"body": "I'm thinking that the difference in how the room feels could be related to the kind of gas heaters which burns the gas right then-and-there, which leads to very moist air, which doesn't feel as toasty-warm. I'm guessing it has to do with the higher heat capacity and the increased mass of the air which makes drafts more powerful. \n\nI'm trying to elaborate on what I think Nessie feels is separating heat and gas - it's not related to efficiency at all, but to how warm the room \"feels\".", "gilded": 0, "created_utc": "1320056283", "subreddit": "askscience", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.  ", "gilded": 0, "created_utc": "1320073369", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "Tree fiddy.", "gilded": 0, "created_utc": "1320078639", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "&gt;a high tree fiddy\n\nFTFY", "gilded": 0, "created_utc": "1320094929", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "You have utterly misunderstood me.  Not only that, you've put words in my mouth.  Stop that.\n\nI never said my beliefs make me better.  Atheism is not a belief; it is a lack of belief.\n\n&gt; one should not be labeled inferior or superior based on their beliefs\n\nSo you're saying that if I believed Elvis Presley was my grandmother, you wouldn't think I was at least a little bit inferior to you?  That you were at least better than me in the believing-Elvis-is-your-grandmother aspect?\n\nI'm not saying all Christians are stupid.  Most of the people I know are Christians, and they're perfectly normal.  Except for the fact that they all share a ridiculous belief for which there is zero supporting evidence.  And that deserves ridicule, just like believing in ghosts or the Loch Ness monster.", "gilded": 0, "created_utc": "1320097602", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Not tree fiddy?", "gilded": 0, "created_utc": "1320097907", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
