{"body": "Really? i took it to be about tree fiddy", "gilded": 0, "created_utc": "1238553492", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Read the descriptions under each meet the video as well. They are hilarious. Especially the Demoman's. \n\n&gt;A fierce temper, a fascination with all things explosive, and a terrible plan to kill the Loch Ness Monster cost the six year old Demoman his original set of adoptive parents. Later, back at the Crypt Grammar School for Orphans near Ullapool in the Scottish Highlands, the boy's bomb-making skills improved dramatically. His disposition and total number of intact eyeballs, however, did not.", "gilded": 0, "created_utc": "1238690215", "subreddit": "gaming", "score": 5, "controversiality": 0}
{"body": "Frankly, relegating Yeti and Nessie to the same level as Creationism is kind of offensive.", "gilded": 0, "created_utc": "1238913664", "subreddit": "atheism", "score": 19, "controversiality": 0}
{"body": "HEY, WANNA HEAR A JOKE? WHAT'S THE CAPITAL OF ICELAND?\n\nABOUT TREE FIDDY!", "gilded": 0, "created_utc": "1239302889", "subreddit": "pics", "score": -2, "controversiality": 0}
{"body": "AND THE MONSTER SAID ABOUT TREE FITTY...", "gilded": 0, "created_utc": "1239341307", "subreddit": "netsec", "score": 1, "controversiality": 0}
{"body": "If you're really lucky, they'll bring up [references to \"dinosaurs\"](http://www.answersingenesis.org/articles/am/v3/n2/dinosaurs-alive-after-babel)\n in the Bible - that is, the word \"behemoth\" and \"leviathan\" are used once each or something \nAnd hey, they're still alive, the [Loch Ness monster](http://www.answersingenesis.org/creation/v19/i4/seamonsters.asp) is one!\n\nMan, I'd never have any fun without creationists.", "gilded": 0, "created_utc": "1239377263", "subreddit": "self", "score": 2, "controversiality": 0}
{"body": "In case anyone was wondering:\n\nA troglodyte is the common [stereotype](http://en.wikipedia.org/wiki/Caveman) of a caveman, or it could be a D&amp;D character. Wikipedia is weird like that.\n\n&gt; A caveman or troglodyte is a popular stock character based upon stereotyped concepts of the way in which early prehistoric humans or homininans may have looked and behaved. The cliché of \"cavemen\" originates with the discovery of Neanderthal remains. The term caveman, sometimes used colloquially to refer to Neanderthal or Cro-Magnon people (Homo sapiens of the Paleolithic era), has dropped from serious use because of its inaccuracy and dependence on certain misconceptions about early humans.\n\n*P.S. I am a shithead*", "gilded": 0, "created_utc": "1239381331", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Ok, he nailed three pirates, I'll give him that much.\n\nNow, how's about some Bigfoots?\n\nI want one Bigfoot, two Chupacabres, and at least a new halfway-decent photo of the Loch Ness Monster.\n\nOh, I'm sure you're going to say, \"But Ace!  Those are all mythical creatures!  Pirates are real!\"\n\nWell, in case you hadn't noticed, we were lied to about the pirates.  Now, I never actually read any of those articles all the way through, but the headline was very effective.  So, until somebody catches a real live pirate and pokes him with a stick, I'm putting them in the Bigfoot category.", "gilded": 0, "created_utc": "1239672913", "subreddit": "pics", "score": 11, "controversiality": 0}
{"body": "Loch Ness Monster", "gilded": 0, "created_utc": "1239838304", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "Loch Ness Monster", "gilded": 0, "created_utc": "1239839066", "subreddit": "reddit.com", "score": -8, "controversiality": 0}
{"body": "I was once at the Edmonton Mall and they had this water slide there called \"Nessie's Revenge.\"  It looked like the tamest water slide in the park.  It was just straight with little drops.\n\nOMG MOTHERFUCKING SLIDE!!!  It was brutal.  Between the weightlessness and my swim trunks tugging on my nuts, I damn near puked after getting off that slide.  That deceptive goddamn slide was hands-down the worst in the park.  In fact, it was the only one that was even bad at all . . . and it looked so tame.", "gilded": 0, "created_utc": "1240123841", "subreddit": "politics", "score": 10, "controversiality": 0}
{"body": "THE OBAMA SHOW! \n\n- Watch it every night! Dragons, Unicorns, The Loch Ness Monster, Israel Tamed, The two-headed woman (Hillary). \n\n- ALSO: The Fight against the super-wealthy bankers who ripped you off and the Care for the People!! (After the break)\n\n- Entrance: ONLY [$37,000](http://www.washingtonwatch.com/blog/2008/09/21/your-liability-for-the-bailout-2000-your-debt-37000/)\n", "gilded": 0, "created_utc": "1240332508", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "HOLY...... CRAP.\n\nI was just going to watch this to laugh at it and tell you how ridiculous it was to post but after I just watched it I am truly shaken to my core.\n\nI've never believed in any kind of bigfoot/loch ness monster type of conspiracies but after seeing this I'm 100% positive that Yetis are REAL.\n\n*shiver*", "gilded": 0, "created_utc": "1240339334", "subreddit": "offbeat", "score": 3, "controversiality": 0}
{"body": "I like the \"Haunted UFO Piloted by Bigfoot delivering the Loch Ness Monster to the Chupacabra\" Channel", "gilded": 0, "created_utc": "1240408328", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Yes, I see what you mean, Nessie, sorry!  But I was not aware I could?", "gilded": 0, "created_utc": "1240574323", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Piloted by the ghosts of Nazi Loch Ness monsters. They were actually the ones who flew into the towers on 9/11.", "gilded": 0, "created_utc": "1240583661", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "Loch Ness monster is not a god. But it was an interesting read. *grins*", "gilded": 0, "created_utc": "1240621225", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "And there was piltdown man, cold fusion, and the loch ness monster... Just sayin'", "gilded": 0, "created_utc": "1240833611", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "&gt;If i told you i went fishing in the same spot for thirty years and never caught a fish, you would not tell me that fish don't exist.\r\n\r\nYou think that might have something to do with the fact we've all caught fish, eaten fish, lived in societies that consume millions of tons of fish a year, probably filleted one with our own hands or paid a grocer to do it for us and that this has been going on, more or less, for all of human history?\r\n\r\nSo your metaphor is a giant clusterfuck from top to bottom.  You aren't fishing for fish.  You are fishing for the Loch Ness Monster.\r\n\r\nAnd after a few hundred thousand years of fishing for the Loch Ness Monster, some of us are telling you to give it up because all you are going to get is fish.  Fish are a real goal, clearly attainable, because we've all attained it at some point.  Fishing for Nessie, on the other hand, has been batting zero for as long as we can remember.  Everyone has a cousin of an uncle's brother who's seen Nessie.  Lots of people have convinced themselves she's real and that they've seen her together, but there's never any real proof of it.  \r\n\r\nYes, getting together with your cronies gives you all the benefits of a community - comraderie, mutual support, solace -  and being part of the Loch Ness Monster fan club does have measurable and tangible benefits like discounts on Nessie merchandise.  I'll support you in your decision to stay a part of this group because you are clearly getting some good out of it and it gives you yahoos something to do every week.\r\n\r\nIt's my duty to point out, though, that the benefits you are getting have nothing to do with the Loch Ness Monster and whether she is real or not.  They have everything to do with the people around you.  You get those benefits from each other, not from Nessie, and the rest of us are getting the exact same benefits without having to wear the stupid Nessie hat and sing the Nessie songs ever week.\r\n\r\nOnce you figure that out, you can meet up at the pub with those people and drop all this Nessie shit once and for all.  You'll have all the benefits without the wasted time and effort of fishing for Nessie that have been so fruitless for all those countless centuries.  Heck, those running battles with the believers in the Ogopogo were a pain in the ass anyway, right?\r\n\r\nI'll buy you your first pint, in fact.", "gilded": 0, "created_utc": "1240960628", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "&gt;Its not really meant as an insult.\n\nIt certainly comes across as one.  Especially considering how generally vile Christopher Hitchens is.\n\n&gt;I'v already posted this but you might find it interesting if you've not noticed it; Eagletons original review of 'The God Delusion'; http://www.lrb.co.uk/v28/n20/eagl01_.html\n\nIt was interesting, if frustrating and annoying.\n\nHe begins with the classic Courtier's Reply.\n\n&gt;What, one wonders, are Dawkins’s views on the epistemological differences between Aquinas and Duns Scotus? Has he read Eriugena on subjectivity, Rahner on grace or Moltmann on hope? Has he even heard of them?\n\nTo which the answer is: who cares?  The basic thesis is wrong, what matters the eloquent curlicues of rhetoric that the false thesis produced?\n\nOne may as well ask if, in dismissing phlogiston physics one has considered the work of Bryant on the theory that phlogiston changes density the further it is from any large mass, or the speculation of Halbrook that phlogiston is simultaneously as dense as concrete and perfectly frictionless and causes no impedance to objects passing through it (complete with math that proves the necessity of both conditions).\n\nNone of that matters for one simple reason: there's no such thing as phlogiston.\n\nSo too I see no need to devote any time to studying the theology of anybody absent proof that there is a god.  Show me a god and we can talk about theology, but until you can do that all the learned discussion of this \"god\" you propose exists is merely noise.\n\nHe spends a great deal of time on this, objecting most strenuously to the idea that a person can reject god without being an expert on Christian theology.  I do wonder, how many of those respected Christian theologians were perfectly versed in the ins and outs of the Norse Eddur before they rejected Odin?  How many studied the complex philosophies of the Tao before they rejected it for Christ's love?\n\nAs always atheism is held to a standard that no theist ever matches.  We dare to reject all gods, while the theist, ever so much more intelligently, rejects all but one god, and thus looks down on our ignorant rejection of the final god.\n\nAfter Eagleton wastes a number of bytes on his extended Courtier's Reply, he then attempts to define a god that no Christian I have ever met believes in.  I live in the Texas panhandle, I know a **LOT** of Christians.\n\nI say that Eagleton \"attempts\" to define a god, because while he spends a large number of words on the attempt, mostly he produces gibberish.  It looks like English, it seems as if it should make sense, but in the end the sentences just don't parse.  It makes for extremely dense, and frustrating, reading.\n\n&gt;God is not a celestial super-object or divine UFO, about whose existence we must remain agnostic until all the evidence is in. Theologians do not believe that he is either inside or outside the universe, as Dawkins thinks they do. His transcendence and invisibility are part of what he is, which is not the case with the Loch Ness monster. This is not to say that religious people believe in a black hole, because they also consider that God has revealed himself: not, as Dawkins thinks, in the guise of a cosmic manufacturer even smarter than Dawkins himself (the New Testament has next to nothing to say about God as Creator), but for Christians at least, in the form of a reviled and murdered political criminal.\n\nFirst he describes a black hole, and then he simply declares that this is not the case.  Christians, I am told, believe in well, I'm not sure, the sentences don't parse.\n\nI can confidently say that well over 90% of the Christians I have met, and as I say I know a large number of Christians, most assuredly do believe in a bastard of a god.  Most people here are Calvinists, if not strict five point Calvinists.  They believe in an anthropic god, and in a literal hell in which they believe most people (me especially) will be tortured forever.  \n\nObviously Eagleton, when he uses the term \"Christian\" does not mean it to apply to mere people who worship Jesus and call themselves Christian.  No, he means **REAL** Christians, a group which, as nearly as I can tell, includes perhaps fifty professors of theology and no one else.", "gilded": 0, "created_utc": "1240968400", "subreddit": "philosophy", "score": 6, "controversiality": 0}
{"body": "People have had made use of some sort of stone, bone, and wood tools since the paleolithic era(\"Old Stone Age\"). Even in the early paleolithic era we see stone tools and evidence of fire-building in the Olduwan culture, one of the earliest human communities that existed in the era. It's concievable that we could see some knowledge passed down to atomicthumbs in the scenario.", "gilded": 0, "created_utc": "1241040917", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
