{"body": "bout tree fiddy. ", "gilded": 0, "created_utc": "1243840512", "subreddit": "Marijuana", "score": 2, "controversiality": 0}
{"body": "I think you mean \"tree fitty\".", "gilded": 0, "created_utc": "1243841447", "subreddit": "worldnews", "score": 2, "controversiality": 0}
{"body": "So the 'English Channel Monster', not the 'Loch Ness Monster'.", "gilded": 0, "created_utc": "1243862465", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "I read what you wrote, and I read it in the context of this thread. You were responding to another_user_name's statement that \"atheism is a statement of faith\", claiming it was accurate.\n\nI suppose, if you wanted to ignore the context of this thread, you *could* say that \"atheism is a statement of faith (in the sense that its invalid as a reason for belief)\", but within the context of this thread it is quite clear we're talking about the frequent attempts by the religious to shift the burden of proof for their claims to the people whom their trying persuade.\n\nJust as no one would call a disbelief in any of the items on the original list a faith, so too one should not call a disbelief in the idea of God a faith. I do not believe in the Loch Ness Monster, but if you prevented me with credible evidence of its existence I would gladly change my mind. My skepticism towards its existence is based on the lack of credible evidence, and though I doubt it exists I couldn't prove beyond any imaginable  doubt that it doesn't, even if I wanted to, even if I'm right that it doesn't exist. \n\nIf you have faith in the existence of the Loch Ness Monster and I doubt your claim, that doesn't mean I have faith in the non-existence of the Loch Ness Monster, or that our two beliefs are in any way comparable.\n\nedit: Jesus, what bizarre typos I made here; prevented - should be presented, and I know the difference between their and they're, honest I do. ", "gilded": 0, "created_utc": "1243968750", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt; I read what you wrote, and I read it in the context of this thread. You were responding to anotherusername's statement that \"atheism is a statement of faith\", claiming it was accurate.\n\nAccurate *within the context I provided*.  Which was that a statement of non-faith is in effect a statement of faith.\n\nThat is to say, *categorically* to say \"I don't care\" **IS** a *positional statement*.  That is how it is *categorized*.\n\nSo atheism is a statement of faith.  I rather made this clear when I stated,\n\"*Atheism is a statement of faith in that it is a profession of non-faith. Declaring the absence of something is related to that something, so -- yes. Your statement is accurate.*\"\n\nReally, now.  Do I have to break this down even further?\n\n&gt; If you have faith in the existence of the Loch Ness Monster and I doubt your claim, that doesn't mean I have faith in the non-existence of the Loch Ness Monster, or that our two beliefs are in any way comparable.\n\nIt would seem I have to.  Your *positional statement* of \"I do not believe in the Loch Ness Monster\" is relational to Nessy.  Therefore, it is a statement about Nessy.  \n\nWithin that context, a profession of non-faith (There's that fucking word I keep using over and over again) *is a statement of faith*. \n\nThe **category of the statement is filed under 'faith'**.  Why is this so difficult?", "gilded": 0, "created_utc": "1243969035", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Your definition of faith is shared by C.S. Lewis, and it is one that I also shared at one point.  It is certainly what people mean by the word faithful.  But that is not the meaning that most religious people would put to it today, and I was working off of that meaning.\n\nThere was a time when evidence for the existence of an intelligent creator was on par with, or even above, evidence that the universe we know developed by chance.  It is hard to conceive of the odds that intelligent life could form by random chance.  That changed with the theory of evolution.  That discovery, and a thousand others, have obliterated any need for an architect.  God is a solution to a problem that no longer exists.\n\nThere aren't two theories here that stand on equal ground.  Evidence for any intelligent creator is mostly wordplay and rather easy to deflate.  Evidence of a personal God who interacts with humans and takes an interest in their daily lives is utterly non-existent.  They are all based on historical evidence that would never be accepted by modern methods of study, and have no support from other records available from that time period.  (I'm focusing on Christianity here.)\n\nAny remaining assertions come from subjective experience of claimed interaction with God.  But no claim has ever had a shred of evidence to support it.  And if you believe those claims to be worthy of acceptance, there are plenty of people with equally convincing stories of everything from little green men with anal probes, to astrology, to wiji boards, to the Loch Ness Monster, and a thousand other things that are all equally worthy of acceptance.\n\nI suspect that the shift in meaning of the word faith is a direct result of the fact that its character has also changed.  As we have learned more and more about the universe, faithfulness to religious dogma has become more and more diametrically opposed to reason, and the language has shifted right along with it.\n\nFaith, as in belief without evidence, is an absolute requirement for modern religion.\n\nEDIT for grammer", "gilded": 0, "created_utc": "1244047715", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "As an atheist, as far as I'm concerned agnostics are on \"our team.\"  I don't make too big a fuss about it.\n\nOccasionally I'll point out that I'm agnostic towards \"god\" in the same way that I'm agnostic towards the Tooth Fairy, The Loch Ness Monster, Bigfoot and other similar ideas but that's about the extent of it.", "gilded": 0, "created_utc": "1244054264", "subreddit": "atheism", "score": 8, "controversiality": 0}
{"body": "Yeah, well it's called the History Channel, not the stupid bullshit channel.  Nothing wrong with stupid bullshit that entertains people without stimulating their brains, but the channel's name implies that it's not gonna show some retarded bullshit about the fuckin Loch Ness Monster.  Dumbass....", "gilded": 0, "created_utc": "1244061520", "subreddit": "reddit.com", "score": 4, "controversiality": 0}
{"body": "Wow.  This is embarrassingly stupid.  The Plesiosaur, a creature recognized by science for two centuries, is now a \"Loch Ness-style creature?\"  Well, yes, I suppose, in that people think Nessie IS a fresh-water plesiosaur; in what other way is this discovery related to Loch Ness?", "gilded": 0, "created_utc": "1244068969", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "People also see bigfoot and nessie.  Weirdly, none of them seem to leave any, you know, actual evidence.  ", "gilded": 0, "created_utc": "1244164187", "subreddit": "space", "score": 2, "controversiality": 0}
{"body": "Please give my regards to Nessie.  Thank you.", "gilded": 0, "created_utc": "1244414227", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "That's the loch ness monster!", "gilded": 0, "created_utc": "1244423522", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "@Nessie: A good start!\n\n&gt;Comment | eProps | Email to a Friend |", "gilded": 0, "created_utc": "1244531917", "subreddit": "offbeat", "score": 15, "controversiality": 0}
{"body": "is he what we are using now to find the loch ness monster?", "gilded": 0, "created_utc": "1244544682", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "God Dammit Loch Ness Monster, I ain't gonna give you no tree fiddy.", "gilded": 0, "created_utc": "1244592967", "subreddit": "funny", "score": 26, "controversiality": 0}
{"body": "You gave him tree fiddy?  No wonder he keep coming back!", "gilded": 0, "created_utc": "1244601437", "subreddit": "funny", "score": 11, "controversiality": 0}
{"body": "Dammit woman I don't care what we had for dinna that night I ain't givin him no tree fiddy! You WHAT? YOU GAVE HIM A DOLLA?", "gilded": 0, "created_utc": "1244649769", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "Serendipity, sure, not deja vu, not synchronicity exactly...I seem to remember a Wikipedia link for this very phenomenon coming up in the past.\nI'm specifically thinking about the \"tree fiddy\" quote from South Park that's come up a couple of times today here and on Digg, having strangely enough just watched that (rather old and obscure) episode for the first time. ", "gilded": 0, "created_utc": "1244673735", "subreddit": "ask", "score": 1, "controversiality": 0}
{"body": "You were downvoted?  Doesn't anyone remember Bush joking about how much easier his job would be if he were a dictator?  It was joking but Nessie's comment is accurate.", "gilded": 0, "created_utc": "1244807451", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Nessie is technically correct - the inference being implied here is invalid.  I've explained this in another comment.  Really, you would think people here would be more logically rigorous.. the fallacy is pretty obvious.", "gilded": 0, "created_utc": "1244808486", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "\"...both inclusive *and* less weighted...?\"\r\n\r\nI see your point, really, but I still think there's something amiss with this issue.  It feels too much like turning \"Shell Shock\" into \"post traumatic stress disorder.\"  I guess the reason I oppose it most strongly is i perceive a tone of condescention in the word \"nonbeliever\", the same type of condescention I'm sure the religious would feel if we started calling them the \"institutionally mass-delusioned\". \r\n\r\nBesides all that, I do take issue with atheists who actually are nihilists or say \"I haven't given it any thought really\" and then shrug.  It's the same issue I take with any person who doesn't take the time to fully develope a self-consistent worldview.  Secular Humanist might be an incomplete moniker for the wide spectrum of persons who reject the divine, but anything other than \"atheist\" is incomplete to describe every person not believeing in god; in the same way, any term but \"theist\" is incomplete when describing all people who believe in a personal interceasory god.\r\n\r\nThe term atheist SHOULD offend people to a degree.  It should cause immediate impact and bring fears and prejudices out into the open and expose the hypocricy of those faiths which profess love for all things, and then deny love for all things not like themselves.  A little offense can co a long way to starting a good conversation about the attitudes of each side.  We should not be afraid to offend religious people any more than we would be afraid to offend someone who believes other dubious claims like UFOlogy or the Loch Ness Monster.   \r\n\r\nThe only thing all atheists have in common is the rejection of unverifiable claims to knowledge regarding the divine.  Religious people need to understand that they cannot insulate themselves from criticism in public discourse for no better reason than \"because I said so\".\r\n\r\nNow I'm not really an anti-theist, but I do hold nothing to be sacred and unchallengeable, not even my own adopted certainties and ideologies, and I refuse to accept that kind of shady behavior from the people with whom I debate or converse.  Your worldview ought to be able to withstand criticisms without the threat of collapse r it's time to find anotherone in the interests of self preservation and the desire to be actually correct instead of just feeling correct.", "gilded": 0, "created_utc": "1244832695", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Having a sense of humor does not require one to laugh uproariously every time some dim bulb atheist mentions Batman, or unicorns, or Santa Claus, or the Loch Ness monster, or pixies, or the fucking Flying Spaghetti Monster, and thinks he's\n\na) made some very clever joke\n\nb) actually made an argument. ", "gilded": 0, "created_utc": "1244860398", "subreddit": "atheism", "score": -1, "controversiality": 0}
{"body": "The Loch Ness Monster is a giraffe?", "gilded": 0, "created_utc": "1244886351", "subreddit": "funny", "score": 10, "controversiality": 0}
{"body": "Oh, atheist subreddit, must you always be so predictable? \n\nVirtually every time I try to challenge the standard New Atheist dogmas here in the atheism subreddit, I get one or more of the following reactions:   \n\n1) Someone decides I must be a Christian, and promptly insults me for it. \n\n2) If I mention I'm an agnostic, they either tell me I can't really be an agnostic -- I must be an \"agnostic atheist\" -- or they continue to insist that I'm a religious believer.\n\n3) Someone declares me a \"troll\" or (if I suggest, say, that Dawkins is being a bit of a douche in his approach to religion) that I'm a \"concern troll.\" \n\n4) Someone says something about imaginary friends, or the easter bunny, or unicorns, or Santa Claus, or fairies, or the Loch Ness monster, or the fucking Flying Spaghetti monster, and thinks that he has not only made a very clever joke but also has actually made an argument. \n\n5) If I point out any ways in which Dawkins (or whoever) misunderstands or is simply ignorant about religion, my actual argument is ignored, and someone pulls out the old \"Courtier's Reply\" pseudoargument, as if expecting Dawkins (or whoever) to understand the most basic facts about religion were somehow an exercise in philosophical nit-picking. \n\n6) People respond not to what I've said but to something else they've convinced themselves I've said instead. Sometimes they will say \"so what you're really saying is ...\" and then trot out something that has no resemblance to what I've said. \n\n8) Someone makes some sort of comparison between religious believers and Nazis. \n\nDisagree with me if you must, atheist subreddit, but please, please, please, just do so in some slightly more creative or meaningful way. \n\nInstead of assuming I'm Christian, assume I'm Zoroastrian. \n\nInstead of calling me a troll, call me an elf. \n\nI don't care. Just use your allegedly big brains to come up with something new. \n\nThank you, and God bless you! ", "gilded": 0, "created_utc": "1245009208", "subreddit": "atheism", "score": -19, "controversiality": 0}
{"body": "Homeopathy deserves significantly less benefit-of-the-doubt than you'd give to the Loch Ness Monster, because that at least supposedly obeys the laws of physics.", "gilded": 0, "created_utc": "1245150363", "subreddit": "science", "score": 16, "controversiality": 0}
{"body": "But there's no independent historical verification of those eyewitness accounts.  There were plenty of historians in and around Galilee at the time Christ was supposed to have lived, and not a one of them mentions a man roving the country side performing miracles, not even so much as to dismiss it as peasant superstition.  The Josephus Testament has been widely regarded as either a forgery or a willful embellishment of the life of a religious teacher.  Also, it does not mention Jesus by name, but refers only to a man called Christ, which is to say \"the anointed\".  Many \"messiahs\" of the time attempted to assume this title.\n\nAlso it is important for me to mention that your reason for becoming and remaining a Christian boils down to a simple \"because it feels right\".  I understand the feeling of certainty.  I was once certain that I would nightly lead armies of angels against endless hoards of demons in great ethereal wars.  I would astrally project to heaven in my sleep, you see, and join forces with an angel to complete these missions of great cosmic import.  Silly? Of course!  But I was DEAD certain that these were facts.  No amount of virtue gained on my part from the experience will change the fact that I was completely and hopelessly wrong for nearly five years.\n\nAnd finally, just to be clear: you make no claim against Mohammed riding into the heavens on a winged horse after preaching the name of Allah and in doing so insisting that Christ was not God but a prophet?  You don't deny that Hercules was a real demi-god?  You're not going to refute eyewitness accounts of dragons and sea monsters?  What about all the prophecies made by the Oracle at Delphi in the name of Pheobus Apollo which came true (such as the decay of Athens and the sacking of Greece by Rome)?  Have you no comment on the eyewitness accounts and photographs of Extraterrestrial Spacecraft which are reported to visit the Earth on a regular basis?  Or the Jersey Devil?  Or the Chupacabra?  Bigfoot?  Loch Ness Monster?  These are all things which are reported extensively by folklore and/or eyewitness testimony: surely you don't believe them *all*?", "gilded": 0, "created_utc": "1245296374", "subreddit": "Christianity", "score": 2, "controversiality": 0}
{"body": "Not at all, I'm merely suggesting they are in the same category as papers which depict bat boy and new photos of the loch ness monster. It's possible the things they say are true but for the most part they are full of shit. No integrity.", "gilded": 0, "created_utc": "1245381473", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I need about tree fiddy", "gilded": 0, "created_utc": "1245416072", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Which is... \n\n&gt;4) Someone says something about imaginary friends, or the easter bunny, or unicorns, or Santa Claus, or fairies, or the Loch Ness monster, or the fucking Flying Spaghetti monster, and thinks that he has not only made a very clever joke but also has actually made an argument.\n\nThere's nothing to indicate that jotux thinks he was being \"very clever.\" There's also nothing to indicate that he was trying to make an argument. He was merely stating the truth. And if we already know this truth, and if we've heard it a bunch of times already, so what? I think it deserves to be said again. In fact, I think it deserves to be said a lot more, generally speaking. Atheists have been forcibly silenced throughout history, often by death. We finally have an outlet where we can speak our minds.  I'll take a good atheist cliché over that silence any day. So pardon my French, but say something constructive or STFU. ", "gilded": 0, "created_utc": "1245476708", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "[Nessie](http://imgur.com/pc3pE.jpg)\n\n[Loch Ness Monster](http://imgur.com/MwRcg.jpg)\n\n[Charley](http://imgur.com/F8i7h.jpg)\n\n[Liz the Lizard](http://imgur.com/qCA1w.jpg)", "gilded": 0, "created_utc": "1245952569", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1245972406", "subreddit": "gaming", "score": 7, "controversiality": 0}
{"body": "&gt; the extremely few serious mainstream studies (should that even be plural?) that are undertaken are flawed because they are designed by scientists who set out with the intention of disproving the existence of the transcendent.\n\nThere are a number of misapprehensions in this sentence.\n\nFirstly, there have been a lot more studies into this kind of thing than you realise, especially in the last few years, when brain-imaging techniques and harmless, detailed, safe neurological experimentation on subjects in altered states of consciousness has become possible.\n\nSecondly, in cases of things like astral projection and other fringe science, some of the most telling studies have been conducted with the full cooperation of the people concerned.  Typically these people agree to the set-up ahead of time (it's a waste of time to test something in a way even its own proponents claim won't produce any results), and only complain about the \"failure\" of science when science fails to prove their own claims accurate.  In other cases people have reported details (describing like patients in beds out of sight of their own bed, etc), and in pretty much every case when these details have been checked up-on they've proven to be false (with the few remaining cases equally and more simply explainable by foreknowledge or subconsciously-remembered details), showing the process to be a hallucination caused by relatively well-understood brain chemistry, not corresponding to reality.\n\nThirdly, of *course* scientists try to disprove a theory.  That's the whole point of science: why it works, and why we don't have to eat our food raw and sleep in a tree.  You formulate a hypothesis, and then think of all the different ways you could disprove it.  Then you try all those different ways (or as many as possible), and if at the end you still haven't disproven it, it gets upgraded to an accepted theory.  *Not* trying to disprove something allows you to deceive yourself more easily, and is therefore useless.  As we know, correlation does not necessarily imply causation, but if you aren't sceptical towards your own hypothesis you can easily conclude that it does.\n\nFourthly, if there was any objective validity to phenomena like OBEs then trying to *disprove* them should still turn up phenomena we can't disprove.  At this point it becomes science, instead of superstition.  Alas, after decades of research and hundreds of different experiments, not one single shred of evidence has shown itself, but with advancements in technology we *have* learned a lot more about neurochemistry.  No unexplained phenomena, and no suggestive loose ends - just a gradually deepening understanding of how the brain reacts in these situations and how these kinds of hallucinations occur.\n\n&gt; in the only organized study I've heard of, the test was to read an inscription. Brilliant! Let's test them on a completely arbitrary criterion, not on the ability that anecdotal cases have shown people to have again and again!\n\nThey claim to be able to leave their bodies.  So you give them something simple, memorable but too open-ended to fluke a guess at, and see if they can leave their bodies and read it.\n\nWhat's wrong with that?  It's about the simplest possible experiment you could do.\n\n&gt; The huge volume of anecdotal evidence that exists is proof enough for anyone with a thinking mind that OBE's are real.\n\nI'm assuming from this reasoning that you also believe in God, Allah, Xenu, Bigfoot, the Loch Ness Monster, aliens who regularly visit us to abduct and anally probe rednecks, the Bermuda triangle, psychics, homeopathy, new-age crystal healing and that Elvis isn't really dead.\n\nAll these things have the same kind of anecdotal \"evidence\" for them as OBEs (many of them - like the major world religions - have *even more*), and all of them have failed to demonstrate a single shred of *hard* evidence in favour of them.\n\nSo, do you believe in all those things?  And if not, why do you apply different reasoning to OBEs?", "gilded": 0, "created_utc": "1246059735", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "Lost my beloved West Highland White Terrier, Nessie, little more than 2 years ago.  Took it upon myself, to dig the hole in which I would bury her.  Call it my last act of love for her.  I miss her deeply; it's one of those \"friend\" deaths that I doubt I'll ever really accept.  I only knew her for 2 years.  Still, I know she lived a rich life, and was always happy.  Her last meal, consisted not only of chicken (which she loved), but of KFC's popcorn chicken.", "gilded": 0, "created_utc": "1246121848", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "If they have they could not be called responsible for the ultimate outcome unless the people running the op are more brilliant than Albert Einstein and more elusive than the Loch Ness Monster.", "gilded": 0, "created_utc": "1246154553", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "Notice the \"cryptids\" category, which puts this in roughly the same category as the Loch Ness monster and Bigfoot.", "gilded": 0, "created_utc": "1246185012", "subreddit": "todayilearned", "score": 22, "controversiality": 0}
{"body": "Yes. I use the service provided by my bank, but it gets expensive at times (though I rarely trade -- long-term). I have no recommendations, as I've only been with one, but I've heard good things about Schwab -- from the  comment made by Nessie.", "gilded": 0, "created_utc": "1246361523", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
