{"body": "I don't think I have an answer for you, but here's a great exchange I had with the good folks over at [The Atheist Experience](http://www.atheist-experience.com) in Austin.\n\n&gt;I guess that I should start out by saying that I'm an atheist who doesn't really understand how an adult believer's mind works. I'm 25 today and called myself a born-again for a brief time when I was in high school.\n\n&gt;I suppose that since my only frame of reference with respect to belief was my own adolescence, (please don't take this the wrong way, I'm sorry) it's hard for me to think of belief in God(s) as something that adults do. It seems to occupy a space somewhere in between children's belief in fantasy characters and the tendency of young adults to hold radical political views that seem naive to their elders.\n\n&gt;What I'd really like to know is this: what do believers mean when they say things along the lines of \"Well if there's no God, then why don't I just kill myself right now?\"\n\n&gt;This has always baffled me-- it seems as much a non-sequitur as \"Well, if there's no Loch Ness Monster, why don't we just eat waffles for breakfast every day?\"\n\n&gt;The only connection I can draw between premise and conclusion is that perhaps they mean something like \"Why bother with life if it doesn't last forever?\" But that again seems no more sane than asking \"why eat this delicious Chinese food if I can't eat delicious Chinese food non-stop for all eternity?\"\n\n&gt;Is this what they're saying, or are they saying that life isn't worth living without being administered by a creator? If so, why not?  Perhaps I should be asking a believer about this, but they never seem to give me a straight answer.\n&gt;Anyway, I felt I should ask someone with an evangelical background about this, since I hear this question all the time. Basically I feel that intellectual honesty demands that I have a a response to arguments against atheism, but I simply don't understand how believers think well enough to interpret this one.\n\n&gt;Thanks for your help, and I love the show.\n\n**First response, from Tracie Harris** \n&gt;&gt;Pardon me for wanting to reply--but your description of your past belief sounded so much like my own that I wanted to chime in and say, \"me too!\"\n\n&gt;&gt;I do, however, think I can offer some insight into the \"why don't I just lie down and die!?\" note, though, as well.\n\n&gt;&gt;You are definitely reading them pretty well right. The idea is that, to them, the meaning of life is to be there for god and to be god's tool. If you take away their god, you take away their meaning for life. And the reality is that they are incapable of even comprehending that for every person in the world there is an opportunity for a new and unqiue \"purpose\" for a human life. The Xians you're describing hold to an idea that the prescribed meaning in life is the one the Bible dictates. That, in itself, isn't problematic (so far as your question). The problem comes in with their inability to put themselves in someone else's shoes. THAT'S the core issue that's confusing you.\n\n&gt;&gt;It's the equivalent of someone with cholesterol problems saying this:\n\n&gt;&gt;1. If I can't eat all the great stuff I love, I might as well have a heart attack!\n\n&gt;&gt;BUT, then they go on to add:\n\n&gt;&gt;2. I can't understand how someone doesn't want to eat pork ribs every day!\n\n&gt;&gt;See the problem? It's one thing to state your own meaning; but it's entirely another to be incapable to understand how the cholesterol diet might not be such a big deal to someone for whom food/eating really isn't a big deal. In order to do that, you have to say, \"there are OTHER people with OTHER values than mine in life that ALSO work just fine (or that perhaps don't work as well, or whatever). The point is--these Xians see life meaning as a choice between \"Bible meaning\" and \"no meaning.\" They haven't really considered the idea of applying meaning from another source than the Bible--like personal values.\n\n&gt;&gt;Also, they sometimes do the \"if I'm just going to die, and that's it, then what's the point of living?!\" This misses that our lives can have impact on the world even after we're gone; and also misses that helping someone else out can be rewarding, even if it's temporal. Stopping someone from abusing an animal, for example, would matter to me even if I and that animal were going to die tomorrow. I would feel something was gained by helping that animal avoid pain and cruelty--even for just a day.\n\n&gt;&gt;I don't think Xians actually think it through. They have a knee jerk response and a defensive followup that makes it hard to get at what's really in their heads sometimes.\n\n&gt;&gt;I'm sure Matt will still reply, but wanted to add my thoughts.\n\n&gt;&gt;Thanks for writing!\n\n&gt;&gt;-th\n\n\n**Second response, from Matt Dillahunty** \n&gt;&gt;First, thanks for writing!\n\n&gt;&gt;Second, I don't have an answer for you...it's just as baffling to me, and I didn't think this way even when I did believe. However, I'll take a shot at it...\n\n&gt;&gt;Essentially, for fundamentalists, the entire purpose of this life is to qualify you for an afterlife of some kind. Because they believe in this afterlife, their life will have some \"meaning\" even after they've died - because they're going to live forever. To them, without the idea of an afterlife, this life is ultimately meaningless and, in the sense that they mean \"ultimately meaningless\" they're correct. Once you're dead, you're dead. Everything that was 'you' is gone and, eventually, no one will remember you and your contributions will ultimately be without meaning (even if this only occurs after humankind has died off).\n\n&gt;&gt;This 'ultimate meaning' is a red herring, constructed by religion. If they'd simply take some time to really consider reality, they'd understand that the sort of meaning they THINK their life has, is useless and unnecessary.\n\n&gt;&gt;In any case, you're right - it's nonsense and I don't think they really believe it. If they lost their religious beliefs, I don't think they'd start killing themselves.\n\n&gt;&gt;-Matt", "gilded": 0, "created_utc": "1262403704", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "second thought:  when I go through this scanner, I'm gonna stick my hand down my pants and make them a burger or loch ness monster (you should watch \"Puppetry of the Penis\" if you don't understand this reference)", "gilded": 0, "created_utc": "1262664617", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "God damn loch ness monster.", "gilded": 0, "created_utc": "1262801785", "subreddit": "AskReddit", "score": 9, "controversiality": 0}
{"body": "I was hoping for tree fiddy.  While I'm not certain what a fiddy is, I'm sure that the tree deserves it.", "gilded": 0, "created_utc": "1262812385", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "That's right. I said \"I ain't giving you no treefiddy you goddam Loch Ness monster! Get your own goddam money!\" ", "gilded": 0, "created_utc": "1262827341", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "That's right. I said \"I ain't giving you no treefiddy you goddam Loch Ness monster! Get your own goddam money!\" ", "gilded": 0, "created_utc": "1262827653", "subreddit": "offbeat", "score": 0, "controversiality": 0}
{"body": "[TREE FIDDY!](http://vids.myspace.com/index.cfm?fuseaction=vids.individual&amp;VideoID=8819502)", "gilded": 0, "created_utc": "1262917969", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "I agree it's a very, very poor choice of wording on their part, though they probably mean since they first began measuring and only counting asteroids that are dangerous enough to threaten life on earth.\n\nI doubt they're counting as far back even as, say... the Paleolithic Era. ", "gilded": 0, "created_utc": "1262927001", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "Nice thought problem.  Here is my take on it.\n\nSince the human visual system can only perceive about 30 frames per second, the beam of laser light and the moving dot on the wall will appear to be a continuous line on the wall or a constant plane in the room at anything above 30 rpms.  Anything above that is redundant and does not add any more \"speed\" to your example.  How would it appear to be superluminal when we cannot see faster than 30 fps?  We certainly cannot see faster than the speed of light, since it is light that we see.\n\nYour example is not a very good one.  I understand the physics you are trying to describe.  At a vast enough distance, the line of photons being projected onto this wall should appear to be moving in a linear motion faster than the speed of light, but the human senses are not capable of viewing it.  When a row of lights blink in succession, the light is not moving.  That is an illusion.\n\nIf anything, as the distance between wall and laser are increased, it would become a trail of photon impacts spaced out further and further apart like a machine gun spraying bullets on the wall in a row.  The further away from the laser source, the greater the space between impacts.  There is no actual dot that is moving along the wall.  The impact point of subsequent photons is not moving along the wall, since each impact is a separate event.  It only looks like the dot is moving.  That is why a cat can never catch the dot of a laser pointer.  (But isn't it great watching them try?)\n\nSince we process information provided by our senses, just like the Matrix, we believe what our senses tell us.  \"I saw it with my own two eyes!\"  (Yeah, like you could somehow see something with anyone Else's two eyes?)\n\nIn my opinion, what a person perceives can be either real or imaginary.  If those perceptions are corroborated by someone else, then they are real.  What are the odds of two people having the same delusion?  Something is real if it can be corroborated.\n\nThis leads to a whole bunch of other scenarios.\n\nWhat if the other person was also imaginary?  Maybe my entire reality is imaginary and nothing is real?  I could be a brain floating in a tank with a bunch of wires hooked up making me believe I have a body sitting in a chair in front of a computer typing away.  When you get to this level of questioning, you cannot live a normal life anymore.  If I am a disembodied brain believing it has a body, please don't wake me up.  I would be better off not knowing.  (And if I am being made to believe all this, why couldn't I have been made to believe I was tall, dark, handsome, and a total chick magnet?)  A less drastic analogy would be living in a holodeck in Star Trek.  If you cannot tell the difference between life on the Holodeck and real life, what is the difference?\n\nWhat if the person or persons was a victim of a hoax or an illusion?  If one person sees the Loch Ness Monster, it could be real or imagined.  If two people witness the same event, (the appearance of the Loch Ness Monster,) then the event was real.  That doesn't mean the Loch Ness Monster is real, just the sighting event.  They could both have witnessed something resembling the Loch Ness Monster, like a deliberate hoax or several seals or dolphins playing follow the leader.\n\nSo, you could have a real sighting of the Loch Ness Monster without having a real Loch Ness Monster.  That'll bake your noodle!", "gilded": 0, "created_utc": "1262970141", "subreddit": "philosophy", "score": 2, "controversiality": 0}
{"body": "&gt;So, you could have a real sighting of the Loch Ness Monster without having a real Loch Ness Monster. That'll bake your noodle!\n\nI like that. Sounds like part of what I'm looking for.", "gilded": 0, "created_utc": "1262970271", "subreddit": "philosophy", "score": 1, "controversiality": 0}
{"body": "&gt; Explain the Loch Ness Monster threw [sic] evolution.\n\nAddendum to Godwin's law: Debate ends when the Loch Ness monster is invoked.", "gilded": 0, "created_utc": "1263110313", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "[Unfortunately, that is not necessarily an accurate decider.](http://en.wikipedia.org/wiki/Leviathan#Scriptural_references\"God made Nessie\")", "gilded": 0, "created_utc": "1263110670", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I answered that if there's no evidence for the Loch Ness monster, then it doesn't exist.  I later answered that it is NOT justified to believe that God does not exist if we see no evidence of his/her existence.  It called me out on this.\n\nIt was implied that no evidence of the Loch Ness monster was found within the finite boundary of Loch Ness, and hence it is logical to say it doesn't exist.  Fair enough.  However, I would say that the universe is relatively infinite in boundary in relation to man, so it would be foolish to believe that God absolutely does not exist simply because we have seen no evidence within our limited scope.  Yes, I would describe myself as Agnostic.  Am I wrong with this logic?", "gilded": 0, "created_utc": "1263157836", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "When I claimed god would not be capable of creating logical contradictions it said I took a hit for saying that god would be able to do anything. Point of note, being able to do the impossible means in reality it was possible.\n\nSHENANIGANS. \n\nAlso dinged me on saying the loch ness monster has no evidence so it's ok to believe it doesn't exist, (if the question was, the loch ness monster has no evidence so it's ok to KNOW it doesn't exist). It dinged me on saying atheism is a matter of faith. Well if an atheist simply believes god doesn't exist sure, if an atheist says \"God does not exist\" Then YES it's WRONG. Fuck you quiz &gt;:|", "gilded": 0, "created_utc": "1263164984", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "The trouble is that they're equating something with 0% evidence of its veracity (the omnipotent god or the loch ness monster) with something with 90% evidence of its veracity (evolution). It claims believing in evolution without 100% proof is the same as believing in god or the loch ness monster despite a complete lack of evidence for either. Intellectually, this is a bullshit trick question.", "gilded": 0, "created_utc": "1263183648", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt; I'm taking it as saying that if there is no evidence that shows that God does not exist, [evidence that proves a negative], then atheism is a matter of faith. What kind of evidence could disprove the notion of God to begin with?\n\nI think I need to stress that the question says evidence *or argument*. Absent evidence or argument, would that be sufficient for a *lack* of belief, which is what most atheists say is the definition of atheism? And there are many arguments that seek to positively disprove the existence of God, usually based on some logical impossibility of the definition of God. (E.G., God can do anything, but nothing can make 1+1=72, so nothing that can exist could qualify as God.)\n\n&gt; To answer your question, however, I would say that what a person finds 'compelling' regarding the belief or lack thereof in God is very relative and subject to opinion.\n\nEven though we can't come to an agreement about the premise, we can examine the logic that follows from the premise if we assume it to be true temporarily. Or we can recycle the same logic for a different premise that is unambiguously true, which was the point of the Loch Ness Monster.", "gilded": 0, "created_utc": "1263184720", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt;He received the gospel not through another man, nor through a book, but through the Living Word, Christ.\n\nAnd I met JRR Tolkien, who told me that Uruk-Hais are very, very real. You sound as if you don't believe me, why is that?\n\n&gt;And while my experiences are not as epic as Paul, I nonetheless claim to know with all certainty that God exists.\n\nAnd I claim with equal certainty that Uruk-Hais are real.\n\n&gt;Do they have gu ns yet? If not, I think I can handle a dozen or two on my own.\n\nYou overestimate your abilities, me thinks. You wouldn't last two seconds against the weakest of them.\n\n&gt;If ever you see them, please let me know.\n\nI don't need to _see_ them. I know they're real, and you have no base to question this assertion. I _know_ they're real, so you better go out and buy those guns, real quick.\n\n&gt;Thusfar I know of no Uruk-Hai sightings.\n\nDon't blame everyone else for your inability to recognize the truth. Uruk-Hais are real, whether you've seen them or not. If you don't want to believe that, then that's _your_ problem.\n\n&gt;But I'm talking about validity in general. What makes something valid to you?\n\nIn general? Well, using my own senses is, naturally, a start. If you claim that something is in the room with me, but that I can't see it, hear it, smell it, feel it or taste it, I probably won't believe you. However, I fully realize that the human senses aren't perfect, and there might be something there that I'm too primitive to detect. For example, I believe there exists more colors of light than those that I can see with my own eyes, because of the multiple, intricate ways of detecting this light using more sensitive equipment.\n\nThe problem with religious beliefs is that they elude _both_ the human senses _and_ any other kind of existing equipment to detect and/or validate it. You claim God exists, but no one has ever actually seen him (many have claimed to, but just as many as have claimed to see the Loch Ness monster, a Yeti and aliens), and there exists no way of verifying his existence in any real way whatsoever. We're left with the simple claim that he exists, and _that_, regardless of anything else, is _not_ enough to make a claim valid in my opinion.\n\n&gt;Is the chair you're sitting in factual, valid?\n\nYes, my _chair_ is factual, just like the actual, printed _book_ of the Bible is factual. However, I'm not the one making the claim that my chair was \"divinely inspired\", or even crafted personally by God himself. Such a claim is _not_ factual.\n\n&gt;Is proof necessary to consider something factual, or valid? What constitutes proof?\n\nThat, of course, depends on the claim. If we take it in the context of the possible existence of God, then I leave it up to you to present any proof you can muster. I am an atheist, but I feel that the title usually leaves people more confused than enlightened, so for the purpose of this argument, simply call me _unconvinced_ instead. I don't deny the existence of your God, you have simply failed to convince me that he exists. Everyone has different standards this convincing evidence needs to meet, and \"simple folk\" usually have lower standards than, say, scientists. This adequately explains the vast difference in religious faith between scientists and non-scientists.\n\nBut to answer your question directly, I don't know yet. I'm of the opinion that you haven't yet presented any actual proof to consider, and I leave it completely up to you to do the presenting. You're trying to convince me, remember?", "gilded": 0, "created_utc": "1263368937", "subreddit": "Christianity", "score": 1, "controversiality": 0}
{"body": "&gt;There's a lack of evidence to suggest they don't, but that's a very different thing.\n\nI mentioned a bit about this above (though admittedly I got a bit over-wordy).  We *do* have evidence because we've been looking for them with a process that should have a chance of detecting them.  The fact that that process returned \"nothing found\" is evidence against them.  How conclusive it is depends on how effective it is, and how likely aliens actually *are* (I gave some sample probabilities above), but provided it's possible for it to detect something, absence of detection does provide evidence.  Every year that passes without detecting something reduces the probability of alien civilisations.\n\nIt's the same rationale that sampling a volume of Loch Ness and seeing nothing provides evidence against Nessie.  It may not be *conclusive* evidence, but the more you do it, and the more volume observed without a sighting, the greater evidence there is against the monster.\n\nThere *are* practical arguments that can be made that our instruments are ineffective, and so that the evidence they provide is far too weak to support \"advanced civilisations are rare\".  However if you *do* accept that they're sufficient, I think the probabalistic reasoning is valid. \n\n&gt;It's like columbus hoping he didn't find any civilisations in north america, or else it might prove that his own was doomed.\n\nOnly if he'd known that similarly advanced civilisations were rare ahead of time. However in reality he'd dozens of nearby examples of similar civilisations, and no way to learn about more advanced ones like SETI.  We don't have the luxury of knowing dozens of civilisations, with plenty of histories of how civilisations developed, and so must rely on more limited sources of information.  (There's also issue that *planetary* tech levels aren't independant.  Civilisations communicate, so there's a tendency towards even tech distribution that will distort any such reasoning).   Changing our available information changes the probabilities.  The argument being made requires all of:\n\n  1. Knowledge that advanced civilisations are either rare or short-lived.\n  2. Knowledge that life is neccessary to develop into advanced civilisations.\n  3. Receiving evidence that life is common.\n  4. No other information contradicting this.\n\nIf life was rare, it would be sufficient to explain 1.  If not, there must be another reason.  Some of those reasons are unpleasant for us, so finding that it *isn't* rare would be bad news on that score.\n", "gilded": 0, "created_utc": "1263406547", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "First comment ever to make me spit something I was trying to drink.\n\nThank you, Nessie.", "gilded": 0, "created_utc": "1263433845", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1263507973", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Wow.  I couldn't finish looking at all the pictures of that poster because I pretty much vomited in my mouth.  It is sad to see claims with pretty much no scientific backing on a poster in a classroom for children.  The poster has a picture of what is clearly a cetacean and claiming it to be a plesiosaur.  They might as well be showing pictures of Bigfoot or the Loch Ness monster.\n\nSchool is where children should learn unbiased knowledge, allowing them to think for themselves as they grow up.  ", "gilded": 0, "created_utc": "1263569336", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "&gt; I don't see how you can say that an image generated by a CRT and by an LCD are exactly the same.\n\nWell, since I never said it, I don't have to take responsibility for it. What I said was, when comparing two *identical displays*, one black on white, one white on black, the black text on white display is easier on the eyes for a multitude of reasons -- and I gave the reasons.\n\nSince that remark, a number of people have been trying to raise unrelated issues and wander away from the original topic. But I am not here for a discussion of the entire topic of display technology, I just wanted to make a single point.\n\nNext, someone will say, \"Yes, but what about the orbit of Mars, or the Loch Ness Monster?\" Yes, all right, those may have an effect on display technology -- knock yourself out.\n", "gilded": 0, "created_utc": "1263582277", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "&gt; Oh, but of much importance if one is attempting to apply design-principles that have their origin in badly-lit rooms in monasteries with current technology which makes you stare right into the equivalent of a say 200W bulb or something.\n\nHey, what about the orbit of Mars, the Loch Ness Monster, and what Angelina Jolie had for breakfast? What about that, huh?\n\nAll I said was that, for *two identical displays*, one black on white, one white on black, the black text on white background display is to be preferred. It is always possible to confuse the issue beyond recognition, or we can try to discipline ourselves and focus on one issue at a time.\n", "gilded": 0, "created_utc": "1263582501", "subreddit": "programming", "score": 0, "controversiality": 0}
{"body": "Better de dat tree fiddy dat damn Loch Ness monster tried to get from me.", "gilded": 0, "created_utc": "1263582534", "subreddit": "fffffffuuuuuuuuuuuu", "score": -5, "controversiality": 0}
{"body": "Okay. REQUEST ANSWERED [HERE](http://www.reddit.com/r/circlejerk/comments/aqjx6/i_am_the_loch_ness_monster_ama/).\n\nNow, I need about tree fiddy?", "gilded": 0, "created_utc": "1263701084", "subreddit": "circlejerk", "score": 1, "controversiality": 0}
{"body": "If by \"it\" you mean my dog, then, no. I don't have a dog.\n\nI got laid yesterday by a mermaid. It was super hot.\n\nI have gum, no mints. It'll run ya about tree fiddy.", "gilded": 0, "created_utc": "1263703090", "subreddit": "circlejerk", "score": 2, "controversiality": 0}
{"body": "I ain't giving you no tree fitty! We earn our money in this household!", "gilded": 0, "created_utc": "1263708353", "subreddit": "circlejerk", "score": 1, "controversiality": 0}
{"body": "Yes, the Loch Ness Monster is down with that crack rock steady beat.", "gilded": 0, "created_utc": "1263717153", "subreddit": "circlejerk", "score": 2, "controversiality": 0}
{"body": "But I just need 'bout tree fiddy!", "gilded": 0, "created_utc": "1263717196", "subreddit": "circlejerk", "score": 1, "controversiality": 0}
{"body": "Nessie is a mod there, which is why he defends the dump.\n\nModeration drove me insane as it often actively contributed to the poor quality of discourse. Reddit's karma/moderation system isn't \"free wheeling\", it's *appropriate*, *functional* and overall conducive to adult discourse.\n\nOnly a handful of people at japstoday aren't raving morons or lunatics, but it tends to have a few more stories than other english news sites.", "gilded": 0, "created_utc": "1263760829", "subreddit": "japanlife", "score": 3, "controversiality": 0}
{"body": "Lol at 0.16 when nessie's head flies across the screen.", "gilded": 0, "created_utc": "1263789491", "subreddit": "WTF", "score": 4, "controversiality": 0}
{"body": "Right.  The tree outside your window, your little brother's dog, and your computer monitor also don't believe in leprechauns, fairies, or the loch ness monster.  We don't have words for that though, but since we've got so many insane people on this planet who think it's strange not to believe in an invisible sky wizard we've had to make a word that means \"I don't believe in your bullshit\".\n\nAnd since no one is born with a belief in that bullshit, they're born as, all together now, atheists.", "gilded": 0, "created_utc": "1263797640", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I need a buck tree fiddy.", "gilded": 0, "created_utc": "1263952617", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "If Google gave all its profits to the sites it links to, weighted by number of visits via search, these companies' share would be about tree fiddy.", "gilded": 0, "created_utc": "1263979455", "subreddit": "business", "score": 2, "controversiality": 0}
{"body": "Don't go givin' no German newspaper tree fiddy, woman! You wanna start out at a buck two-five!", "gilded": 0, "created_utc": "1263982805", "subreddit": "business", "score": 4, "controversiality": 0}
{"body": "YOU AIN'T NO VERIZON REP! YOU THE GOD DAMN LOCH NESS MONSTER! I AIN'T GIVIN' YOU NO TREE-FITTY!", "gilded": 0, "created_utc": "1264039017", "subreddit": "AskReddit", "score": 225, "controversiality": 0}
{"body": "Aint no Loch Ness Monster gonna go away if you give him a dolla!", "gilded": 0, "created_utc": "1264044437", "subreddit": "AskReddit", "score": 111, "controversiality": 0}
{"body": "Tree fiddy? I ain't payin you no tree fiddy!", "gilded": 0, "created_utc": "1264056120", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "This has confirmed my thoughts that, verizon is in fact the loch ness monster.  Now if you please I'ma need bout tree fiddy", "gilded": 0, "created_utc": "1264073568", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Women propose? I have not seen that. I have heard about it but I have also heard of the loch ness monster. \n\nI looked at the post because I do resent how female centric marriage is. I resent the whole concept of having to kneel and give her an expensive present *AND* in a fancy ass manner. \n\nAll of this to create a ceremony which is entirely female centric consisting of lame music, fancy clothes, and a whole lot of family around.\n\nThe only thing a man gets out of the deal is a bachelor party. And do you know what a bachelor party represents? The death of a man's freedom. The death of his ability to do what he chooses with his life.\n\nIt all seems very one sided and like quite a raw deal. I cannot imagine what any woman on earth could do to be worthy of so much investment. And yet.... 70% of the divorces are initiated by the female.. The men under goes a complete kow-tow to her. Complete with kneeling. To get divorced.\n\nFuck this whole concept. Fuck it right in the eye.", "gilded": 0, "created_utc": "1264102654", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "About tree fiddy.", "gilded": 0, "created_utc": "1264211968", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "I would pull out my concealed carry weapon and open fire, fatally wounding each of them.  Then one of them would say \"can i some money?\"  and I'd ask how much, and he'd say \"BOUT TREE FIDDY\" ", "gilded": 0, "created_utc": "1264283768", "subreddit": "WTF", "score": 0, "controversiality": 0}
{"body": "Loch Ness Monster?", "gilded": 0, "created_utc": "1264292394", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Sasquatches, Unicorns, T-Rexes, Loch Ness Monsters, Minotaurs, Neanderthals, and Penguins.", "gilded": 0, "created_utc": "1264336879", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "I was actually an agnostic for quite some time. I recently made the switch to atheism after hearing of Russell's teapot.\n\nhttp://en.wikipedia.org/wiki/Russell%27s_teapot\n\nBecause there is no evidence to support the existence of God(s), there is no reason to consider the possibility of its existence. I also don't believe in the Loch Ness Monster, Bigfoot, Santa, the tooth fairy, or skyscrapers on Mars. So, while strictly I am an agnostic with respect to all of these things, the burden of proof falls upon the ones making the claim. \n\nEdit: Russell's Teapot:\nIf I were to suggest that between the Earth and Mars there is a china teapot revolving about the sun in an elliptical orbit, nobody would be able to disprove my assertion provided I were careful to add that the teapot is too small to be revealed even by our most powerful telescopes. But if I were to go on to say that, since my assertion cannot be disproved, it is an intolerable presumption on the part of human reason to doubt it, I should rightly be thought to be talking nonsense. If, however, the existence of such a teapot were affirmed in ancient books, taught as the sacred truth every Sunday, and instilled into the minds of children at school, hesitation to believe in its existence would become a mark of eccentricity and entitle the doubter to the attentions of the psychiatrist in an enlightened age or of the Inquisitor in an earlier time.", "gilded": 0, "created_utc": "1264350929", "subreddit": "IAmA", "score": 7, "controversiality": 0}
{"body": "I cordially invite you to disagree. Yours, Nessie\r\n\r\n    RSVP", "gilded": 0, "created_utc": "1264386966", "subreddit": "entertainment", "score": 1, "controversiality": 0}
{"body": "'bout tree fitty.", "gilded": 0, "created_utc": "1264411931", "subreddit": "Frugal", "score": 7, "controversiality": 0}
{"body": "tree fitty, sir.", "gilded": 0, "created_utc": "1264415693", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "tree fiddy. sir.", "gilded": 0, "created_utc": "1264422544", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "Some say the Loch Ness Monster is actually one of his unsuited and unhelmeted grand children. Some say that Hadrian's Wall was actually built by the Scottish to keep him out... all we know is he's called the Stig.", "gilded": 0, "created_utc": "1264437250", "subreddit": "pics", "score": 195, "controversiality": 0}
{"body": "He needs about tree fiddy.", "gilded": 0, "created_utc": "1264442259", "subreddit": "pics", "score": -6, "controversiality": 0}
{"body": "The Stig *is* the Loch Ness Monster.", "gilded": 0, "created_utc": "1264442446", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "On tonight's episode: we convert cars into submarines in order to search for the Loch Ness Monster. ", "gilded": 0, "created_utc": "1264444537", "subreddit": "pics", "score": 23, "controversiality": 0}
{"body": "Some say he once made sweet sweet love to Nessie and his only natural predator is bagels. All we know is… he's called the Stig. ", "gilded": 0, "created_utc": "1264453298", "subreddit": "pics", "score": 7, "controversiality": 0}
{"body": "He's seeing which is faster: a Ferrari FXX or the Loch Ness monster. ", "gilded": 0, "created_utc": "1264456046", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Anyone notice the street sign with nessie himself on it?\nhttp://maps.google.co.uk/maps?f=q&amp;source=s_q&amp;hl=en&amp;geocode=&amp;q=loch+ness&amp;sll=56.660755,-5.059891&amp;sspn=0.255862,0.606308&amp;ie=UTF8&amp;hq=&amp;hnear=Loch+Ness,+United+Kingdom&amp;t=h&amp;layer=c&amp;cbll=57.225092,-4.573264&amp;panoid=2ZFwqamlzadWYEnVn0sM7g&amp;cbp=12,122.26,,1,18.41&amp;ll=57.224999,-4.573359&amp;spn=0.01078,0.026157&amp;z=16", "gilded": 0, "created_utc": "1264459683", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "So I'm minding my own business when Stig walks up to me out of nowhere and asks for three fitty. Well, it was about that time I realized that wasn't Stig hitting me up for money, it was the gawd damn Loch Ness Monster! I told that monster I ain't giving him no three fifty and hit the road.", "gilded": 0, "created_utc": "1264460025", "subreddit": "pics", "score": 11, "controversiality": 0}
{"body": "Yeah, they really nerfed the exploration.  Worse, resource-gathering is now done through a completely tedious \"scanning\" screen where you have to roam your mouse over an image of the planet while little meters flicker to let you know how close you are to a useful mineral deposit.  Then you hit a button to launch a probe, it sucks up the minerals, and you go back to scanning grid by grid, over and over, trying to get enough minerals to \"research\" all the upgrade schematics you've found.\r\n\r\nI swear to god, it feels like I'm playing something from the paleolithic era of computing.  Aside from the higher-def graphics, the same minigame could have been a component on a C64 game.  Hell, Star Control II had a similar, yet *vastly* superior, explore-and-collect-minerals system... and that was in 1992.\r\n\r\nDon't get me wrong, I'm enjoying the game in all *other* ways...  but the planet scanning is really an embarrassment.  It's the first major flaw I've found in the game, but it's an irritating one.", "gilded": 0, "created_utc": "1264464587", "subreddit": "gaming", "score": 4, "controversiality": 0}
{"body": "Some say that he *IS* the Loch Ness Monster.\n\nAnd that if left unattended, he will go out foraging for haggis.", "gilded": 0, "created_utc": "1264466657", "subreddit": "unitedkingdom", "score": 4, "controversiality": 0}
{"body": "He obviously wants his tree fiddy back.", "gilded": 0, "created_utc": "1264482768", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Religion is so great! Kinda like having super powers combined with the Loch Ness Monster. Amazing powers that only seem to be experienced in a second hand manner.", "gilded": 0, "created_utc": "1264484321", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "OMG the stig *is* actually the Loch Ness Monster.\n\n...it all makes sense now. ", "gilded": 0, "created_utc": "1264520984", "subreddit": "unitedkingdom", "score": 2, "controversiality": 0}
{"body": "...and that he taught the Loch Ness monster to fetch his slippers.", "gilded": 0, "created_utc": "1264521902", "subreddit": "TopGear", "score": 1, "controversiality": 0}
{"body": "I wanted to ask you:\n\n* Is their a possibility -however remote- that creatures bigger than the blue whale still exist in the deep seas? \n\nEg legends like Nessie etc.", "gilded": 0, "created_utc": "1264526056", "subreddit": "science", "score": 5, "controversiality": 0}
{"body": "I need about tree fitty.", "gilded": 0, "created_utc": "1264565535", "subreddit": "atheism", "score": 6, "controversiality": 0}
{"body": "God damn loch-ness monster I ain't gon give you no tree fitty!", "gilded": 0, "created_utc": "1264582332", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "\"that's actually about history\"\nBut the loch ness monster and aliens are a part of actual history! They played a valuable role in WWII, scalping Nazis all over the place.", "gilded": 0, "created_utc": "1264605584", "subreddit": "entertainment", "score": 1, "controversiality": 0}
{"body": "tree fiddy!", "gilded": 0, "created_utc": "1264651067", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Delusion:\nPsychiatry. a fixed false belief that is resistant to reason or confrontation with actual fact\n\nUFOs, astral projections, mental telepathy, ESP, clairvoyance, spirit photography, telekinetic movement, full trance mediums, the Loch Ness monster and the theory of Atlantis are delusions.\n\nA Jewish zombie who is his own father and sacrificed himself to himself to repay a blood debt and save mankind from an eternal punishment he imposed in the first place is her cherished belief.", "gilded": 0, "created_utc": "1264656289", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "With anti-virus, how do you know you have no viruses?\n\nHow can anybody know that there's no Nessie? Illuminati? Duke Nukem Forever? Ney'Tiri? God?", "gilded": 0, "created_utc": "1264689602", "subreddit": "netsec", "score": 1, "controversiality": 0}
{"body": "Nessie!", "gilded": 0, "created_utc": "1264740959", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "&gt; By what logical principle? That premise is simply your opinion. I start from a different premise.\n\n[Occam's Razor](http://en.wikipedia.org/wiki/Occam%27s_razor).  And the fact that *you* believe this and live your life according to the heuristic, even if you claim not to.\n\nIf you shut a door, do you *honestly* believe that the room behind it disappears, or instantly becomes filled with tightly-packed pink elephants?  Or that it stays where it is?\n\nIf we arrange to meet somewhere and I'm late do you conclude that I missed my bus, or that I was abducted by space aliens from Mars who want me to teach them English so they can pass a human in order to steal Earth's water?\n\nCome to think of it, do you believe that you're a human being, or a psychotic mouse with delusions of grandeur?  Or just a brain in a jar, being fed sensory impressions by a computer?\n\nYes yes, I know you can't ever *prove* that isn't the case, but that's the point - in the absence of *proof* you automatically - without even *thinking* about it - believe in and rely on Occam's Razor in something like 99.99999% of the situations you find yourself in.\n\nIn fact, pretty much the only situations where you *don't* apply Occam's Razor are:\n\n* (Apparently) religion, and\n* Sometimes when second-guessing fictional plots\n\nIn fact, there's a name for someone who *doesn't* instinctively apply Occam's Razor in *practically every single area of their life*, and it's \"mentally ill\". &lt;:-)\n\nMy GF's a mental health nurse, and one of the most characteristic features of delusional ideation is the constructions of over-complicated explanations to rationalise simple situations (I didn't absent-mindedly lose my lighter - someone came into my room through a locked door and *stole* it).\n\nAs you seem pretty coherent and stable and show no evidence of insanity I'm pretty secure in my assumption that you also use Occam's Razor to resolve approximately 99.9999...% of the unanswered questions in your life, even if you *claim* not to.\n\n&gt; Besides, I will not concede there is NO evidence for God's existence. Rather, I will only concede there is no direct, empirical evidence for God's existence.\n\nFair point.  However, science tends to disregard subjective experience because it's *known* to be unreliable and, well, subjective.\n\nIn particular if I didn't reject subjective experience then I'd believe the world really *did* move when I got drunk, and if I didn't disregard anecdotal \"evidence\" from other people then I'd believe in Thor, the Loch Ness Monster, the healing power of crystals and that \"jews done 9/11\".\n\nBasically science has *proved* that the brain is often an [unreliable narrator](http://en.wikipedia.org/wiki/Unreliable_narrator), so it's unwise (and irrational) to believe subjective evidence *from your unreliable brain* over empirical evidence (which, by definition, doesn't rely on it).\n\nFor another example, if you wake up one morning and hear the voice of God talking to you, go to a hospital, not a church.  Even if you believe in them, prophets come along at most once every few thousand years, but there are *thousands* of schizophrenics in the world *right now*, as well as millions who randomly suffer undiagnosed or transient temporal lobe epilepsy.\n\nI'm not saying this to anger or offend you, but to explain *why* I reject purely subjective \"evidence\" as inherently unreliable to the point of worthlessness.\n\nYou can *claim* to have had profound religious experiences, but I can *claim* to have been abducted by aliens.  Moreover, I've *experienced* the ground lurching up and down like a sea-swell before, but I don't claim that has any meaning or validity as evidence, because I knew I'd been drinking beer before.  Had someone spiked my drink without my knowing, I'd still conclude that my brain was playing up, not that the entire world was dancing for my benefit. &lt;:-)\n\n&gt; Numerous 12-step programs with proven effectiveness require belief in a \"higher power\" as one of those essential steps. Faith has helped many people deal with mental and emotional issues, particularly grief and depression... These phenomena will never be empirical evidence because they could just be correlations and/or placebo effects -- but they still constitute some evidence.\n\nNot really - I can make you feel just as good by tickling a bit of your brain with magnetic fields, or slipping you a drug.\n\nHypothetically, I could sit you in a chair, tickle your temporal lobes with EM fields and then immediately *kick you in the balls* - you'd experience a powerful feeling of profound love and significance, but that doesn't mean that kicks in the balls are profound or demonstrate love - it just means your brain was compromised so you couldn't trust anything that it showed you or made you felt.\n\nOnly repeatability and empiricality of evidence guards against this - if you get kicked in the balls another time and still feel the same, or you kick me in the balls and I feel the same, it might be that kicks in the balls really *do* have some real effect.  Otherwise it's entirely too easy for you to be mislead by your own brain... especially when (as with TLE) the bit that misfires is *the very part which causes you to feel* faith, awe and profound emotion.\n\nEver had a dream where something happened that nevertheless really, *really* upset you?  And remember how you still felt upset when you woke up?  Did the event in your dream *necessarily* have *any* meaning, worth or validity in the real world, or was it a meaningless brain-fart that you dismissed as best you could?\n\n&gt; Empiricism is the most powerful tool in all of human history, but every tool has its limits.\n\nGranted, but as the person who uses Occam's Razor 99.99999...% of his life and baldly *asserts* that it doesn't apply in one specific situation, the onus is still very much on you to support that assertion.\n\nFor example, if God isn't amenable to rational thought or empiricism, why don't you believe in Glob?  Admittedly he's an entity I've just made up, but he's omnipotent, omniscient, omnipresent, invisible, can violate the laws of physics *and* has a sweet hat, although he's a bit of a prick.\n\nLike God he *also* demands undivided worship, so who do you choose?  Aside from your pre-existing belief (which causes you to *attribute* any previous questionable subjective experiences to God) you have exactly the same amount of reason to believe in Glob as in God.  Or Thor, for that matter.  Or Allah.  Or the Hindu pantheon, or Greek or Roman gods.\n\nWhy do you believe in God, and not in Odin?  Because you *already* believe in God, so you attribute subjective experiences to him, which reinforces your belief in him?  What kind of circular reasoning is that? &lt;:-)\n\n&gt; God declines to be measured or tested in a lab, but that is no reason to conclude God is not real.\n\nGlob declines to be measured in a lab (I *said* he was an awkward prick).  Do you believe in him, too? ;-)\n\n&gt; The rest of your post conflates specific doctrines with belief in God's existence, when the whole point is (supposedly) to recognize that diostinction and show how one necessarily leads to the other.\n\nRegardless of your belief in God, do you believe that there's something special and holy about the *precise form your worship takes*, or is it merely a cultural reflection of the time and place in which you live?\n\nWould you still have been a Christian if you'd lived in ancient Babylon?  Or would you have believed in the Babylonian gods?\n\nI would respectfully suggest that your *faith* is constant, but its *form of expression* changes depending on the culture you're raised in.  So supposing the religion, culture and entire belief-system you're raised in - say, the [Hashshashin](http://en.wikipedia.org/wiki/Hashshashin) - says it's evil to fight on battlefields and waste the lives of hundreds of thousands of people, and more virtuous to conduct surgical strikes against non-combatants and cow your enemy into submission?  Wouldn't you then support of terrorism?\n\nMy point is that if you allow your morals to be dictated to you by an outside force, then unless you're going to claim something stupid like \"I would have been a Christian before Christ even lived\" you have to face the fact that that outside force *can* in principle sway, mislead or simply mis-educate you in the first place.\n\nIf I trust the preachers of my religion to *tell* me what's right and wrong then they can always tell me what's convenient to them, or steer my morals by slowly and gently changing emphasis and/or introducing new elements and priorities.  This is *empirically* possible, because it's what we call [radicalization](http://en.wikipedia.org/wiki/Radicalization), and it's basically what caused 9/11 and most of the attacks since then.\n\nIf my morality [comes from my own rational reasoning](http://en.wikipedia.org/wiki/Kohlberg%27s_stages_of_moral_development), it can still be swayed where someone else has a good argument, but it's much harder to sway me without one.  And if someone has a good, rational argument why I should change my mind that I can't refute, I probably *should* change my mind.\n\nNot so if they merely *happen* to be in a position of authority and I voluntarily delegate the definition of my morals to them.\n\nAlso, please accept my most sincere apologies if I've offended at any point above.  Please don't take any of the analogies above as my mocking your beliefs - at worst, they're supposed to be light-hearted examples intended to make you laugh *and* think, not jabs or attempts to demean your belief system in any way.", "gilded": 0, "created_utc": "1264788130", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "Cryptid Brewing\n\nA Cryptid creature is one that is suggested but not able to be proved by science; think Big Foot, Nessie or El Chupacabra.\n\nThis is the logo for the last one I just did, The Gryphon. Which is more of a fabled creature than a cryptid, but there are really only so many cryptid creatures people are aware of. \n\nhttp://imgur.com/5Z5JO.jpg", "gilded": 0, "created_utc": "1264793064", "subreddit": "Homebrewing", "score": 7, "controversiality": 0}
{"body": "Asians are small, white people are average, and niggers are huge.\n\nI hypothesize that niggers look for something to put there dick into then aids.  also tree fiddy.", "gilded": 0, "created_utc": "1264900680", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "&gt; don't know whether there are 0 or &gt;0 gods, don't believe it CAN be known for sure one way or the other\n\nYou're absolutely correct, it can't be known whether there are 0 or &gt; 0 gods, Just like it can't be be known whether there are 0 or &gt; 0 invisible pink unicorns, 0 or &gt; 0 Flying Spaghetti Monsters, or 0 or &gt; 0 Loch Ness Monsters.\n\nThat said, a rational person would have to admit that there are pretty strong cases to be made for Loch Ness Monster(s), Flying Spaghetti Monster(s), invisible pink unicorn(s), and god(s) all being mere stories made up by humans to scare people, make people feel better, or take people's money.\n\nAt to your main point, though, I agree. Arguing with your spouse about religion will often just make him or her dig in deeper because they won't want to feel bested. Better to argue with total strangers on the internet, where if you end up admitting the other person is right, they won't tease you for it.\n", "gilded": 0, "created_utc": "1264924143", "subreddit": "atheism", "score": 6, "controversiality": 0}
{"body": "She's like the Loch Ness monster and his $3.50\n\nhttp://www.youtube.com/watch?v=9cn7xfBpZ3M", "gilded": 0, "created_utc": "1264937141", "subreddit": "WTF", "score": 1, "controversiality": 0}
