{"body": "[Loch Ness monster caught on tape](http://www.youtube.com/watch?v=aB_c2RwpbXU)", "gilded": 0, "created_utc": "1230854482", "subreddit": "worldnews", "score": 3, "controversiality": 0}
{"body": "Tree fitty.", "gilded": 0, "created_utc": "1230894954", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "I almost agree with you, it's just that your explanation doesn't really work with the History Channel, seeing as how they have no standards.\n\nSeriously, all their shows are about like Nostradamus and the Mayan calendar and the Garden of Eden and the Loch Ness monster.", "gilded": 0, "created_utc": "1230988170", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "&gt; I watched this video with an open mind and weighed the words of both sides.\n\nLOL, did you notice that the video is made by the people making the claims about pyramids? It's a PR piece lacking any objectivity.\n\nStretch your mind and _read_ the scientific references cited in the Wikipedia article.\n\n&gt; These people are not fraudsters.. Western scientists.. mostly concerned with the progression of their careers .. esteem with which they are held by other scientists .. power elite .. United Nations... the Illuminati.. UFOs... the Loch Ness Monster...\n\nI see that you're either as crazy or as fraudulent as Osmanagić.\n\n&gt; The greatest deceptions in the history of our world originate at the top of our hierarchies, \n\nWell, apart from those that come from the desire to make a fast buck by selling a lot of phoney books and documentaries. \n\nAnd those that peddle nationalistic myths while claiming to be \"scientific\", yet without any genuine scientific support. ", "gilded": 0, "created_utc": "1231038227", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "Nessie!", "gilded": 0, "created_utc": "1231091662", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Looking at Wright's body of work; at least the books available on Amazon; it does appear that he takes a particular view about Christ, God, and Christianity.  The titles alone speak volumes about this author's views; *Christians at the Cross: Finding Hope in the Passion, Death, and Resurrection of Jesus*; *Simply Christian: Why Christianity Makes Sense*; *The Last Word: Beyond the Bible Wars to a New Understanding of the Authority of Scripture* -- those are just some examples of titles I found on Amazon.  \n\n&gt;Ok, but I take issue with the idea that a researcher has to have come to one conclusion over any other for their research to be worth investigation.\n\nThat's not quite the issue.  Based on Wright's body of work I am under the distinct impression that his goal is not just to ratify the idea that Jesus existed as a person; but also to attempt to justify the entire belief system that is based upon Jesus' supposed divinity.  **That** is the main problem that I have with attempting to read such a book.  I'm not interested in spending $25 on a book whose author's goal is to justify belief in mythology.  To me, that would be the same as buying a book that claims to be able to prove that Bigfoot and the Loch Ness monster are real; the evidence for such claims simply does not exist--if it did, it would not be revealed in a $25 book.\n\n", "gilded": 0, "created_utc": "1231135234", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "about tree fitty http://www.youtube.com/watch?v=yuB0GUgIB4Y", "gilded": 0, "created_utc": "1231359461", "subreddit": "web_design", "score": 1, "controversiality": 0}
{"body": "Well, what *if* God, acupuncture, Bigfoot, the Loch Ness monster, the chupacabras, alien abduction, spontaneous human combustion, ghosts, ghost orbs, fairies, leprechauns, succubi, urine therapy, Scientology, necromancy, La Llarona, giants, trolls, ogres, werewolves, vampires, dragons, elves, unicorns, sea monsters, golems, reverse werewolves that turn into people when the moon is full, Reptilian aliens from the planet Draco, ESP, Sylvia Browne, voodoo dolls, penis-enlargement pills, those Nigerian emails promising you a million dollars, and everything H.P. Lovecraft wrote about turn out to be **the real deal**?", "gilded": 0, "created_utc": "1231581940", "subreddit": "atheism", "score": 13, "controversiality": 0}
{"body": "It's funny that we don't define ourselves by our lack of belief in unicorns, or the Loch Ness monster.\n\nWish there was a word for \"religiously indifferent.\"\n\n", "gilded": 0, "created_utc": "1232145426", "subreddit": "atheism", "score": 8, "controversiality": 0}
{"body": "What was \"fucking amazing\" to me about this, was the fact that the next night a news-talking-guy on Finnish telly said, and I quote, \"this was not a flying saucer\". Thanks a bunch mister news reporter,  but to be honest I have a feeling that we might have heard about it earlier if it had in fact been a flying saucer. Or a ghost. Or the Loch Ness monster. ", "gilded": 0, "created_utc": "1232381960", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "This reminds me of a poem I wrote for a Creative Writing class in college. Since I have nothing better to do right now, I have decided to share.\n\n&gt;I sit in front of this \n\n&gt;leg of chicken \n&gt;and wonder what a \n\n&gt;giraffe neck tastes like.\n\n&gt;_\n  \n&gt;Perhaps it is like\n\n&gt;the hump of a camel,\n\n&gt;the trunk of an elephant,\n\n&gt;or the blow hole of a whale.\n\n&gt;_\n\n&gt;Or perhaps it tastes more like Bigfoot\n\n&gt;mixed with El Chupacabra, \n\n&gt;add Loch Ness Monster to taste.\n\n&gt;Which probably has a similar flavor\n\n&gt;to a Jackalope or the fur-bearing trout.\n\n&gt;  \n\n&gt;_ \n\n&gt;  \n&gt;Or maybe it just tastes like chicken.\n\n \n\n\n", "gilded": 0, "created_utc": "1232408772", "subreddit": "food", "score": 1, "controversiality": 0}
{"body": "Now all you have to do is spend several years studying and contemplating the existence of dragons, unicorns and the loch ness monster, and you will be WAY ahead of all those clueless atheists! Whether you choose to believe in them or not won't matter so much. What will matter is that you will be extremely well informed, while the rest of us won't have a clue!", "gilded": 0, "created_utc": "1232489661", "subreddit": "reddit.com", "score": -2, "controversiality": 0}
{"body": "&gt;&gt;So in effect, you do admit both sides make assumptions.\n\n&gt;No, i do not. There's only one side making assumptions. The other side does not make anything at all. There's nothing, so nothing to make.\n\nActually, you have to make an assumption to get to \"God doesn't exist.\" Absolutely proving the non-existence of something is usually impossible. Just like Big Foot or the Loch Ness Monster, you can only demonstrate that it is highly unlikely. \n\nSo, logically, both believers and nonbelievers must make assumptions. You cannot arrive at a decision on the existence of God any other way.", "gilded": 0, "created_utc": "1232506473", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "1) Constitution Of The State Of Arkansas Of 1874.\n\nArticle 19. Miscellaneous Provisions. § 1. Atheists disqualified from holding office or testifying as witness.\nNo person who denies the being of a God shall hold any office in the civil departments of this State, nor be competent to testify as a witness in any Court.[2]\n\nPART IV. CRIMES, PUNISHMENTS AND PROCEEDINGS IN CRIMINAL CASES\n\nTITLE I. CRIMES AND PUNISHMENTS CHAPTER 272. CRIMES AGAINST CHASTITY, MORALITY, DECENCY AND GOOD ORDER Chapter 272: Section 36. Blasphemy Section 36. Whoever wilfully blasphemes the holy name of God by denying, cursing or contumeliously reproaching God, his creation, government or final judging of the world, or by cursing or contumeliously reproaching Jesus Christ or the Holy Ghost, or by cursing or contumeliously reproaching or exposing to contempt and ridicule, the holy word of God contained in the holy scriptures shall be punished by imprisonment in jail for not more than one year or by a fine of not more than three\nhundred dollars, and may also be bound to good behavior.[4]\n\nSeparation of WHAT?  Don't ask for more examples, I have plenty.  I could fill PAGES with the asinine religious laws that are still on the books.  Just Google it.\n\n2)  I have answered that a thousand times, and I'm tired of typing it, so I'll cut and paste (please forgive):\n\nthe same could be said of Father Christmas and tooth fairies. There may be fairies at the bottom of the garden. There is no evidence for it, but you can't prove that there aren't any, so shouldn't we be agnostic with respect to fairies?\n\nThe trouble with the agnostic argument is that it can be applied to anything. There is an infinite number of hypothetical beliefs we could hold which we can't positively disprove. On the whole, people don't believe in most of them, such as fairies, unicorns, dragons, Father Christmas, and so on. But on the whole they do believe in a creator God, together with whatever particular baggage goes with the religion of their parents. \n\nScience offers us an explanation of how complexity (the difficult) arose out of simplicity (the easy). The hypothesis of God offers no worthwhile explanation for anything, for it simply postulates what we are trying to explain. It postulates the difficult to explain, and leaves it at that. We cannot prove that there is no God, but we can safely conclude the He is very, very improbable indeed. \n\n-Richard Dawkins\n\nIn my own words, if you can disprove the existence of the tooth fairy, Loch Ness Monster or bigfoot, I'll be happy to \"prove\" there is no god.  :)\n\nI think my point is that you are intellectually lazy.  If you put half as much effort into reading science books and history, you wouldn't be such a lazy apologist.\n\n[Religion does foster bad behavior, and atheist societies are better societies.](http://skeptically.org/hhor/id15.html)\n\nI'm different because I base my life on reason, and not faith as you must (based on your comments).\n\nIf atheists annoy you, tough shit.  We're not going anywhere, and we will continue to shine a light on your bullshit and the intellectual laziness of you and your ilk.", "gilded": 0, "created_utc": "1232522960", "subreddit": "funny", "score": 5, "controversiality": 0}
{"body": "tree fiddy? ", "gilded": 0, "created_utc": "1232618688", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Bread is a new invention from the neolithic era, we're creatures that evolved for the paleolithic era.\n\nEvolution takes longer than a few thousand years.\n\nEating foods that we didn't eat during the paleolithic era is unnatural and our bodies aren't meant to digest it.\n\nHence, cancer, diabetes, obesity, etc etc.\n\nEliminate carbs, eat meat, fruit, nuts (not peanuts, those are legumes), and veggies.\n\nYour health will improve rapidly.\n\nMine did, I went from being on the brink of full blown diabetic (not type 2, different genetic kind) to feeling great.\n\nNote: when weaning yourself off of carbs, you're not going to feel so great for a couple days. It'll pass and then you'll wonder how you survived.", "gilded": 0, "created_utc": "1232921240", "subreddit": "science", "score": -5, "controversiality": 0}
{"body": "Dude could pass of as a loch ness monster by wearing one of those chinese(?) dragon things", "gilded": 0, "created_utc": "1233160635", "subreddit": "videos", "score": 2, "controversiality": 0}
{"body": "That was going to be my response.\n \nThis idiot is like Barry Manilow.  NObody admits to liking him or his \"music,\" but LOTS of people keep buying it.  It's right up there with the Loch Ness Monster and Phoenix Lights in unsolved mystery quotient.", "gilded": 0, "created_utc": "1233294560", "subreddit": "WTF", "score": 3, "controversiality": 0}
