{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1338773893", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "[Gee thanks Obama](http://www.newsmax.com/Newsfront/obama-pays-women-less/2012/04/11/id/435600)", "gilded": 0, "created_utc": "1338831912", "subreddit": "MensRights", "score": 16, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1338859208", "subreddit": "politics", "score": -3, "controversiality": 0}
{"body": "Always wanted a thingamajig! Thanks Obama!!!\n", "gilded": 0, "created_utc": "1338864749", "subreddit": "PoliticalDiscussion", "score": 2, "controversiality": 0}
{"body": "Do you not understand how mob mentality works? Especially at the presidental level. For the four years someone is in office just about EVERYTHING that happens in this country is \"their fault.\"\n\nDeficit rose: Obama's fault, Bin Laden is dead: thanks Obama, the economy is collapsing: fucking Obama and his liberal-muslim agenda.\n\nAs comical as his name may be aspergers-hermit is right. Obama is NOT going to allow himself to go down in history as the first black president and the one who allowed marijuana to be legalized. The media would have a fucking field day and any reputation that man still has left would be destroyed. And before you get into \"Obama's Reputation;\" he has done a fuckload for this country [and I have a ton of respect for the man.](http://whatthefuckhasobamadonesofar.com/)", "gilded": 0, "created_utc": "1338880151", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "You also forgot that Monsanto will use the defense of not being able to control nature to avoid being held accountable. Yet! They use nature as a means of legally going after farmers whose lands their products have invaded.  \n  \nBut with Monsanto in such key positions within the FDA (thanks Obama for that one), there really is little to do in terms of political leverage.  \n  \n", "gilded": 0, "created_utc": "1338948276", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "No more launched. Thanks Obama.", "gilded": 0, "created_utc": "1339076591", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "The one day I took the 405 instead of Sepulveda is the one day I was late to work. Thanks, Obama.", "gilded": 0, "created_utc": "1339096506", "subreddit": "LosAngeles", "score": 14, "controversiality": 0}
{"body": "My toast was cold this morning.\n\nThanks Obama!! ", "gilded": 0, "created_utc": "1339116634", "subreddit": "politics", "score": 8, "controversiality": 0}
{"body": "Thanks Obama for killing the shuttle program, and for somehow getting a State that has nothing to do with the Space program a real Shuttle. ", "gilded": 0, "created_utc": "1339172129", "subreddit": "pics", "score": -1, "controversiality": 0}
{"body": "Thanks, Obama.", "gilded": 0, "created_utc": "1339186805", "subreddit": "politics", "score": 69, "controversiality": 0}
{"body": "I was insured for about 2 months then I grew up.Thanks Obama!", "gilded": 0, "created_utc": "1339196651", "subreddit": "politics", "score": -18, "controversiality": 0}
{"body": "Im on my moms insurance, so thanks Obama, even if it pisses people off. cant understand why anyone would be ok with some one not having health care", "gilded": 0, "created_utc": "1339199829", "subreddit": "politics", "score": 16, "controversiality": 0}
{"body": "The problem is, of course, that a lot of people are idiots and blame Obama for this when it is supremely obvious to people from UHS countries that the real issue lies with the horrible insurance companies and the for-profit model itself.\n\n~~\"Oh no, prices are horrible! Thanks, Obama!\"~~ \"Fucking insurance companies refusing to insure children and charging a god damn billion. Let us get rid of this shitty system and join the rest of the developed world!\"", "gilded": 0, "created_utc": "1339257055", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks, Obama. Thobama.", "gilded": 0, "created_utc": "1339261968", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Last time I said that, I was getting arrested for indecent exposure. Now I'm a registered sex offender.\n\nTHANKS, OBAMA", "gilded": 0, "created_utc": "1339302764", "subreddit": "aww", "score": 5, "controversiality": 0}
{"body": "Let's not fix the economy, let's just get the citizens so high that won't realize how fucked they are. THANKS OBAMA. \n\nYOLO2012", "gilded": 0, "created_utc": "1339368294", "subreddit": "politics", "score": -36, "controversiality": 0}
{"body": "Thanks, Obama!", "gilded": 0, "created_utc": "1339369616", "subreddit": "funny", "score": 28, "controversiality": 0}
{"body": "Temp, temp, TEMP.\n\nIt's a great way to build connections and find yourself a decent long-term career track to settle into. \n\nIn my experience it also pays better than most other entry-level work (which, in my experience, means a service job. Whether that involves serving food or answering a phone all day is a matter of happenstance).\n\nSure, you won't get benefits, but if you were under your family's health plan then you should be covered (thanks, Obamacare) for another few years. This is the best time to do this. You can afford to, and if you really are someone who'll work their ass of and do whatever he's asked, you'll start building relationships with supervisors from a plethora of different industries FAST.\n\nIt's a good way to play the field without long-term commitment but has serious long-term benefits.", "gilded": 0, "created_utc": "1339433637", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1339512311", "subreddit": "politics", "score": -10, "controversiality": 0}
{"body": "Thanks Obama!!!", "gilded": 0, "created_utc": "1339592866", "subreddit": "Health", "score": -12, "controversiality": 0}
{"body": "Hell yea thanks Obama this will help me alot.  My parents brought me here when I was 9 months got my diploma and now I am almost done with my general ed at my local JC without any financial aid.  Not all of us are members of trans national gangs. ", "gilded": 0, "created_utc": "1339773941", "subreddit": "politics", "score": 448, "controversiality": 0}
{"body": "I agree with tenkei. It's an economy that Obama inherited from a president who royally fucked it up and then handed it over to Obama as if it was a game of hot potato, except it's not a hot potato, but the ECONOMY. Honestly, I know this one guy who will talk about the economy and then sarcastically say \"Oh, thanks Obama.\" Bitch please, Bush messed it.", "gilded": 0, "created_utc": "1339774294", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Seriously?!? Wow..another reason to hate Obama. This country is going to shit faster than a Kenyan marathon runner.\n\n\nThanks Obama, thanks alot bro, now it's just going to be even harder for white citizens like myself to get a job. I'm sure these new young illegals you plan on letting in are willing to work for a lot less. \n\n\n\nEDIT: Fuck...I knew this was going to happen...reddit actually likes this and are thanking Obama...oh god kill me now.", "gilded": 0, "created_utc": "1339785951", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Great job :) I'm really happy about this all, too. The majority of my old high school was made up of immigrants, and the majority of those were illegals (this led to varying classes sizes and upset throughout the years because there would be raids one or two nights every few months, and half the class would be gone the next day, and you can't say goodbye to friends - one of my friends lost her prom date two days before prom one year; the kids aren't even the ones who chose to come here, but they suffer for it). Particularly, my brother-in-law now doesn't have to worry so much about going outside, getting aid so he can go to school, or finding a decent job anymore :) He moved here when he was two, and his parents completely screwed up their paperwork; he did not find out he was illegal until he was 18. He and my sister moved up their wedding date when they found out he was going to be deported - they were already engaged anyway - but that doesn't actually give you legal status immediately - it just delays the inevitable. His deportation date has been set back time and time again, but he was given a final one a month ago for the middle of this August, and that would be it. Now things definitely look up. Thanks Obama :)", "gilded": 0, "created_utc": "1339805132", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Thanks Obama staffer. We all remember how effective Bush was. He was a moron that was hated by even his own supporters and yet he got everything he wanted. I think most of us have a problem with Obama because he doesn't bother trying. He cuts deals before he negotiates. \n\nBut incremental \"change\" right? Obamney 2012!", "gilded": 0, "created_utc": "1339826326", "subreddit": "socialism", "score": 2, "controversiality": 0}
{"body": "Thanks, Obama's new immigration initiative will help my family a lot. ", "gilded": 0, "created_utc": "1339832197", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "He took my state by 2.5+ million votes, then proceeded to completely abandon us. Thanks, Obama! \n\nBut am I surprised? No. Politicians will mostly do cold political calculations instead of valuing the support.", "gilded": 0, "created_utc": "1339858543", "subreddit": "socialism", "score": 5, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1339939404", "subreddit": "politics", "score": -8, "controversiality": 0}
{"body": "Thanks, Obama and wocco!", "gilded": 0, "created_utc": "1339949741", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "Interesting.\n\nIf we do take the Hume analogy with morality-as-percept, that would seem to run into some difficulty accommodating people who change or 'evolve' (thanks Obama!) their moral positions.\nNotwithstanding politically expedient *claims* of a change in moral percepts, we probably do have to have a model that can account for how peoples perceptions of morality evolve over time.\n\nThere are some interesting findings in developmental psychology that outline fairly common pathways in which peoples moral senses evolve over time, and their relation to capacity for abstract thought at the very least on their way to adulthood; and of course we would be presumptuous to ignore further changes subsequent to that.\n\nThere may be ways to reconcile morality-as-percept with this, but it seems far from obvious how.", "gilded": 0, "created_utc": "1340054576", "subreddit": "philosophy", "score": 1, "controversiality": 0}
{"body": "&gt;Dead Afghanis are labelled 'terrorist' and undeserving of even body counts.\n\n[Thanks Obama.](http://www.salon.com/2012/05/29/militants_media_propaganda/singleton/)", "gilded": 0, "created_utc": "1340070075", "subreddit": "news", "score": 2, "controversiality": 0}
{"body": "Don't worry, they'll just get bought by the bigger banks that are too big to fail.\n\nThanks Obama.", "gilded": 0, "created_utc": "1340110565", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "You had me right up until the \"Thanks Obama\" part. You are right about many of them being bought up by large wall street banks, but very wrong about who is to blame for that.\n\nFirst, bank takeovers have been going at a feverish pace for 2 decades now. This was accelerated by the removal of regulation at the end of Clinton's presidency and then further during Bush's. Second, you then use the term \"too big to fail\" and attempt to pin that on Obama who was not in office when the financial crisis struck (that was Bush) and did not orchestrate the bailouts of said institutions (that was also Bush).\n\nYou could say that Obama has not done enough (or anything really) to change the status quo, but that clearly isn't what you are trying to say.", "gilded": 0, "created_utc": "1340116565", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Allies are in? Ugh, thanks Obama.", "gilded": 0, "created_utc": "1340130606", "subreddit": "Warhammer", "score": 3, "controversiality": 0}
{"body": "nope \n\nhigher gun ownership has decreased the crime rate for 2011 \n\nthanks obama for scaring the shit out of white people that they needed guns to protect themselves from the upcoming government takeover we all see coming. ", "gilded": 0, "created_utc": "1340143401", "subreddit": "politics", "score": -3, "controversiality": 0}
{"body": "I stubbed my toe today, Thanks Obama-care!", "gilded": 0, "created_utc": "1340166315", "subreddit": "AdviceAnimals", "score": 1, "controversiality": 0}
{"body": "&gt;Doctors' pay will be determined by the quality of their care, not how many people they treat.\n\nThis is such a wonderful little thing. It sounds so beautiful and sweet - aww, the doctors will be incentivized to really care about their patients! Who could be against that?\n\nThe reality: doctors are now incentivized to *not treat sick people*, because their 'quality of care' score will go down if the sick person gets worse or dies. This pays doctors to only treat healthy people, or people with easily treatable diseases. If your condition is life-threatening and/or rare, you will *not* find a doctor after this takes effect.\n\nOn a side note, my insurance costs are going up 44% this year. They didn't do that before Obamacare was signed. Thanks Obamacare!", "gilded": 0, "created_utc": "1340201364", "subreddit": "explainlikeimfive", "score": 9, "controversiality": 0}
{"body": "&gt; On a side note, my insurance costs are going up 44% this year. They didn't do that before Obamacare was signed. Thanks Obamacare!\n\nCorrelation does not imply causation.", "gilded": 0, "created_utc": "1340203835", "subreddit": "explainlikeimfive", "score": 23, "controversiality": 0}
{"body": "Yea, thanks Obama for the worst economic recovery on record!\n\nBut when the next slump gets here then the benefits will kick back in.  \n\n*it is a fact that this \"recovery\" is the [worst recovery in the history of the US](http://online.wsj.com/article/SB10001424052702303816504577311470997904292.html), so why the down votes? Way to actually address my comment instead of just down voting me, stay classy r/Texas ", "gilded": 0, "created_utc": "1340208271", "subreddit": "texas", "score": -5, "controversiality": 0}
{"body": "The companies to the east stopped polluting the air. Thanks Obama!", "gilded": 0, "created_utc": "1340218678", "subreddit": "houston", "score": -8, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1340239969", "subreddit": "politics", "score": -11, "controversiality": 0}
{"body": "DODGED A BULLET. THANKS OBAMA.", "gilded": 0, "created_utc": "1340312258", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Outsourced to a 3rd world country. *Thanks, Obama.*", "gilded": 0, "created_utc": "1340354531", "subreddit": "AdviceAnimals", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!  If we can get to $2.50 by election day, gas prices will only be about 40% higher than when you took office!", "gilded": 0, "created_utc": "1340377536", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "i quit my job at the smoke shop on wednesday, and I'm going to be a professional with business trousers on monday. growing up is hard to do, but i got a job, so i guess, thanks Obama :)", "gilded": 0, "created_utc": "1340385810", "subreddit": "eldertrees", "score": 3, "controversiality": 0}
{"body": "Remember when all the Republicans were all \"$4.00 gas this summer, thanks Obama!\", and all the Dems were \"This is still Bush's fault\" and then nothing because $2.50 gas. ", "gilded": 0, "created_utc": "1340387073", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Thanks Obama...", "gilded": 0, "created_utc": "1340389689", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks OBAMA!", "gilded": 0, "created_utc": "1340392070", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Just in time for the election. Imagine that. \n\nThanks Obama. ", "gilded": 0, "created_utc": "1340396864", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1340550364", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "If she's a 30 Rock fan, there's a bit where Liz's ex-boyfriend says \"I don't have health insurance. Thanks Obama.\" Perhaps she's trying to be sarcastic?", "gilded": 0, "created_utc": "1340565764", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Thanks Obama, you really helped the world on this one!\n", "gilded": 0, "created_utc": "1340576199", "subreddit": "worldnews", "score": -1, "controversiality": 0}
{"body": "Very interesting. Perhaps the framing of the very possibility of true alternatives in terms of the aggrandized idea of \"saviorship\" is a clue to what the problem is. From the standpoint of the man behind the man behind the curtain, this would seem to be one of the ideal horizons that is deployed (*so to speak*: I'm not making this out to be a very willful imputation on your part here) to put to rest any real attempts at fundamental change or even just thought. Or, worse, *thouhtaction*, something that is irreducibly both thought and action, in which the two are intersubmitted (which the are most of the anyhow!)\n\nThe \"all\" of \"all are punished\" appears to be quite good. The prudent take would of course be \"most are punished\". Who would I view as being outside that \"all\"? Those working in areas genuinely disruptive of the prevailing mentalities (which together make \"the machine\" or \"The Man\" of today).  But not figures one would first thing. [Marty Price](http://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;ved=0CJMEEBYwAA&amp;url=http%3A%2F%2Fwww.vorp.com%2Fbio.html&amp;ei=4G7pT4HYCuf16AGTieHyDA&amp;usg=AFQjCNFg0W1ryEP8emTHEk3O_Q8Fyud6tg&amp;sig2=ht-8zUGyUedetYxM3clszg), for example, working in [restorative justice](http://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;ved=0CKQEEBYwAA&amp;url=http%3A%2F%2Fen.wikipedia.org%2Fwiki%2FRestorative_justice&amp;ei=j27pT4GoNsGN6QG35b2rDQ&amp;usg=AFQjCNEX8O2r4xYYasbYHOgeHswfZBIVqQ&amp;sig2=tY0vKw7I0O1DNVyv2GC1_g), the [University of Minnesota's](http://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;ved=0CJMEEBYwAA&amp;url=http%3A%2F%2Fwww.cehd.umn.edu%2Fssw%2Frjp%2F&amp;ei=yG7pT4TfMciZ6QG2x-XuDA&amp;usg=AFQjCNEf0c-znNykFCmR9IOVbq8fNuxp8g&amp;sig2=Qt5CXJpU1xez8mtKcq7Wog) department in the same. Such alternative justice runs radically counter to the emotional and logical cache of the dominant themes of justice that permeate culture in innumerable ways. As such, these promise more along the line of genuine saviorship for humanity than just about anything going on today. But to commit to such a mode of justice requires a radical change of thought and orientation, one that puts in suspension and ultimately radically \"deconstructs\" (I would say here \"enconstructs\") the dominant motives and forms of litigiousness that inhere in both specific sites of justice as such as well as broader forms of polemic that drive many machinations at work, working together to form what I call, metaphorically, \"the furnace\" behind the illusion of \"rampant materialism\"; I suggest that the dominance of materialism really derives from the tendency towards illusion of retributive justice, while the perpetual war against materialism wages on in this complex structure. \n\nAs for asking me where it leaves me, I'm all for that! Please do. In bold! By all means.\n\nFor me this critique is essential, and I claim that I submit myself to it quite regularly. Whether, on the other hand, the usual saviorship that is operating today is too complicit, that's another question. I view most as being just that: too complicit. I'm not a big fan of the Dali Lama. I don't hate him. Breivk, well, what can you say? It's certainly worth analyzing (which I've done, informally, of course, BTW, and linked his kind of outburst and violence as parallel with someone like the LA Fitness shooter). I can explain on request.\n\nYour read is good but superficial, of course. The sketch you give doesn't have quite enough substance to ground the necessary alternativity that would be in order. But your formulation, I must again stress, leaves the question of that alternativity formulated in terms that are highly problematic. Let me come at it in the following way: I'm a serious Gandhian. More or less. But I stress repeatedly that I never, ever say \"Mahatma\" Gandhi. I say Mohandas, or even Mohan, for emphasis of this point, while I do occasionally add the gesture of respect in the form \"Gandhiji\". Together the point about this is by putting \"saviorship\" up too high, we absolve ourselves of any real possibility of undertaking genuine change.\n\nBut that change itself is a problem. It points to \"revolution\", does it not? And I am decidedly not about that, according to the very principle of critique, self-critique, you so appropriately demand. The very concept of revolution must, likewise, be submitted to such critique, if for no other reason than that the history of revolution is one that is rife with violence. In response to this, I favor what I call \"envolution\". Envolution lies between evolution (that's the other thing that's always being anticipated) and revolution, which sort of takes the bull by the horns. The structure of envolution lies in realizing that one, **me** or **you** is oneself in the position of having to undertake, and that is part of the hoped-for evolution and the to-be-questioned operation of revolution. Envolution enters existing structures and forms and initiates, but doesn't frame this in the total form implied by revolution, or probably evolution (one is forceful, the other seems to more or less totally eschew that kind of \"direct action\"). I won't unpack that more here, but I will mention a series of other basic forms that parallel envolution: enarchy (no mere eschewing of archical forms), enconstruction (not merely deconstructive), and in response to the general idea of \"critique\", since this has been brought up, a certain transcendence that one might call \"enscendence\", although I'm not sure about that. Together these come under the general rubric/form nonviolence and amelioratie thoughtaction. The \"thoughtaction\" part, which parallels the use of the term \"spacetime\" in physics, simply better denotes the complex admixture of both thought and action as they operate in institutions, policies and various moments of popular culture. It parallels \"praxis\", but is less congealed; a hybrid, paralleling Gandhian *satyagraha*, it has an irreducible form that can be variously opened and inflected on one side or the other. \n\nI wouldn't go so far as to say that the critique in and of itself is useless, any more than Daniels' speech is useless. It's a great speech, really. I referenced it in my rant, BTW, which gives the lie to the idea that I'm simply totally critqueing, althogh I certainly did use a deliberately provocative and arched form in my rant, picking up, really, on the spirit of his character's rant/speech.\n\nYour statement, \"if not a also a self critique, then you must certainly fancy yourself as some great modern savior of humanity\", is faulty. It seems that you are saying that if it is not self-critical as well, *then* one is positing alternatives. (Notice that I've shifted the aggrandized form to \"alternatives\"). I think maybe you meant it the other way? Not sure, but in any case, I'm saying that the possibility of such alternativity does lie in part in precisely the sort of self-critque you are demanding, and that without it, one posits no saviorship at all and is merlely a meta-cynic criticizing meta-corruption. Which wouldn't have been evident in that critique, aside from its momentum, which could be a clue. Fair, you say, but again, here the way you've laid out being self-responsible such critique casts one in this dubious and in any case all-too-rare role of some \"elevated\" being, a quasi super-species, ubermensch or rarified being, all of which I most strongly oppose as ruses. Terrible ruses, indeed. Witness, for example, Jean-Bertrand Aristide's error in this regard, in that while he referenced such figures as Gandhi in relation to the difficult oppression by th Macoutes in Haiti at one point, he cast those famous personages as being systematically superior to him, he a mere moral, they, idealities or whatever. Thanks, Jean-Bertrand. And thanks, **you**, for likewise doing the same. And while I'm at it, thanks Obama for casting Gandhi and MLK as mere idealistis (without whom, permit me to note, he would not be president) while going on to quote GWB in his Nobel Peace Prize acceptance speech: \"but there is evil in the world\". There you have the status quo in a nutshell. \n\nNo, sir, I am a genius. *And so are you*. You just don't realize it yet most likely.\n", "gilded": 0, "created_utc": "1340699912", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "(Throwaway because it's about my penis.)\n\nRandom Arab-American atheist Redditor here. This anti-circumcision crusade is misguided and arrogant.\n\nNeither I nor my two brothers were circumcised as kids. My folks were advised that it wasn't medically necessary, that it dulled the nerves, etc etc. There was no family history of issues, but since all men my parents' age and up had been circumcised as infants, there was no real history to go off of. For that and many of the reasons discussed here, my folks decided to skip it. \n\nFast forward 30 years, two of the three of us have had to have painful, embarrassing, *expensive* operations to have our dicks fixed because my folks chose to pass the buck.\n\nI ran into a problem around 25, where every time I'd try to have sex my foreskin would pull so hard on my dickhead via the \"rubber band\"-like flap called the frenulum that it would tear and I'd bleed like a stuck pig. Seriously, some gross shit. Worse, I couldn't jerk off or fuck for 2-3 weeks after it happened (or it would just tear back open), and after two months of this I realized that this wasn't a temporary thing, it was an issue. Went to a urologist, who told me this happens in lots of uncircumcised guys of my ethnicity, and learned that basically my dick had outgrown my frenulum's ability to stretch. 2 months and $2500 later (thank you American healthcare system) I'd had a &lt;30-minute operation called a frenulectomy, and could finally wank off and fuck again. \n\nOne of my brothers had to have a full-on circumcision, took him out of commission for two weeks while he literally had to sit around hopped up on percs with his dick hanging out of his shorts. Dumbest thing I've ever seen, but perfect blackmail material. Fortunately he was covered under my parent's health insurance (thanks, Obamacare) so I understand it cost a lot less.\n\nBottom line is that when my son is born I'll absolutely have him cut. Is it medically necessary? Not according to my doctor or prevailing medical knowledge. But I'm going to do it because I've been on the receiving end of the consequences when something goes wrong.\n\n**TL;DR:** Circumcision isn't evil. I wasn't cut and 25 years later it cost me $2500 and 3 months of wanking &amp; fucking when my dick stopped working properly. Ditto for one of my brothers. I will absolutely have my son cut to save him from this.", "gilded": 0, "created_utc": "1340732979", "subreddit": "worldnews", "score": -1, "controversiality": 0}
{"body": "My husband from Hawaii is expecting soon! So excited.. thanks Obama for really breaking the barriers with male pregnancy and same sex marriage. ", "gilded": 0, "created_utc": "1340863715", "subreddit": "youtubehaiku", "score": 5, "controversiality": 0}
{"body": "Coming from west Texas, I wholeheartedly agree. Sadly, since the south is forever red in a Nixonian permanency, it will take an act of God to change southern states blue. \n\nI constantly see ignorance and idiocy posted on FB by all my friends, with a tacked on \"THANKS OBAMA YOU BIG &lt;censored&gt; GO DIE YOU SOCIALIST CLOWN\".....for things that Obama had nothing to do with. \n\nHowever, they'll blindly support Mitt Romney, the guy who's going to lower capital gains/hedge funds tax and fuck over the 99%. It's a wonder that man ever got to be the Republican nominee for anything besides looking like a president. However, being so inundated in the Republican south, people view this out-of-touch, incredibly wealthy Mormon as their savior.\n\nlolwat", "gilded": 0, "created_utc": "1340895869", "subreddit": "politics", "score": 19, "controversiality": 0}
{"body": "1% of AGI on even 100K is going to be like $650. I pay ~300/mo for insurance now. I'll just pay the tax and get insurance when I get sick.\n\nThanks Obama!", "gilded": 0, "created_utc": "1340898516", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "Ralph (who's not quite so broke): Hey.... I make a little bit more than Mary, so I don't qualify for the 95% subsidy.  Screw it. I'll just pay the fine... it's much smaller than the cost of an insurance policy, and hell... if I ever need health care, I'll just go out and buy an insurance policy. They can't turn me down!  Thanks, Obama!\n\n(2 months later) Ralph:  Wow... cancer. That sucks.  I guess I better get an insurance policy now.  Hello?  Insurance Company?  Hello?\n\nInsurance Company (recorded message): I'm sorry, but we are no longer in business.  It turns out (who could know) that unlimited liability is really bad for business.  We had all these guys in the middle class who we were forced to provide policies for on the day they got their dire diagnosis, so we on month 1, we took in $200 from the guy, and paid out $90,0000.  Next month was pretty much the same.", "gilded": 0, "created_utc": "1340905366", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "Right. Thanks Obama for the largest tax increase on the middle class... ever.\n\nAnd the rich are laughing all the way to the bank while the income inequality continues up and up. ", "gilded": 0, "created_utc": "1340910981", "subreddit": "politics", "score": -6, "controversiality": 0}
{"body": "Thanks Obama!\n", "gilded": 0, "created_utc": "1340912693", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "How about we cancel the 1 trillion dollar war on drugs, the two three trillion dollar wars that no one wants(oh wait, already cancelled one of those, thanks Obama!). Then take the taxable income from the people that aren't bankrupted for the rest of their lives when they get sick and count that non-lost income as part of the payment?\n\n   If you are really concerned about waste, find real waste. If your only problem is that it's Obama's plan, grow up. If you really want to see sick people suffer and die, get serious psychological help.", "gilded": 0, "created_utc": "1340914365", "subreddit": "gifs", "score": 1, "controversiality": 0}
{"body": "&gt;Congratulations America. More people are going to have health care.\n\nAt the expense of self-autonomy. Let's just count the ways in which we keep losing our freedoms.\n\n* warrantless spying on every American's communications\n* indefinite detention\n* airport molestations (coming to a train/bus station near you!)\n* PERPETUAL CUSTOMER OF A PRIVATE ENTITY\n\nWow. Now that's the change I voted for. Thanks Obama! \n", "gilded": 0, "created_utc": "1340921342", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "The hospital screwed me out of $4k. Thanks Obama you totally didn't cover any of that!", "gilded": 0, "created_utc": "1340945390", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1340946737", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "I'm already double and triple taxed sometimes. So what's new? \n\nI'm taxed on my income. When I buy something with that income, I'm taxed again with a sales tax. Even buying a house now comes with a sales tax (thanks Obama). Every year I pay property taxes on a house I was already taxed on. \n\nEx: I earn income, I'm taxed on it. I buy an MP3 player, I'm taxed on it. I sell the MP3 player, I have to report that profit as income and I'm taxed again. Now I use the profit from the MP3 player to invest and earn interest. I'm taxed on the interest. \n", "gilded": 0, "created_utc": "1340973950", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "But the benefits for the insurance company is terrific.  Thanks Obama!", "gilded": 0, "created_utc": "1340984960", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "The people who are going to get skanked here are the 20-35 yr olds who are now going to be paying (through the nose) for all the soon not to be working, or buying (thanks to medicare) health insurance baby boomers. They will be heading over the hill into nursing homes at your expense. Thanks Obama. ", "gilded": 0, "created_utc": "1340985585", "subreddit": "politics", "score": -5, "controversiality": 0}
{"body": "Thanks Obama for keeping the good fight on drugs going!! Keep up the good work!", "gilded": 0, "created_utc": "1341000133", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "Thanks Obama and Progressives for passing the largest regressive tax increase on the Middle Class in history!\n  \nI'm sure you will be well awarded for this come November.  Just like 2010!", "gilded": 0, "created_utc": "1341009011", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "the majority of the new customers will have such high deductables that they won't be using this new toy the messiabama and his astroturfing hordes brought us either.\n\nthanks obama!\n\nhttp://www.motherjones.com/politics/2010/12/wikileaks-cable-obama-quashed-torture-investigation\n\nfor nothing you piece of shit.", "gilded": 0, "created_utc": "1341014743", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Are you kidding me? We're going to make those 30 million buy a policy, a policy that in all likelihood will be the only shitty policy they can't afford.\n\nOh, what about all these high risk people being made to buy policies?? I'm sure that won't raise premiums... Won't it be nice to be forced to buy insurance when the premiums go up??? Thanks Obama :D\n\nI'm sure this individual mandate won't incentivize employers to drop their coverage because the individual is now by law responsible for insuring themselves, and did I mention the increased premiums?? This won't be a clusterfuck or anything :D\n\nYour ignorance of economics is as good as my knowledge of it :D :D :D\n\nThis will be really good for the struggling middle class.", "gilded": 0, "created_utc": "1341021111", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks OBAMA!", "gilded": 0, "created_utc": "1341085369", "subreddit": "woodworking", "score": -2, "controversiality": 0}
