{"body": "Yes, but sadly this is like saying \"Hitler would be a better president than Satan\". Agreed, but not terribly useful.\n\nAdded: hey thanks, Obamabots. Sad about your gullibility thing though.", "gilded": 0, "created_utc": "1259712057", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "More battlefield promotions coming, every General and wannabe is Happy! Thanks Obama, the deaths of more US service personnel will pave the way to much fatter retirements for the Senior Officers you love so well! As a veteran of Vietnam, I am learning to Hate you.", "gilded": 0, "created_utc": "1260319171", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "'09 Convertible Mini Cooper\r\n\r\nThanks, Obama!", "gilded": 0, "created_utc": "1260486424", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Doesn't matter at all, no matter what someone runs on once a motherfucker gets in office it's all the same, no real shit happens. Obama was the change guy right but it's the same old shit - always was and always will be no matter what. Al's right on now but he will change IF elected - like anyone else would. I've lost faith in politicians (again goddamnit, thanks Obama).", "gilded": 0, "created_utc": "1261186302", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "&gt;it also provides $500M to the Palestinian Authority in the West Bank. \n\nHey, you forgot to mention that the $500M comes with certain conditions.\n\n&gt;The conditions include recognizing Israel, renouncing violence and accepting past agreements signed with the Tel Aviv regime. \n\nI didn't see any conditions attached to the $2.775B that a despotic regime who has an official policy of apartheid got. Oh, well. Thanks, Obama.   ", "gilded": 0, "created_utc": "1261263877", "subreddit": "worldnews", "score": 7, "controversiality": 0}
{"body": "I'm mad because I didn't get the remote control car and pony Obama promised me for voting for him last year :(\n\n&gt;THANKS OBAMA!\n\nAh yes, blame the President.  Heaven forbid droopy would take responsibility for his actions and vote.\n\n", "gilded": 0, "created_utc": "1261433349", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Thanks Obama, you shit!", "gilded": 0, "created_utc": "1261470975", "subreddit": "WTF", "score": 15, "controversiality": 0}
{"body": "...and at the same time, put all good, decent, hard-working Americans on the hook to pay the tab.\n\nThanks Obama....you are officially the WORST president this country has ever had.", "gilded": 0, "created_utc": "1261757304", "subreddit": "politics", "score": 0, "controversiality": 0}
