{"body": "I'm loving this Whitehouse petition thing; it's disillusioning a lot of people about representative democracy at this pivotal moment in American history when we've got the biggest *direct* democratic movement ever going on across the nation. It's almost like they set out to prove beyond a shadow of a doubt, on a point-by-point basis, that \"representative\" democracy is not democracy at all. When you think about it, the idea that some rich stranger who wouldn't know you from Adam could possibly \"represent\" your interests in government has always been kind of kooky on an intuitive level. \n\nThanks, Obama!", "gilded": 0, "created_utc": "1320176127", "subreddit": "programming", "score": 70, "controversiality": 0}
{"body": "Maybe she'd appreciate the eggs since she can't afford food (thanks, Obama).", "gilded": 0, "created_utc": "1320201912", "subreddit": "funny", "score": 13, "controversiality": 0}
{"body": "So well do away with patents for software, thus making open sourced stuff more easy and efficient to use and copy. But we'll put up a massive firewall to protect big business and their revenue. Sounds awesome. Thanks Obama.", "gilded": 0, "created_utc": "1320209845", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "I'm loving this Whitehouse petition thing; it's disillusioning a lot of people about representative democracy at this pivotal moment in American history when we've got the biggest direct democratic movement ever going on across the nation. It's almost like they set out to prove beyond a shadow of a doubt, on a point-by-point basis, that \"representative\" democracy is not democracy at all. When you think about it, the idea that some rich stranger who wouldn't know you from Adam could possibly \"represent\" your interests in government has always been kind of kooky on an intuitive level.\n\nThanks, Obama!", "gilded": 0, "created_utc": "1320213204", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1320262124", "subreddit": "gaming", "score": 27, "controversiality": 0}
{"body": "&gt;We should also be thanking the new regulations the Obama administration put on the banks.\n\n**Are you INSANE!?**\n\nThanks to Obama's Credit Card Reform, my Citibank APR went from 14% in 2009 to a staggering 20% in 2010. Never been late either. Of course I was offered an opt out, IF A PAY OFF MY DEBT. Thanks Obama. Your administrations naivete and pandering to the socialists cost me an extra $50 a month.\n\nSure, thanks but no thanks.", "gilded": 0, "created_utc": "1320373749", "subreddit": "politics", "score": -15, "controversiality": 0}
{"body": "Thanks, Obamabot.", "gilded": 0, "created_utc": "1320447390", "subreddit": "starcraft", "score": 10, "controversiality": 0}
{"body": "What happens when a dude like Rick Perry gets the authority to kill American citizens? Thanks, Obama.", "gilded": 0, "created_utc": "1320532123", "subreddit": "Libertarian", "score": 5, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1320614564", "subreddit": "Economics", "score": -8, "controversiality": 0}
{"body": "It is particularly offensive because broken families are largely the result of the war on drugs, which Obama has expanded.\n\nThanks, Obama.", "gilded": 0, "created_utc": "1320619541", "subreddit": "MensRights", "score": 7, "controversiality": 0}
{"body": "Thanks Obama...", "gilded": 0, "created_utc": "1320636086", "subreddit": "politics", "score": -7, "controversiality": 0}
{"body": "Thanks Obama. ", "gilded": 0, "created_utc": "1320702872", "subreddit": "pics", "score": 29, "controversiality": 0}
{"body": "lol yeah they used to have to pay their employees back then... now they got rid of all those employees and profits are up.. thanks Obama  \nlmao\n", "gilded": 0, "created_utc": "1320703054", "subreddit": "politics", "score": -3, "controversiality": 0}
{"body": "Thanks Obama - if we still had a space program in America then I would have missed out on watching the Chinese and the Russians.  ", "gilded": 0, "created_utc": "1320739213", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "THANKS OBAMA!!!", "gilded": 0, "created_utc": "1320947505", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "Thanks Obama\n\n\n\nEdit: and dont act like only people with rich parents can afford this, its kind of insulting", "gilded": 0, "created_utc": "1321139796", "subreddit": "gaming", "score": -1, "controversiality": 0}
{"body": "I would like my flair to say THANKS OBAMA because he got me a sandwich once and I forgot to thank him. Thanks!", "gilded": 0, "created_utc": "1321169196", "subreddit": "circlejerk", "score": 1, "controversiality": 0}
{"body": "In the five years before the health care law passed, my health plan at work got progressively more expensive. Double-digit yearly premium increases, increased co-pays and decreased benefits, every year for five years running.  \nIn the two years since the law's passage, there have been no premium increases, some of the more onerous co-pays (like $400 for many common tests, a rule that was constantly and erroneously applied by hospitals to x-rays and ultrasounds) have been decreased, benefits have increased and the lifetime maximum is gone. \n\nThanks Obamacare! ", "gilded": 0, "created_utc": "1321239948", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "I don't think we know if trans sexuality is the result of opposite gender brain chemistry. I think in order to know that for sure we'd need to crack a bunch of skulls of fetuses and test their head goo. But we can't. Thanks Obama. ", "gilded": 0, "created_utc": "1321335252", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Just another waste of our tax dollars. Thanks Obama! ", "gilded": 0, "created_utc": "1321394151", "subreddit": "seaents", "score": 3, "controversiality": 0}
{"body": "More absurd mob-thug shakedowns by the Feds. [Thanks Obama!](http://www.washingtontimes.com/news/2009/feb/05/dea-led-by-bush-continues-pot-raids/?page=all)", "gilded": 0, "created_utc": "1321397021", "subreddit": "Cascadia", "score": 8, "controversiality": 0}
{"body": "Progressivism rules!   Thanks Obama!", "gilded": 0, "created_utc": "1321544505", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "This is what the country looks like after the progressives have taken over.\n\n\nIt's sick.  Thanks Obama!", "gilded": 0, "created_utc": "1321553915", "subreddit": "politics", "score": -9, "controversiality": 0}
{"body": "Thanks Obama for the change! ", "gilded": 0, "created_utc": "1321569627", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1321625561", "subreddit": "funny", "score": 23, "controversiality": 0}
{"body": "The Marine is right. He makes me hate myself for ever complaining. Skip the Art History degrees and major in something that will actually be able to pay off your student loans. Don't blame Wallstreet for mistakes that Obama made. Not saying Obama is a BAD President, he simply didn't do enough. 3 years into his Presidency and he proposes a jobs bill? Gee, thanks Obama. Elect a Republican when the economy sucks, elect a Democrat when it's strong. Stop occupying wallstreet, and occupy a job, or a classroom, or do some charity work. You're only wasting your time, we don't have much of it.", "gilded": 0, "created_utc": "1321668935", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "If you look at the charts it was doing fine until Progressives took over in 2006.   Then it went to shit.\n\nThanks Obama and the Progressives!", "gilded": 0, "created_utc": "1321669377", "subreddit": "politics", "score": -6, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1321739464", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks, Obama. ", "gilded": 0, "created_utc": "1321745579", "subreddit": "worldpolitics", "score": 2, "controversiality": 0}
{"body": "Thanks Obama ", "gilded": 0, "created_utc": "1321821061", "subreddit": "AskReddit", "score": -3, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1321830020", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "Monsanto, finding innovative new ways to fuck humanity and the world every year.\n\nFirst they did Agent Orange... now they're basically in charge of our food supply (thanks Obama for appointing a Monsanto man to head the USDA).\n\nI want to know who is really behind this company.", "gilded": 0, "created_utc": "1321831513", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Yeah, all it did was make me sad that there was never a Luigi's Mansion on the Wii.\n\nThanks, Obama.\n\n(...ok, that's not ALL I thought, because I really enjoyed that thing)", "gilded": 0, "created_utc": "1322110675", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1322264999", "subreddit": "politics", "score": -8, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1322385693", "subreddit": "politics", "score": -5, "controversiality": 0}
{"body": "Thanks Obama, people should know that the white house isn't a fucking church.", "gilded": 0, "created_utc": "1322401938", "subreddit": "atheism", "score": 23, "controversiality": 0}
{"body": "The linked article and *unclefred's* headline indicate neither has any idea why the doughnut hole exists and why eliminating it drives UP healthcare costs in the US.\n\nThanks, Obamacare.  ", "gilded": 0, "created_utc": "1322404521", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Patients usually have choices when it comes to medications.  The drug companies know that.  That's why they spend so much money advertising to the consumer and selling to the doctor.  Drug companies want the doctors to prescribe their highest cost/highest profit drug and they want consumers to believe on the high cost/high profit drug will treat them.\n\nThe \"doughnut hole\" coverage encourages patients (consumers) to select the lower cost drugs if they can.  The lower cost drugs, some of which are generics (but not all), will be paid for completely by the Medicare coverage.  \n\nPatients are free to choose higher cost drugs, but they must pay the costs themselves... up to a point.  Once the patient has paid a certain amount out of his/her own pocket (think \"deductible,\" but called the \"doughnut hole\") the Medicare coverage kicks in again and pays most of the rest.\n\nIt is a serious attempt to hold down healthcare costs by allowing choice and encouraging the \"cost-saving\" choice with extra financial incentives.  Even the more expensive choice is still partially paid by the coverage.  \n\nThe majority of the people wanted Obamacare to address the rising **costs** of healthcare and try to do something to increase **access.**  The resulting law is almost exclusively targeted at access and does virtually nothing to control costs.  In fact, celebrations aside, closing the \"doughnut hole\" will cripple one of the few attempts to reign in costs.\n\nThanks, Obamacare.", "gilded": 0, "created_utc": "1322407370", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "What? Now I can't drink toilet water? Thanks Obama. ", "gilded": 0, "created_utc": "1322507698", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "Now you can get arrested for talking about black people?  What happened to the First Amendment?  Thanks, Obama.\n\n\n\n*I know this was Britain.  sarcasm*", "gilded": 0, "created_utc": "1322523581", "subreddit": "videos", "score": -4, "controversiality": 0}
{"body": "First Law of Thermodynamics WTF? It's 2011, come on. Ron Paul introduced a bill to overturn it, but the Republicans blocked it. Thanks, Obama.", "gilded": 0, "created_utc": "1322579601", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1322582798", "subreddit": "Economics", "score": -10, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1322644349", "subreddit": "politics", "score": -5, "controversiality": 0}
{"body": "Thanks Obama, my friend has dystonia and you shut down his dispensary which was following all the stupid rules San Diego has. Now he has drive across the city to get his meds from a shittier place. Hope and Change. ", "gilded": 0, "created_utc": "1322676336", "subreddit": "politics", "score": 21, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1322676338", "subreddit": "nyc", "score": -1, "controversiality": 0}
