{"body": "Thanks Obama!!!!", "gilded": 0, "created_utc": "1267568398", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Hey, I live in Ca. and we have dispensaries which are largely untouched now so \nThanks Obama..and that's sincere.", "gilded": 0, "created_utc": "1267663564", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "&gt; you can still get class B clove cigarettes\n\nNot anymore. Thanks Obama!", "gilded": 0, "created_utc": "1267707220", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "Thanks Obama for keeping Roe v. Wade in there, couldn't have stopped the bill faster.  One Term Presidency is in the bag.", "gilded": 0, "created_utc": "1267769167", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "More time to Torture, that's what need! Thanks Obama, more torture than Bush...", "gilded": 0, "created_utc": "1268809306", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "How does this mean we need healthcare reform? The guy was likely at fault for getting HIV in the first place (homosexual anyone?).\nI have great insurance, and they won't ever drop me since I'm not irresponsible enough to get AIDS.\nThis is just more liberal propaganda to convince the population that BIG GOVERNMENT is in their best interest. \n\nIf people like the guy in the OP took more PERSONAL RESPONSIBILITY then they wouldn't have to ask the fucking government to regulate everything.\n\nBut as usual, the hardest-working people (the ones with real jobs) are now going to have to pay more so that some lazy poor person with AIDS can sit around watching TV all day while receiving free medication.\n\nThanks, Obama.", "gilded": 0, "created_utc": "1268926337", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "&gt; If we want to call ourselves a democracy we should demand that our news sources be more than a right wing version of the fucking Pravda.\n\nRight wing aliens are going to start visiting Earth? Thanks, Obama.", "gilded": 0, "created_utc": "1268935861", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "If that is true and it passes, then I predict that my current insurance (mostly covered by my employer) will go away, and I will be required to pay 8% of my income to buy this new insurance. (Why would it be less than the legal maximum of 8%?)\r\n\r\nYay! Instant poorer-ness!\r\n\r\nThanks Obamacare!", "gilded": 0, "created_utc": "1268944889", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Well that really sounds like Healthcare to me!\n\nOr rather a Bill of Attainder (http://en.wikipedia.org/wiki/Bill_of_attainder) applying to the finances of anyone who can't or won't buy his Obama care policy. I guess either the government or the Health Insurance Companies behind this Bill will benefit from your money - just not you!\n\nOne thing that really sucks is that with no competition and policies only available from the Health Insurance Cartel (a legal monopoly), prices will be so high the everyone in the US will end up with the least insurance legally possible (and the least coverage). Even employers will have no choice but to reduce the quality of coverage in the face of skyrocketing  costs! \n\nSo you see Obama care gives some Healthcare and the rest of us far worse Healthcare.\n\nThanks Obama - now we know never to ask YOU for another solution to our problems!", "gilded": 0, "created_utc": "1269112762", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Where exactly is here? Now I'm forced to pay for insurance that I don't want.\n\nThanks Obama, like I didn't have enough money problems.", "gilded": 0, "created_utc": "1269239469", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "&gt;Taylor Swift just smiled at me! Love Nashville...love Sweet CeCes!\n \n\n&gt;Healthcare passed!!! Whoo! [user/calebroy ]\n \n\n&gt;Finally.\n \n\n&gt;hey, the House isn't so bad after all. hurray!\n\n\n[This is where it gets interesting; you can tell who was paying attention to the news]\n\n&gt;well......goodbye freedom, hello communist nation. :/\n\n\n&gt;who's moving to Europe with me?\n\n\n&gt;the federal government now owns my soul. epic fail tonight\n\n\n&gt;THANKS OBAMA!!!!!!!!! [sarcasm]\n\n\n&gt;became a fan of Midgets  and 6 other profiles. [lulz]\n\n\n&gt;The Health Bill isn't perfect, but I'm happy to see progress.\n\n\n&gt;is proud to be an American, especially on nights like this.\n\n\n&gt;is thinking the more she hears about this healthcare bill the more she hates it.\n\n\n[I did convince someone to take down their angsty status. Win! Edit: I can't get them to break apart; each line is a separate status, obviously]", "gilded": 0, "created_utc": "1269269784", "subreddit": "pics", "score": 11, "controversiality": 0}
{"body": "One of my friends posted this \"Well...I used to want to go to med school. Thanks Obama for making a lifetime of hard work completely futile and stomping on my hopes and dreams. Stupid liberals.\"\n\nIt took every thing i had to not reply \"poor girl, you mistook wanting to be rich for wanting to be a doctor\"", "gilded": 0, "created_utc": "1269306228", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "The new healthcare bill extends coverage to age 26, I think that's what OO meant by thanks Obama. ", "gilded": 0, "created_utc": "1269327115", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Exactly, this is awesome! My Aetna stock is up 2% in the two days since this bill has passed!! Thanks Obama, you are making the health insurance companies (and me) richer!!!", "gilded": 0, "created_utc": "1269373579", "subreddit": "politics", "score": 7, "controversiality": 0}
{"body": "All guns should be free I want 3 noveskes, 3 LMTs and and an LWRC I want 2 of every model of the Arsenal AK milled and stamped.  I want 2 P90s and 2 five sevens ... 5 Walther P99s and 5 Walther PPSs ummm... I want 100,000 rounds a month in each caliber... and I want 3 sig 556 .. I want a few MP5s ... Oh I want a few SPA12 and Benelli shotguns.  A few Mosseberg 500s and 590s Some Remington 870s... 2 Dan Wesson 1911s 4 Night Hawk 1911s...  One of each WW2 gun.  I want a .50 cal... Oh yeah the entire Glock collection... 2 sets... I want a bunch of accessories for all of them Some HK USPs ... and some other stuff... Thanks Obama!!!", "gilded": 0, "created_utc": "1269377246", "subreddit": "guns", "score": 0, "controversiality": 0}
{"body": "there is an awful lot of everyone un/underemployed people right now. Thanks Obama.\r\n\r\nBut Pete, he is one funny Dude!", "gilded": 0, "created_utc": "1269539444", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "1) Am I correct in assuming that Health Insurance is not really mandatory?\r\nAnswer, not only mandatory but is now LAW. Nobody gives you insurance, but you are now mandated to have it one way or the other.\r\n\r\n2) Can the IRS fine me because i have no health insurance after I file a tax return? \r\nAbsolutely, Obama is hiring 16000 new IRS agents to enforce this new law. They can and will keep your tax return if you are deemed to not have \"sufficient\" insurance coverage. The newly super powerful IRS will check you insurance coverage monthly and you will be fined accordingly. Thanks Obama!!\r\n\r\n3) If I am without Health Insurance and I attend an Emergency Room, I will get treated then fined (by the IRS?) ? Yes, treated AND fined\r\n\r\n4) Is the fine a once off fee? Or am I now enrolled into this \"Emergency Room\" insurance pool?\r\nEvery month Brother. no such thing as One Off here..", "gilded": 0, "created_utc": "1269551706", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "No, now you will have to survive it.\r\n\r\nThe economy is in slow motion collapse. \r\nSo will the currency. \r\nThanks Obama.", "gilded": 0, "created_utc": "1269631278", "subreddit": "business", "score": 0, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1269640242", "subreddit": "news", "score": 0, "controversiality": 0}
{"body": "AT&amp;T will pass these costs on to their consumers, thanks Obama, and dig a little deeper in your wallet to pay your AT&amp;T bill.", "gilded": 0, "created_utc": "1269743137", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks Obama for closing the loophole \n(sim, you are stupid, so shut up)", "gilded": 0, "created_utc": "1269751616", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "&gt;a legislator who passes laws infringing on people's freedoms.\n\nI no longer have the freedom to not buy health insurance. &lt;/pedant&gt;\n\nThanks, Obama.\n\n", "gilded": 0, "created_utc": "1269755917", "subreddit": "obama", "score": 0, "controversiality": 0}
{"body": "And they likely got a tax cut from Obama already.  I did.  My wife and I made 7% more gross income in 2009 than 2008 *and* paid 3% less tax, (even with the 2008 deductions I got to take as a result of \"sustaining damage to a wood-framed structure in a federally-declared Midwest Flood Disaster Area\").  So we made more money, didn't have a big deduction and still paid less taxes.  That's a nice cut.  Thanks, Obama.  No one on the right will talk about this.", "gilded": 0, "created_utc": "1269879142", "subreddit": "politics", "score": 29, "controversiality": 0}
{"body": "obama also said all troops would be out of iraq/a-stan within 16 months (at the rate of 1 brigade per month). well, 16 months came and went, now we're sending MORE troops to a-stan. thanks obama!", "gilded": 0, "created_utc": "1269965647", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "Since I track my income and returns in a spreadsheet I can tell you my wife and I made 7% more gross income in 2009 than 2008 and paid 3% less tax, (even with the 2008 deductions I got to take as a result of \"sustaining damage to a wood-framed structure in a federally-declared Midwest Flood Disaster Area\"). So we made more money, didn't have a big deduction and *still* paid less taxes. That's a nice cut. Thanks, Obama.  No one on the right will talk about this, mainly because it makes them look stupid when they acknowledge that taxes went down.", "gilded": 0, "created_utc": "1269983678", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "No they do she admits it later say the government works pay less bu that means nothing as they get paid byb the government.\r\n\r\nChina buys our debt to we buy stuff from them.\r\n\r\n8-24 year ols will have to pay off the current mess. Thanks obama voters.", "gilded": 0, "created_utc": "1269997813", "subreddit": "Economics", "score": -10, "controversiality": 0}
