{"body": "It is now, thanks to Obama signing this bill into law and not vetoing like he threatened to do, a lot harder to undo these laws. We are worse off as a nation. Thanks Obama. I just hope the other guy you're running against is a lot worse.", "gilded": 0, "created_utc": "1325377230", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama ", "gilded": 0, "created_utc": "1325452730", "subreddit": "AskReddit", "score": 19, "controversiality": 0}
{"body": "thanks obama!", "gilded": 0, "created_utc": "1325475374", "subreddit": "politics", "score": -8, "controversiality": 0}
{"body": "And once they call you a terrorist, you will go to a concentration camp forever.\n\nThanks Obama.\n\nVote Ron Paul - He is not perfect but the only possible chance left.", "gilded": 0, "created_utc": "1325528107", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "THANKS OBAMA.   ", "gilded": 0, "created_utc": "1325557524", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Or indefinite detainment! Thanks Obama!", "gilded": 0, "created_utc": "1325712849", "subreddit": "Anarchism", "score": 3, "controversiality": 0}
{"body": "&gt;we aren't still torturing people\n\nWhat......?\n\n&gt;Dodd Frank\n\nMore government bureaucracy. Because that's worked out so well in the past. It essentially puts all the blame on the private sector and does nothing to handle how the government or the FED conducts itself.\n\n&gt;Don't Ask Don't Tell\n\nI'll give you that.\n\n&gt;Bin Laden\n\nI'm not voting for a man who is fucking everything else up just because he killed Bin Laden. Especially if that man is taking away more of my rights than Bin Laden ever could. I'm more afraid of the Government now than I am of terrorism. Thanks Obama.\n\n&gt;Iraq\n\nHe was simply following a time-line outlined by Bush. Sure he followed it but he also spent months bombing Libya. He's still a war-mongerer.\n\n", "gilded": 0, "created_utc": "1325815505", "subreddit": "ronpaul", "score": 1, "controversiality": 0}
{"body": "I think this one might be a winner. I was at the end of a 9 day canoe trip with my brother on the Colorado River. \n\nWe had been camping with almost no food. If we did not catch fish we did not eat.  We had a stringer with 3 large fish on tied up just off shore. We were on our way back to our camp spot when I saw a coyote trying to get to our fish. I grabbed my 22. The only gun I had and fired off a warning shot to scare it away. Then I fired off 10 more rounds for the fun of it. \n\nWhat I did not know is that I was on a National Park.  Two L.E.O. were called out by someone on a houseboat about 500 yards away.  They hiked in 2 miles to were we were, right around dusk and snuck to within about 60 yards from us. They both pop up, pointed their M16’s at us and yell: “Park Rangers hands on your heads”. They said it too fast so I kindly asked them to slow down and enunciate. This did not amuse. They again screamed for me to put my hands on my head. I told them to calm down and stop pointing M16’s at two unarmed campers. Again not amused. They kept screaming at us as they walked the last 60 yards. (I never put my hands on my head) One kept his assault rifle pointed at us while the other violated every one of our constitutional rights.  \nAfter almost three hours of them illegally searching everything we had. They found my gun in its case and a small pipe.  They charged me with possession of a firearm in a National Park. (which is now legal. Thanks Obama!) Discharging a firearm in a National park And possession of drug paraphernalia. It did not help that I was talking shit the whole time. \nI showed up to court in a suit, clean cut and with a stack of supporting case material.  In court there is some law that witnesses cannot hear each other’s testimony, so I asked the officer’s to step out. The prosecution said they were not calling them as witnesses, so I said I was. They had to sit out side; they were bummed. When I did call them I only asked them one question. I just wanted to fuck with them.  \n\n The SCOTUS had just ruled (like a week earlier) that in order to be convicted of a drug offence the lab tec that did the test must be there to testify. The prosecution did not know that.  So I got the pipe lab results suppressed. There was no one to testify that I shot the gun, and when they asked me if I had, I said no. Throughout the trial I had shown that the cop was lying. He said the gun was not in a case, it was, they had it. He said there were shells on the ground that he didn’t pick up and submit into evidence. There were not. (I pick up all my brass so they were in my pocket.)  So I asked why he didn’t find it relevant to collect the ones on the beach. He did not have an answer. \nHe said that his dispatch sent him out on a call that there were 2 men with a gun and a canoe. I had the dispatch report and all it said was someone heard shots. That’s it. His report did not match up to his testimony. \nThe trial went on for four hrs. The judge didn’t give a ruling right then. He said he wanted to review some of the evidence. But it was obvious I made them look like the liars they were. They all knew they lost the case. Bad. \nOne month later I received a letter from the court the judge said he felt the officers were being dishonest. He found me not guilty on all charges.\n\n The sergeant called me after he received the judge’s decision and apologized for the actions of the officers and informed me that they would no longer be working for the forest service, or any L.E. It felt great they were such dicks to me and the whole time I was on the beach I was telling them that when this goes to court they are going to get fucked. And they did!\n BTW: I really was guilty of all charges. But they couldn’t prove it. \n\nTL;DR: Smart ass L.E.O were dicks. I not only got off, but I got them fired.       \n\n\n\nEdit: The only law I broke was discharging a firearm, in a National park. I did not know I was in a National park. There were no signs, nothing to let me know I had entered one. It did not say I was in a National park on my map. It was the middle of nowhere. The nearest road was 2 miles away.  The pipe was found with rolling papers and smoking tobacco. Not weed! My brother was smoking out of it. It was not mine but I was the one with the big mouth so I got the ticket. It had been use for weed before. But they never would have found it if they had not violated my 4th Amendment.  The cops left the tobacco out of the report.  \n \nI got everything suppressed and them fired because they violated several of my constitutional rights. That is the way all our rights are enforced if a L.E.O. violates them the information he/she obtains by doing so is suppressed in court. \n\n\nEdit #2: 1) If you're mad someone who was technically guilty got off. You should be mad at the officers. They are the reason for the not guilty. \n  2) If you're mad they got fired, then you should be mad at them, not me. They brought this upon themselves. If they were honest and did not violate The Constitution Of The United States Of AMERICA they would still have their job.", "gilded": 0, "created_utc": "1325884184", "subreddit": "IAmA", "score": 9, "controversiality": 0}
{"body": "Thanks, Obama.", "gilded": 0, "created_utc": "1325973465", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Yes, so we should go with the alternative. Continue to dramatically increase the size of government, continue to be the policeman of the world, continue going down the path of tyranny.\n\nNo thanks, Obama, and the congress and senate for that matter, should be removed from office and put away in Guantanamo. ", "gilded": 0, "created_utc": "1326044795", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1326320816", "subreddit": "politics", "score": -6, "controversiality": 0}
{"body": "Wow, good thing there are no greater atrocities/injustices  in the world to worry about. I mean whatever happened to a good hearty laugh at something that you find absurd. We always have to sue someone. So you don't believe in something. Big Deal. What till this girl gets into the real world. Daily life is full of stupid stuff that you don't believe. She gonna sue everyone over everything and waste a shit ton of her life doing it? lol I mean get a life man, seriously. \n\nPut some time into knocking down Sopa or Defense Authorization Act(thanks Obama)...I think being detained without trail indefinitely is a little more worth the time and effort...just sayin'", "gilded": 0, "created_utc": "1326345678", "subreddit": "atheism", "score": -6, "controversiality": 0}
{"body": "Reddit is being monitored, and your chats are being stored in their databases.  Thanks Obama.", "gilded": 0, "created_utc": "1326374592", "subreddit": "politics", "score": 16, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1326382905", "subreddit": "Economics", "score": -7, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1326422469", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "I forgive you for indefinitely detaining my father now! Thanks Obama!", "gilded": 0, "created_utc": "1326442471", "subreddit": "pics", "score": -1, "controversiality": 0}
{"body": "Thanks Obama, now just come out against NDAA and you won't be a worthless president!", "gilded": 0, "created_utc": "1326561440", "subreddit": "politics", "score": -7, "controversiality": 0}
{"body": "THANKS OBAMA!!!", "gilded": 0, "created_utc": "1326613633", "subreddit": "WTF", "score": -3, "controversiality": 0}
{"body": "Obama followed Bush's plan to the letter on getting out of Iraq. Thanks Obama", "gilded": 0, "created_utc": "1326666803", "subreddit": "occupywallstreet", "score": 5, "controversiality": 0}
{"body": "10% inheritance tax in Skyrim? Thanks Obama.", "gilded": 0, "created_utc": "1326756648", "subreddit": "skyrim", "score": 6, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1326768524", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "Thanks for fixing that, it was very deceiving.  This is why I don't have insurance.  Thanks Obama.", "gilded": 0, "created_utc": "1326815236", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "So we get the The National Defense Authorization Act instead?  Sprinkle a little anti-religion into the mix and the sheep will be satisfied with ANYTHING.\n\n\n\nYea ... I will vote for the man that has passed one of the most liberty killing bills in the history of this country because he stated that laws must not be based upon religion.  \n\n\n\nNO THANKS OBAMA.  YOU MAY FOOL THE SLEEPING SHEEP AGAIN BUT NOT ME.", "gilded": 0, "created_utc": "1326845971", "subreddit": "atheism", "score": -1, "controversiality": 0}
{"body": "Thanks, Obama!", "gilded": 0, "created_utc": "1326866835", "subreddit": "nosleep", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1326935701", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Obama sacrifices 20,000 jobs minimum to pander to an extreme minority segment of his base.\n\nThanks Obama!", "gilded": 0, "created_utc": "1326935885", "subreddit": "politics", "score": -17, "controversiality": 0}
{"body": "That is my husband, he came home on leave today. We had kiss in 7 months!! Sadly his tour overseas was extended and will be going back for longer than planned. Thanks obama and your \"bring the troups home\" deal, pfffft. I will enjoy my time to the fullest!", "gilded": 0, "created_utc": "1326942593", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1326999788", "subreddit": "Libertarian", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1327001254", "subreddit": "Economics", "score": 1, "controversiality": 0}
{"body": "Remember that instead of closing Guantanamo down, Obama expanded it so that American Citizens can now be put there and held indefinitely, without trial.  Thanks Obama... you piece of shit..", "gilded": 0, "created_utc": "1327005963", "subreddit": "WTF", "score": 9, "controversiality": 0}
{"body": "Thanks, Obama looks so happy lol", "gilded": 0, "created_utc": "1327013796", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "I'm literally in the waiting room at Planned Parenthood reading this good news. Thanks, Obama :)", "gilded": 0, "created_utc": "1327094997", "subreddit": "TwoXChromosomes", "score": 6, "controversiality": 0}
{"body": "Thanks Obama", "gilded": 0, "created_utc": "1327102464", "subreddit": "worldnews", "score": -1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1327119088", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I'll just point out one of the many things I don't agree with in your statement - birth control has MANY uses besides contraception. It it very often used as medical therapy for a wide variety of diseases and health conditions, including endometriosis, which is what I use it for. It helps to slow down the growth of uterine tissue in the rest of my pelvis, which is incredibly painful. It has nothing to do with me keeping my legs closed.\n\n I am incredibly grateful to be under my parent's health insurance for the next few years until I turn 26 (thanks Obama), because otherwise my medical costs would be astronomically higher (thanks to a myriad of doctors visits, surgeries, birth control, pain medicine, and other prescriptions.) Though I am still in daily pain, I am so grateful that I am fortunate enough to be able to receive treatment for a condition which I don't really have a choice in.\n\nP.S. In case anyone was curious, they said something along the lines of \"If you can't afford car insurance, don't drive. If you can't afford birth control, keep your legs closed.\"", "gilded": 0, "created_utc": "1327119230", "subreddit": "TwoXChromosomes", "score": 12, "controversiality": 0}
{"body": "Holy crap. Amazing. You don't usually see politicians standing up to something like this. Thanks Obama for restoring some of my faith in mankind.", "gilded": 0, "created_utc": "1327127848", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1327151034", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Have you noticed how this country has gone to complete shit?  It started when Reid and Pelosi took over Congress in 2006 and gotten worse when Obama took the White House in '09?\n\nThanks Obama!", "gilded": 0, "created_utc": "1327174746", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1327253564", "subreddit": "Economics", "score": -19, "controversiality": 0}
{"body": "Thanks Obamanomics!", "gilded": 0, "created_utc": "1327286523", "subreddit": "politics", "score": -10, "controversiality": 0}
{"body": "Thanks Obama. ", "gilded": 0, "created_utc": "1327299906", "subreddit": "SRSBusiness", "score": 3, "controversiality": 0}
{"body": "[Credit card bill of rights](http://www.whitehouse.gov/blog/2010/08/23/your-credit-card-bill-rights-now-full-effect) was a big one.\n\nThen there's this [sweeping bank-reform bill](http://www.marketwatch.com/story/obama-signs-sweeping-bank-reform-bill-into-law-2010-07-21-12200) that he signed into law.\n\nYou know how banks are no longer allowed to re-order your deposits from highest to lowest, increasing the amount of overdraft fees you pay?  Yup, thanks Obama.  You know how they're also not allowed to just increase your interest rates on credit cards because they feel like it?? Yup, thanks, again Obama. You know how they now have to actually *tell* you all the fees and stuff before you sign up? And how if you use your debit card now, and don't have money, it gets declined rather than run through, amassing huge fees... all thanks to those bills. (That only top of really high level stuff, that's just the stuff that applies to us, directly)\n\nThose things really didn't make it to Reddit because Reddit doesn't appear to like when Obama does something good, so if this website is your only source of news, you're missing out.", "gilded": 0, "created_utc": "1327335612", "subreddit": "economy", "score": 2, "controversiality": 0}
{"body": "thanks obama eel.....", "gilded": 0, "created_utc": "1327460315", "subreddit": "AdviceAnimals", "score": 1, "controversiality": 0}
{"body": "I had forgotten, due to the Primaries, that we don't have to vote Republican. Thanks Obama for reminding me I can support you in the 2012 race.", "gilded": 0, "created_utc": "1327464738", "subreddit": "politics", "score": 16, "controversiality": 0}
{"body": "I invested my life savings, 3 months of 60 hour work weeks, and lost the woman I loved to host the first ever International Zamboni Olympics. \n\nI simply knew I was the best driver out there, and had to prove it. Operating a Zamboni, on or off the ice, comes naturally to me. Cutting ice is like making love or breathing: it is a constant and pure expression of my very being. Like the yin and yang, Sauron and the ring of power, or Kermit and Miss Piggy; when I am united with a Zamboni, I feel truly complete and powerful.\n\nDespite my intense passion and unsurpassed skill, the event was a horrible failure. Almost no one attended, and after hours of waiting and a bottle of celebration \"champagne\" I decided it would be a good idea to drive the Zamboni down to taco bell for some dirt tacos. Despite following all traffic laws, I was pulled over for operating a \"highly illegal vehicle while intoxicated,\" which is a felony offense and carries a 6 month prison sentence. Apparently the Zamboni was recently moved into in the same class of vehicles as mining trucks and wheeled cranes over 60' (thanks Obama).\n\nI only recently got out of prison, but my reputation is tarnished, and I am no longer legally allowed to drive and/or operate a Zamboni in the state of California. I really don't know what to do with myself. A part of me died that day. Maybe I can fake my death and begin anew in a new state. Perhaps South Dakota. ", "gilded": 0, "created_utc": "1327470579", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1327506077", "subreddit": "starcraft", "score": 1, "controversiality": 0}
{"body": "thanks obama!  laws were confusing, it's easier now that i just have to trust in you!", "gilded": 0, "created_utc": "1327532342", "subreddit": "news", "score": 21, "controversiality": 0}
{"body": "THANKS OBAMA.", "gilded": 0, "created_utc": "1327610638", "subreddit": "pics", "score": 37, "controversiality": 0}
{"body": "I didn't have insurance, and then I wrecked my car. But when I went to an insurance company to make them pay for it, they laughed at me. Now, thanks to Obama, I was able to go back to the insurance company and make them pay for my busted car. Thanks Obama.\n\nRead that? Yup, that's what we are talking about. It's called health INSURANCE. Want to hear another story? I'm in management at the company I work for. Every year for the past three years, my personal health insurance costs have gone up. Every year for the past three years, the company's insurance costs have gone up. As a company, we have tried to insulate our employees from some of this, but it is a huge burden, since we already offer great benefits compared to other companies. As an employee, none of that insulation has mattered. The funny thing? I can trace at least a portion of all of these increases DIRECTLY to changes in the health care bill that have lead to either fewer options being available for insurance, or new taxing on benefits.\n\nYes, the sob story sounds sweet, but there is another side.", "gilded": 0, "created_utc": "1327685138", "subreddit": "pics", "score": -1, "controversiality": 0}
{"body": "\"I had no insurance when I crashed my car last week, but thanks to Obama-care, I was able to force a new insurance company to pay for my repairs. thanks Obamacare !\"", "gilded": 0, "created_utc": "1327715859", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "As the article says, they have 2 bureaus in the US.\n\nThat said, it pisses me off royal when americans post anti-obama nonsense on UK articles.\n\nAnything about high taxes or government administrative failures and its\n\n&gt; Thanks Obama for bringing european socialism to us!\n\nServes me right for reading the comments, I suppose.", "gilded": 0, "created_utc": "1327738873", "subreddit": "unitedkingdom", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1327759791", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "WHAT WE NEED INSTEAD ARE CORRUPT GOVERNMENT OFFICIALS TO BE DEPENDENT ON!\n\nTHANKS OBAMA FOR GIVING US THIS!", "gilded": 0, "created_utc": "1327844128", "subreddit": "TrueReddit", "score": -6, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1327865118", "subreddit": "worldnews", "score": -2, "controversiality": 0}
{"body": "Unfortunately, mine is censored because of ACTA. \n\nThanks, Obama. ", "gilded": 0, "created_utc": "1327868017", "subreddit": "AskReddit", "score": 154, "controversiality": 0}
{"body": "Eight out of the ten top questions were about marijuana, yet it was not even mentioned in the god damn interview. Thanks Obama. Glad to know you care about America's opinions.", "gilded": 0, "created_utc": "1327965901", "subreddit": "trees", "score": 11, "controversiality": 0}
{"body": "&gt; The health care industry has been taking your money for ever increasing costs over the last 20+ years.\n\nThey haven't been taking my money; I'm no sucker. I've been paying cash from a health savings account. (I usually even get a discount for keeping clinics' administrative costs down.) *Now,* on the other hand, under Obamacare, I am required by law to give my money to those same corporations that you hate so much. I am obligated to buy something I don't want. Thanks, Obama!\n\n&gt; but when people take their money back it is called theft\n\nWho the hell is \"taking their money back?\" That's a very...unique way to look at this situation.\n\n&gt; I have to pay for fat asses who eat like shit, smoke, then want medicare/ medicaid in their old age but want to take away from me when i get older.\n\nAnd why do you \"have to pay\" for that? Is someone forcing you? Who could it be?", "gilded": 0, "created_utc": "1328030877", "subreddit": "Libertarian", "score": 1, "controversiality": 0}
