{"body": "A perfect encapsulation of the attitude of the Health Care industry: \"Fuck you and fuck off.\"\n\nThanks Obama &amp; democrats!  This is why we needed HCR.", "gilded": 0, "created_utc": "1270227089", "subreddit": "news", "score": 8, "controversiality": 0}
{"body": "That's illegal now. Got to McDonands do not pass go do not collect $200.\r\n\r\nThanks obama. ", "gilded": 0, "created_utc": "1270508757", "subreddit": "Economics", "score": -1, "controversiality": 0}
{"body": "perhaps we should ask not whether these guys were a threat to our forces on the ground but, why are we there in the first place? a lot of people on this board are asking questions about the symptoms and not about the disease. do you really expect any of the men killed in this video to come over here and start killing americans? i think not. but don't try to argue that with the defense contractors. they make billions off this sort of stuff. thanks obama. \n\ni was against the war when bush got us in and i'm against the war now that obama is continuing it. ", "gilded": 0, "created_utc": "1270510636", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Same here. I make over $100K and still got back $8K. Thanks Obama.", "gilded": 0, "created_utc": "1270588130", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Ohh I have heard this only 3 times in my life.  As long as Sarah Palin isn't the nominee Ill be voting (R) in three years.  Thanks Obama for giving the Republicans a better track record on NASA funding.", "gilded": 0, "created_utc": "1271050131", "subreddit": "space", "score": 1, "controversiality": 0}
{"body": "Thanks to the HCR law, my mom is getting a nice tax break on her small business courtesy of Obama. Thanks Obama voters!", "gilded": 0, "created_utc": "1271098147", "subreddit": "politics", "score": 11, "controversiality": 0}
{"body": "This is the first year in 25 of paying taxes that I ended up *owing* federal.  Thanks, Obama!", "gilded": 0, "created_utc": "1271274683", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "&gt;  The guy who fills out your withholding form is named Obama?\n\n\nNothing about my income or my forms changed this year from last. So WHY do I have to pay more?  It's horrible!  ( I just wrote \"thanks, obama\" out of sheer frustration and sadness - I don't actually hold him personally responsible.)", "gilded": 0, "created_utc": "1271279373", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "About fucking time! This is a huge legal issue. I deal with this shit on a daily basis from my gay friends and family asking for me for POAs. Now I can get back to making money. Thanks, Obama!", "gilded": 0, "created_utc": "1271388641", "subreddit": "politics", "score": 18, "controversiality": 0}
{"body": "Thanks Obama. Even Gays are more important than fathers!  ;-p\n\nHonestly, the comparison is irrelevant. We should allow same sex partners to see each other. But that also suggests we should allow girlfriends as well. (since anyone can marry now in America, they just have to travel to do it)\n\nThese are 2 separate but equally important issues.\n\nThe problem with the statement is simple: Is the father / has the father been a danger to the child? If no, then there is absolutely no reason that he should not be allowed to see his child. \n\n", "gilded": 0, "created_utc": "1271428528", "subreddit": "Equality", "score": 5, "controversiality": 0}
{"body": "Damn, video is blocked @ work. Just reading that small article made me tear up though.\r\n\r\nThanks Obama, it's a small step but it means a lot.", "gilded": 0, "created_utc": "1271447748", "subreddit": "politics", "score": 13, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1271698427", "subreddit": "business", "score": -7, "controversiality": 0}
{"body": "Thanks, Obama!", "gilded": 0, "created_utc": "1271743216", "subreddit": "trees", "score": 5, "controversiality": 0}
{"body": "So companies that literally make money by taking federal money in one end and spitting it out to kids on the other without actually providing any measurable service aren't making money any more, thus allowing more federal education money to go to actually paying for education?\n\nThanks Obama!", "gilded": 0, "created_utc": "1272058590", "subreddit": "politics", "score": 8, "controversiality": 0}
{"body": "thanks Obama. and the phucktard voters.", "gilded": 0, "created_utc": "1272593063", "subreddit": "business", "score": -3, "controversiality": 0}
