{"body": "Thanks Obama and the Democrats!  You bunch of fucking pig Fascists, (in the real historical sense, not the made up revisionist liberal propaganda bullshit projection mud-slinging sense).", "gilded": 0, "created_utc": "1296604541", "subreddit": "politics", "score": -4, "controversiality": 0}
{"body": "That would take far to long. US gave US $65 billion over 6 years. That's most of our money Thanks obama or should I say Hillary. Yeah no ones talked out about and it exist in one offical blog post. $65 billion just walk out the front door. It's for a really good cause though. Much more the the US spending it on war.\r\n\r\nIn Africa north is not usually a problem. Right now yes. Most other places don't have a government.\r\n\r\nLike a normal meeting. More civilized then our other meetings. Some people are losing their cool under pressure. Can't blame them though. I'll do an IMA tomorrow.\r\n", "gilded": 0, "created_utc": "1296794566", "subreddit": "Libertarian", "score": 1, "controversiality": 0}
{"body": "Thanks Obama, you fascist piece of shit.", "gilded": 0, "created_utc": "1296837910", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Wow, thanks Obama!\n\n... Jerk.", "gilded": 0, "created_utc": "1296920929", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "with a single executive order obama could change that.  Thanks obama!", "gilded": 0, "created_utc": "1296931137", "subreddit": "Economics", "score": -3, "controversiality": 0}
{"body": "I voted against her in the primaries because I really didn't want to see her in public office, ever.\n\nThanks, Obama, for yet another disappointment. ", "gilded": 0, "created_utc": "1297132841", "subreddit": "politics", "score": 7, "controversiality": 0}
{"body": "Obviously, \"we need to look forward as opposed to looking backwards.”...\"don’t want them to suddenly feel like they've got spend their all their time looking over their shoulders.”...\r\n\r\nYou certainly don't want someone looking over your shoulder as you kill some innocent people...Thanks Obama...", "gilded": 0, "created_utc": "1297277727", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "More like, we can't look back because then the whole world would collapse due to how much we have essentially fucked over people's lives.\n\nThanks obama indeed", "gilded": 0, "created_utc": "1297285303", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Because, you know, without wise bureaucrats guiding us out of our caves, we will just sit in our own filth pounding rocks together.\n\nThanks, Obama!   You're our hero!", "gilded": 0, "created_utc": "1297434597", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "It's so good that we have wise bureaucrats to lead us out of our caves.  Everyone I know had been planning to sit here in the darkness in our own waste and wait for a hero to come and rescue us.  And now here's Obama!\n\nThanks, Obama, you're my hero!!!!", "gilded": 0, "created_utc": "1297556438", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1297726202", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Try to short sell instead of foreclose if possible.  It will be a bit less damaging to your credit.  Before I got into real estate I thought a \"short sell\" meant a quick sale.  :)   Actually it means to work with the bank that you owe money to for the house... and to get them to agree to accept as payment for your entire debt... whatever you are able to sell your house for.  This will be much less that you owe but it is better for the bank than for you to just walk away.  After a short sale you will be out of the house with damaged credit (but not as bad as a foreclosure would be) and without a mortgage obligation.\n\nEssentially your strategy in this interaction is to understand the bank's perspective.  You must convince this bank that you are about to hand them your keys and walk away from the house / mortgage / obligations.  They do not want this!!  If you walk away from the property they get the house... but also they (a) lose your income stream and (b) have to start paying people to take care of the house so that it maintains its value.  So know that the bank wants you in the house... this should give you some confidence and the correct angle for how to squeeze them a bit.  If a bank agrees to a short sale (i.e. they let you sell your house for 30K) they get some free money from uncle sam as a bit of a bonus (about $3600 I think, thanks Obama!) so they have a bit of an incentive to work with you.  However if they think they can trick you into staying in your own home they will definately do this.  \n\nThe national HAMP and HARP programs are a joke so don't go for them.  Essentially they banks are using these programs to trick people into staying in their homes and paying their mortgages while they pretend to lose paperwork, or they just need you to fax in another copy, or you need to apply to another different new program, etc.  Don't be fooled.\n\nAlso, they may offer to let you miss a few mortgage payments so you can catch up on bills or to placate you.  Don't accept this.  If you do this they can either (a) foreclose on you immediately due to the accelleration clause in your mortgage (they could demand payment in full for your house immediately or start foreclosure proceedings) or (b) they will let you skip a few payment periods but they will add what you owe back into the principle with added on fees or extra interest. \n\nThe best win/win scenarios for you and the bank would be for you both to come to some sort of agreement in which they would reduce your principle owed somewhat and you would stay in the house paying them every months... but AFAIK every bank in the US is avoiding sensible business practices like this and so your only choices in this matter are walking away, being the economy's bitch, or negociating a short sale before you bail.  \n\nGood luck.", "gilded": 0, "created_utc": "1297744836", "subreddit": "RealEstate", "score": 2, "controversiality": 0}
{"body": "It's a good thing he is doing this.   Me and everyone I know is just sitting around in a dark, cold cave, wallowing in our own filth, pounding rocks together, just waiting for a wise bureaucrat to take us by the hand and lead us out of the darkness and show us how to feed and clothe ourselves.\n\nAnd then here we go, right on schedule, Obama comes along!\n\nThanks, Obama, you are my hero!!!!", "gilded": 0, "created_utc": "1297788543", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I love how the left completely absolves all Democrats and the UN for the war.  Democrats were looking at all the same intel Bush was when they voted to go to war.  But yes- Bush's fault.    There was a larger UN coalition going into Iraq the second time than the first - yes Bush's fault. \n\nEveryone acts as though the previous 8 years of intel and responsibility from a Democratic Administration just vaporized and started only under Bush.  But 2 years into this administration - any blame about anything is tied immediately to the 8 years prior.   The UN passed 30+ resolutions over the 10 years prior to Bush against Iraq - based on what?  The same intelligence that was fed to Bush when he took office.  But yes- all that vaporized as soon as Bush took office - and he made it up.  What the hell was the UN basing it's resolutions on for the previous 10 years?\n\nYou use the word critical thinking followed by a reflexive impulse to cover for Obama: Bush did it.\n\nThis post is about Federal Student Loan laws passed by Obama - and here we are mired into a conversation about Bush and Iraq.  \n\nSeriously - can Obama be responsible for anything?  I didn't initiate a conversation absolving Bush - or discussing Iraq.  \n\nNo more than a few weeks after the State of the Union with a goal of Education as a theme in our \"Sputnik\" moment - Obama makes education more expensive.  That is hypocritical.  If he needed to make tough financial decisions impacting education funding - then don't get up there and spend an hour lying to the taxpayers and then do the opposite.\n\nThis visceral response to blame everything on Bush is really getting old.  \n\nYou are right - Bush didn't have control over regulation of the mortgages.  But he did speak directly to Congress twice about it. President don't speak directly to Congress often.  Bush did about mortgages - well before the collapse.  He tried to shore up Freddie and Fannie and a Democratic Congress blocked it.  The democratic response too all of it was that Bush was fear-mongering and inventing a crisis to distract from the war.   \n\nAnd for all the campaigning against the war Obama did - we are still there.  It was Obama that choose to simultaneously fund a Health Care bill, bailouts and a second stimulus while he increased funding and troops in a war.  Fiscal responsibility would be be to them serially - not in parallel.  Here again - Bush's fault right?\n\nI am not giving Bush a pass on anything - but seriously - did Democrats really live in a vacuum for the past 10 years? Apparently they still do - Bush's fault.\n\nBack to my original posting on education before you changed the subject:  \n\nThanks Obama\n", "gilded": 0, "created_utc": "1297794185", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1297807298", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "wow I really played to much WoW back in the day.  I knew instantly the \"secret\" spot you were talking about.  I'm now depressed.  THANKS OBAMA! ", "gilded": 0, "created_utc": "1297889019", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "can we not sue for defamation of character?  Wrongly accused of a crime without following protocol?\n\noh wait, we cant, there the government and they can do what the fuck they want, thanks bush, and thanks obama for not fixing this massive fuck up... GG!", "gilded": 0, "created_utc": "1297910688", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "Are you a complete and total idiot?   The failures that are described in this article are due to the recent attempts to regulate the market.  I have a deviated septum -- no big deal, but I was told I should get it operated on someday so that was the basis that I was denied coverage.   Before the idiot attempt at 'reform', I would simply have asked for and been granted a rider saying specifically I couldn't get the insurance company to pay for the operation. Now I get no insurance at all, despite being able to pay.  Thanks Obama!\n\n", "gilded": 0, "created_utc": "1298322956", "subreddit": "Economics", "score": -9, "controversiality": 0}
{"body": "&gt;Thanks Obama!\n\nNo. This has being going on *for years* before *Obama became president*. Saying that you would have been able to ask for and granted a rider just exemplifies with how out of touch and ignorant your are of the health insurance situation, probably caused by you being comfortable in your employer provided health care. \n\nReally, you should have just said \"I hate Obama\" instead of wrapping it in all the healthcare debate shit.\n", "gilded": 0, "created_utc": "1298324753", "subreddit": "Economics", "score": 6, "controversiality": 0}
{"body": "I am healthy - high risk pools are obviously going to also be high cost pools --- probably much more costly even than is projected if the history of medicaid is any guide.  So, again, fucking thanks Obama.   ", "gilded": 0, "created_utc": "1298392786", "subreddit": "Economics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1298411564", "subreddit": "AskReddit", "score": 16, "controversiality": 0}
{"body": "Thanks Obama, further tearing apart the moral fabric of this nation.", "gilded": 0, "created_utc": "1298490143", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "Say you have $100 revenue (premiums) of which you spend $70 on care, $25 on admin costs leaving $5 profit.\n\nObama says you are not spending enough on care. What are your options. \n1. Give up profit. Never I am capitalist.\n2. Cut costs. I don't mind laying off people but if I could before the legislation I probably would've already done it. Remember I am a ruthless capitalist.\n3. Raise premiums. Unintuitive at first but let's see what happens when I raise everybody's premiums and bring in $150. My costs are the same $25. I am obligated to spend only $120 on care. Leaving me with $5 profit. \n\nThanks Obama.\n\nEdit: Corrected arithmetic.", "gilded": 0, "created_utc": "1298685149", "subreddit": "reddit.com", "score": 10, "controversiality": 0}
{"body": "&gt;bring the law into compliance with what they were doing\n\nOH WOW! So instead of bringing your actions into compliance with the law, ie, NOT BE A CRIMINAL, you just bring the law into compliance with your currently criminal actions!\n\nSounds fucking WONDERFUL THANKS OBAMA I WAS GETTING WORRIED", "gilded": 0, "created_utc": "1298730124", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "That was my first genuine laugh out loud of the day.  Now I know just how much of a nerd I am.\n\nThanks Obama.", "gilded": 0, "created_utc": "1298841188", "subreddit": "pics", "score": 2, "controversiality": 0}
