{"body": "this is illegal now.\n\nthanks obama!", "gilded": 0, "created_utc": "1335836551", "subreddit": "AdviceAnimals", "score": 19, "controversiality": 0}
{"body": "Thanks Obama! ", "gilded": 0, "created_utc": "1335841313", "subreddit": "EnoughPaulSpam", "score": 3, "controversiality": 0}
{"body": "Plenty around here, all I need to do is open an article in the local news to see all the \"THANKS OBAMA\" or \"N*GGERS NEED TO GET OUT OF __ FLORIDA!\" (In regards to the Trayvon case..) ", "gilded": 0, "created_utc": "1335889724", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1335908307", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "Some people who commit crimes are liberals so if there were no liberals there would be less crime. Thanks Obama Bin Satan", "gilded": 0, "created_utc": "1336005737", "subreddit": "environment", "score": 3, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1336064526", "subreddit": "news", "score": -8, "controversiality": 0}
{"body": "meanwhile the NSA and other security agencies have a computer recording your every key stroke, so that if a cop were to arrest you they could pull up your file and access everything you have said over the internet.  then if you had ever been angry at the establishment and voiced your opinion via reddit or any other medium online, they would use it against you in a court of law and you would not have the benefit of even seeing or knowing where the eveidence came from... \n\nAlso, they can now hold you as a combatant with out charges indefinitely in the US, you are no longer able to request and recieve a lawyer if they determine you to be a terrorist and you could be totured and imprissoned, even executed with out even so much as a day in court.  Welcome to america.\n\nthanks obama", "gilded": 0, "created_utc": "1336071663", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1336117954", "subreddit": "offbeat", "score": 1, "controversiality": 0}
{"body": "But not when consumers call a private company to complain that their sponsorees are bad PR. That's like socialism. Or fascism. \n\nThanks, Obama. ", "gilded": 0, "created_utc": "1336142781", "subreddit": "ShitRedditSays", "score": 12, "controversiality": 0}
{"body": "Thanks Obama for cutting our social security where every Republican president failed.\n\nObama = Best Republican president EVER.\n\n(best for the 1% that is - sorry but you lot are fucked again)", "gilded": 0, "created_utc": "1336257817", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1336309640", "subreddit": "Cooking", "score": 3, "controversiality": 0}
{"body": "Thanks Obama", "gilded": 0, "created_utc": "1336388399", "subreddit": "todayilearned", "score": -12, "controversiality": 0}
{"body": "It took awhile, but thanks Obama. Maybe we will finally end this stone age thought that gay marriage will ruin society.", "gilded": 0, "created_utc": "1336591293", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "Well, I guess this means that Romney will be president next year!\n\nThanks Obama for throwing the election. You have given the people of America so many reasons to kick you out.\n\nComing next year: a republican POTUS, House, and Senate!\n\nIt's time to get down to business and get this country back on the right track!", "gilded": 0, "created_utc": "1336621226", "subreddit": "circlejerk", "score": -11, "controversiality": 0}
{"body": "i love it when people tell me my criticism of the messiabama amounts to a vote for \"the eviler guys\".\n\never thought that having to vote for evil on either ticket is just wrong?\n\nor since their evil is worse the rest of us should sit down and shut up because the grown ups are in the room and ridiculing the patron prince of peace by mentioning dying children and drone strikes might cause someone to open their eyes and see how little difference there is on the real issues.\n\nHai Guys!!! Ernie and Bert can get married!!!!!!! Thanks Obama!!!!!\n\nAlot of us think the dead Afghanii kids will really get a kick out of that.", "gilded": 0, "created_utc": "1336624074", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I gotta say I really like the way Obama handled this. He expressed his personal opinion on the matter (which I happen to agree with,) but let the states decide whether or not to do it. Unlike Bush, Obama has an opinion on the matter but isn't actively trying to legislate his morality on the rest of us with some kind of bill or amendment to the constitution. Thanks Obama.", "gilded": 0, "created_utc": "1336646783", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "As a gay man, when the amendment passed it brought up a lot of self hate. I felt more and more like a second citizen, and it didn't help that the next day the front page of the greensboro news and record had in gigantic text: NC decides marriage between 1 man and 1 women. It was followed by a picture of some religious fundies staring at the sky and cheering. I understand that I should be stronger, but seeing images of people cheering my lack of equal rights was severely disheartening.\n\nLuckily though our president the very next day supported same-sex marriage. It gives me hope, thanks Obama.", "gilded": 0, "created_utc": "1336659428", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "Thats the same \"Thanks Obama!!' rhetoric i keep hearing. Lets not forget the impetus of these wars began when motherfuckers flew planes into skyscrapers killing how many innocents? Also lets not forget that the country is filled with fuckers who strap bombs on themselves and detonate in crowded markets and buses on a DAILY basis. I guess with enough circular logic you can place the blame of those deaths on Obama as well", "gilded": 0, "created_utc": "1336674456", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1336861174", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Obamacare - My insurance has gone up 25% this year. . . . Thanks Obama\n\nClean Energy Incentives - You mean the billions given away to green energy firms that had no plan to actually make and market the technology and went under?  Or are you talking the billions of dollars for \"cash for clunkers\" which has shown to not have accelerated automobile purchases at all, but rather caused people who were going to buy in September to buy in August and then come September there are no buyers?  Or are you talking the rising gasoline and oil prices?  Yea, thanks a lot for your clean energy initiatives Obama. . . . \n\nKilling Osama - He gets credit for giving the go ahead.  Literally every president would have given the go ahead though.  \n\nRepealing DADT - You mean his signing of a bill Congress passed?  Wow, how big of him.  You mean his appealing of a decision of Log Cabin Republicans vs US in 2010 where DADT was found unconstitutional and a violation of the first and fifth amendments, yet Obama requested a stay and appealed the decision through his justice department and received it through the ninth circuit?", "gilded": 0, "created_utc": "1336864734", "subreddit": "trees", "score": -2, "controversiality": 0}
{"body": "Ive benefited greatly.  My shit health insurance premiums went up 25% this year.  Thanks Obama!!!!  \n\nAnd don't even come at me with the bullshit that its just the insurance companies, Obama MANDATED I buy their product and gave them free reign to raise the shit out of rates before his bullshit goes into effect, coincidentally after the last election he will ever have to face . . . . ", "gilded": 0, "created_utc": "1336864880", "subreddit": "trees", "score": 0, "controversiality": 0}
{"body": "Thanks Obama and Liberals for takin over loans and 'helping' us!", "gilded": 0, "created_utc": "1336867372", "subreddit": "politics", "score": -6, "controversiality": 0}
{"body": "I guarantee 90% of the people who are actually \"outraged\" about this are straight white males that use \"faggot\" and \"gay\" online regularly.  Let's all forget that Rand Paul isn't Ron Paul and let's also all forget that Obama hasn't done shit for marriage equality except for take years and years to tell us all he is approves!  Thanks Obama!  I'm glad you finally approve of the love between me and my partner, I was waiting for your permission all this time!\n\nAs someone who is actually gay and been in a committed relationship for almost a decade, let me tell you this:  Rand Paul's comments are just another distraction.  Fuck all you straight people getting offended over something that doesn't effect you at all, I find your reactions to this much more offensive.  Ron Paul wants to get the state out of marriage completely, and you know what, it isn't a perfect solution but it is one of the few ways to actually make marriage equality a reality by getting the government out of our personal lives altogether.  ", "gilded": 0, "created_utc": "1336924648", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "YEAH THANKS OBAMA!", "gilded": 0, "created_utc": "1336938201", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Dumb nigger got famous while on welfare. Now he's rich and acts ilke a self entitled d-bag. Thanks OBAMA!", "gilded": 0, "created_utc": "1337019042", "subreddit": "pics", "score": -37, "controversiality": 0}
{"body": "...what does the IRS have to do with this? Thanks, Obama.", "gilded": 0, "created_utc": "1337079630", "subreddit": "Diablo", "score": 2, "controversiality": 0}
{"body": "This is why we can't have gay marriage.  We let two dudes or two chicks marry each other and then all of a sudden we got dogs walking around marrying Koi fish.  Thanks Obama.", "gilded": 0, "created_utc": "1337095214", "subreddit": "pics", "score": 42, "controversiality": 0}
{"body": "While these collection companies can go fuck themselves, the Federal government (thanks Obama) changed their policies and are buying up the private loans (fuck you too Sallie Mae) through the Ford foundation and taking on huge amounts of this student loan debt.\n\nI'm not surprised this dude is making bank with the huge number of loans being bought up.", "gilded": 0, "created_utc": "1337100113", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "THANKS, OBAMA", "gilded": 0, "created_utc": "1337106316", "subreddit": "leagueoflegends", "score": -6, "controversiality": 0}
{"body": "&gt;the Federal government (thanks Obama) changed their policies and are buying up the private loans \n\nYea, that was a Republican deal. And since when does Obama rule by fiat. Blame our worthless congress.\n\n", "gilded": 0, "created_utc": "1337125284", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "thanks Obama's PR team, you act like I went on a full attack.  From a voting stand point of the average person... the economy isn't much better if at all, and plain and simple, whether it's his fault or not he's going to take the blame.  Just like people try to call for the president's head when gas prices sky rocket... it's reality, deal with it.", "gilded": 0, "created_utc": "1337179758", "subreddit": "ronpaul", "score": 0, "controversiality": 0}
{"body": "Thanks Obama!   Who the fuck can afford that?", "gilded": 0, "created_utc": "1337346622", "subreddit": "politics", "score": -3, "controversiality": 0}
{"body": "&gt;they should not be able to dictate what a doctor can or cannot prescribe patients.\n\n\nThey're not. They dropped their health plan rather than be forced to do that. Now, nobody has health care.\n\nThanks Obama!", "gilded": 0, "created_utc": "1337349467", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1337364044", "subreddit": "politics", "score": -6, "controversiality": 0}
{"body": "Thanks Obama =/", "gilded": 0, "created_utc": "1337379351", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "Well, H1bs and illegals from Mexico are drowning in jobs.  Thanks Obama and the GOP!", "gilded": 0, "created_utc": "1337525581", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1337527079", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "&gt;Thanks Obama!\n\n\nSince you seem to think Obama is responsible for the actions of regressive state governments, then you obviously have no idea about how government actually works.", "gilded": 0, "created_utc": "1337532159", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1337537136", "subreddit": "politics", "score": -4, "controversiality": 0}
{"body": "Djarum makes cigarettes and cigarillos . Only the cigarillos are legal for sale inside the US now because of the flavored cigarette ban (thanks Obama).\n\nI will smoke other things but that is all I will buy (because I like the flavor). I don't smoke anything very often i'm honestly on a less than 1 cig a month level, and I liked the Djarum black cigarettes more because the cigarillos just burn for fucking ever. Cloves burn like 30% longer that normal cigarettes, so clove cigarillos burn even longer.", "gilded": 0, "created_utc": "1337622001", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "First gay marriage, now this. Thanks, Obama.", "gilded": 0, "created_utc": "1337703457", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "I dunno, I saw a couple at a gas station a while ago. The wife was vomiting in a trash can while the husband held her hair back. This was a classy redneck couple I might add. A moment later, he looks up at the sky and shouts, \"THANKS OBAMA!\" then goes back to concentrating on his wife. \n\nMy wife and I have contemplated what this might have been, why she was vomiting, and what the president had to do with it. Still cracks me up thinking about it though. ", "gilded": 0, "created_utc": "1337714144", "subreddit": "funny", "score": 7, "controversiality": 0}
{"body": "Wonderful. great, thanks Obama,\nfor instigating the overthrow and subsequent takeover of multiple\ncountries by Muslim extremists. Hosni Mubarak was a real bastard,\nbut at least he was our bastard. Now we'll get someone even less concerned about human rights, with a militant attitude toward\nanything even remotely resembling western culture.\n\nThat goes for Assad too, And the eventual overthrow of Syria.\nAssad is real cocksucker, no doubt, but at least he kept the\nmilitants in check, and the small Christian and other minority communities were relatively safe from harm, owing mainly to Assad's own minority status. these militant *rebels* (aka terrorists) are trying to establish a global Caliphate, no matter the cost, And we shouldn't be dropping them anti-tank weapons.\n\n\n", "gilded": 0, "created_utc": "1337732636", "subreddit": "worldnews", "score": -12, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1337746964", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Kutner had potential, except Kal Penn left before his character had a chance to [grow his beard (warning tv tropes link)](http://tvtropes.org/pmwiki/pmwiki.php/Main/GrowingTheBeard).  It was fun to have another character as reckless as House and not particularly intimidated by him. I just wish he didn't quit the show to work for Obama. *Thanks Obama...* haha", "gilded": 0, "created_utc": "1337760764", "subreddit": "HouseMD", "score": 8, "controversiality": 0}
{"body": "Thanks Obama.  Keep suppressing that nascent democracy with your clandestine air war against the people of Yemen.", "gilded": 0, "created_utc": "1337797382", "subreddit": "worldnews", "score": -7, "controversiality": 0}
{"body": "Thanks, Obama!", "gilded": 0, "created_utc": "1337895515", "subreddit": "worldnews", "score": -5, "controversiality": 0}
{"body": "Actually it wasn't due to that.  The immunity to bankruptcy came when the federal government stepped in to guarantee all the loans.\n\nThanks Obama!", "gilded": 0, "created_utc": "1337895590", "subreddit": "worldnews", "score": -24, "controversiality": 0}
{"body": "Thanks Obama. We'll just be afraid of being indefinitely detained with no trial or representation instead. So glad the man has these things prioritized. ", "gilded": 0, "created_utc": "1337908412", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Thanks, Obama.", "gilded": 0, "created_utc": "1337957960", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "what my dad pretty much said was \"thanks obama for giving me an extra 3% and then taxing me 10%\"", "gilded": 0, "created_utc": "1337992355", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "My dad is a changed man today, but 20 years ago I remember him talking, in anguish, about Castro or someone on how they were going to destroy America's children with drugs. My actions had shown him that was true, I guess. \n\nOf course, he, like most thinking people, realize our handling of \"drugs\" is what has really screwed us.   \nIf I was religious, still, then I would question whether Satan's real purpose was to send us down this unholy road of denying liberty, winning our country economically, and so on. \n\nWould ask the same about our reaction to 9/11 and money spent since then. (Thanks Obama, for using intelligence and following through).\n\n ", "gilded": 0, "created_utc": "1338109895", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1338143829", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "I'm out of milk.  Thanks Obamacare!", "gilded": 0, "created_utc": "1338389597", "subreddit": "todayilearned", "score": 0, "controversiality": 0}
{"body": "Thanks, Obama.", "gilded": 0, "created_utc": "1338400650", "subreddit": "pics", "score": 1, "controversiality": 0}
