{"body": "It is legal.....See NDAA.\n\nThanks Obama for making this douche right.", "gilded": 0, "created_utc": "1328075325", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "Thanks, Obama!", "gilded": 0, "created_utc": "1328132483", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "You don't know the difference between budget and appropriations.\n\nBush did have a budget.  Reid and Pelosi ignored it and passed their own appropriations.  In March of 2009, Obama signed in the rest of the 2009 spending.\n\n&gt;All this time you have been blaming the 2010 debt on Obama and suddenly it's me who was using talking points. Do you have absolutely any shame?\n\nSpending written by Democrats signed by Democrats is owned by Democrats.\n\nThese numbers are indisputable:\n&gt;FY2012:  1.1T in deficits.  (Includes Bush Tax Cuts &amp; Wars, Includes any TARP payback) &lt;-- Obama  \n&gt;FY2011:  1.3T in deficits.  (Includes Bush Tax Cuts &amp; Wars, Includes any TARP payback) &lt;-- Obama      \n&gt;FY2010:  1.3T in deficits.  (Includes Bush Tax Cuts &amp; Wars, Includes any TARP payback) &lt;-- Obama   \n&gt;FY2009:  1.4T in deficits.  (Includes Bush Tax Cuts &amp; Wars, Includes TARP)   &lt;-- Obama   \n&gt;FY2008:  $248B in deficits.  (Includes Bush Tax Cuts &amp; Wars)  &lt;-- Democrats + Bush   \n&gt;FY2007:  $161B in deficits.  (Includes Bush Tax Cuts &amp; Wars)  &lt;-- Democrats + Bush  \n\nNational Debt in 9/2007?  $9T.  \nNational Debt today?  $15T+.  \n\nThanks Obama and Democrats!  \n\nhttp://en.wikipedia.org/wiki/2009_United_States_federal_budget  \n\n&gt;Total expenditures\t$3.107 trillion (requested)   \n&gt;  $3.518 trillion (enacted)[1]   \n&gt; Deficit\t$407 billion (requested)  \n&gt; $1.413 trillion (enacted)[1]    \n\nThe requested parts were what Bush requested.  The enacted parts are what Obama and the Democrats actually appropriated.  Thanks Obama!\n\nAs they always say, reality has a conservative bias.  \n", "gilded": 0, "created_utc": "1328156637", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "&gt;You don't know the difference between budget and appropriations.\n\nI do know which is why I specifically said budget, and if you knew about the omnibus spending why did you keep pointing to 2010 debt as Obama's sole responsiblity. Dishonest much?\n\n&gt;Bush did have a budget. Reid and Pelosi ignored it and passed their own appropriations. In March of 2009, Obama signed in the rest of the 2009 spending.\n\nI already linked to the article that showed where the spending increased - it was 200 billion or so under Obama. The deficit was set to hit 1 trillion without any increase from Obama.\n\n&gt;Spending written by Democrats signed by Democrats is owned by Democrats.\n\nBush's lowest deficit in his whole 8 years was under Democrats.\n\n&gt;National Debt in 9/2007? $9T.\n National Debt today? $15T+.\n\nFucking moron - what about the Iraq war, tax cuts, medicare part D, recession - did they stop being in effect because of Democrats?\n\n&gt;The requested parts were what Bush requested. The enacted parts are what Obama and the Democrats actually appropriated. Thanks Obama!\n\nYou need an education, typical low IQ Republican.\n\nhttp://www.politifact.com/truth-o-meter/statements/2011/jul/27/barack-obama/obama-says-deficit-was-track-top-1-trillion-year-h/\n\n&gt;As they always say, reality has a conservative bias.\n\nYes, we totally found those WMD's didn't we. LOL.", "gilded": 0, "created_utc": "1328157038", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1328210543", "subreddit": "Libertarian", "score": 0, "controversiality": 0}
{"body": "Thanks Obama, because we don't value energy independence, and it definitely isn't vital to our national security.", "gilded": 0, "created_utc": "1328375497", "subreddit": "politics", "score": -7, "controversiality": 0}
{"body": "lol thanks obama", "gilded": 0, "created_utc": "1328390374", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1328401143", "subreddit": "worldnews", "score": -5, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1328407209", "subreddit": "technology", "score": -8, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1328471458", "subreddit": "videos", "score": 0, "controversiality": 0}
{"body": "These actually made me laugh pretty hard. Especially the thanks Obama and the sofa one.  ", "gilded": 0, "created_utc": "1328486250", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "Thanks obama", "gilded": 0, "created_utc": "1328510098", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "It's hard times dood. I don't know how the non-medical market is... that really depends on what drug busts are going on at SDSU frankly :)\n\nBut medical is fucking depressing. Just look at weedmaps... where before you couldn't see the city through all the tags, now they're far and few between.\n\nThey seem to be winning, sadly. Thanks Obama\n\nBut as far as finding other stoners, OB/other beaches are indeed your best bet. Just go along the cliffs a bit if you're near the pier, or drive all the way down to Sunset Cliffs park.", "gilded": 0, "created_utc": "1328517188", "subreddit": "sandiegoents", "score": 1, "controversiality": 0}
{"body": "Iraq was war mongering.\n\nI have no problem with why we went into Afghanistan. \n\nLibya, Yemen, Somalia, drone Bombings in Pakistan - that's war mongering. Thanks Obama.\n\n", "gilded": 0, "created_utc": "1328635831", "subreddit": "Conservative", "score": 3, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1328724264", "subreddit": "politics", "score": -4, "controversiality": 0}
{"body": "Not cell phones, [any phones](http://www.lifeline.gov/lifeline_Consumers.html)\n\n&gt;Lifeline provides discounts on one basic monthly phone service (**wireline or wireless**) for qualified subscribers. These discounts can be **up to $10.00** per month, depending on the state.\n\nBut, why let facts get in the way of a good emotional headline?\n\n&gt;Thanks Obama\n\nActually, the subsidy started in 1996 with landlines.  Wireless phones were added as an additional option eligible for subsidy **in 2008** (please pay close attention to who was the occupant of 1600 Pennsylvania Avenue for all of 2008).\n\nHere are [actual facts](http://www.snopes.com/politics/taxes/cellphone.asp), for those that are not scare of such things...", "gilded": 0, "created_utc": "1328802587", "subreddit": "Libertarian", "score": 3, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1328822437", "subreddit": "Economics", "score": -5, "controversiality": 0}
{"body": "Good. We consistently rank in the top 5 (in 2010 and 2011 the best or 2nd best, depending on the source) performing states in the country.\n\nBecause of this act, the education system no longer teaches kids actual, useful skills and/or subjects, but instead what to put for question 24.\n\nWe SHOULDN'T be affected by this abomination of legislation. Good riddance. Thanks, Obama.", "gilded": 0, "created_utc": "1328825267", "subreddit": "boston", "score": 25, "controversiality": 0}
{"body": "This has nothing to do with federal funding.  The HHS mandate affects all private businesses employing at least 30 people.  Thanks ObamaCare!", "gilded": 0, "created_utc": "1328990463", "subreddit": "Catholicism", "score": 2, "controversiality": 0}
{"body": "Where's your global warming now, atheists?\n\nNow I have to shovel all this crap off my driveway; thanks Obama.", "gilded": 0, "created_utc": "1329149928", "subreddit": "Lawrence", "score": 5, "controversiality": 0}
{"body": "Thanks Obama.  You are destroying the lives of the poor to feed your loonie environmental base.  Watch the clown try to blame it on those evil oil companies.", "gilded": 0, "created_utc": "1329198608", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I'd explain this kind of thing as the weather that news stations generate is like a trigger to buy things. Ratings is what news media are selling so a heroic soldier who dies for his platoon is great for media but only long after the war is over since each new soldier death is like another heroin bruise on Uncle Sam's inner elbow or ankle. So when Whitney Houston dies and we all remember what a star she used to be, then the news media can focus on all the great things she did. The politicians love her for bringing all kinds of revenue and votes in because then they can stand up and talk about how bad drugs are and spike ratings for their campaigns which translate into votes. At the end of the day, nobody wants to talk about the dead soldier because it's fucking depressing, but everyone wants to talk about Whitney Houston because I'm pretty sure we all feel she had it coming a long time ago (even I was like, \"damn that bitch was still alive?\") and so we all kind of expected she wouldn't be long for this world anyway, and if you're a fan you're tuning into the media to hear everything you can about her just in case you missed something, but you probably didn't.\n\nAt the end of the day it's ratings. Dead soldiers more often solicit a twitch on the remote than dead pop stars. I know it sucks but at the end of the day, producing shit that doesn't suck is really fucking hard to do and since the government and people in control of society are all hoping and praying to line their pockets, we see a lot of changes that seem pretty much the same. Thanks, Obama.", "gilded": 0, "created_utc": "1329282840", "subreddit": "facepalm", "score": 3, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1329308411", "subreddit": "Libertarian", "score": 1, "controversiality": 0}
{"body": "YOU SOUND LIKE A LIBERAL. THANKS OBAMACARE.", "gilded": 0, "created_utc": "1329322972", "subreddit": "philadelphia", "score": 1, "controversiality": 0}
{"body": "If you've been without health insurance for more than 6 months, you qualify for a new program (Thanks, Obama!) for health insurance. http://www.chip.state.il.us/default.htm.\n\nI went through this cycle last year. Underemployment is really hard emotionally. It doesn't help that employers know they have the upper hand in this economy. \n\nAnyway, look into CHIP. It's way cheap compared to private companies. For folks in their 20s it runs around $150-$200. Dental is cheap, too. Plus getting health insurance is actually really relaxing, knowing you have some kind of safety net. Good luck!", "gilded": 0, "created_utc": "1329500941", "subreddit": "chicago", "score": 1, "controversiality": 0}
{"body": "I make reservations for the tour of that Boeing factory- we shut down the whole day. I got a free day, thanks Obama!", "gilded": 0, "created_utc": "1329513338", "subreddit": "Seattle", "score": 3, "controversiality": 0}
{"body": "**THANKS OBAMA**", "gilded": 0, "created_utc": "1329535729", "subreddit": "AskReddit", "score": 35, "controversiality": 0}
{"body": "&gt; Officials in key parts of the Obama administration are increasingly convinced that sanctions will not deter Tehran from pursuing its nuclear programme, and believe that the US will be left with no option but to launch an attack on Iran or watch Israel do so.\n\nThanks Obama, just what we need, another war... scumbag!", "gilded": 0, "created_utc": "1329578353", "subreddit": "obama", "score": 0, "controversiality": 0}
{"body": "####THANKS OBAMA", "gilded": 0, "created_utc": "1329624363", "subreddit": "circlejerk", "score": 3, "controversiality": 0}
{"body": "Thanks Obama and the Progressives!", "gilded": 0, "created_utc": "1329659084", "subreddit": "politics", "score": -7, "controversiality": 0}
{"body": "&gt; Today, the government asked the Supreme Court to overturn an appeals court ruling that allowed our lawsuit challenging the constitutionality of the 2008 FISA Amendments Act to go forward. That law gives the government unprecedented authority to monitor Americans’ international emails and phone calls.\n\n&gt; The appeals court ruling, which was issued in March 2011, held that our case could forward, rejecting the administration’s arguments that the case should be dismissed because our clients could not prove their communications would be collected under the law.\n\n&gt; Needless to say, we’re disappointed by the government’s filing today. ACLU deputy legal director Jameel Jaffer stated in a press release, **“It’s crucial that the government’s surveillance activities be subject to constitutional limits, but the administration’s argument would effectively insulate the most intrusive surveillance programs from judicial review.** The Supreme Court should leave the appeals court’s ruling in place and allow our constitutional challenge to proceed.”\n\nScumbag Obama:\n\n touts the fact that he is a constitutional law professor\n\n\nSees constitutional law as \"optional\"\n\nThanks Obamabots, we get 4 more years of this crap...\n\nin before \"derp, stupid libertarian ACLU!\"\n", "gilded": 0, "created_utc": "1329667171", "subreddit": "obama", "score": 0, "controversiality": 0}
{"body": "&gt; Thanks Obamabots, we get 4 more years of this crap\n\ntell me to my face that you'd prefer one of the republican candidates. ", "gilded": 0, "created_utc": "1329719078", "subreddit": "obama", "score": 5, "controversiality": 0}
{"body": "no, id rather have a DEMOCRAT in the Whitehouse, not a republican with a D next to his name. If you dumbshits would have actually done research and not easily fall for someone who can give a good speech we WOULD have an actual democrat in the Whitehouse. So once again, Thanks Obamabots, we get 4 more years of this crap!", "gilded": 0, "created_utc": "1329747671", "subreddit": "obama", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1329772726", "subreddit": "economy", "score": -10, "controversiality": 0}
{"body": "Good thing we only have 300 nukes left! Thanks Obama!", "gilded": 0, "created_utc": "1329778834", "subreddit": "worldnews", "score": -9, "controversiality": 0}
{"body": "This is why a massive education on the banking and federal reserve system is essential to understanding just how these practices screw everybody but the people who control the money supply...this will never be fixed under the framework this country is using right now... This is the key to the End the Fed movement that only Ron Paul is being candid and honest about. For goodness sakes, Ron Paul is the only guy I can see actually tackling these mortal wounds this country is being bled from. \nAs im typing this the Dow is about to tap 13,000 with some of the worst fundamentals to back up such gains... It's going to be the biggest pump and dump this country had ever seen. If it's not obvious to you why the Dow is so high, then you may want to look and see what the FED is up to and inform yourself on the trillions of dollars papering over the the biggest lie going... Which is the recovery. There is no recovery, you are witnessing the collapse of dollar, wich is being hedged with Americans lives. Thanks Obama, you really held everyone accountable, and by everyone I mean US.", "gilded": 0, "created_utc": "1329835078", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "THE GREEN HURTS MY EYES\n\n\nTHANKS OBAMA", "gilded": 0, "created_utc": "1329943482", "subreddit": "starcraft", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1329969273", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I probably tallied over a million dollars through several months of dialysis, chemotherapy, and extra hospital visits last year, but this was the biggest single bill I ever saw. It's my dad's insurance (thanks Obama), and his union nearly goes on strike every year over benefits.", "gilded": 0, "created_utc": "1329972463", "subreddit": "humor", "score": 5, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1329997589", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1330117737", "subreddit": "Economics", "score": 0, "controversiality": 0}
{"body": "Thanks Obama! Is the U.S. ready for a black zombie president? He'll definitely take away your guns...", "gilded": 0, "created_utc": "1330271214", "subreddit": "fffffffuuuuuuuuuuuu", "score": 7, "controversiality": 0}
{"body": "When I was broke I didn't have health care. I tried to apply for state health but my income was too high. That meant I didn't get to have insurance because I couldn't afford to pay for it on my own each month. Luckily I moved back to my home state and am now on my parent's coverage until I'm 26 (Hey thanks Obama!) which is great because about 7 months ago I was finally diagnosed with a chronic illness.\n\nIt's my understanding that those who have very little money may have state sponsored health insurance that may not be that great, or they are forced to buy coverage which is touted as insurance but isn't really, they end up in the hospital and their coverage only actually covers 10% of the bill and they're stuck owing $20,000 or more for their stay, tests, and medicines.\n\nSo I'm not sure which sources led you to believe that poor people have the \"exact same care\" that those with paid insurance receive but it's really not true. If it was they probably wouldn't be complaining too much.", "gilded": 0, "created_utc": "1330353904", "subreddit": "politics", "score": 14, "controversiality": 0}
{"body": "&gt;Let me ask you an honest question- what would you have them do with Jamal? Check his insurance card at the door, and say sorry dude you have no money so we won't help you, you'll just have to bleed out in the street over there? Obviously Jamal isn't going to pay for his care, but I don't think we should deny care to anyone. That's just un-American, IMHO.\n\nYes by all means... sew him up and let him get on with it... Do I think it's borderline socialism? Yes. All I was trying to point out with that is we already do have \"universal healthcare\" to an extent and I am actually OK with the way it is EVEN tho it still comes out of my paycheck.\n\nCan you imagine if people actually had to work for incentives such as healthcare? Or work for the hospital to pay off their debt to society or as a thank you....?\n\n&gt;That said, I think it did some good things. Mainly, it prevents insurers from rejecting pre-existing conditions and provides a safety net for those who lose their insurance.\n\nThus driving the cost up for people who already pay for their insurance (on top of a new healthcare fee)... Therefore FORCING you to go on the Free Government plan because you cant afford the new premium costs even tho you are healthy.\n\nONLY taxpayers pay for for this health care fee... That to me is 100% Unconstitutional. \n\nWhy should I bother working anymore??? I could quit and go into government housing, go on welfare, have free health insurance, and free direct TV, all on some dumb schmucks dime. \n\nFat Albert lives in government housing, does not pay taxes let alone for health insurance, has been arrested 5 times for drugs and spent 10 years for killing a cop. Once released he sucks down 4 cheeseburgers a day and has a heart attack. Thanks Obama for the triple bypass that you are forcing hard working Americans to pay for.\n\nIs the idea of FREE health care nice and wonderful?? YES... Is it OK to force me to pay for YOUR healthcare? Hell no.\n\nI think the majority of the healthcare bill will ultimately be found Unconstitutional in the end.", "gilded": 0, "created_utc": "1330378539", "subreddit": "guns", "score": 2, "controversiality": 0}
{"body": "$6.25 in northern Vermont on a snowmobile trail.\n\nThanks Obama!", "gilded": 0, "created_utc": "1330389508", "subreddit": "pics", "score": -8, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1330398536", "subreddit": "funny", "score": -9, "controversiality": 0}
{"body": "Some more quotes from a different article\n\nhttp://washington.cbslocal.com/2012/02/27/white-house-pumped-millions-into-nypds-muslim-surveillance-programs/\n\n&gt; The AP confirmed the use of White House money through secret police documents and interviews with current and former city and federal officials. The AP also obtained electronic documents with digital signatures indicating they were created and saved on HIDTA computers. The HIDTA grant program is overseen by the White House Office of National Drug Control Policy.\n\n&gt; The disclosure that the White House is at least partially paying for the NYPD’s wholesale surveillance of places where Muslims eat, shop, work and pray complicates efforts by the Obama administration to stay out of the fray over New York’s controversial counterterrorism programs. The administration has championed outreach to American Muslims and has said law enforcement should not put entire communities under suspicion.\n\n&gt; The Obama administration, however, has pointedly refused to endorse or repudiate the NYPD programs it helps pay for. The White House last week declined to comment on its grant payments.\n\n&gt; **John Brennan, Obama’s top counterterrorism adviser**, last year called the NYPD’s efforts **“heroic”** but would not elaborate. Homeland Security Secretary Janet Napolitano, whose department also gives grant money to the NYPD and is one of the lead federal agencies helping police build relationships with Muslims, has refused in recent months to discuss the police tactics. Tom Perez, the Justice Department’s top civil rights lawyer, has repeatedly refused to answer questions about the NYPD.\n\nThanks Obama...", "gilded": 0, "created_utc": "1330398540", "subreddit": "obama", "score": 0, "controversiality": 0}
{"body": "THANKS, OBAMACARE.", "gilded": 0, "created_utc": "1330436481", "subreddit": "videos", "score": 0, "controversiality": 0}
{"body": "Thanks Obama !\n\n\nI bet if Julian was black or a campaign donor this wouldn't be the case.", "gilded": 0, "created_utc": "1330453434", "subreddit": "politics", "score": -4, "controversiality": 0}
{"body": "the Facebook outrage from my Republican friends when he picks us and we lose is hilarious.  \"THANKS OBAMA, FIRST YOU RUIN OUR COUNTRY AND NOW YOU RUIN OUR SEASON\"", "gilded": 0, "created_utc": "1330454016", "subreddit": "CollegeBasketball", "score": 2, "controversiality": 0}
{"body": "They provide Romney with an excuse for losing his home state.\n\nTHANKS OBAMATONS!", "gilded": 0, "created_utc": "1330471723", "subreddit": "PoliticalDiscussion", "score": -1, "controversiality": 0}
{"body": "I like the term. Because I hope someone who was so against it is saved by it and goes \"Obamacare saved me. Thanks Obama!\" I realize this is highly unlikely.", "gilded": 0, "created_utc": "1330524712", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "So THIS shit is what my hard earned tax dollars are funding!!? What the!?...thanks Obamacare!", "gilded": 0, "created_utc": "1330528811", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Thanks OBAMA!", "gilded": 0, "created_utc": "1330543477", "subreddit": "worldnews", "score": -1, "controversiality": 0}
{"body": "[Remember this](http://abclocal.go.com/kgo/story?section=news/local&amp;id=6250899)?  If it's Bush's fault that gas was that high then, why isn't it Obama's fault now?\n\nHard to take any of this shit seriously when both sides will just say what's expedient for their \"side\" at the time.\n\nEDIT: [Well shit - higher gas prices are here to stay.  Thanks Obama Administration!](http://www.politico.com/news/stories/0212/73408.html#ixzz1nlwKN38K)", "gilded": 0, "created_utc": "1330555409", "subreddit": "politics", "score": 1, "controversiality": 0}
