{"body": "Yeah!  I'm so glad I'm forced to pay money to gov't connected corporations or pay a hefty fine!  I never wanted to shop around for health insurance anyway.  Thanks Obama!", "gilded": 0, "created_utc": "1288765669", "subreddit": "WTF", "score": -1, "controversiality": 0}
{"body": "So what is the government and the Fed going to do? \n\nThey are going to feed more free money into the maws of the primary dealer banks and inflate speculative bubbles in commodities. This will in no way help the larger economy, it will not lead to more employment, it will allow a well-positioned group of bankers and insiders to get even richer at the cost of the dollar´s buying power. \n\nIt will also raise the price the price of food and fuel. \n\nThanks Obama, thanks Bernanke, thanks Little Timmy ", "gilded": 0, "created_utc": "1288785704", "subreddit": "Economics", "score": 1, "controversiality": 0}
{"body": "I just found out that after a year of being uninsured, I am about to get full health because I am under 26 (even though I am married) - and because of \"Obamacare\", I am now eligible to be insured under my parents.\n\nThanks Obama, try to take it easy on the fetus's, okay?", "gilded": 0, "created_utc": "1289074105", "subreddit": "reddit.com", "score": 5, "controversiality": 0}
{"body": "&gt; Thanks Obama/Fed for punishing the financially responsible people who save their earnings.\n\nIf we encountered deflation and you got laid off you'd be thanking them for not doing anything instead.", "gilded": 0, "created_utc": "1289247799", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "Reminds me of Communist USSR where citizens were not able to move freely within the country without proper papers and definitely not allowed to leave the country without approval from a higher authority.  Thanks Obama for renewing and expanding the Patriot Act.", "gilded": 0, "created_utc": "1289696744", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Me in 20 years, thanks Obama.", "gilded": 0, "created_utc": "1289786874", "subreddit": "canada", "score": -9, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1289837643", "subreddit": "WTF", "score": 8, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1289880602", "subreddit": "cannabis", "score": 2, "controversiality": 0}
{"body": "Quick question - How will the \"Donate Now\" ribbon work when the page is actually sized for a standard browser window? If it's fixed to the top right, it was overlay your navigation.\n\nAlso, although I am a HUGE fan of Gotham (thanks Obama) you might want to consider how you're going to work that font in there. Perhaps you're just a designer and not a coder, but it can be a pain to include a custom font that isn't an open typeface.\n\nEdit: Oh yea, I like that colored one. The dark is easily the best looking, but isn't very friendly. The light is nice, but it draws all the attention to the image in the middle, which distracts from your purpose. The colored one flows with the logo and the image a little better, and definitely gives off a good feeling, but maybe it could be toned down a little. The contrast between the colors gives a little discrepancy between the two sides, and it is just slightly overpowering. Overall, solid design. Typography spacing could be increased a little for readability.\n", "gilded": 0, "created_utc": "1289884135", "subreddit": "design_critiques", "score": 2, "controversiality": 0}
{"body": "Thanks Obama and dems who lost - what a great legacy you are leaving ", "gilded": 0, "created_utc": "1289961941", "subreddit": "technology", "score": 0, "controversiality": 0}
{"body": "Thanks Obama for yet another Bushalike appointee.", "gilded": 0, "created_utc": "1290026649", "subreddit": "news", "score": 3, "controversiality": 0}
{"body": "Thanks Obama &amp; The Democrats!", "gilded": 0, "created_utc": "1290034065", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Hell yes we do. It's really nice being able to ride my horse to school. They just put in state sponsored grazing pastures for them so they can eat while I study. Thanks Obama!", "gilded": 0, "created_utc": "1290198593", "subreddit": "sports", "score": 11, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1290220337", "subreddit": "Marijuana", "score": 6, "controversiality": 0}
{"body": "Thanks Obama, for scheduling the end of the of the Department of Defense study on DADT to coincide with the end of this congressional session. That was a real fucking brilliant move... if it was your plan to kill the possibility of repeal, that is.", "gilded": 0, "created_utc": "1290259252", "subreddit": "lgbt", "score": 3, "controversiality": 0}
{"body": "Thanks Obama. Change you and your cronies can believe in. ", "gilded": 0, "created_utc": "1290469766", "subreddit": "OperationGrabAss", "score": 3, "controversiality": 0}
{"body": "Thanks Obama! More of that Hope And Change! Man, Obama is really doing a great job of wiping out cronyism! ", "gilded": 0, "created_utc": "1290577868", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks, obamanu looks interesting.", "gilded": 0, "created_utc": "1290661664", "subreddit": "fantasyfootball", "score": 1, "controversiality": 0}
{"body": "Thanks Obama and the Democrats!", "gilded": 0, "created_utc": "1290714917", "subreddit": "Economics", "score": -4, "controversiality": 0}
{"body": "thanks obama!", "gilded": 0, "created_utc": "1290888313", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "David Spade was the funniest one in that movie. That should say something as well. *Sigh* I remember when Adam Sadler was funny.... Thanks Obama.", "gilded": 0, "created_utc": "1291001650", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "It's a step in the right direction and I think it would be really awesome if people were excited for these small steps instead of knocking them down every time.  It seems like it just adds to the all the negativity... and I for one would like to add words of encouragement to the mix. So thanks Obama for making moves to try to correct a problem that can't be fixed overnight; let alone in 2 years.  I too have made sacrifices as my pay was cut 15% last year.", "gilded": 0, "created_utc": "1291079178", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
