{"body": "Yup. My favorite \"Let's blame Obama!\" thing was posted in a review of my jeweler:\n\n\"I LOVED Bailey, Banks and Biddle.  But...they went out of business!\n\nThanks, Obama.\"\n\nSuuuuure it was Obama's fault that an over priced jewelry store went bankrupt. Just keep telling yourself that.", "gilded": 0, "created_utc": "1309481853", "subreddit": "reddit.com", "score": 13, "controversiality": 0}
{"body": "I love reddit, Thanks Obama.", "gilded": 0, "created_utc": "1309485688", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "I work at a mobile vet clinic and just yesterday when I told someone that the price of our eye ointment went up because the manufacturer raised the price, a guy said \"thanks, Obama.\" Then an hour later, I had the same conversation with a woman who then said \"if you were black Obama would cover the cost for you.\" I live in Texas if that helps you understand. This sort of thing happens CONSTANTLY!", "gilded": 0, "created_utc": "1309487547", "subreddit": "reddit.com", "score": 31, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1309487948", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "All the duct tape companies are going to hell. Thanks Obama", "gilded": 0, "created_utc": "1309489609", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Don't worry, soon enough taxpayers will be forced to buy insurance from these for-profit companies and then have their taxes used to buy insurance from these for-profit for people who don't pay taxes!\n\nThanks Obama!", "gilded": 0, "created_utc": "1309538320", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "I fucking don't. They took my taxes and look what I got for it, massive debt, 5 wars, torture on American citizens, airport rape, increased drug war activity, massive bailouts, corrupt foreign aid, the Patriot Act, etc. \n\nThanks Obama, hope and change indeed. \n\n  ", "gilded": 0, "created_utc": "1309550068", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1309674950", "subreddit": "space", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1309675506", "subreddit": "Physics", "score": 0, "controversiality": 0}
{"body": "Thanks Obama, now go get those cancer patients!", "gilded": 0, "created_utc": "1309722315", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "YEAH, THANKS OBAMA!", "gilded": 0, "created_utc": "1309763611", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1309765416", "subreddit": "AskReddit", "score": -2, "controversiality": 0}
{"body": "I paid it annually, since I am always hopping between places as a college student and didn't want to deal with sending bills to different places. $1500 a year isn't bad, but I was almost stuck with $3000 when my address was going to be on Long Island (understandable, driving there is hectic). The accident was 100% not my fault, and the companies found the same. My car was completely totalled, so they awarded me $3,000, which was actually a bit above the blue book value that I was able to find (it was a 91 Wrangler). The other driver fucked up their whole front end, and had a much shinier 06 Civic, so I bet that cost them a pretty penny. \n\nOn the other hand, had I not had insurance, I would have just had access to my dues instead, which would have been about three grand anyway. If I got into my accident any later, I'd have been out the difference. My real luck was that i didn't get hurt, because I didn't have any health insurance at the time (I've got student and family now, thanks Obama!) and I may have been in trouble had I gotten injured.", "gilded": 0, "created_utc": "1309797744", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Fox.com commentors on reddit??\n\n*THANKS OBAMA*", "gilded": 0, "created_utc": "1309925206", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1309998743", "subreddit": "pics", "score": 7, "controversiality": 0}
{"body": "I only just got back on it in January (thanks Obama!)  Will my family practitioner be able to run all those tests from his office, or would you suggest a specialist?", "gilded": 0, "created_utc": "1310058844", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1310085662", "subreddit": "worldnews", "score": 2, "controversiality": 0}
{"body": "They did carry jail time, it is just that she got credit for time served and so she only has 6 days left on her sentence.\n\nThe logic just does not compute.  If she was charged with manslaughter nobody would say \"she got away with murder\" they would say \"she was convicted of manslaughter\".\n\nShe was convicted of the crimes that could be proven in court.  If we couldn't prove she committed murder then she should not be convicted of it. \n\nThe result was justice, not vengeance.  Learn the fucking different America!  THANKS OBAMA!", "gilded": 0, "created_utc": "1310085887", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "pshhh...never, thanks obama", "gilded": 0, "created_utc": "1310109018", "subreddit": "trees", "score": 3, "controversiality": 0}
{"body": "First, the \"THANKS OBAMA!\" thing is what is called a meme.  It is a satirical representation of right-wing, borderline Poe's law, fanatical freaks who blame EVERYTHING on Obama.  It is especially funny in this instance because it was officially escalated to the point of being indistinguishable from satire by the very nature of it being too satirical.  The original authors were very likely exaggerating the style of the genuine participants in the discussions on the various right-wing sites, and then I take that probable satire, assume it may be genuine (as I am aware of Poe's law I have to just take chances and go with my instinct, or whatever I think will get me the most karma, knowing that there is always a chance I'm completely wrong) and choose to further stretch the bounds of satire by placing that phrase at the end of what one can only assume is a serious comment, only to result with a nearly text-book example of Poe's law in action.  \n\nSecondly, I was making assumptions.  I'm just a little fed up with people demanding that she was guilty.  That is not how justice works.  I responded assuming you were in that group.", "gilded": 0, "created_utc": "1310171070", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "Your tax dollars at work.  Thanks Obama.", "gilded": 0, "created_utc": "1310173791", "subreddit": "worldnews", "score": 3, "controversiality": 0}
{"body": "Well anything happens for a reason.. WAIT... no real reason here. Thanks Obama and his puppeteers.", "gilded": 0, "created_utc": "1310209841", "subreddit": "fffffffuuuuuuuuuuuu", "score": 4, "controversiality": 0}
{"body": "NASA under George W. Bush cancelled the shuttle program with the understanding that the funds were to be diverted to a new program, Constellation/Orion, the goal being to eventually send humans to Mars.  Obama came along and almost immediately cancelled Constellation/Orion and there's nothing to replace it.  So now Russia and China are the only countries in the world with manned spaceflight programs.  All the NASA engineers and workers who worked on the shuttle program have been laid off with no hope of getting rehired, since there is no replacement program anymore; not to mention the thousands and thousands of contractors.  Obama has gutted America's space program, and I don't think it will ever recover.  Thanks Obama.  ", "gilded": 0, "created_utc": "1310224914", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1310247064", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "THANKS, OBAMA.", "gilded": 0, "created_utc": "1310251130", "subreddit": "funny", "score": 15, "controversiality": 0}
{"body": "Thanks obama", "gilded": 0, "created_utc": "1310306449", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1310408179", "subreddit": "Libertarian", "score": 1, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1310420285", "subreddit": "conspiracy", "score": -1, "controversiality": 0}
{"body": "I guess net zero is better than net negitive 11 million. Thanks Obama.", "gilded": 0, "created_utc": "1310580009", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "no thanks obama ill keep my guns...so when shit like this goes down im defending my shit...", "gilded": 0, "created_utc": "1310778609", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "And what makes you think the tax code treats them as rich? The actual rich should be paying much more than 20-30%.\n\n&gt;one side is completely disingenuous: Thanks, Obama is an ass so I agree with your comment that Obama is disingenous\n\nYou just prove my point.", "gilded": 0, "created_utc": "1310833265", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Cannot use technology.  THANKS OBAMA!", "gilded": 0, "created_utc": "1310919172", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "Another liberal \"retort\" ... Yawn. \n\nHey, how's that CHOPE working for ya?  \n\nIf we're lucky, China will take Alaska for a down payment on the debt.  \n\nThanks Obama!\n", "gilded": 0, "created_utc": "1310946133", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1311021572", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "**Thanks, Obama!**", "gilded": 0, "created_utc": "1311171208", "subreddit": "circlejerk", "score": 6, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1311173598", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks obama", "gilded": 0, "created_utc": "1311257171", "subreddit": "science", "score": -6, "controversiality": 0}
{"body": "Thanks Obama! I can tell my kids I was alive when we stopped exploring space so we could focus on more important things here on Earth like spending billions researching global warming (lolol) and appeasing muslims!", "gilded": 0, "created_utc": "1311279238", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "    Thanks, Obama.", "gilded": 0, "created_utc": "1311284535", "subreddit": "wallpapers", "score": -3, "controversiality": 0}
{"body": "Exactly. Bush may have ended the shuttle program as we know it, but there was a plan for the next generation. Not anymore. Thanks Obama.", "gilded": 0, "created_utc": "1311338615", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "WHY IS THE MSM IGNORING THIS STORY! THANKS OBAMA! ", "gilded": 0, "created_utc": "1311369691", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "Well that's it, we might as well just give our county to Al Queda.  Now every military recruiter is going to be telling our kids to be gay.  Its not bad enough that schools say it is ok, the last bastion of honor and manliness is now gone to the queers, I bet they get special pink uniforms too.\n\nThanks Obama.", "gilded": 0, "created_utc": "1311460307", "subreddit": "news", "score": -11, "controversiality": 0}
{"body": "&gt;All this has to be ready to launch by 2025 by presidential order.\n\nThanks Obama.\n\n\nI hope they bring an extra propulsion system to maneuver the asteroid into Earth orbit to use as a counterweight for an orbital lift. Actually, they could send an unmanned craft to perform that beforehand and meet it halfway with a crew. Once we have a lift up and running, all the inefficient rocket nonsense won't hold us back anymore. ", "gilded": 0, "created_utc": "1311602219", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "The redirection of funding of a NASA program is indicative of the failure of capitalism and clearly all of NASA is done for and the US has lost on all fronts. Thanks Obama!", "gilded": 0, "created_utc": "1311644357", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "This is what happens when the Chinese have too much American money. THANKS OBAMA!", "gilded": 0, "created_utc": "1311733521", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "Thanks Obama. . . ", "gilded": 0, "created_utc": "1311737572", "subreddit": "news", "score": -17, "controversiality": 0}
{"body": "THANKS OBAMA! ", "gilded": 0, "created_utc": "1311912155", "subreddit": "politics", "score": 7, "controversiality": 0}
{"body": "So 51% of people aren't paying there fair share? Thanks Obama.", "gilded": 0, "created_utc": "1311949737", "subreddit": "politics", "score": -6, "controversiality": 0}
{"body": "Probably because we had 0.4% GDP growth in the first quarter of the year.  Thanks Obama!  How's that recovery going for ya?  Why don't you have another speech blaming Republicans for your shitty ass recovery.  Awesome isn't it?  Nothing is ever your fault.  It's all Bush's fault for protecting our country while you went on your apology tour to the muslim world and even bowing to Japan.  Liberals are Giant Pussies.   Bye.", "gilded": 0, "created_utc": "1312004307", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "No 3DS remake!? \n\n*Thanks OBAMA*", "gilded": 0, "created_utc": "1312010518", "subreddit": "gaming", "score": 8, "controversiality": 0}
{"body": "\"My home was broken into. THANKS OBAMA!\"", "gilded": 0, "created_utc": "1312139466", "subreddit": "self", "score": 0, "controversiality": 0}
