{"body": "Sounds great!\n\nSo where are these samples?  What?  You don't know?\n\nWell okay, who found them?  Some names please?  What?  It was a friend of a friend?  What?  Just some guy you heard of?\n\nHmmm....\n\nWell how about this:  I know this guy who's cousin works in a jungle, and he found a dead stegosaurus, and he cut it open with is light saber (those are illegal in the US, -- THANKS, OBAMA!) and inside it was all robot stuff, made with alien technology.  So this PROVES that Earth is 6 billion years old.  Take THAT, motherfucker!", "gilded": 0, "created_utc": "1273293064", "subreddit": "science", "score": 19, "controversiality": 0}
{"body": "thanks obama", "gilded": 0, "created_utc": "1273343623", "subreddit": "Health", "score": 1, "controversiality": 0}
{"body": "We were just talking with our Junior in HS kid's teacher and the topic came up of what would happen to her healthcare if she waited a year after HS to go to college.\n\nFortunately, because of the Healthcare bill, she can be covered through the age of 26.  Excellent.\n\nThanks Obama!", "gilded": 0, "created_utc": "1273358093", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "Another Goldman Sachs vet set in place like a viper. Thanks, Obama.", "gilded": 0, "created_utc": "1273437779", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Wow, Thanks Obama.  I'd rather have Bush in there.  Holy fuck, Obama has spewed more &amp; more lies.  Hmm, BP contributing so much money to Obama's campaign? THEN offshore drilling ban is lifted.  The bank bailout, now we have Goldman Sachs and a GS supporter and a person that goes along with this \"War On Terror Everywhere\" scheme.  I hope the American people wake up.  This country WILL collapse like the Roman Empire if something isn't done soon.  But, fuck it Americans, I mean, Tiger Woods has a new mistress right?  Who the fuck cares about politics?", "gilded": 0, "created_utc": "1273499938", "subreddit": "politics", "score": -6, "controversiality": 0}
{"body": "Me too!  We're finally done with unnecessary government growth, we've ended those stupid wars, and our freedoms are being restored.  I also had the chance to ride a unicorn to work today.  It was fun.  Thanks, Obama!", "gilded": 0, "created_utc": "1273501888", "subreddit": "news", "score": 1, "controversiality": 0}
{"body": "Yeah THANKS, Obama....", "gilded": 0, "created_utc": "1273583872", "subreddit": "science", "score": -19, "controversiality": 0}
{"body": "We haven't eliminated world hunger, abuse, slavery, and evil in general.\n\nTHANKS, Obama. You piece of shit. &gt;:[", "gilded": 0, "created_utc": "1273590021", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "This is exactly what George Orwell was warning us about in his book \"1984\". In the name of \"equality\" we will put you all into a police state and MAKE you equal in thought and expression. \"Government\" will decide for you if what you think is good for society. Thanks Obama.", "gilded": 0, "created_utc": "1273680347", "subreddit": "Libertarian", "score": 18, "controversiality": 0}
{"body": "This is exactly what George Orwell was warning us about in his book \"1984\". In the name of \"equality\" we will put you all into a police state and MAKE you equal in thought and expression. \"Government\" will decide for you if what you think is good for society. Thanks Obama.", "gilded": 0, "created_utc": "1273680635", "subreddit": "politics", "score": 8, "controversiality": 0}
{"body": "And who will PAY for this new tax at the pump? Thanks Obama.", "gilded": 0, "created_utc": "1273760206", "subreddit": "business", "score": 1, "controversiality": 0}
{"body": "And who will PAY for this new tax at the pump? Thanks Obama.", "gilded": 0, "created_utc": "1273760301", "subreddit": "Libertarian", "score": 1, "controversiality": 0}
{"body": "And who will PAY for this new added tax on top of the tax we already pay at the pump? Thanks Obama.", "gilded": 0, "created_utc": "1273760814", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "And who will PAY for this new added tax on top of the different taxes we already pay at the pump? Certainly not BP....Thanks Obama.\r\n", "gilded": 0, "created_utc": "1273761422", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "And who will PAY for this new added tax on top of the different taxes we already pay at the pump? Certainly not BP....Thanks Obama.\r\n", "gilded": 0, "created_utc": "1273762031", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "And who will PAY for this new added tax on top of the different taxes we already pay at the pump? Certainly not BP....Thanks Obama.\r\n", "gilded": 0, "created_utc": "1273764121", "subreddit": "energy", "score": 1, "controversiality": 0}
{"body": "My uncle talks about Coulter, Bachmann, and Palin like they are the hottest women in politics. He actually uses them as proof that Republicans have hotter women. Then again, I went to the store with him yesterday, and he bought cigarettes. When the lady told him cig. prices were up 9 cents, he mumbled \"Thanks, Obama...\".", "gilded": 0, "created_utc": "1274200293", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "Another nail in the coffin of the Obama lie about no new taxes on anyone making less than $250,000 a year. Thanks Obama for the Obomination of Obamacare.\r\n \r\n  This is how the morons that don’t work will get their health care, at our expense.  OUR meaning those of us who work for a living.This is supposed to be part of the new Health Care Bill.    I contacted my Congressman about House bill HR3590 the health care bill that just passed. I asked for a summary of changes.The aid directed me to go to www:thomas.gov ; enter HR3590 in the search box and look for summaries.   Starting in 2011 (next year folks) your W 2 tax form sent by your employer will be increased to show the value of what ever health insurance you are given by the company. It does not matter if that's a private concern or governmental body of some sort. If you're retired? So what; your gross will go up by the amount of insurance you get.  You will be required to pay taxes on a large sum of money that you have never seen.  Take your tax form you just finished and see what $15,000 or $20,000 additional gross does to your tax debt. That's what you'll pay next year. For many it also puts you into a new higher bracket so it's even worse. This is how the government is going to buy insurance for the15% that don't have insurance and it's only part of the tax increases. Not believing this I researched the summaries and here's what I'm reading: On page 25 of 29: TITLE IX REVENUE PROVISIONS- SUBTITLE A: REVENUE OFFSET PROVISIONS-(sec. 9001, as modified by sec. 10901) Sec.9002.  \"requires employers to include in the W-2 form of each employee The aggregate cost of applicable employer sponsored group health coverage that is excludable from the employees gross income.\"  Joan Pryde is the senior tax editor for the Kiplinger letters. Go to Kiplingers and read about 13 tax changes that could affect you. Number 3 is what I just told you about. Why am I sending you this ? The same reason I hope you forward this to every single person in your address book. People have the right to know thetruth because an election is coming in November.\r\n\r\n\r\n\r\n", "gilded": 0, "created_utc": "1274322067", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1275055862", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama, nice to know.", "gilded": 0, "created_utc": "1275286135", "subreddit": "funny", "score": 5, "controversiality": 0}
