{"body": "I learned a new word today:\r\n\r\nequanimity\r\n\r\nThanks Obama!", "gilded": 0, "created_utc": "1241230696", "subreddit": "politics", "score": 14, "controversiality": 0}
{"body": "A company is an entity devoid of conscience. Only profit can sedate it. If you want to ship jobs overseas, it should be more difficult than just hiring a local.\n\nThanks Obama!", "gilded": 0, "created_utc": "1241746267", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "\"The American people be damned.\" Thanks Obama!\r\n", "gilded": 0, "created_utc": "1242390835", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "thanks Obama! *belch*", "gilded": 0, "created_utc": "1242657626", "subreddit": "economy", "score": 1, "controversiality": 0}
{"body": "I am in no way right wing, I voted for Obama. And I am seriously pissed off with the constant stream of news from the White House that tells us Obama is reversing course on what he said he would do when he was a candidate, now he is actually in power. So we're getting out of Iraq (kind of, maybe); but ramping up in Afghanistan. So now we're not going to pursue anybody from the past administration for anything that happened - now it's all about \"looking forward\" and \"protecting our troops\", bullshit excuses to cover up the fact that Obama is apparently obsessed with finding \"middle ground\" and not offending anybody too much. He seems to be equally obsessed with being like Lincoln, surrounding himself with his political enemies. This is a losing strategy. The Republicans are completely ruthless in their political strategy, as they have been demonstrating very well. He gives, they give nothing. He compromises, they are not at all interested in compromise. Listen, if there's a chasm between you, then there's no point meeting halfway, is there? Sometimes you have to take a strong position. Those who say that Obama is \"just a figurehead\" and unable to change direction so quickly are really putting their heads in the sand. We've seen a constant stream of decisions MADE BY OBAMA which disappoint the very base which got him into office. These aren't caused by the huge beurocracy in DC, they are policy statements coming from the man himself. So, as the headline says, what are we seeing? A bunch of Wall Street insiders put in charge of the economic crisis... caused by Wall Street. So, um, any guesses who gets to benefit from that? Anyone? And torture prosecutions - why isn't ANYBODY being held accountable? Have we reached an age where NOTHING is prosecutable any more, all you have to be is \"part of the administration\" and somehow that gives you magical carte blanche to ignore whatever laws you like, abandon habeus corpus, spy on Americans without warrants (we're keeping that, apparently - thanks, Obama!), authorize torture... and now we hear that he's going to keep the military tribunals for the detainees at Gitmo. It's making a lot of people sick and tired, because this isn't a lack of progress after four months - it's progress, but in the WRONG DIRECTION. We need strong leadership to counter what the Republicans want to do to this country, what they've been doing for the last eight years, and what they apparently continue to be able to do, even though they are no longer the party in power. I wish the Democrats would grow a fucking backbone.", "gilded": 0, "created_utc": "1242660144", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "Awesome thanks! I'm going to copy/paste this into my own résumé. It's so impenetrably vague and full of robust action words that really don't mean all that much:\n \nAppointed, expanded, extended, indexed, directed, restored, supported, pledged, enacted...\nYes, I did all those things!\n\nSeriously, this list of accomplishments is so trivial and limp-wristed. \n1. \"supported increased funding for the NEA\" -&gt; OMG THANKS OBAMA! THANK YOU!\n2. \"indexed the 2007 AMT patch.\" -&gt; I'VE WAITED FOR THE MOMENT MY ENTIRE LIFE.\n3. \"(take your pick from the above)\" -&gt; THANK GOD! IT'S ABOUT TIME! YAY!  \n\n", "gilded": 0, "created_utc": "1242706224", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "wow another groundbreaking surprise, thanks obamaidiots", "gilded": 0, "created_utc": "1242958141", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Was all over Reddit; use the search feature if you dare. Posts littered homepage \"THANKS OBAMA FOR EXPOSING THE WAR CRIMES; OBAMA PLANS TO RELEASE GITMO TORTURE\" etc etc.\n\nI was honestly hoping he would.", "gilded": 0, "created_utc": "1243520385", "subreddit": "politics", "score": 1, "controversiality": 0}
