{"body": "Principal financial just closed their entire fucking insurance department today.\n\nThanks Obama", "gilded": 0, "created_utc": "1285951604", "subreddit": "reddit.com", "score": -6, "controversiality": 0}
{"body": "CHANGE!  Finally! Thanks Obama!", "gilded": 0, "created_utc": "1285976937", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!\n\nEDIT: jk", "gilded": 0, "created_utc": "1286301667", "subreddit": "politics", "score": -4, "controversiality": 0}
{"body": "Thanks, Obama!", "gilded": 0, "created_utc": "1286348555", "subreddit": "business", "score": 1, "controversiality": 0}
{"body": "Fuck yea.\n\nToo bad the DEA can still come in and do whatever the fuck they want.\n\nOf course they can tell the Feds to fuck off, but bye bye federal funding.\n\nThanks Obama.", "gilded": 0, "created_utc": "1286372589", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "All of the bad PR with none of the benefits.  Thanks Obama.", "gilded": 0, "created_utc": "1286493145", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Actually the company I work for is not hiring because it is a small business hovering around 50 employees... if you have under 50 employees you are exempt from the new health care laws so the owner does not want to expand.\n\nThanks Obama!", "gilded": 0, "created_utc": "1287055621", "subreddit": "Economics", "score": 13, "controversiality": 0}
{"body": "They said much of that required investment is the result of the health care reform bill passed in Washington.\r\n\r\nThe CEO said it means the need for more spending and less federal reimbursements.\r\n\r\n\"Health care reform is absolutely playing a role. Was it the precipitating factor in this decision? No, but was it a factor in our planning over the next five years? Absolutely,\" Cook added.\r\n\r\n\r\nThanks Obama!!!", "gilded": 0, "created_utc": "1287162884", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I'd cancel but it's against the law now. Thanks Obama.", "gilded": 0, "created_utc": "1287174193", "subreddit": "Economics", "score": 5, "controversiality": 0}
{"body": "thanks obama!", "gilded": 0, "created_utc": "1287231402", "subreddit": "Economics", "score": 0, "controversiality": 0}
{"body": "Thank God Obama has mandated that we all buy health insurance or pay big ass fines. Also, he hired 16,500 IRS agents to enforce his bullshit law. That has to be good for America, huh?\r\nYou can never have too many fucking IRS agents can you..\r\nThanks Obama! You have now set the Democratic party back 50 years.\r\nFuck you Hussein", "gilded": 0, "created_utc": "1287288302", "subreddit": "politics", "score": -4, "controversiality": 0}
{"body": "Thanks Obama, you dick!", "gilded": 0, "created_utc": "1287290132", "subreddit": "canada", "score": -1, "controversiality": 0}
{"body": "I have had to tell this story half a dozen times already, and I'll tell it 3 dozen more times. The health care reform made a real difference in my life. Here's how: \n\nI need a kidney transplant. I'm on Medicare/Medicaid. When I had tried before to get on the transplant list one of the problems which I could not properly respond to was the need for medications after the transplant. Since having a kidney transplant is a pretty noticeable Pre-Existing Condition, potential transplant patients are told to save up as much money as they can to pay, out of pocket, for the medications and doctor visits you need to stay alive and keep your transplanted kidney functioning. I'm a relatively young guy, and I was told I should try aim for \"a couple hundred thousand dollars. At least.\" That's pretty much impossible for me.\n\nSo now it's the end of 2010, and I have reapplied to the transplant list. I went in a few weeks ago and started the process again, and this time things went a little differently when we got to the money section. In fact we knocked down the $3000/month cost for medicine to around $400/month (estimated) for insurance. Insurance I will be able to get now. \n\nNow, I'm on the transplant list. Thanks Obama and the push for health care reform. It isn't everything I would hope for, but it's enough to give me some hope. And soon, a kidney.\n\nAs for the stimulus bill, my mom is a software tester. She was out of work for almost a year. She just got a job for a health care company that is getting money for the job she has been hired to do from the stimulus package. Something about digital storage of medical records. So thanks again, Obama. Now my mom is going to have a place to live, and food to eat.", "gilded": 0, "created_utc": "1287383897", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Prop 19 will lead to more racial profiling in the state for this reason.\n\nAlso, the DEA has made it clear that they will continue to pursue growers and smokers. Thanks Obama for lying about the DEA and pot busts too. ", "gilded": 0, "created_utc": "1287419209", "subreddit": "trees", "score": 0, "controversiality": 0}
{"body": "How dare you try and feed me liberal lies about this Obamacare deathpanel decision to kill fat people who gave themselves diabetes from being too poor and stupid to buy disgusting fresh local foods and not deliciously yum dollar menu items from fast food chains. This food keep for months without rotting how is it not good for me. I don't know where in the constitution it says we have to have an FDA but we should should take that right out of there and damn Woodrow Wilson the BASTARD for putting it in there! I need to buy some antique gold coins so I can afford my Nazi prescription drugs. Thanks Obama and Pelosi for making my children gay married by giving me diabetes and AIDs and taxing me for this bullshit.", "gilded": 0, "created_utc": "1287592318", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "THANKS, OBAMACARE!!", "gilded": 0, "created_utc": "1287847753", "subreddit": "gaming", "score": 20, "controversiality": 0}
{"body": "TIL that my companies health insurance costs are going up thanks to \"Obamacare\".  I am now going to be paying a higher deductible.\n\nThanks, Obama!", "gilded": 0, "created_utc": "1288271862", "subreddit": "todayilearned", "score": 8, "controversiality": 0}
{"body": "I do have health insurance and my premiums are going up, big time.  Thanks, Obamacare -- and you're welcome, OP.", "gilded": 0, "created_utc": "1288275575", "subreddit": "todayilearned", "score": 0, "controversiality": 0}
{"body": "Hey alright!! Too bad it's to expensive to\nactually pay for without plummetting the nation into further debt not to mention furthering the power of a broken system!! \nThanks OBama!!", "gilded": 0, "created_utc": "1288276107", "subreddit": "todayilearned", "score": -5, "controversiality": 0}
{"body": "Til I am 26! thanks Obama ", "gilded": 0, "created_utc": "1288276936", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "I have a rather simple idea that seems like it would pay off 2 years down the line.  Everyone who is benefiting from Obamacare should make YouTube segments saying \"Thanks, Obama\" (30 seconds or less).\n\nSomething like \"I have MS and I've been denied coverage for years.  Starting Nov 1st, I have insurance for the first time in years because of Obamacare.  Where's your compassion, conservatives?  Thanks, Obama\"\n\nIf it gets viral enough, well, all the better...", "gilded": 0, "created_utc": "1288285929", "subreddit": "todayilearned", "score": -1, "controversiality": 0}
{"body": "Thanks Obama!?!?! It's my goddamn tax money that's paying for it. I expect a hand-written thank you, at minimum.", "gilded": 0, "created_utc": "1288291210", "subreddit": "todayilearned", "score": -1, "controversiality": 0}
{"body": "I would just like to say that I'm perfectly healthy, never had to go to the emergency room, and never experienced a major accident of any kind... Which is lucky because I had been kicked off my parents' health plan for years until the new bill passed. Thanks Obama!", "gilded": 0, "created_utc": "1288297369", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "I realized I need some help a good while ago, unfortunately, I will not be back on my father's health insurance for another two weeks. (thanks Obama!) Waiting passively is not my style. I will try writing out the small things for the day, I feel silly doing it sometimes, but I think you're right, it's important.", "gilded": 0, "created_utc": "1288311736", "subreddit": "depression", "score": 2, "controversiality": 0}
{"body": "I wrecked my car last week. Now thanks to Obamacare, I can get insurance to cover this \"pre-existing\" condition and everyone else to pay for it. Thanks Obama!", "gilded": 0, "created_utc": "1288385839", "subreddit": "todayilearned", "score": 0, "controversiality": 0}
