{"body": "&gt;Thanks, Obama, for pressuring us into a war we don't want and making our government fall.\r\n\r\nWell, he was in a pretty messed up position himself...", "gilded": 0, "created_utc": "1280773117", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Thanks Obama and Progressives in Congress!", "gilded": 0, "created_utc": "1281226698", "subreddit": "Economics", "score": -18, "controversiality": 0}
{"body": "Democrats have been in control of Congress for four years, and Congress and the White House for two.\n\nThanks Obama and Progressives in Congress!", "gilded": 0, "created_utc": "1281228923", "subreddit": "Economics", "score": -11, "controversiality": 0}
{"body": "Actually it doesn't.\n\nAnd unlike some troll in their mama's basement, I own my own place.\n\nThanks Obama!", "gilded": 0, "created_utc": "1281698188", "subreddit": "Economics", "score": 1, "controversiality": 0}
{"body": "Yep, that's about right. My boss was happy about that, up until the point he realized he'd be paying more taxes on his business and would make less money. He decided to remedy that situation by firing his editor. Now I work twice as hard... and, oh yeah, I get no bonuses. More work, less pay.\n\nThanks Obama and all you Democrats. But you had good intentions right? And that's all that matters right? Fuck the consequences and all that noise, right?", "gilded": 0, "created_utc": "1281714093", "subreddit": "Economics", "score": 5, "controversiality": 0}
{"body": "Florida: A god forsaken state? Have you ever been in the midwest, or \"up north\" where they have that season called, what is it again? Oh yeah…winter? How about state  income tax? Not in Florida. \n\nHave you ever watched the sun rise over the Atlantic and set over the Gulf? Florida. \n\nEver been woken up by the space shuttle taking off or landing? Florida. (Sadly not much longer. Thanks Obama.)\nEver been to an NHL game in shorts, in January?\nEver been to a different theme park for two weeks straight without driving more than 50 miles? Central Florida. \nSo where's your happy place. God help me if you say Oklahoma. ", "gilded": 0, "created_utc": "1282329816", "subreddit": "politics", "score": -4, "controversiality": 0}
{"body": "Here's a number. 500,000 new unemplyment claims. Thanks Obama for being a community leader and not an economist. We got the change for the worse.\r\n", "gilded": 0, "created_utc": "1282374273", "subreddit": "news", "score": -1, "controversiality": 0}
{"body": "Thanks Obama", "gilded": 0, "created_utc": "1282756399", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "I graduated in 2007 with $110,000 in debt due to not qualifying for financial aid and no help from my parents. I majored in math, physics, and religious studies. I landed a job teaching high school math in a public school that pays well and ended up just living at home for three years and paying above the minimum payment on the loans with the highest interest rates while saving money on the side to move out. \n\nI did not consolidate my loans, mainly because I couldn't. The contract that I had signed said that the loans were non-consolidatable and as a result other private loan companies would not consolidate them. So you may want to look into whether or not this is even an option for your loans. \n\nBasically you have two options: Either consolidate them if possible at a fixed lower interest rate and over a longer period of time to have the lowest payment possible, and then pay MORE than that minimum each month to get rid of your debt, OR don't consolidate them and make sure to pay off the loans with the HIGHEST interest rates first (no matter the size of them, the rate is all that matters here if you want to pay the lowest amount possible in the end). What is important is that you try to pay MORE THAN THE MINIMUM in either case if you want to get out of debt. \n\nI am happy to say that after three years of living at home I finally just moved out in November when I bought my first house (thanks Obama!!) and my debt from my BS is down to $50,000, which is much more manageable. \n\nTLDR; If your loans are consolidatable and you can get a low FIXED interest rate, then do it! If they aren't then start paying off the ones with the highest interest rate first, regardless of their individual loan amount. AND FOR CTHULU'S SAKE PAY MORE THAN THE MINIMUM!", "gilded": 0, "created_utc": "1282921211", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "i'm gonna make an AMA later today. I think it was underlying, I always had a little weird to me, but the drugs definitely brought it out in full force. at it's worse for me, I would start the day \"neutral\" and all left turns had to be countered with right turns eventually. ALL DAY until I got ready to go to bed and would make sure I was neutral again. That and counting steps to squares in those kind of areas, for a while I had a bad one where if I accidently bumped into something, or someONE, with one side of my body, i had to reproduce that same or similar sensation on the other side. made for lots of awkward moments.\n\nEDIT: I should add... I actually self diagnosed my self at first, during the beginning or middle of my heavy using. I didn't visit a doctor once those 4-5 years. I just felt they could sniff out drug addicts and stamp a big fat failure on my \"permanent\" record. Of course, since then I've found out what really goes down and have been visiting a psychologist along with getting a PCP, primare doctor. I lucked out and got good health insurance from being in school at the right time, thanks obama. Anyways, I was officially diagnosed a few months ago but it was already way less severe than before and now almost non existent with my meds.", "gilded": 0, "created_utc": "1282923108", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "except for the 50,000 American (foreign) troops still there, and the 100,000 + private contractors...oh, and before we forget, the handful of massive permamnent bases. \r\n\r\nPromise kept alright. Thanks Obama! Keep on bombing civilians in Yemen, Pakistan, and Afghanistan! ", "gilded": 0, "created_utc": "1283082421", "subreddit": "worldpolitics", "score": 1, "controversiality": 0}
{"body": "\"authoritarian capitalist tyranny\"\n\nThat is possibly the dumbest thing I have ever read.\n\nName ONE company, beside the insurance companies(thanks Obama and democrats) that can FORCE you to buy a product.\n\nJust one.", "gilded": 0, "created_utc": "1283167695", "subreddit": "Libertarian", "score": 2, "controversiality": 0}
