{"body": "Didn't the CFTC expand their investigation of Oil Speculation?  So, yes, Thanks Obama, because Bush wouldn't have done...\n", "gilded": 0, "created_utc": "1306887837", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "And he died-- what a pointless death, in idiotic war we were lied about.\nTail wagged the dog, while rich continue to get richer of it, while innocent people on both sides continue to die under \"patriotism.\"\n Thanks Obama for the change-- that you lied to us as well.\n", "gilded": 0, "created_utc": "1306933633", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "One of the problems is that society today has conditioned us into thinking raping and murdering is wrong, when really it's just a way for the justice system to persecute white males. \n\nTHANKS OBAMA. ", "gilded": 0, "created_utc": "1306985254", "subreddit": "circlejerk", "score": 7, "controversiality": 0}
{"body": "As a taxpaying citizen of the US you are also a part owner of the company who is screwing you over!  Net cost of bailout just hit 16 billion.  Thanks Obama!", "gilded": 0, "created_utc": "1307031663", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "Aw, see, this is why we can't have nice things. Thanks Obama!", "gilded": 0, "created_utc": "1307057042", "subreddit": "nsfw", "score": 1, "controversiality": 0}
{"body": "Let me use the same logic. My car got stolen. Thanks Obama and Yankee fans. \n\nGot it!", "gilded": 0, "created_utc": "1307145696", "subreddit": "politics", "score": -3, "controversiality": 0}
{"body": "Thanks obama", "gilded": 0, "created_utc": "1307162289", "subreddit": "circlejerk", "score": 8, "controversiality": 0}
{"body": "Thanks, Obama.", "gilded": 0, "created_utc": "1307167132", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "I never touch umbrellas and I'm poor as shit. THANKS, OBAMA!", "gilded": 0, "created_utc": "1307227256", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "I don't have insurance either. thanks obama", "gilded": 0, "created_utc": "1307231670", "subreddit": "pics", "score": 7, "controversiality": 0}
{"body": "Came here to say it seemed pedantic, but now I feel shallow. Thanks, Obama", "gilded": 0, "created_utc": "1307543477", "subreddit": "reddit.com", "score": 14, "controversiality": 0}
{"body": "Yes and they will. Thanks Obama. Remember, this is part of the federal executive branch. They answer to him.", "gilded": 0, "created_utc": "1307641764", "subreddit": "OperationGrabAss", "score": 11, "controversiality": 0}
{"body": "Fair enough but the point is that NASA lost it's vision when it lost it's funding...\n\nThanks Obama!  Good job!  Take down the ONE government program that nearly everyone agrees with!\n\n&lt;smacks head&gt;", "gilded": 0, "created_utc": "1307650139", "subreddit": "space", "score": -1, "controversiality": 0}
{"body": "&gt;Fair enough but the point is that NASA lost it's vision when it lost it's funding...\n\n&gt;Thanks Obama!\n\nNASA lost its vision for manned spaceflight 25 years ago when it became clear the Space Shuttle wasn't going to be cheap and reliable. They've been trying and failing to come up with replacements since.", "gilded": 0, "created_utc": "1307658634", "subreddit": "space", "score": 2, "controversiality": 0}
{"body": "Thanks Obamanomics!", "gilded": 0, "created_utc": "1307723564", "subreddit": "Economics", "score": -6, "controversiality": 0}
{"body": "Thanks, Obama.", "gilded": 0, "created_utc": "1307752996", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1307989038", "subreddit": "reddit.com", "score": 7, "controversiality": 0}
{"body": "JESUS, CAN'T TAKE MY GRENADES ON A PLANE ANYMORE FOR ME TO JUGGLE IN FRONT OF THE OTHER PASSENGERS.........\n\nTHANKS OBAMA.........", "gilded": 0, "created_utc": "1308026273", "subreddit": "pics", "score": 46, "controversiality": 0}
{"body": "Thanks, Obama.", "gilded": 0, "created_utc": "1308170498", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Now they are giving healthcare to mannequins!? *Thanks Obama.*", "gilded": 0, "created_utc": "1308194735", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "thanks obama", "gilded": 0, "created_utc": "1308339404", "subreddit": "politics", "score": -7, "controversiality": 0}
{"body": "Thanks Obama, you are now commander in chief of opium production, *change* indeed. ", "gilded": 0, "created_utc": "1308349094", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Can't miss him since he never really left. Thanks, Obama!", "gilded": 0, "created_utc": "1308373809", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1308593081", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I spent I believe $20 on a special edition Barack Obama DC Metro pass because the CVS by my housing was out of the regular ones. Regular ones cost $10 and had $5 pre-loaded. The Obama card had no pre-loaded money. THANKS, OBAMA.", "gilded": 0, "created_utc": "1308593090", "subreddit": "AskReddit", "score": 15, "controversiality": 0}
{"body": "... and gov't influence. thanks obama and boehner. ", "gilded": 0, "created_utc": "1308635555", "subreddit": "science", "score": -1, "controversiality": 0}
{"body": "1) You clearly are living in economic denial.  You'd have to DOUBLE the number cited for defense to approach what is being spent on unConstitutional do-gooding.  The simple fact is that fiscal sanity requires gutting the social services and entitlements FIRST and MOST.\n\n2) You and your fellow douchebag liberals need to REALLY learn how to do some math.  THERE ARE NOT ENOUGH RICH PEOPLE TO FUND YOUR FANTASIES.  You hate them, I know.  You think they don't pay enough in taxes, I know.  But you are tragically and idiotically WRONG.  The top 10% is already paying about 80% of the taxes (http://www.ntu.org/tax-basics/who-pays-income-taxes.html).  And guess what?  There's not that many of them.  So here's some math for you...\n\nSay you have 100 Bill Gates in the world (there aren't) and you tax them at 100% *of their net worth* - that is, everything they have ever accumulated.  That's 100 * $50B = $5 Trillion dollars.  With that amount of money you can either:\n\n  - Pay off only about 1/3 of the debt (thanks Obama ... it's mostly yours)\n  - Run the country for just a bit under 2 years (@ $3.6T/year).\n\nAnd you can only do this ONCE - you've taken everything they ever made away from them.\n\nIOW - your understanding of money and taxation is profoundly stupid.  Fiscal health can only come from CUTTING THE SIZE OF THE FEDERAL GOVERNMENT.\n\nAs to war and the making thereof:  That horse is long out of the barn.  Every administration since Teddy Roosevelt has been sticking our beak into the business of everyone else.  It's too late to get out now.  We HAD to go into Iraq because WE HELPED PROP UP HUSSEIN.  He was (partly) our mad dog and he had to go.\n\ntl;dr  Anti-war whiny liberals are fools that do not understand mathematics, history, economics or Reality.\n\n", "gilded": 0, "created_utc": "1308676333", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1308691012", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "that stimulus sure helped out, thanks Obama", "gilded": 0, "created_utc": "1308707143", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama! I feel safer already. ", "gilded": 0, "created_utc": "1308723701", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama", "gilded": 0, "created_utc": "1309052647", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "How easy it is to forget about closing GITMO and not extending the patriot act. Thanks Obama for being pretty much just like Bush. Bombing Libya after getting a peace prize was nice touch.", "gilded": 0, "created_utc": "1309328436", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks, Obama.", "gilded": 0, "created_utc": "1309402720", "subreddit": "gaming", "score": -33, "controversiality": 0}
{"body": "By healthcare options do you mean: if your parents have health insurance you can remain on their plan?\n\nBecause you have no other options. If your parents dont have healthcare, or its bad, or its expensive, those are your \"options.\" Until 3 years from now when you can spend your entire income to buy coverage for your pre-existing conditions.\n\nThe few good things that came out of the HCR bill could have been passed in a much smaller bill without the *gigantic* mistakes that came with the bill. Woo in 3 years you have the *mandate* to buy private healthcare insurance at market rate, with absolutely, positively, not a single price control in the entire bill. Wow, thanks Obama, you're a fucking hero. I can't wait to buy that for profit health insurance from the private predatory companies that created this mess in the first place, and who Obama had write the bill, almost entirely behind close doors.\n\nFuck obama, stop defending that asshole and lapping at his starfish sphincter.", "gilded": 0, "created_utc": "1309412323", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Thanks Obama for protecting copyrights ", "gilded": 0, "created_utc": "1309438562", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Live in Los Angeles here.  If Obama is going to tax millionaires and billionaires then back it up and actually tax them.\n\nMaking $250000 as a joint-flyer here is middle-class.  Making close to that tax bracket and raising 5 kids, can't afford a house, can't afford college, can't afford to buy any cars, and don't have the money to plan for retirement.  Even when they get financial-aid in college we are unqualified for some assistance because we're not poor enough.\n\nYet, every year we have to write a check for $10,000 - $12,0000 to the federal government because they know how to spend our money better than we know how to spend ours.  That money could help pay for college, a car, a fund for retirement, or a DP on a house.  But no that's OK cause we are \"millionaires and billionaires\" that don't deserve a tax break.  Thanks Obama!", "gilded": 0, "created_utc": "1309460611", "subreddit": "politics", "score": 2, "controversiality": 0}
