{"body": "Same, would have been (an unaffordable) $600 for me, and it's a manageable 1/3 of that. Thanks Obama!! \n\nAlthough, when I lived in Berlin, everyone would have just laughed that anyone would have to pay anything at all for health insurance. They have thought about it as a public good for so long that it seems insane to them that we pay for it. ", "gilded": 0, "created_utc": "1283311173", "subreddit": "politics", "score": 268, "controversiality": 0}
{"body": "Throw-away account here to say: \n\nThis 20 year old with depression can go to therapy and afford medication again, thanks Obama!", "gilded": 0, "created_utc": "1283314650", "subreddit": "politics", "score": 12, "controversiality": 0}
{"body": "I am temporarily disabled, and I m having surgery in 2 weeks.  My premiums for Cobra just dropped to $210/mo.  I love being able to afford to heal myself and still support my wife and son.\n\nThanks Obama, I didn't know what I was going to do without this.  My son will have a father that can play with him again thanks to you.", "gilded": 0, "created_utc": "1283320286", "subreddit": "politics", "score": 13, "controversiality": 0}
{"body": "This 20 year old with depression can get a bunch of anti-depressants and sell them to my college mates, thanks Obama!\n\nFTFY", "gilded": 0, "created_utc": "1283353736", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I can't afford to purchase insurance through my work (Group Health) for just me let alone for my family but thanks to health care reform I will now be required to get it or be fined about the same amount. Private insurance companies are raising their rates to cash in on this. Thanks Obama administration for freeing my children and I from the burden of wearing shoes or having electricity for I, like most americans don't have access to a special insurance from fantasyland.", "gilded": 0, "created_utc": "1283367716", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "It get's even worse when you're self employed. I get to claim 35% of premiums for employees but after I have paid full price for me and my family. Since we can't afford it we do without.\r\nThanks Obama administration.", "gilded": 0, "created_utc": "1283368721", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "LOL @OP who thanks Obama for his medication instead of the people who are paying for it. Priceless. \n\nNow I get to pay for his insurance &amp; mine! Awesome!", "gilded": 0, "created_utc": "1283368740", "subreddit": "politics", "score": -6, "controversiality": 0}
{"body": "Thanks Obama, Reid, and Pelosi!", "gilded": 0, "created_utc": "1283695768", "subreddit": "politics", "score": -3, "controversiality": 0}
{"body": "WoW, evil Wins Again. Thanks, Obama.", "gilded": 0, "created_utc": "1283996541", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "thanks, obama. ", "gilded": 0, "created_utc": "1284017145", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "Freedom of speech successfully suppressed by those threatening violence.  What a grand accomplishment.\r\n\r\nThanks Obama for the fear mongering.", "gilded": 0, "created_utc": "1284102794", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "I just took out a 9,000$ loan for school, thanks Obama. I'm loving the low interest rate. In 11 months I stand to make 28$ and hour starting fresh out of school. Probably the best 9,000$ I ever borrowed.", "gilded": 0, "created_utc": "1284165281", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "Thanks Obama, for keeping us safe from muslim terrorists.\n\nIt must be hard for him to deny justice to his brother in faith, but at least he realizes that the USA is more important than the sky-molester that lives in the clouds.", "gilded": 0, "created_utc": "1284172246", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Actually, [Obama re-opened Abu Ghraib](http://www.telegraph.co.uk/news/worldnews/middleeast/iraq/4742288/Abu-Ghraib-to-reopen-complete-with-childrens-playground.html) after Bush closed it down. But it's okay this time, because he built a playground for the kids they capture.\n\nThanks Obama!!!!", "gilded": 0, "created_utc": "1284189233", "subreddit": "worldnews", "score": 16, "controversiality": 0}
{"body": "Obama promised \"if you like the insurance you have now, you can keep it\". Yea, Right. \n\nI was on my wife's insurance because my company's insurance cost more and has a $2400 out of pocket before they cover anything. For my wife to cover me it cost about $70 a month for health, dental, vision, life, ect. They recently sent out a letter stating that due to recent health insurance legislation, if my wife wanted to continue covering me it would cost an additional $600 a month. \n\nOh, I am sure a lot of you will say \"well, that was just a convenient excuse\", and it very well my have been, but it doesn't change the fact that they had that excuse to use. Now I will have to pay $300 a month for about a quarter of the coverage that I had for $70. Thanks Obama. ", "gilded": 0, "created_utc": "1284229165", "subreddit": "Economics", "score": 3, "controversiality": 0}
{"body": "I would've been dropped from my parent's plan this year and forced to pay $2k for 3 months of my school's health insurance plan.  Thanks Obamacare!!", "gilded": 0, "created_utc": "1284424351", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "The comments on the bottom of this article reinforce the idea that far too many people are idiots..\n\nWTF?\n\n&gt; Thanks Obama and BP! Your **lack of inexperience** and concern for LA has served us well. Maybe now you will consider signing your resignation.\n\n&gt; remember that obama told bp what to dump into the water soput the blame **wear it belong!!!**\n\nUh...\n\n&gt;I think this is cause by BP oil taking air factor out of the water due to oil the system the water can not retain the air when oil is enter , every fish should be charge to BP for 500.00 per fish and clean up of all the fish should take place at there expense if they fail we should file law suits on behalf of people of the united States and take the billion they earn every day for next 10 years this should be clear up and test done ASAP\nwhy is this not happening and why is not being reported on national TV\nBe vocal\n\nI don't even....\n\n", "gilded": 0, "created_utc": "1284589120", "subreddit": "worldnews", "score": 114, "controversiality": 0}
{"body": "actually, the Federal Direct PLUS loans are 7.9% and the interest is fixed.  Therefore, much better rate.  I work in Financial Aid and never recommend the Sallie Mae \"Smart\" loan because of this very reason.  I have actually talked people out of taking this loan because the rate is sooo bad.  Unfortunately, since all Federal Stafford and PLUS loans are paid out through the Federal Direct loan program (thanks Obama) banks resort to these tactics to make up for the lost revenue they used to get from the student loans they were able to issue through the FFELP program (which is now gone).  I expect the private student loan industry to be like this for a very long time, and maybe get worse.  ", "gilded": 0, "created_utc": "1284594577", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "It basically means the government gives you a loan for the balance of your debt, which you use to pay all your creditors.  Now, instead of owing Citi or whatever, you owe the federal Direct Loan program--one large sum at (I think) one interest rate.  It can save a lot of money.\n\nIf you make less than (I think) 150% of the poverty line you can then qualify for Income Based Repayment, where you pay a certain percentage of your income for 25 years, after which the balance is forgiven.  This period is 10 years if you work in a non-profit.  This is all pretty new, thanks Obama!\n\nhttp://loanconsolidation.ed.gov/borrower/beligible.html", "gilded": 0, "created_utc": "1284613772", "subreddit": "pics", "score": 7, "controversiality": 0}
{"body": "Thanks Obama and the Democrats!", "gilded": 0, "created_utc": "1284764466", "subreddit": "Economics", "score": 0, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1285011188", "subreddit": "Economics", "score": -9, "controversiality": 0}
{"body": "Regardless of what happens November 2, many aspects of health care will still remain including longer wait times and less care.  Thanks ObamaCare! ", "gilded": 0, "created_utc": "1285097438", "subreddit": "politics", "score": -5, "controversiality": 0}
{"body": "Thanks Obama. Sending people to jail for *life* for growing plants. How's that hope and change?", "gilded": 0, "created_utc": "1285281440", "subreddit": "WTF", "score": -6, "controversiality": 0}
{"body": "Your insurance company now has unlimited liability for providing you benefits.  Your insurance company won't be in business for very much longer. Thanks Obama!!", "gilded": 0, "created_utc": "1285339670", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "I've spent the last two weeks applying for health insurance policies, and getting denied because of pre-existing conditions. I'm 23 and an independent contractor. Thanks to the Health Care Reform I can stay on my Dad's plan til I'm 26. Thanks Obama.", "gilded": 0, "created_utc": "1285339959", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Thanks Obama", "gilded": 0, "created_utc": "1285709136", "subreddit": "technology", "score": 8, "controversiality": 0}
{"body": "Breaking New Alert!!\r\nObama is destructive to America.\r\n\r\nHe hired 16,500 new IRS agents to enforce his mandated insurance, so go buy your insurance or the IRS will fine your ass!!\r\nUnemployment = 9.8%\r\nThanks Obama :)", "gilded": 0, "created_utc": "1285728273", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "Obama has done it all by himself. He has pissed on the ones who got him elected, from the beginning of Office. It was his 'bipartisan' kissing the GOP's ass, and abandoning all Hope for Change which has lost it for the Democrats! Thanks Obama, for damn little change and no hope of any! The Nobel Fraud and serial warmonger now wants to blame others for his lying?", "gilded": 0, "created_utc": "1285763430", "subreddit": "politics", "score": 10, "controversiality": 0}
{"body": "Thanks Obama, for the pocket change. [](/troll)\n", "gilded": 0, "created_utc": "1285800183", "subreddit": "fffffffuuuuuuuuuuuu", "score": 2, "controversiality": 0}
{"body": "on behalf of all of those liberals who care more about  \"D\" than their principles, thanks obama. ", "gilded": 0, "created_utc": "1285812590", "subreddit": "Military", "score": -6, "controversiality": 0}
