{"body": "I used to.  But then I was fired because of the economy.  THANKS OBAMA.", "gilded": 0, "created_utc": "1351782791", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "First it's what sparked the subreddit /r/wheredidthesodago second they're calling it OC for the Thanks Obama at the end either way its a shit post and they should be crucified for it ", "gilded": 0, "created_utc": "1351817411", "subreddit": "reactiongifs", "score": -3, "controversiality": 0}
{"body": "&gt; stop laughing because this is very serious.\n\nObama's feelings were hurt.   I think that's what caused the meltdown.   \n\n&gt;Perhaps that was Mitt's intended message.\nThere is an alternate world where Obama sent jobs to China.\n\nAre you a mind-reader?  We've already determined your Theory of Mind skills are beneath that of the common Bonobo.\n\n&gt;On the planet Kolob, perhaps.\n\nNice bigoted slam there.  The hate is always just bubbling under the surface with you types.  It wasn't that long ago your kind were big proponents of eugenics.\n\nLooks like some of Chrysler's factories will be in italy.  \n\n&gt;[Instead of closing Italian factories, which have been producing fewer than half as many cars as they could, workers there will focus on producing Alfa Romeos, **Jeeps** and Maseratis, Mr. Marchionne said](http://www.nytimes.com/2012/10/31/business/global/fiat-turns-to-high-end-production.html)\n\nThanks Obama!  Outsourcer in Chief!", "gilded": 0, "created_utc": "1351895950", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "What does that have to do with Obama taking everyone's guns away?\n\nRomney *actually signed* an assault weapons ban. (And yet the NRA endorses Mitt Romney. Proving that organization is completely full of shit and lobbies in the basis of far more than gun rights.)\n\nObama has said he probably would sign a bill renewing the assault weapons ban. (Which he could only do if Congress collectively passed one.)\n\nBanning assault weapons is not \"taking all guns away\". You also can't have nuclear missiles. THANKS, OBAMA!\n\n", "gilded": 0, "created_utc": "1351898422", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "\nThis link appears to have been removed from /r/politics by either the spam filter or moderators.\n\n---\n\n[Sophia, 10-Year-Old Daughter Of Gay Dads, Thanks Obama](http://www.reddit.com/r/politics/comments/12k1xg/sophia_10yearold_daughter_of_gay_dads_thanks_obama/)\n\nsubmitted an hour ago by: [herrojew](/user/herrojew) to [politics](/r/politics)\n\n---\n\n**[Confirm it's missing](/r/politics/search?q=\"Sophia%2C%2010-Year-Old%20Daughter%20Of%20Gay%20Dads%2C%20Thanks%20Obama\"&amp;sort=new&amp;restrict_sr=on)** |\n**[Message the moderators about this removal](http://www.reddit.com/message/compose?to=/r/politics&amp;subject=Why%20was%20this%20removed%20from%20/r/politics%3F%3A%20Sophia%2C%2010-Year-Old%20Daughter%20Of%20Gay%20Dads%2C%20Thanks%20Obama&amp;message=http%3A//www.reddit.com/r/politics/comments/12k1xg/sophia_10yearold_daughter_of_gay_dads_thanks_obama/)** |\n**[Post to PoliticalModeration](/r/PoliticalModeration/submit?title=/r/politics%20%5Bspam%20filtered%5D%20Sophia%2C%2010-Year-Old%20Daughter%20Of%20Gay%20Dads%2C%20Thanks%20Obama&amp;url=http%3A//www.reddit.com/r/politics/comments/12k1xg/sophia_10yearold_daughter_of_gay_dads_thanks_obama/)**\n\n\n|           |     | |           |     |\n------------|-----|-|-----------|-----|\ncreated:    |  Nov. 3, 2012 7:22 a.m. | |score:     |  1 |\nfirst seen: |  Nov. 3, 2012 7:21 a.m. | |upvotes:   |  1 |\nlast seen:  |  Nov. 3, 2012 7:25 a.m. | |downvotes: |  0 |\nmissing:    |  Nov. 3, 2012 8:28 a.m. | |comments:  |  0 |\n\n", "gilded": 0, "created_utc": "1351931371", "subreddit": "ModerationLog", "score": 1, "controversiality": 0}
{"body": "\nThis link appears to have been removed from /r/politics by either the spam filter or moderators.\n\n---\n\n[Sophia, 10-Year-Old Daughter Of Gay Dads, Thanks Obama](http://www.reddit.com/r/politics/comments/12k1xg/sophia_10yearold_daughter_of_gay_dads_thanks_obama/)\n\nsubmitted an hour ago by: [herrojew](/user/herrojew) to [politics](/r/politics)\n\n---\n\n**[Confirm it's missing](/r/politics/search?q=\"Sophia%2C%2010-Year-Old%20Daughter%20Of%20Gay%20Dads%2C%20Thanks%20Obama\"&amp;sort=new&amp;restrict_sr=on)** |\n**[Message the moderators about this removal](http://www.reddit.com/message/compose?to=/r/politics&amp;subject=Why%20was%20this%20removed%20from%20/r/politics%3F%3A%20Sophia%2C%2010-Year-Old%20Daughter%20Of%20Gay%20Dads%2C%20Thanks%20Obama&amp;message=http%3A//www.reddit.com/r/politics/comments/12k1xg/sophia_10yearold_daughter_of_gay_dads_thanks_obama/)** |\n**[Post to PoliticalModeration](/r/PoliticalModeration/submit?title=/r/politics%20%5Bspam%20filtered%5D%20Sophia%2C%2010-Year-Old%20Daughter%20Of%20Gay%20Dads%2C%20Thanks%20Obama&amp;url=http%3A//www.reddit.com/r/politics/comments/12k1xg/sophia_10yearold_daughter_of_gay_dads_thanks_obama/)**\n\n\n|           |     | |           |     |\n------------|-----|-|-----------|-----|\ncreated:    |  Nov. 3, 2012 7:22 a.m. | |score:     |  1 |\nfirst seen: |  Nov. 3, 2012 7:21 a.m. | |upvotes:   |  1 |\nlast seen:  |  Nov. 3, 2012 7:25 a.m. | |downvotes: |  0 |\nmissing:    |  Nov. 3, 2012 8:28 a.m. | |comments:  |  0 |\n\n", "gilded": 0, "created_utc": "1351931375", "subreddit": "POLITIC", "score": 1, "controversiality": 0}
{"body": "HE'S THE PRESIDENT, you morons. He's got all of the resources of the federal government at his fingertips. You don't think the military doesn't have some kind of weather control device that could artificially create a storm like Sandy?\n\nBillions of dollars of damages, peoples' homes flooded, animals displaced... THANKS, OBAMA! Hope it wins you the election.", "gilded": 0, "created_utc": "1351966884", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Oh yes, I know. But I've noticed that people like to say that IUDs are magic and never hurt anyone.\n\nProtip: If you're in the US, the IUD is free to you now (along with most other birth control. Thanks, Obama! Some health insurances might not have kicked in, yet, but you can likely go to planned parenthood to get it). I got mine for free a bit over a year ago through planned parenthood before that went into effect, because I'm poor. Best thing ever.\n\nCopper ones often result in heavier periods and cramping, though. If you already have problems with those, Mirena is a godsend (that's what I have, and I'm in love with it).", "gilded": 0, "created_utc": "1351975074", "subreddit": "AdviceAnimals", "score": 7, "controversiality": 0}
{"body": "We are redoing our health care and this showed up. Not to mention last year the big O wouldnt let us use our flex funds to buy over the counter meds. thanks obama :(", "gilded": 0, "created_utc": "1351979942", "subreddit": "politics", "score": -3, "controversiality": 0}
{"body": "Which crew do you run with?  Is it Too Live or Motley?\n\nI'll translate for you what your boss so incomprehensibly tried to convey.\n\n\"The last four years have been tough.  I had to take out another mortgage on my house just to keep this place afloat.  You guys aren't just my employees, you're a major part of my life.  You're like family to me and I hope you understand how much I appreciate your hard work. \n\nUnfortunately, if we have four more years of the narcissist in chief raping me, I won't be able to keep the place open.  Four more years of Obama means that we'll all be unemployed very soon.\"\n\nBUT YOU'VE GOT YOUR FOOD STAMPS!!! THANKS OBAMA! ", "gilded": 0, "created_utc": "1352015554", "subreddit": "PoliticalDiscussion", "score": -4, "controversiality": 0}
{"body": "Ok, so it's your argument Obama is bragging that under his lead only 10% of Al Quaeda is gone.  Is that what you're saying?  Because if it is, that is a pathetic number to brag about.  We're 10% safer from terrorism than we were 4 years ago...thanks Obama!", "gilded": 0, "created_utc": "1352048388", "subreddit": "Conservative", "score": -1, "controversiality": 0}
{"body": "Le Northern Virginia here, it really hasn't been that bad.  I mean they sniped at each other during the debates but I honestly haven't seen a whole lot of nasty mud slinging this year.  NoVA usually leans democrat, but there have been plenty of Romney/Ryan signs around.\n\nI think the most jimmy-rustlin sign I've seen was \"$6 TRILLION IN DEBT, THANKS OBAMA\" on the side of the road.  ", "gilded": 0, "created_utc": "1352143925", "subreddit": "circlebroke", "score": 2, "controversiality": 0}
{"body": "I should clarify that we are not literally rabid.  Completely rabies free.  Thanks Obamacare!", "gilded": 0, "created_utc": "1352157401", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "Or,  until we've spent the entire day LOOKING for work.  Thanks Obama.  Everyday is Presidents' Day when you're in charge.  /willworkforfood", "gilded": 0, "created_utc": "1352239308", "subreddit": "republicanmemes", "score": 5, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1352242568", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks Obama! Now I know where too go vote for Mitt Romney :D", "gilded": 0, "created_utc": "1352247174", "subreddit": "politics", "score": -10, "controversiality": 0}
{"body": "I got a free sticker when I voted.  Thanks Obama!", "gilded": 0, "created_utc": "1352267133", "subreddit": "Conservative", "score": 1, "controversiality": 0}
{"body": "As a matter of fact, I haven't seen it. I went to Iraq with barebones m4's, 240's, SAW's, and .50's. my truck didn't have AC for the first seven months. I ate MRE's for the majority of the time I spent on the road, and got DFAC food when my squad wasn't stuck watching a highway somewhere. I'm not really sure of the spending you're talking about. Are you talking about the HMMWV up armor kit that saved several of my friends lives? I hear those are pretty pricy. I guess the defense budget is worth slashing if you don't give a shit if some guy, seemingly worthless compared to you and your wealthy government elite friends, goes home alive or not. Now my little bro is in the infantry, deploying back to Afghanistan again soon. This time he has to go back with fewer soldiers and less funding, and they are going to expect him to cover the same amount of real estate, more often, with less protection. Thanks Obama, for clarifying that you couldn't give two fucks about me or my bro. Oh but don't forget to tell me that I **have** to purchase your healthcare. ", "gilded": 0, "created_utc": "1352282827", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I had a facebook acquaintance who said that her \"social security and job are gone now. Thanks Obama.\" I was half-tempted to ask if she lost her waitress job to China. I held back my keyboard (read: held my tongue).", "gilded": 0, "created_utc": "1352295016", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "Thanks, Obama.", "gilded": 0, "created_utc": "1352300161", "subreddit": "baltimore", "score": 7, "controversiality": 0}
{"body": "Thanks Obama", "gilded": 0, "created_utc": "1352300651", "subreddit": "trees", "score": 0, "controversiality": 0}
{"body": "I was helping an obese patient out of bed this morning and it suddenly became much easier.  When I had her stable with her feet on the ground at bedside, I looked over and Obama was holding her other arm!  Thanks, Obama!", "gilded": 0, "created_utc": "1352301199", "subreddit": "nursing", "score": 2, "controversiality": 0}
{"body": "Thanks, Obama!", "gilded": 0, "created_utc": "1352304147", "subreddit": "nyc", "score": 22, "controversiality": 0}
{"body": "Well have you seen the stock market's reaction to his re-election? Thanks Obama, I guess it's back to the status quo. 4 more years...  -_-\n\nhttp://money.cnn.com/2012/11/07/investing/stocks-markets/index.html?iid=SF_INV_River", "gilded": 0, "created_utc": "1352309594", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Right? [I've been giving this](http://i.imgur.com/UhsVm.jpg) to people who mention Australia as an alternative. \n\nHere are a few more of LE gems and facebook gold I will copy paste for you:\n\n* I woke up this morning and started my daily routine of crushing weights and hating terrorists while screaming the marine corps anthem followed shortly after by the national anthem. I usually like to end with a nice solid 'MERICA! ... this morning however i got one push in and decided to stop.... instead i began packing my ammunition and gun cabinet with all sorts of provisions for when Obama repeals my freedoms and begins transplanting everyone in the middle east here. Y'know... cuz their family an all.\n\n* I'm just saying the people of America should probably prep themselves for another Revolutionary war. I can feel the storm coming\n\n* America, tonight we go from THE greatest country on earth to the venerable section of historical remembrance labeled \"once great\". Say goodnight. Here comes the knockout punch.\n\n* 4 more years of hell!\n\n* Quitting my jobs and applying for welfare, so i can live off the system for the rest of my life, Thanks Obama. :)\n\n* well looks like im not going to get a job when I graduate......thanks america\n\n* Well, suddenly my dual citizenship in Canada doesn't seem so pointless. I don't know that I can handle another four years. \nBad choice America, bad choice...\n\n(Note: 1st one is actually not satirical. I know the guy pretty well. He is a marine, and strong conservative.)", "gilded": 0, "created_utc": "1352313889", "subreddit": "atheism", "score": 79, "controversiality": 0}
{"body": "Interesting. The guy I'm referencing always comes up on lunch to watch the tickers. The first words out of his mouth after seeing the DOW were, sarcastically, 'Gee, thanks Obama'...\n\nSo basically just wanted to know if his displeasure was at all justified.", "gilded": 0, "created_utc": "1352337275", "subreddit": "PoliticalDiscussion", "score": 1, "controversiality": 0}
{"body": "hey free donuts! thanks Obama. oh.. i see there is a stupid person saying Obama is a failure and a \"the most lieingest president\" dear mother of god.. have mercy on that kids soul when he dies.", "gilded": 0, "created_utc": "1352350306", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Arrrgh! Now I'm stuck in traffic... [thanks Obama!](http://www.youtube.com/watch?v=oPphgGwf7iE)\n", "gilded": 0, "created_utc": "1352385297", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama for letting BP off the hook. ", "gilded": 0, "created_utc": "1352386143", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "thanks, Obama!\n\n/s", "gilded": 0, "created_utc": "1352386328", "subreddit": "LifeProTips", "score": 3, "controversiality": 0}
{"body": "And thanks to drones, NDAA, and kill lists, they now can! Thanks Obama ;)", "gilded": 0, "created_utc": "1352389950", "subreddit": "boulder", "score": 2, "controversiality": 0}
{"body": "Interesting!  I just saw this discussion elsewhere on the internets:\n\n&gt;I think Libertarianism IS America's future.  \n\n&gt;Socialism is going to fail here in the next few years.  There's just not enough money to steal and too few people working to make it.  We've hit the tipping point (Thanks Obama!) and it's going to get rather nasty for the economy.  \n\n&gt;Furthermore we have problems internationally.  The Middle East problem isn't going to go away.  In fact I bet there's a nasty war there in the next 4 years.  Israel, love it or hate it, won't tolerate a nuclear Iran.  It wouldn't surprise me if the wheels have been set in motion for a strike before the new year.  Once that happens you'll have Egypt's Muslim Brotherhood jumping in on it.  From there who knows?  But one thing is for sure: Benghazi will be brought up again and in a big way.  This isn't a Libertarian argument but the Libertarian argument will be used to shape the viewpoint from a hindsight standpoint.  There will be lots of time to do it.  US involvement can be easily justified by saying we'll involve ourselves minimally to protect the peace and try to calm things down.  This means defensive actions and not offensive.  \n\n&gt;Overall I just don't see a path for the Democrats that does not lead to implosion.  If they change their ways and move more fiscally conservative they might pull out.  If the Republicans don't change on social issues they're out.  \n\n&gt;Either way I think one of the two big parties is going to go down over the next 10 years and be replaced with a more libertarian party.  (this may or may not mean a name change, mind you!)\n\n&gt;The bright side is that a Libertarian party can now change the basic philosophical argument from left/right to up/down (meaning liberty vs. totalitarianism).  \n\n&gt;All that said I don't think the current Libertarian party can do it.  They are more anarchists than Libertarian.  If someone can come forward and mold Libertarians to have a philosophy not of every man for himself but rather one that seeks to protect the liberties of all by having thoughtful and limited regulations to provide protections for people but not over-protection then we might have something.\n\n\n&gt;At this point I truly think the Republicans have more ability to adopt and bring in the Libertarians than the Democrats.  The Democrats have moved too far towards socialism and totalitarianism in all things to get to Libertarianism.  The Republicans MUST take a good, hard look at social issues if they are to survive.\n\n&gt;Social issues that can be reconciled between Republicans and Libertarians: \n\n&gt;-Abortion: Stop it with the religious arguments.  Just stop.  Instead use the argument that I use: protection of life.  I'm 100% sure the fetus would prefer to live.  I don't think anyone can argue that life prefers to live over dying.  We can be against it but within reason.  Anyone who uses the term \"Legitimate Rape\" should be tarred and feathered on the spot. \n\n&gt;-Creationism: Come on, guys.  Even the Catholic Church has come out and said evolution exists and does not conflict with their beliefs.\n\n&gt;-Gay Marriage: Who cares?  That said I just want protection against lawsuits against churches or businesses that do not wish to cater to gay marriages.  There's plenty of other revenues and businesses that would be happy to take your fab dollars.  My advice for the gay community: don't force it because you're not going to win hearts and minds that way.  It just makes people push back harder.\n\n&gt;-Global Warming: We can all have a civil discussion here.  If the other side starts to go nuts walk away.  That said we should be good stewards to the Earth but let's not throw out the baby with the bathwater either.\n\n&gt;-Health Care: The solution is NOT nationalization of an industry.  All libertarians and conservatives pretty much agree on this (along with a majority of Americans).  Let's look at the reasons it costs so much instead.\n\n&gt;-Immigration: Our focus needs to be on LEGAL immigration.  We do not want illegal immigrants.  Period.  That said I welcome legal immigrants because they value their citizenship more so than any natural born citizen I've ever known.  Every person I know who has gone through the system legally is proud of their citizenship.  You can see the pride in their faces when they talk about it.  Naturally we cannot afford to let everyone in the world come to America so there does need to be a set of requirements in place.  I'll leave that set to others.\n\n&gt;-Unemployment: get the work requirement back on the books!  You should be either looking for work or working part-time to get unemployment.  Freeloaders should NOT be allowed.  There was once a time when cashing an unemployment check was shameful.  Now it's normal.  That's a HUGE problem.\n\n&gt;-Military: it is time to pull back a bit.  That said we need bases in hot spots around the world. We DON'T need a base in Germany, England, Australia, or where ever peace seems pretty permanent.  That's what the state department is for with their embassies. \n\n&gt;-Foreign Aid: STOP GIVING MONEY TO PEOPLE THAT HATE US.  Just stop it!  In fact we should stop buying friendship all together.   Instead let's save some of that cash to help out when stuff is really needed like Haiti, Japan, or the Indonesian tsunami.  THAT'S when we should step up with foreign aid.  \n\n&gt;-Social Security: Something drastic needs to be done here.  I think a SS savings account for each citizen is the appropriate way to do it.  Set it up so 60% goes into your lock box and 40% goes into a general fund.  The money in the lock boxes can be lent out as general bonds to earn interest (SAFE bonds like munis).  The 40% is going to be needed to help bridge the fund gap in the coming years.  (these numbers might not be correct.  An analysis would need to be done)\n\n&gt;-Tax rates: I have to agree with Romney on this one: Lower the rates but remove the loop holes.  A modified flat tax is the way to go.  We can keep it progressive but make each tier set in stone. No more deductions. \n\n&gt;I can go on if you'd like.", "gilded": 0, "created_utc": "1352391644", "subreddit": "PoliticalDiscussion", "score": 0, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1352408936", "subreddit": "AdviceAnimals", "score": 5, "controversiality": 0}
{"body": "American redditors, take note.  One nice thing about ACA (Obamacare) is that it mandates mental health coverage.  If you have insurance (or if you are under 26 and can get under your parents insurance, thanks Obama) you can see a therapist and get reimbursed no questions asked.", "gilded": 0, "created_utc": "1352427552", "subreddit": "depression", "score": 5, "controversiality": 0}
{"body": "Yeah! Thanks, Obama!\n\nNo, really. What are you talking about?", "gilded": 0, "created_utc": "1352429589", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "California here.  Yeah, THANKS Obama!  Not SARCASTICALLY AT ALL!  THANKS for EVERYTHING!\n\nPresident jerkface is more like it.", "gilded": 0, "created_utc": "1352438051", "subreddit": "PoliticalHumor", "score": 2, "controversiality": 0}
{"body": "That's why he has been elected. Thanks Obama. ", "gilded": 0, "created_utc": "1352444765", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thank god someone else sees this too.\n\nHe went WAY overboard with his lavish praise for Obama.\n\nIt was 7 freaking days before the election and he went all over national TV doing multiple interviews lavishing praise on Obama. He made no attempt to tone it down with just a \"good job, thanks Obama\" and didn't  bother giving Romney any support.\n\nAll of the Obama supporters keep claiming the moral highground saying \"how dare you want Christie to be political during a time of crisis!\" but that's pure fucking bullshit - politics is always there, and taking care of his state was **NOT AT ALL** contingent on lavishing praise on Obama.\n\nIf it was, that would be a different story and nobody could blame him, but it wasn't. The President was going to show up and support his Northeastern constituents no matter what. And of course he went right back to campaigning while the citizens suffered but that went ignored by the media (naturally)", "gilded": 0, "created_utc": "1352475205", "subreddit": "Conservative", "score": 0, "controversiality": 0}
{"body": "THANKS OBAMA.", "gilded": 0, "created_utc": "1352494068", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1352560053", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1352560550", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "No one's buying my pizza. Thanks, Obama! ", "gilded": 0, "created_utc": "1352573684", "subreddit": "PoliticalHumor", "score": 2, "controversiality": 0}
{"body": "That's when you write in a 5 and make the tip $50.00. Thanks Obama you da man.", "gilded": 0, "created_utc": "1352585745", "subreddit": "AdviceAnimals", "score": 3, "controversiality": 0}
{"body": "No, I had to sell my hummer because of the gas crisis. Thanks Obama.", "gilded": 0, "created_utc": "1352593490", "subreddit": "shittyaskreddit", "score": 1, "controversiality": 0}
{"body": "Either way, Obama raised their expenses. Thanks, Obama for yet another knucklehead move. This is what we have to look forward to now.", "gilded": 0, "created_utc": "1352602194", "subreddit": "politics", "score": -3, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1352644909", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "So this is the 1000 years of darkness that Chuck Norris warned everyone about! Thanks Obama!", "gilded": 0, "created_utc": "1352666392", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Thanks Obamacare.", "gilded": 0, "created_utc": "1352666418", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1352691910", "subreddit": "bostonboardgames", "score": 3, "controversiality": 0}
{"body": "Threatening to cut off aid to countries that genocide gay people and then being kind of wishy washy about it, thanks Obama.", "gilded": 0, "created_utc": "1352697443", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "That company is owned by a major Obama donor though.  Plus it's not just red Lobster its all Darden Restaurants. Let the BoyCotts Begin. They only have 2 full time employees per store now.. LoL thanks Obama...", "gilded": 0, "created_utc": "1352702518", "subreddit": "AdviceAnimals", "score": 1, "controversiality": 0}
{"body": "Wait, now I can't eat shitty seafood OR shitty pizza? THANKS OBAMA.", "gilded": 0, "created_utc": "1352734611", "subreddit": "AdviceAnimals", "score": 1, "controversiality": 0}
{"body": "Thanks Obama", "gilded": 0, "created_utc": "1352734897", "subreddit": "politics", "score": -9, "controversiality": 0}
{"body": "THANKS OBAMA!\n\nRON PAUL 2016", "gilded": 0, "created_utc": "1352735885", "subreddit": "AdviceAnimals", "score": 6, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1352738191", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Justice!\n\nThanks, Obama!", "gilded": 0, "created_utc": "1352746208", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Thanks Obama administration, you fucking niggers. ", "gilded": 0, "created_utc": "1352817523", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "The most important thing you need is the experience in already having killed a large animal before. The knowledge that you killed something bigger than your potential prey will help you get an edge. \n\nSince you've expressed interest in moose-hunting, the only animals you're going to be able to find that are bigger than those are in your local zoo. Now, there's no way you can bring a large hunting rifle into a zoo these days (thanks Obama!), so you're going to have to use a hunting knife to take down your pre-hunt kill. \n\nNow, if you're worried that the zoo animals are dangerous, just remember this: zoo animals are tamed, like cats or dogs. They'll let you come right up and pet them if you get over the fences/bars that the zoo puts up so that pussies don't complain about the \"dangers\" of \"roaming large animals\". Good luck, killer!", "gilded": 0, "created_utc": "1352828841", "subreddit": "shittyadvice", "score": 5, "controversiality": 0}
{"body": "People of my caliber, are the one's who keep your welfare check coming.guessing your Just like the millions on welfare, hey why work when the government will subsidized your housing,give you food stamps and now you can even get a cellphone. minimum wage wont pay for those things so lets all get on the welfare train, thanks obamanation.\nAnd lets see all across the country small businesses are laying people off, or just letting them go because they can't afford  the new price of healthcare. Have you been to canada do you know how their healthcare works?  When all of our good doctor's start migrating to other country's, and you have to wait months on end for simple medical procedures you'll know just how great obamacare isnt", "gilded": 0, "created_utc": "1352831263", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama, you done well.", "gilded": 0, "created_utc": "1352838937", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Coming soon to an American city near you.  Thanks Obama.", "gilded": 0, "created_utc": "1352855945", "subreddit": "worldnews", "score": -1, "controversiality": 0}
{"body": "THANKS, OBAMA", "gilded": 0, "created_utc": "1352863760", "subreddit": "gaming", "score": 18, "controversiality": 0}
{"body": "Can't jack off in the bathroom at work.  Or the warehouse, or my car in the parking lot.  Not even in my own car.  Thanks Obama!", "gilded": 0, "created_utc": "1352928138", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "DAMMIT!   Now we can't use this joke when Clinton makes an AMA.   THANKS, OBAMA!", "gilded": 0, "created_utc": "1353017780", "subreddit": "AdviceAnimals", "score": 33, "controversiality": 0}
{"body": "Yeah I'm fully aware that they do cut hours if you reduce your availability. I averaged 12 hours a week last year, and probably 16 this year - because I have another job and I go to school full time, so I pretty much tell Walmart  when I work. No other employer anywhere around will let me set my own hours and give me health insurance. And yeah, it's not great insurance, but it's not horrible either **(thanks, Obamacare!)**.", "gilded": 0, "created_utc": "1353026904", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "And how many jobs we're lost by closing down Limbo!!!!!! Thanks Obama!!!!!", "gilded": 0, "created_utc": "1353073943", "subreddit": "ireland", "score": 9, "controversiality": 0}
{"body": "Because Obama decided to bail on the one ally in the ME that had a decent peace treaty with Israel. Now a new guy takes charge and will use our money to attack Israel.\n\nThanks Obama.", "gilded": 0, "created_utc": "1353080114", "subreddit": "worldnews", "score": -7, "controversiality": 0}
{"body": "Well...there's ANOTHER 1200.\n\nThanks Obama.", "gilded": 0, "created_utc": "1353086744", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "THIS IS FALSE.\n\n\nThis needs to be read. Someone is lying to you. As an RC employee (I am sitting at my desk right now at the main facility), there was no meeting yesterday. Nothing on the company website (internal). No emails. Nothing.\n\n\nA few weeks ago they announced that one of the two plans wont be offered anymore in 2014. I know my coworkers have been posting to Facebook \"losing my health insurance, thanks Obama!\" Extremely conservative environment here.", "gilded": 0, "created_utc": "1353094189", "subreddit": "PoliticalDiscussion", "score": 18, "controversiality": 0}
{"body": "The current buying frenzy is caused by.... FEAR MONGERING.  I'm not holding you personally responsible.\n\nIn my opinion, when you say to yourself \"Oh shit, I can charge these idiots $400 more than the gun is worth and pocket all the profits hehehheh THANKS OBAMA!\" it makes you a dishonest dealer.  I hope that SWMP15 sits on your shelf unsold until you lower it to a fair price.  \n\nThat is just my opinion.  ", "gilded": 0, "created_utc": "1353097716", "subreddit": "guns", "score": 3, "controversiality": 0}
{"body": "Tough choice: There is one dictator that is our puppet and another dedicated to our destruction and is allied with soon-to-be nuclear Iran (Biden says don't sweat it, it aint no big thing). Hmmmmm, Which one do I choose. \n\nNeither Mubarak or Ghadaffi were puppets. Both were elected to their positions. Both were dictators just as the new leaders will be. Both had the good sense to leave Isreal alone. Ghadaffi had even voluntarily turned over his nuclear plans to the US. Neither were a threat to the US or Isreal - unlike their replacements. Thanks Obama - and reddit.", "gilded": 0, "created_utc": "1353099828", "subreddit": "politics", "score": -5, "controversiality": 0}
{"body": "&gt;The current buying frenzy is caused by.... FEAR MONGERING.\n\nFear mongering is not the underlying symptom. DEMAND is the underlying symptom. Take the election out of the equation. \n\nManufacturers have been swamped with orders all year, election has nothing to do with that.\n\nChristmas and hunting season increase demand exponentially, election has nothing to do with that.\n\n&gt;In my opinion, when you say to yourself \"Oh shit, I can charge these idiots $400 more than the gun is worth and pocket all the profits hehehheh THANKS OBAMA!\" it makes you a dishonest dealer.\n\nLet me pose a few scenarios.\n\nWhat you're saying is that the farmer who planted his wheat early and harvests his wheat early because he thinks there's going to be way more rain this year - and there is more rain this year and the price of wheat goes up and he sells his wheat at more than he could have - you would call a dishonest farmer because he took advantage of the market.\n\nWhat you're saying is that the guy who bought a house in 1984, paid it off and sold it in 2004 is a dishonest homeseller because he took advantage of the market.\n\nWhat you're saying is that bank that lent money to someone at 22% interest in 1983 to buy a house is a dishonest bank because they took advantage of high interest rates. \n\nGET YOUR HEAD OUT OF YOUR ASS.", "gilded": 0, "created_utc": "1353100542", "subreddit": "guns", "score": 0, "controversiality": 0}
{"body": "Thanks, Obama!  ", "gilded": 0, "created_utc": "1353103097", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1353105431", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "AAAAANNNNDDDD its gone. My job. My job is gone now. Thanks Obama you fucking moron. How the hell will I feed my kids now!?!", "gilded": 0, "created_utc": "1353120449", "subreddit": "politics", "score": -8, "controversiality": 0}
{"body": "Thanks, Obama!  Thanks FEMA!  Keep up the excellence!", "gilded": 0, "created_utc": "1353154723", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "Thanks Obama. ", "gilded": 0, "created_utc": "1353177396", "subreddit": "Dexter", "score": 17, "controversiality": 0}
{"body": "Thanks, Obama!", "gilded": 0, "created_utc": "1353284567", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "Oh, so, nanobots that can and will destroy the world.  *Thanks Obama.*\n\nSeriously, thank you, that makes sense.", "gilded": 0, "created_utc": "1353288026", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Thanks Obama, I can really see what this world is coming to now.  Reddit Gold to semi-funny puns and unemployment for EVERYONE!  Change is good.  I like Change.", "gilded": 0, "created_utc": "1353292317", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "\"Used\" (the last combat troops left in 2011, thanks Obama!). ", "gilded": 0, "created_utc": "1353312900", "subreddit": "todayilearned", "score": 3, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1353330879", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "New members join reddit every day, because It's some big fancy website (thanks obama and celebrities..) so we'll always have people upvoting the same things that us older members have seen a thousand times.", "gilded": 0, "created_utc": "1353355947", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "like indefinite detention? thanks, Obama!", "gilded": 0, "created_utc": "1353413428", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "I can't read \"thanks, Obama!\" any more without hearing this snarky Fox News anchor tone. It could go like:\n\n\"Dude, the president just gave me a soft serve ice cream cone! Thanks, Obama!\"\n\nand I'd be thinking like \"you Republican bastard\". ", "gilded": 0, "created_utc": "1353413806", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Yes. Thanks, Obamacare!", "gilded": 0, "created_utc": "1353434247", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "But not yet old enough to sex a gun and own a lady. At least not with this fascist government. THANKS OBAMA", "gilded": 0, "created_utc": "1353436456", "subreddit": "gamegrumps", "score": 6, "controversiality": 0}
{"body": "America has never been so divided on green bean casserole as they are now. THANKS OBAMA!", "gilded": 0, "created_utc": "1353510994", "subreddit": "webcomics", "score": 1, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1353606963", "subreddit": "gifs", "score": 0, "controversiality": 0}
{"body": "\"THANKS OBAMA\"", "gilded": 0, "created_utc": "1353683630", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I'm in a similar situation.  When I moved into my apt complex all of my neighbors worked one or two jobs.  As time went on a few people lost their jobs for various reasons and had to move out.  The worst part about it is my landlord decided it is easiest to fill their units with people who receive government handouts such as section 8 housing and unemployment because these tenants will have guaranteed income and he thinks they are more likely to pay rent on time.\n\nI have a huge issue with these government handout programs.  I am now one of four people (apt complex has 20 units) that actually pays rent from a job. Everyone else has their rent paid or subsidized by the government.  Thanks Obama.", "gilded": 0, "created_utc": "1353690158", "subreddit": "funny", "score": -5, "controversiality": 0}
{"body": "And now you guys have nothing to eat. My how times have changed. Thanks, Obama.", "gilded": 0, "created_utc": "1353780019", "subreddit": "pics", "score": 29, "controversiality": 0}
{"body": "Thanks Obama", "gilded": 0, "created_utc": "1353792894", "subreddit": "Conservative", "score": -1, "controversiality": 0}
{"body": "This happens all the time in the ghetto. Seriously, these nigresses are almost constantly pregnant, and are WAYYYYY to stupid to know when they are due. All funded by the American tax payer!\n\nThanks Obama!", "gilded": 0, "created_utc": "1353815979", "subreddit": "WTF", "score": 0, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1353860556", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Thanks Obama and the Democratically Controlled Congress!!!", "gilded": 0, "created_utc": "1353867912", "subreddit": "politics", "score": -3, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1353984709", "subreddit": "phoenix", "score": 0, "controversiality": 0}
{"body": "Got mine five months ago for $22.50-Thanks, Obama, I'm still on my parent's insurance!\n\nI have the paragard so my periods are longer and a bit heavier (went from 3.5 to 5 days). I wouldn't recommend the copper IUD unless you have light periods already.\n\nI'm childfree and under 30. In a perfect world, I would get essure. However, PP and my doctor were great with setting me up with a long term birth control option.", "gilded": 0, "created_utc": "1353989154", "subreddit": "TwoXChromosomes", "score": 5, "controversiality": 0}
{"body": "[Thanks Obama](http://i.imgur.com/9FHMR.gif)", "gilded": 0, "created_utc": "1353999728", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "\"Despite local legalization measures, in March 2011 federal agents raided a whole list of medical marijuana dispensaries throughout the state of Montana, including the one owned by William.\"\n\nThanks, Obama!", "gilded": 0, "created_utc": "1354002806", "subreddit": "news", "score": 14, "controversiality": 0}
{"body": "[Thanks, Obama.](http://www.penny-arcade.com/comic/2010/12/27)", "gilded": 0, "created_utc": "1354022621", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Thanks, Obama", "gilded": 0, "created_utc": "1354028222", "subreddit": "worldnews", "score": -5, "controversiality": 0}
{"body": "“We don’t want to be heavy in Highland Park and light in South Dallas.”\n\nWhy is this guy promoting class warfare?? THANKS OBAMA.", "gilded": 0, "created_utc": "1354041432", "subreddit": "Dallas", "score": 4, "controversiality": 0}
{"body": "Two KFCs closed down in my area, they were notorious for bad service, terrible employees, disgusting food (worse than your typical KFC), and as a result of the previously mentioned bad qualities, low business turnout.\n\nThe first comment I saw about this on Facebook came from your typical GOP Fox News junkie that said \"THANKS OBAMA!\" Really?", "gilded": 0, "created_utc": "1354043177", "subreddit": "PoliticalHumor", "score": 7, "controversiality": 0}
{"body": "put a \"Thanks Obama\" at the end\n", "gilded": 0, "created_utc": "1354073254", "subreddit": "gifs", "score": 2, "controversiality": 0}
{"body": "Or, if you're like me, once you're successful you'll just toss that raggedy fucker out in the trash, and then a decade later when you're back down in the dumps again and all your shiny new stuff is gone (thanks Obama) you're going to be asking yourself, \"Hey! Where the fuck did I put that tiny ass tree?\" ", "gilded": 0, "created_utc": "1354127205", "subreddit": "pics", "score": -32, "controversiality": 0}
{"body": "Who are the retards who thinks this is just now happening?\n\nI worked for a company 10 fucking years ago that had a few people who had been \"temps\" for years because that way they didn't have to supply them with benefits. \n\nGOPtards think if it's happening now, even if it's been happening for years, it's Obama's fault.\n\n\"The sun disappeared from the sky around 8 o'clock and was gone for 12 hours, thanks Obama!\"\n\n\"All the geese flew up North when the weather got cold, thanks Obama!\"\n\n\"Water got below 32 degrees and expanded becoming less dense after it's phase shift, thanks Obama!\"", "gilded": 0, "created_utc": "1354131115", "subreddit": "Republican", "score": 1, "controversiality": 0}
{"body": "I had no idea that Kaepernick was undocumented until just now. Look, I support immigrant rights, but I think he needs to get in line behind the other immigrants who are trying to move through the system legally. \n\nThanks Obama!", "gilded": 0, "created_utc": "1354157957", "subreddit": "49ers", "score": 11, "controversiality": 0}
{"body": "WOW THANKS OBAMA! HOPEFULLY SHE IS ATHILETIST TOO.", "gilded": 0, "created_utc": "1354167880", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "Thanks, Obama.", "gilded": 0, "created_utc": "1354208097", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "thanks, obama", "gilded": 0, "created_utc": "1354251843", "subreddit": "news", "score": -6, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1354286579", "subreddit": "AnarchistNews", "score": 3, "controversiality": 0}
