{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1293936435", "subreddit": "politics", "score": -4, "controversiality": 0}
{"body": "The calendar rolled over and my cancer disappeared.\n\nThanks Obama!", "gilded": 0, "created_utc": "1293937337", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Oh yeah! That must have been why they raised my family premium 20%... Thanks Obama, you're the bestest ever! Maybe you can start a war in Iran next?", "gilded": 0, "created_utc": "1293940775", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "And  by \"spending\" you mean they'll create another shell company in another country \"buy\" services from it -- boom! spending 80%, wow thanks Obama, you sure fixed the problem.\n", "gilded": 0, "created_utc": "1293997553", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Even it was true, you can only decrease premiums if you decrease services.  Thanks Obamatrons!  Besides, actually profit margins of health insurance companies are around 4%.  Big fuckin deal.", "gilded": 0, "created_utc": "1294019769", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "You do realize 2011 just started moron.  My shit jumped 25% right before 2011 started. Biggest jump in years.  Thanks Obama! NOT! ", "gilded": 0, "created_utc": "1294021580", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "THANKS OBAMA!\n\nhttp://www.youtube.com/watch?v=PlFfxWbi5eI&amp;feature=player_embedded", "gilded": 0, "created_utc": "1294090247", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama and Progressives!", "gilded": 0, "created_utc": "1294103421", "subreddit": "Economics", "score": -4, "controversiality": 0}
{"body": "I had problems hearing out of one ear and thought it would go away.  I woke up one night at 2am and couldn't hear out of that ear, and was terrified that it would be permanent, so I went to the hospital.  I don't drive or have a car, so I got a taxi.  I also don't have a lot of money, so this was a pretty expensive decision.  When I was discharged, the subway was just about to begin running, but not just yet.  I had just started at a new job a few days before, and was worried about calling in sick my first week, and I was worried that I wouldn't get enough sleep, and since I had never felt more tired and haggard, I allowed myself to get a cab to take me halfway home.  \n\nI was standing on the platform at Sullivan Station on the Orange Line in Boston, at 5am, waiting for the first train of the day to take me to the end of the line (Oak Grove).  I was standing at the end of the station, which was outdoors.  One of the papers I had with me flew out of my hands and onto the track, so I decided screw this, after all I've been through I better get that paper back!  I thought it was a prescription.  I lowered myself off the platform, but did it awkwardly and fell, landing about 1/8th of an inch from touching the 3rd rail.  That would have killed me.\n\nI almost electrocuted myself for nothing.  The paper I wanted wasn't even the prescription.  It was a stupid printout about ear infections.  And that is what is wrong with health care in America.  Thanks, Obama!", "gilded": 0, "created_utc": "1294154987", "subreddit": "AskReddit", "score": -5, "controversiality": 0}
{"body": "Thanks Obama :P", "gilded": 0, "created_utc": "1294178171", "subreddit": "Libertarian", "score": 0, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1294304313", "subreddit": "politics", "score": -3, "controversiality": 0}
{"body": "Great thanks Obama, your change is for the worst this time.", "gilded": 0, "created_utc": "1294630364", "subreddit": "technology", "score": 0, "controversiality": 0}
{"body": "No thanks, Obama administration. I use LastPass.", "gilded": 0, "created_utc": "1294646064", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "Sorry that wasn't clearly written, i get flustered now days.  Let me rewind..  I completely agree with you, I much rather take on debt than to lose my life!  I've tried one hospital program and waiting to hear back from another.  I've tried to \"discuss\" my payment options with the hospital and doctors and they still want a minimum payment.  All I asked for is a deferment until a later date, so my debt wouldn't go to collection agencies, I didn't get one...\n\nBack when i had the surgery, this was during the end spring semester.  I was unable to finish paying for that semester, before this emergency.  Since then i have seen a decline in work hours...  I've been a server at two restaurants for over five years.  The Service industry is the worst industry to be in right now in the states, during this ‘recession’.  (People are finding out they don't have to go out to eat to have a good time...  &amp; I picked the wrong job!!) I'm top server at one of the places i work and they even call me off because the place is dead.  And we're a Top Rated cuisine....\n\nSince I have no income (or barely enough to pay my rent and bills).  I find no reason to give them a penny.  Food costs have gone up, Bills remain high, DEBT is piling up left and right, and I just started my life....  Something wrong with the picture...  My medical debt can screw my credit for the mean time, but it’s better than filling for bankruptcy. \n\nI'm just mad at the system, more or less.... in Canada that procedure costs $100, Germany - $0, California - $90,000.....  At least i have health insurance until I'm 26 now.....  Thanks Obamacare????\n", "gilded": 0, "created_utc": "1294865691", "subreddit": "Frugal", "score": 0, "controversiality": 0}
{"body": "Thanks, Obama. This is just what we need in a time of runaway unemployment and rising energy costs. Once again, you sacrifice America to the invisible, omnipresent, unknowable, unappeasable god of \"The Environment.\"", "gilded": 0, "created_utc": "1294962974", "subreddit": "environment", "score": -5, "controversiality": 0}
{"body": "You know what will help bolster their profits even more? Getting an executive elected to chief of staff at the whitehouse! Enter  William Daley, JP morgan's profits will explode in 2011, Thanks Obama!\r\n\r\nCHANGE YOU CAN BELIEVE IN!", "gilded": 0, "created_utc": "1295027641", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "No thanks, Obama just got done screwing me over twice already today. Perhaps you need a hug?", "gilded": 0, "created_utc": "1295396412", "subreddit": "politics", "score": -3, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1295672749", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "Thanks Obama, for change we can believe in. \n\nActually, right now I am having a hard time believing this shit is really happening. ", "gilded": 0, "created_utc": "1296021427", "subreddit": "technology", "score": 17, "controversiality": 0}
{"body": "Did anyone else cringe when he said it?\r\nHere is the man in the position to speak out against the illegal searches performed by the TSA.  Instead, he decides to make a joke about the obvious violations to the Constitution.  Thanks Obama.", "gilded": 0, "created_utc": "1296024908", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Well shit. Gas and energy prices are going up... Thanks Obama, it's not like I had money before.", "gilded": 0, "created_utc": "1296028713", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Yay, so not only do I have to pay for a new unnecessary and inconvenient form of transportation, but I'll also have to pay more for heat, food and other things as well! - With the extra money I don't have.\n\nThanks Obama and your retarded supporters! \n\nDriving the country into the ground faster than Bush! ", "gilded": 0, "created_utc": "1296051760", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1296247202", "subreddit": "food", "score": -19, "controversiality": 0}
{"body": "One step closer to islamo-fascism. Thanks Obama.", "gilded": 0, "created_utc": "1296253624", "subreddit": "politics", "score": -5, "controversiality": 0}
{"body": "\"wow, my carpel tunnel is finally gone!! thanks Obama!!\"", "gilded": 0, "created_utc": "1296276904", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "This video is so old - you didn't even link to the original. \"Derp, thanks obama\". Gimme a break, Bush spent money like no president in history.", "gilded": 0, "created_utc": "1296281802", "subreddit": "Libertarian", "score": -9, "controversiality": 0}
{"body": "Shit, the company I work for is just starting a $40,000,000 job for the local *STATE* government.  It's looked at, financially, as no big deal (it's a huge project, with possible nationwide effects, but no big deal to my state).\n\nHell, our existing maintenance contract alone is worth $3,000,000 per year, and we've had that contract for the past ten years.  Do the math.\n\n$100,000,000 looks like a lot of zeros and a lot of money (and sure, to the private individual, it is), but it means shit in the face of a $14 trillion ($14,000,000,000,000) debt.  In 2010, the US Government had an operating budget of $4,472,000,000,000 ($4.472 trillion), and we were driven into deeper debt.\n\nLooking back into financial history of the US, the last time the debt was actually being paid down (largely due to reduced government spending) was when Clinton was in office.\n\nI'm not promoting either party here (as I'm a Libertarian and oppose both major parties), but instead of saying \"Thanks Obama\", you should say \"Thanks to all of the Presidents after Clinton,\" (Dubbya and Obama).\n\nBottom line is that, regardless of party stance, we all need to force the government to reduce spending and pay off the debt.  Obama's little hundred million dollar peace offering isn't going to cut it.  Let's take a huge chunk out of military spending.  How?  Bring our troops home.  Forget about the quagmire in the Middle East.  If we weren't at war, we wouldn't be spending a few hundred thousand dollars a day on every single wartime soldier - and maybe some of them would be able to see their families, and even possibly be there for the birth of their children.\n\nLet's dissolve the DHS while we're at it.  They just suck up taxpayer money.  TSA too.  Fuck it, let's go back to a pre-9/11 US, without war, without fear, without fearmongering, and without obvious government corruption.  \n\nIt'd be a start.\n\nWant sources?  Just ask.  I'll be happy to provide.\n\nI could go on naming places that we (as a nation) could cut costs, but I won't, as this has already become too much of a political diatribe.\n\n**TL;DR:** Obama's offer is bullshit in the face of reality.  I offer some real places we could cut costs.", "gilded": 0, "created_utc": "1296283252", "subreddit": "Libertarian", "score": 19, "controversiality": 0}
{"body": "thanks Obama.", "gilded": 0, "created_utc": "1296293579", "subreddit": "MensRights", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1296319662", "subreddit": "politics", "score": 8, "controversiality": 0}
{"body": "The misrepresentation I see is the assumption that the administration has made a big deal about the $100 million cut.  I haven't even heard of this, and I follow politics pretty closely.\n\nIn all likelihood Obama (or Gibbs) told the press one day that they found $100 million that wasn't put to any use, yet this guy makes a YouTube video making a big deal about it as if this $100 million is the cornerstone of the President's grand plan to fix the deficit.  It's disingenuous at the very lead.  \"Thanks Obama!\"  Derp.  That $100 million could go to a distressed school district or reinforce one of the thousands of bridges in the country that are in much need of repair.\n\nI never knew $100 million was such a bad thing.  *\"Thanks Obama!\"*\n\nI mean, it sounds like you're falling for it too.  Where does this video indicate that there was this big hype about the $100 million cut?", "gilded": 0, "created_utc": "1296333932", "subreddit": "Libertarian", "score": 2, "controversiality": 0}
{"body": "When he/she mentioned Obama first I thought it was gonna be another despondent \"Thanks Obama\" rant.  But for those who didn't recognize it at first, what that person described to a T (even though they left out Harry Reid's pussyfooting) was the process that was getting Obamacare passed.\n\n[..and for those like me a year ago who fell for the notion of calling the health care bill \"Obamacare\" as derogatory due to Republican lambasting it with that name, just wait 5-10 years when it's still in place and mainstream America has not only embraced it, but seeks to expand on it, and when the right-wing spin-doctors start calling it \"Romneycare\" in vain attempt to take credit for it, as they always predictably do.]", "gilded": 0, "created_utc": "1296432934", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "Talking federal income tax: I call bullshit on someone making $50K and paying 25% income tax.  I did the taxes for three guys at work whose households make between $65K and $80K.  They paid between 3% and 8% tax.  If you are making $50 and paying 25% you're not doing it right.\n\nHeck - even if you're paying in the 25% tax bracket at $50K (which you're not) you're only paying on about $6,500 at that rate.  Once you take a single standard deduction and personal exemption that knocks you down to about $41K AGI which leaves you paying 15% or less.  You add in the EIC, childcare expenses, student loan interest deductions, etc, and you're into pretty low tax rates pretty quickly.\n\nPS: Thanks to the first time home buyers credit, I paid &lt;0% tax this year and earned $64K.  Thanks Obama, you're okay by me.\n\nPPS: Numbers...how do they work?!?", "gilded": 0, "created_utc": "1296511523", "subreddit": "politics", "score": 1, "controversiality": 0}
