{"body": "I had mine removed just after I turned 25. I had insurance though (Thanks, Obama!) so it wasn't that bad cost-wise. I was knocked out for the whole thing and didn't have any issues.", "gilded": 0, "created_utc": "1291176785", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1291291022", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "Well, there go the rest of our jobs. Thanks, Obama.", "gilded": 0, "created_utc": "1291308622", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Thanks Obama and you Progressives!  I'm sure it's for our own good because you know better or it's for something-something Justice and fill-in-the-blank Equality.", "gilded": 0, "created_utc": "1291366556", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "THANKS OBAMA! YOU COULDVE LEGALIZED POT ALREADY AND THEN THESE PEOPLE WOULDNT BE DEAD AND THIS CARTEL WOULDVE BEEN PUT OUT OF BUSINESS BECAUSE THEY WOULD BE HOLDING A MUCH LESS VALUABLE PRODUCT!", "gilded": 0, "created_utc": "1291399304", "subreddit": "Marijuana", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!  I would have gladly paid a few additional percentage points in tax over the next two years to help right the ship we sail.  Instead, I guess I will buy a Lamborghini or something.", "gilded": 0, "created_utc": "1291664872", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1291667225", "subreddit": "news", "score": 3, "controversiality": 0}
{"body": "I like how the FBI uses a free email address from live.com. That's a good way to cut costs. Thanks Obama!", "gilded": 0, "created_utc": "1291672137", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "Wow, I really feed safe now, thanks Obama!", "gilded": 0, "created_utc": "1291694049", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "pre-existing conditions are a thing of the past. thanks ObamaCare.", "gilded": 0, "created_utc": "1291835878", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Thanks Obama, you are becoming more hateful by the day!", "gilded": 0, "created_utc": "1291923193", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "So let the Republicans pull the switch to their own fate.  Let the tax cuts expire.  This is the result of cowardice.  And we will continue to be bitch slapped like cowards for the next 6 to 10 years.  Welcome top the new Banana Republic.  Thanks Obama.", "gilded": 0, "created_utc": "1291943726", "subreddit": "obama", "score": 1, "controversiality": 0}
{"body": "So does this mean that my beef will stop being [\"sanitized\" with ammonia](http://en.wikipedia.org/wiki/Beef_Products)? No? Well at least the kids will be fed. Thanks Obama!\n\nFuck the FDA. What a joke. (yah, yah whatever not Obama's fault. fucking bullshit whatever.)", "gilded": 0, "created_utc": "1292329679", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "I feel kinda like a douche for this, but even if this was meant sarcastically, I agree! I don't regret going to school for a good education, nor do I regret not having kids or being married and still being on my parent's health insurance (thanks, Obama!) And when I finally do graduate, my quality of life will probably be better than it is now and my stress level will probably be much lower. \n\nI admire those of you who do struggle in life and persevere, but college and finals is a whole lot more pressure than I think you're giving it credit. Suicide is actually a huge problem every semester around finals time. To people like me, passing my classes (via finals) can be the difference between failing and being stuck at a shitty minimum wage job with all the problems you spoke of plus tens of thousands of dollars of debt or passing and having a higher quality of life. And it's not just that. There's so much pressure from family, whether you're a first generation and you're whole family is watching you or whether your entire family for generations has gone to college and you're expected to go and pass with flying colors like the rest of them. Plus, how many times do you come home from a shitty day of work only to have hours of more shitty work to do? I have been awake for 48 hours straight at a time because I literally did not have time to sleep between papers and studying and making it to class. So, yes, it may be easy street from your perspective, but I doubt that there will be many other instances in my life where I feel like I'm balancing the stress of my entire future and life all at once based one a tiny test.", "gilded": 0, "created_utc": "1292360633", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "The problem is that Obama just gave the Republicans their winning strategy for 2012:\n\n\"If you vote for the Democrats they will let your tax cuts expire this year!\"\n\nThat's not a lie. Thanks Obama, you just committed political suicide.\n\nEDIT: Downvotes? Really? Do you honestly think that the Republicans are going to let the tax expiration in 2012 slide? Do you have any question at all as to who moved the expiration in to 2012? Seriously?", "gilded": 0, "created_utc": "1292607958", "subreddit": "obama", "score": 0, "controversiality": 0}
{"body": "While I agree that the government is mis-managing the economy, and there are certainly signs that we should be worried, this list makes little sense.\n\n&gt; #1 The official U.S. unemployment rate has not been beneath 9 percent since April 2009.\n\nSo this is a tipping point because it is basically unchanged in two years?\n\n&gt; #2 According to the U.S. Census Bureau, there are currently 6.3 million vacant homes in the United States that are either for sale or for rent.\n\nWithout some context, this statistic is meaningless.  What percent of all houses is that?  Is that higher or lower than normal?  By how much?\n\n&gt; #3 It is being projected that the U.S. trade deficit with China could hit 270 billion dollars for the entire year of 2010.\n\nWhy should this matter?   If we are buying their stuff, it means we have money and are getting stuff on sale;  if they are buying our stuff, it means we are meeting consumer demand and getting our money back from them.   Either side of that is a win for us.\n\n&gt; #4 Back in 2000, 7.2 percent of blue collar workers were either unemployed or underemployed.  Today that figure is up to 19.5 percent.\n\nSo if blue collar workers are moving to white collar jobs, is that a bad thing?\n\n&gt; #5 The Chinese government has accumulated approximately $2.65 trillion in total foreign exchange reserves.  They have drained this wealth from the economies of other nations (such as the United States) and instead of reinvesting all of it they are just sitting on much of it.  This is creating tremendous imbalances in the global economy.\n\nThey didn't \"drain this wealth\", the engaged in voluntary trades.\n\n&gt; #6 Since the year 2000, we have lost 10% of our middle class jobs.  In the year 2000 there were approximately 72 million middle class jobs in the United States but today there are only about 65 million middle class jobs.\n\nIs middle class jobs defined as \"the middle third of the economy\"?  Or did these people just move up to higher incomes?  What does this statistic even mean?\n\n&gt; #7 The United States now employs about the same number of people in manufacturing as it did back in 1940.  Considering the fact that we had 132 million people living in this country in 1940 and that we have well over 300 million people living in this country today, that is a very sobering statistic.\n\nThat's because we are producing things more efficiently, meaning people can move from jobs that are physically demanding to comfy office jobs.  This seems like a Very Good Thing.\n\n&gt; #8 According to CoreLogic, U.S. housing prices have now declined for three months in a row.\n\nOMG There's a housing crisis!!!   Guess what, we knew about this, it's been going on for years.  How does that show an impending collapse?\n\n&gt; #9 The average rate on a 30 year fixed rate mortgage soared 11 basis points just this past week.  As mortgage rates continue to push higher it is going to make it even more difficult for American families to afford homes.\n\nOK, this one could be a very bad sign.  This one could have seriously bad effects.\n\n&gt; #10 22.5 percent of all residential mortgages in the United States were in negative equity as of the end of the third quarter of 2010.\n\nYeah, this is why the housing crisis continues.  The real question is whether we are moving in the right or wrong direction on this one, and specifically, if there has been a sudden change for the worse.\n\n&gt; #11 The U.S. monetary base has more than doubled since the beginning of the most recent recession.\n\nYeah, this is bad.\n\n#12 U.S. Treasury yields have been rising steadily during the 4th quarter of 2010 and recently hit a six-month high.\n\nThis is related to #9, and is a bad sign.\n\n&gt; #13 Incoming governor Jerry Brown is scrambling to find $29 billion more to cut from the California state budget.  The following quote from Brown about the desperate condition of California state finances is not going to do much to inspire confidence in California’s financial situation around the globe….\n&gt;     “We’ve been living in fantasy land. It is much worse than I thought. I’m shocked.”\n\nThe state budget crisis could definitely have a bad effect on the economy.\n\n&gt; #14 24.3 percent of the residents of El Centro, California are currently unemployed.\n\nIs this supposed to be some kind of leading indicator, or just a random statistic?  Why do I care about El Centro, CA, in particular, as opposed to the overall rate for the country?\n\n&gt; #15 The average home in Merced, California has declined in value by 63 percent over the past four years.\n\nYes, a four-year old housing crisis.  Covered that already.  Why does that show imminent collapse if it is four years old?\n\n&gt; #16 Detroit Mayor Dave Bing has come up with a new way to save money.  He wants to cut 20 percent of Detroit off from essential social services such as road repairs, police patrols, functioning street lights and garbage collection.\n\nDetroit is a mess, hardly a bellwether for the rest of the country.\n\n&gt; #17 The second most dangerous city in the United States – Camden, New Jersey – is about to lay off about half its police in a desperate attempt to save money.\n\nSee: Detroit\n\n&gt; #18 In 2010, 55 percent of Americans between the ages of 60 and 64 were in the labor market.  Ten years ago, that number was just 47 percent.  More older Americans than ever find that they have to keep working just to survive.\n\nOr is this an indicator that people are living healthier for longer and actually enjoy contributing and having something to do?\n\n&gt; #19 Back in 1998, the United States had 25 percent of the world’s high-tech export market and China had just 10 percent. Ten years later, the United States had less than 15 percent and China’s share had soared to 20 percent.\n\nSo?\n\n&gt; #20 The U.S. government budget deficit increased to a whopping $150.4 billion last month, which represented the biggest November budget deficit on record.\n\nThis is definitely bad news.\n\n&gt; #21 The U.S. government is somehow going to have to roll over existing debt and finance new debt that is equivalent to 27.8 percent of GDP in 2011.\n\nThis is basically the same as #20, and yes, it's bad news.\n\n&gt; #22 The United States had been the leading consumer of energy on the globe for about 100 years, but this past summer China took over the number one spot.\n\nWhy is this bad?  It seems that more efficient use of energy is a good thing.  Or that their population finally just got big enough to pass us.  Either way, it doesn't seem to indicate a collapse.\n\n&gt;  #23 According to an absolutely stunning new poll, 40 percent of all U.S. doctors plan to bail out of the profession over the next three years.\n\nYeah, thanks Obamacare.  Of course, what they \"plan\" and what they actually do may vary.   But it is certainly a problem if Obamacare goes into full effect as planned.\n\n&gt; #24 As 2007 began, there were just over 1 million Americans that had been unemployed for half a year or longer.  Today, there are over 6 million Americans that have been unemployed for half a year or longer.\n\nStudies in various countries show that the average stint on unemployment is just a month or two shorter than benefits last.   We've been extending that for a few years now, so this result is not surprising.   It's not good news, but not surprising.   Easily fixed, IMO.\n\n&gt;  #25 All over the United States, local governments have begun instituting “police response fees”.  For example, New York Mayor Michael Bloomberg has come up with a plan under which a fee of $365 would be charged if police are called to respond to an automobile accident where no injuries are involved.  If there are injuries as a result of the crash that is going to cost extra.\n\nRetarded, but hardly a sign of impending collapse.\n", "gilded": 0, "created_utc": "1292618056", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Wow, that fucking sucks. I guess we can take solace in the fact that the people fucking us over for profit just got a nice tax cut.\n\nThanks, Obama!\n\n(Despite my handle, I'm not a fundie. Just pissed at Obama these days for being a spineless pussy.)", "gilded": 0, "created_utc": "1292951065", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!  Ur the best :-[", "gilded": 0, "created_utc": "1292986179", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "Let's assume Bradley Manning is the whistlebower.\n\nIs exposing WAR CRIMES and CRIME AGAINST HUMANITY the \"crime\" you should really be focusing on? Attack the messanger and ignore the message?! What about the \"let's kill some loved ones and keep their bones as trophies.\" Don't believe this is happening? Guess you watched the US Corporate Media for your entertainment. Shame on you. \n\nThat sick Truth was exposed in the leaks. That the CiA is murdering people as a sport and keeping human body parts of their victims as \"trophies\". SICK SICK SICK\n\nBradley Manning will likely spend the rest of his life being tortured, for telling the Truth. \n\nThe sub-human people who tortured people to death will be free to walk amongst us. \n\nTHANKS OBAMA!\n", "gilded": 0, "created_utc": "1293021317", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "While this may appear to be a civil-liberties victory, gays still can't marry, still have trouble with adoption, visitation rights, medical rights (insurance coverage and making medical decisions for partners), etc.\n\n\nthis is more about making sure there's enough troops to fight in the middle east because the national guard, reservists, and regular military are stretched way too thin.\n\nThanks Obama.  A civil rights movement based on the right to love is now free to kill but not to marry.  Good news for families.", "gilded": 0, "created_utc": "1293042057", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Hey, thanks Obama.  Oh, and my insurance just dropped my medication, for which there is no generic.  Should only cost me a couple thousand a year.\n\nWell done, buddy.  Never saw this coming with your full of holes no public option wait 4 years health insurance plan.", "gilded": 0, "created_utc": "1293123360", "subreddit": "Health", "score": -2, "controversiality": 0}
{"body": "It isn't bad, it's good. Inflation is when it takes more money to equal the same amount. \n\nlike how a car in the 70's would be 5K and one today would be 15K.\n\nOur dollar in the seventies was worth more than is today, because of inflation, Deflation is great, it means that each and every dollar you have is gaining in value.\n\nI'd like to say \"Thanks Obama\" because this whole economic crisis started with Bush and ended with Obama, all because he wouldn't sit there and listen to all the lobbyists.\n\nThat's just how I see it though.", "gilded": 0, "created_utc": "1293260055", "subreddit": "todayilearned", "score": 0, "controversiality": 0}
{"body": "&gt;Ms. Hatcher said an increase in health costs forced the company to eliminate its mental health coverage for individual plans. \n\n\n\nIncidents like these are just the early symptoms of the epic &amp; massive failure of Obamacare.\n\nThanks Obama &amp; Progressives.  You're destroying what little good there was left.  I know it was on purpose, so fuck you.", "gilded": 0, "created_utc": "1293293045", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Obamacare was written by progressives, their union co-conspirators, and their corporate masters.\n\n\nThanks Obama &amp; Progressives.  You have deliberately poisoned the well for your ideological gain.  People dying in the mean time are just acceptable casualities in your war against freedom and the American Way of Life.", "gilded": 0, "created_utc": "1293294536", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Wasn't even that funny. Thanks Obama.", "gilded": 0, "created_utc": "1293484089", "subreddit": "comics", "score": 73, "controversiality": 0}
{"body": "And it's gonna keep on going up, even faster than before! THANKS OBAMA!", "gilded": 0, "created_utc": "1293496582", "subreddit": "politics", "score": -9, "controversiality": 0}
{"body": "\"Thanks obama for closing gitmo and giving us the public option\" ", "gilded": 0, "created_utc": "1293563801", "subreddit": "IAmA", "score": 2, "controversiality": 0}
{"body": "[Thanks Obama!](http://en.wikipedia.org/wiki/Credit_CARD_Act_of_2009)", "gilded": 0, "created_utc": "1293575301", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "Thanks Obama &amp; Progressives!", "gilded": 0, "created_utc": "1293639084", "subreddit": "Economics", "score": 0, "controversiality": 0}
{"body": "You should send them cards showing pictures of hurricanes, tornadoes, and burning buildings with the caption \"Thanks, Obama!\" Or a picture of your thumb with a papercut.", "gilded": 0, "created_utc": "1293656002", "subreddit": "WTF", "score": 6, "controversiality": 0}
{"body": "OH.  MY.   HEAVENS.\n\nThanks OBAMA????????  \n\nWhat a waste of some perfectly good Hershey's syrup.", "gilded": 0, "created_utc": "1293659516", "subreddit": "WTF", "score": 4, "controversiality": 0}
{"body": "It doesn't come across as funny, though.  Stupidity (thanks Obama!) isn't funny.  Making fun a gigantic natural disaster while nearby people who depend on the Gulf have zero income really isn't funny.  The whole thing screams of rich, self-centered and oblivious.  What a pack of assholes.", "gilded": 0, "created_utc": "1293730278", "subreddit": "WTF", "score": 1, "controversiality": 0}
