{"body": "Yeah, Thanks Obama!", "gilded": 0, "created_utc": "1246412408", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "and we have the highest suicide rates ever among our military today, indicative of massive mental problems- and we just expanded the war in afghanistan and have not ended the one in Iraq. THANKS OBAMA!\n\nDo you see a common thread here? The pres is a puppet for powers larger than he that like to make war in order to make money.", "gilded": 0, "created_utc": "1246989610", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Thanks Obama.  Apparently your idea of change is more of the same.", "gilded": 0, "created_utc": "1247022548", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "Thanks Obama, for the 'transparent' Government, you fucking Liar!", "gilded": 0, "created_utc": "1247363480", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "So the Pharmaceutical Companies can illegally poison us for profit, and legally get away with it! Just like under Bush, corporate criminals get immunity even before their illegal actions. Thanks Obama, you fraud...", "gilded": 0, "created_utc": "1247905271", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Aside from the fact that this is reprehensible, disgusting, and incredibly sad for the victims - the people who enacted these sickening behaviors are walking amongst us this very day without fear of prosecution, without fear of being held to account. Thanks Obama! Thank you for living up to your oath! Thanks for bringing torturers and murderers to account! Let your legacy show your respect for victims of torture and the rule of law! \n\n*Incredibly pissed off now. ", "gilded": 0, "created_utc": "1248147758", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "Ok, so if America gets UHC, we will lose our comparitive advantage as Ear Nose and Throat specialists.\n\nThanks, Obama!", "gilded": 0, "created_utc": "1248227443", "subreddit": "AskReddit", "score": -11, "controversiality": 0}
{"body": "Answer: Because that would point out the benefit of the marketplace at work. This is Reddit. Capitalism = Bad, Government Intrusion(subsidies) = Good.\n\nThanks Obama.", "gilded": 0, "created_utc": "1248724467", "subreddit": "environment", "score": -7, "controversiality": 0}
