{"body": "/garyp714 bends over\n\n\n\n/Obama does him doggy style then robs him blind\n\n\n/garyp714 thanks Obama", "gilded": 0, "created_utc": "1243893277", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "oh this is just great. thanks obama, now the terrorist have won. we're engaged in a **dialogue** for christs sake...", "gilded": 0, "created_utc": "1244405717", "subreddit": "worldnews", "score": 3, "controversiality": 0}
{"body": "Oh?  Is he going to stop giving them my money?  Thanks, Obama!", "gilded": 0, "created_utc": "1245027813", "subreddit": "business", "score": 2, "controversiality": 0}
{"body": "Yeah, thanks, Obama the Two-Faced!", "gilded": 0, "created_utc": "1245058925", "subreddit": "WTF", "score": -4, "controversiality": 0}
{"body": "As the effects of the Government/Wall Street hatchet job on the auto industry is fully realized the half-million lost jobs per month will begin to seem small.  This economy will shed millions of jobs and the ranks of the unemployed, destitute, and hopeless will soar.  Thanks, Obama!", "gilded": 0, "created_utc": "1245103192", "subreddit": "economy", "score": 1, "controversiality": 0}
{"body": "Thanks Obama, you two faced fraud, protecting our rights my Ass!", "gilded": 0, "created_utc": "1245312756", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "I ain't no criminal, I just lost my job\n\nAsian call centers filled with Punjabs\n\nI thought this time it would be different\n\nJust ask for a promotion in case they raise the rent\n\nTryin' to ride the winds of change\n\nBut our leaders're fucking deranged.\n\nVoted for a logo that belongs on a Pepsi can,\n\nWell, thanks Obama- ooh *Yes we can!*", "gilded": 0, "created_utc": "1245338821", "subreddit": "self", "score": 5, "controversiality": 0}
{"body": "Hells YA! Who woulda thought that someday America would have a pro skater doing tricks in the most important building in the country? Thanks Obama! \n\nThen again, Andy MacDonald did this during the Clinton administration first. ABD.\n\nRelated Link - Barack Obama Skateboard Deck:\nhttp://invasionskates.com/store/index.php?_a=viewProd&amp;productId=26", "gilded": 0, "created_utc": "1245502250", "subreddit": "Skatebording", "score": 1, "controversiality": 0}
{"body": "Welcome to America, remember only the bankers are eligible for socialism.\nThanks Obama!", "gilded": 0, "created_utc": "1245532244", "subreddit": "AskReddit", "score": -8, "controversiality": 0}
{"body": "My health care horror story is that one day I woke up and the president of the US was advocating a public option instead of single payer health care. I was horrified by how transparent the US government was. Corporations (especially health care companies) pay to make sure their interests are not trampled on and the people get screwed over once again. Thanks Obama.", "gilded": 0, "created_utc": "1245767067", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Thanks, Obama!", "gilded": 0, "created_utc": "1245863533", "subreddit": "business", "score": 0, "controversiality": 0}
{"body": "Why is no one on reddit talking about this?\ntoo busy fussing over dead child molestors?\n\nthis is going to jack up everyone's energy costs while providing no real repair to the environment.  another 1200 page bill we don't get to see.\nthanks obama.  you fuck", "gilded": 0, "created_utc": "1246035651", "subreddit": "environment", "score": 1, "controversiality": 0}
{"body": "&gt;policy by the Congress and a **repudiation** of the Federal Reserve would be highly destructive to the stability of the financial system, the dollar and our national economic situation.”\n\nam I ever getting tired of this mantra. add to it that he just jumped the shark, admitting that the fed can't stand up to scrutiny.\n\nsure, some things need to be kept close to the vest, but we've seen enough to know that this is just another case of leaving the fox on guard duty...as far as i can tell there isn't a whole lot of 'financial system, dollar or national economic situation'. maybe it's past time for some of that transparency, maybe if everyone knew what was going on we could make a better job of it. \n\nthanks Obama, for yet another excellent choice. hows that working out for you?  answer me this; why oh why are we putting the people that lost us all our money in charge of what's left??", "gilded": 0, "created_utc": "1246148281", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "God damn it, signing statements were one of the things I hated most about the Bush administration.\n\nThanks, Obama. Still can't say I would've preferred to have McCain in there, but you're sure doing a nice job of crushing what was left of idealism in politics.\n\nDemocrats: one of my complaints about you for years has been that you're too much like the Republicans. Looks like I'm still right.", "gilded": 0, "created_utc": "1246167783", "subreddit": "business", "score": 10, "controversiality": 0}
{"body": "thanks obama you transparent accomplice", "gilded": 0, "created_utc": "1246359561", "subreddit": "politics", "score": 6, "controversiality": 0}
