{"body": "Thanks Obama for the change I feel so much more secure. ", "gilded": 0, "created_utc": "1301630320", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "They couldn't afford gas for the short-buses. Thanks Obama!", "gilded": 0, "created_utc": "1301633004", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "since my post, i am already level 94. unsure why you seem to have so little faith in me; perhaps you should be applying to MY heroic team...\n\n\nour strategy for nagafen: funny you should ask, i was at dairy queen getting a dilly bar (http://chowtimes.com/wp-content/uploads/2006/02/_MG_2664.jpg) during a tornado warning. i know i shouldn't have been out and about but i ain't lettin' no weather tell me when i kaint (sp?) have no yummy. well faster than you can slowly count to infinity, i walked out to my car to go home. guess who was there? if you said doreen then you would be right. if you said someone else, you would be wrong. she had one of her titties flopped out on account of her drunken nature. her and i got to talking and i was telling her about the raid i was going on later to kill nagafen. she was all like \"what?\" so i hit her with a tire iron. \n\nlater on when i got back home, we went out to raid. this was before computers had the ability to have telephones inside them so we couldn't hear each other - we had to use letters. there were 312 of us, so my amiga was going all slow and shit, i watched Cops on fox. after about thirty minutes of locking up ethnics, i sawed that we had killed nagafen. i tried to win a new bow for my cleric, but lost. politics haha....\n\ni know my choices are excellent, duh.\n\nas far as furniture stuff - WHO TOLD YOU THAT? i think i have a keylogger or something because i swear i have never mentioned it and you bring it up. THANKS OBAMA!!!\n\ni am not sure what you mean by faction transferring but i think you are hitting on me. while i am uneasy because this forum is usually reserved for gaming chitchat, if you want to meet up and sexit - i guess i am down. \n\n\np.s. PACK A FATTY", "gilded": 0, "created_utc": "1301700519", "subreddit": "redditguild", "score": 1, "controversiality": 0}
{"body": "My wife just got a letter from her insurance. The price went up some, yes. But there was also a long list of improvements to the plan, because of Health care reform. Options that weren't available on any plan before. Thanks, Obama!", "gilded": 0, "created_utc": "1301722370", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1301852806", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Currently, no. I've had issues getting back on my parents' insurance (thanks obamacare!) But, I will be calling a therapist Monday and scheduling my first counseling appointment :)", "gilded": 0, "created_utc": "1301881897", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1301894874", "subreddit": "videos", "score": 15, "controversiality": 0}
{"body": "And the military is planning on killing it even more.  Thanks Obama!", "gilded": 0, "created_utc": "1301960980", "subreddit": "gadgets", "score": 3, "controversiality": 0}
{"body": "So only gays use the term \"wifebeater\"? Here I thought we lived in 2011. Thanks Obama. ", "gilded": 0, "created_utc": "1302062355", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1302093909", "subreddit": "technology", "score": 3, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1302100726", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1302107309", "subreddit": "AskReddit", "score": 88, "controversiality": 0}
{"body": "Wait a second! I would have to disagree Mr.Questions-Answered. The truth is most definitely yes, girls drink through straws because of some subliminal training about blow jobs. Its part of a government led agenda to spread socialism in America one knob gobble at a time. Thanks Obama. ", "gilded": 0, "created_utc": "1302133673", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "I was looking to be offended. I wasn't offended. DAE feel this way?\n\nfffffffuuuuuuuuuuu \n\nTIL the internet desensitized me, AMA\n\nTHANKS OBAMA", "gilded": 0, "created_utc": "1302140157", "subreddit": "reddit.com", "score": 20, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1302140478", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt; \"If you had 5,623 participants in a tournament, how many games would need to be played to determine the winner?\" -- Amazon\n\nJust 1.  It's called marathon, bia-tch.\n\n&gt; \"If you were shrunk to the size of a pencil and put in a blender, how would you get out?\" -- Goldman Sachs\n\nCall Mr. Greenspan.  Oh my bad, did I hit some spot there?  hm?  hm?\n\n&gt; \"How would you market ping pong balls if ping pong itself became obsolete? List many ways, then pick one and go into detail.\" -- Microsoft\n\nHire a screaming monkey as the CEO of the company and open up the warchest for the law suit battle of pingpong IP orgy fest.\n\n&gt; \"How many smartphones are there in New York City?\" -- Google\n\nI can't tell you that information because that would be violating smartphone user's privacy.  DO YOU AGREE????? HMMM?\n\nand lastly\n\n&gt; \"Why do you think only a small percentage of the population makes over $125,000 a year?\" -- New York Life\n\nTHANKS OBAMA.  (hired on the spot)", "gilded": 0, "created_utc": "1302146906", "subreddit": "business", "score": 2, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1302156195", "subreddit": "pics", "score": 5, "controversiality": 0}
{"body": "Thanks Obama ", "gilded": 0, "created_utc": "1302243547", "subreddit": "worldnews", "score": -2, "controversiality": 0}
{"body": "Thanks, OBAMA!", "gilded": 0, "created_utc": "1302285694", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!   Oh, wait...", "gilded": 0, "created_utc": "1302289232", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1302303660", "subreddit": "funny", "score": 9, "controversiality": 0}
{"body": "thanks obama", "gilded": 0, "created_utc": "1302366303", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Yeah, assuming the Tea party is stupid and racist just because some stupid racists make up a minority of the movement is the reason you guys will never be able to stand up to them all that well.  You don't take them seriously and write them off off hand and as a result are detroying decent political discourse.  Yeah, they got a third of all their candidates elected because their opponents wrote them off in such a way, a third! And that whole bit about them being against their own economic benefits, yeah the only uniting theme of that group is to not have the government crash our economy with deficit spending and corporate welfare.  Ron and Rand Paul, the godfather and leader of the Tea party respectively, want to end all the three wars we are in (thanks Obama and Bush), end all corporate welfare (go to hell Haliburton and ConAgro), and abolish the IRS, TSA, NSA, and get the government out of spending money to mandate their own personal morality (no federal spending to stop abortion or gay marriage).  Write them off for stupid reason and they will continue winning, some of them even deserve to win.", "gilded": 0, "created_utc": "1302451945", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "I actually agree with the Chinese on this one. We are not as bad as them in many ways, but we really should STFU. The civil rights abuses that have been codified into law. The surveillance society. Guantanamo. TSA. We are no longer the epitome of a \"free\" society and therefore should not be commenting on the actions of other countries.\nThanks Obama for following through on your campaign promises in this area! Ass hole.", "gilded": 0, "created_utc": "1302455410", "subreddit": "worldnews", "score": 6, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1302564494", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama", "gilded": 0, "created_utc": "1302567621", "subreddit": "Libertarian", "score": 2, "controversiality": 0}
{"body": "Thanks, OBAMA!", "gilded": 0, "created_utc": "1302591936", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Thanks, Obama.", "gilded": 0, "created_utc": "1302618228", "subreddit": "economy", "score": -10, "controversiality": 0}
{"body": "Thanks Obama. Now I can feel free to vote third party knowing that there is absolutely no difference between the Democrats and the Republicans.", "gilded": 0, "created_utc": "1302640111", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Gee thanks Obama for preventing the slaughter of thousands - and all I got was this depleted uranium!", "gilded": 0, "created_utc": "1302672708", "subreddit": "worldnews", "score": 2, "controversiality": 0}
{"body": "Nope, no matter what happens, regardless of your party affiliation, everything is now Obama's fault. What happened to that \"THANKS OBAMA\" meme? It was perfect.", "gilded": 0, "created_utc": "1302723773", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1302751170", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "She is making things up to pander to the retards who will say, see people are killing themselves because of Obama. There is no reason to connect the two events, the poor student committing suicide is most likely not related to Obama at all, and shouldn't be tied to it. It's like that other facebook story here a few weeks ago that went along the lines of, My car ran out of gas, thanks Obama. The two are entirely unconnected and it is stupid to say it's a coincidence the two happened at the same time.", "gilded": 0, "created_utc": "1302756429", "subreddit": "politics", "score": 48, "controversiality": 0}
{"body": "I chose the only definition from the meriam webster dictionary that fit. The first definition I could have used also, \"The act of conditioning or coinciding\".  [Coinciding](http://www.merriam-webster.com/dictionary/coinciding?show=0&amp;t=1302760802) \"a : to occupy the same place in space or time b : to occupy exactly corresponding or equivalent positions on a scale or in a series\n2: to correspond in nature, character, or function\n3: to be in accord or agreement\" So while the two events did coincide in relation to time, they did not correspond in nature, character or function, nor were they in accord or agreement. So I can easily argue that these events aren't coincidences in either definition of the word. From wikipedia: \"In the field of mathematics, the index of coincidence can be used to analyze whether two events are related. Such index does not define any relationship, but just describes some possibility of such.\" The author of this article is trying to suggest that these two events are related. She is suggesting a coincidence where there is none. Also from wikipedia, \"The word is derived from the Latin cum- (\"with\", \"together\") and incidere (a composed verb from \"in\" and \"cadere\": \"to fall on\", \"to happen\") So the word suggests that the events happen together. Even if you look at the last definition you provide, \"a striking occurrence of two or more events at one time apparently by mere chance\", this definition also suggests that there is the possibility these events are somehow connected. Once again, these events are most likely totally unrelated, but the author is trying to suggest that they are through the use of the word coincidence. Thanks Obama.", "gilded": 0, "created_utc": "1302761399", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "&gt; She is making things up to pander to the retards who will say, see people are killing themselves because of Obama.  There is no reason to connect the two events, the poor student committing suicide is most likely not related to Obama at all, and shouldn't be tied to it. It's like that other facebook story here a few weeks ago that went along the lines of, My car ran out of gas, thanks Obama. The two are entirely unconnected and it is stupid to say it's a coincidence the two happened at the same time.\n\nWhat did she make up exactly?  The two events *did* coincide.  They *are* a coincidence.\n\nYou want to call her an asshole?  Fine.  You want to say you think she should rot in hell?  Fine.  But don't go around saying something that is true is a lie.  Doing so does nothing but prove yourself to have sunk to the same level as that you accuse.  Find a better attack, one that can't be defended against by someone with 2 minutes of free time and a 56k modem.  If I can find a hole, any hole, in your argument in the time I did then your argument is not worth the time it took to read it.", "gilded": 0, "created_utc": "1302762094", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "Great, now students are killing themselves. Thanks Obama &gt;.&gt;", "gilded": 0, "created_utc": "1302774214", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "&gt;My car ran out of gas, thanks Obama.\n\n\nmore like, \"I lost my house because he didn't make my mortgage payments like he promised to do during the election.\"  \n\nYou folks are idiots.  Your messiah is an abject failure and you over-scrutinize everything Fox does.  Go back and look at what the press did to the idiot Bush.", "gilded": 0, "created_utc": "1302778522", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "THANKS, OBAMA.", "gilded": 0, "created_utc": "1302790831", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "\"The bad economy, an aging population and a plateau in women working are contributing to changes that pose serious challenges for financing the nation's social programs.\"\r\n\r\nTHANKS OBAMA", "gilded": 0, "created_utc": "1302802261", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "THANKS OBAMA\n\n/s", "gilded": 0, "created_utc": "1302806549", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1302818291", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Thanks Obama...", "gilded": 0, "created_utc": "1302819796", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "THANKS, OBAMA!", "gilded": 0, "created_utc": "1302876895", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Thanks Obama. God damn it. ", "gilded": 0, "created_utc": "1302894415", "subreddit": "poker", "score": 7, "controversiality": 0}
{"body": "Thanks Obama! Thanks for ending the wars!", "gilded": 0, "created_utc": "1302894583", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks Obama. Fucking police state. ", "gilded": 0, "created_utc": "1302894644", "subreddit": "poker", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1302906684", "subreddit": "funny", "score": 6, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1302937120", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "This is actually really awesome, thanks obama!", "gilded": 0, "created_utc": "1302979037", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "&gt;Well first of all, libya isn't our war and we don't have ground trips there.\n\nGood thing we didn't spend millions of dollars and are not spending more on weapons we're using there, oh wait!  Good thing we don't pay tons of money to prop up NATO so it can operate in Libya, oh wait!  Thanks Obama for spending tons of money to fight a war in Libya!  Funny how quick you Obama apologists are to defend war when it's your guy.\n\n&gt;secondly the draw back for troop in Afghanistan start in the next couple months\n\nAwesome!  That magically means we didn't spend billions of dollars in Afghanistan under Obama, oh wait.  Obama criticizing anyone for the cost of the wars is fucking laughable seeing as how he's spending just as much on the same wars and supporting them.  Only an Obama shill like yourself could pretend that reality isn't there.\n\n&gt;you pay them, and the government provides certain things..\n\nMore like, you pay them and government pisses away ever penny on useless bullshit and provides very little.  But hey, let's raise taxes so government can piss away more money on useless bullshit?\n\n&gt;In that regard i don't really care\n\nYou and people like you don't care when it's people posting pro-Democrat bullshit.  You're the first to trot out the digg patriots, Republican astroturfers, or megaphone when a group of people disagree with you though.  Pathetic.", "gilded": 0, "created_utc": "1302979406", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "I know, right, THANKS OBAMA!", "gilded": 0, "created_utc": "1303001994", "subreddit": "videos", "score": 4, "controversiality": 0}
{"body": "**THANKS, OBAMA!**", "gilded": 0, "created_utc": "1303026782", "subreddit": "todayilearned", "score": 0, "controversiality": 0}
{"body": "And what did the White house do? Nothing! Yea, thanks Obama.... Thanks a lot.", "gilded": 0, "created_utc": "1303044515", "subreddit": "science", "score": 8, "controversiality": 0}
{"body": "THANKS OBAMA!\r\n\r\nFor passing a healthcare law that takes care of point 2", "gilded": 0, "created_utc": "1303148385", "subreddit": "politics", "score": 18, "controversiality": 0}
{"body": "I got 2500 votes in my college town as a 20 year old. Was only 20% that year, but in other years would have been nearly 50% (thanks Obama).", "gilded": 0, "created_utc": "1303151823", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "I'm trying to think of how both curses can work together. Maybe... \n\nSeptember 19th, 2011. The Zoo is having a charity event, I dunno, sick babies or whatever, and during a photo op, Peyton Hillis slips and falls off the giraffe deck, accidentally pulling MVP candidate Asdrubal Cabrera, Cy Young finalist Justin Masterson, and weather personality Betsy Kling with him. Hillis suffers torn ligaments in his knees, Dru has lost an eye, Masterson a broken thumb on his throwing hand, and Betsy's finely arched  eyebrows are suddenly a straight-across unibrow. The Indians, who just that weekend were leading the AL by four games, are now demoralized and drop out of the playoffs, Betsy startes wearing a burqa, and the Browns' predicted 12-win season reverts to the usual 12-loss season. \n\n*THANKS OBAMA!*", "gilded": 0, "created_utc": "1303157851", "subreddit": "nfl", "score": 8, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1303159855", "subreddit": "AskReddit", "score": -5, "controversiality": 0}
{"body": "Except that it's gonna cost $30 to prepare those state taxes. They say free e-file, but say nothing about the preparation cost. Those bastards. I, however, netted a positive $411. A tiny bit of federal and state taxes that I didn't claim exempt for to begin with were returned to me, minus the state prep fee, then a nice $400 working pay credit (stimulus plan money). Thanks obama for the new netbook. (Plus that way I'm actually using the credit as it was intended, by putting it back into spending! Woohoo!)", "gilded": 0, "created_utc": "1303184467", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Thanks Obama and Progressives!", "gilded": 0, "created_utc": "1303568728", "subreddit": "Economics", "score": -7, "controversiality": 0}
{"body": "Thanks Obama, you're as great as the last politician before you and probably no better than the next. \n\nMay the intellectuals of the world continue to teach one another of the true horrors that have been committed throughout history. ", "gilded": 0, "created_utc": "1303624470", "subreddit": "demsocialist", "score": 3, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1303743853", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1303831319", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "THANKS OBAMA! ", "gilded": 0, "created_utc": "1303835275", "subreddit": "economy", "score": -6, "controversiality": 0}
{"body": "THANKS OBAMA FOR NOT CONTINUING THE INFLATED BUBBLE!", "gilded": 0, "created_utc": "1303849503", "subreddit": "economy", "score": 4, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1303996625", "subreddit": "comics", "score": 2, "controversiality": 0}
{"body": "Thanks Bush. Oh wait, saying that doesn't make any sense now. \n\n\nTHANKS OBAMA!", "gilded": 0, "created_utc": "1304018369", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "Obamacare will finally help my dad get his Cataract surgery. Thanks Obama! ", "gilded": 0, "created_utc": "1304038975", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Yet was to little to late for me and the $50k health care bill i have. Thanks obama for taking your time and bitching about it instead of using your super majority to push it through. \n\nHow can my broke ass ever repay you. ", "gilded": 0, "created_utc": "1304039533", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "HAHAHAHAHAHAH.. my work slashed health benefits which are now significantly worse than before.  I am now forced to be in a PPO plan as opposed to an HMO.  GREAT!!! THANKS OBAMA!  \n\nHaving a baby before, free.  Now, &gt; 3k.  Love it.", "gilded": 0, "created_utc": "1304054111", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "I was shot in a while back and didn't (still don't) have health care.  Obama sent me a letter saying that I'd get an extra $200 with the fund the city was working with me to pay for my medication, or it was something to do with medicare, though at the time I was still fighting for eligibility.  Anyway, I got it in the mail a couple months after the \"major fuckin' deal\" health bill passed, to help with expenses -- and unfortunately I think we got rid of the letter, or it's somewhere in a pile of paperwork and crap from that time, otherwise it'd be cool to get a pic of it.\n\n*Thanks Obama!* :D", "gilded": 0, "created_utc": "1304061738", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks Obamacare!", "gilded": 0, "created_utc": "1304077777", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks Obamanomics!\n\n", "gilded": 0, "created_utc": "1304086549", "subreddit": "Economics", "score": -28, "controversiality": 0}
{"body": "Sad. Just so pointless. Thanks Bush, thanks Obama.", "gilded": 0, "created_utc": "1304106815", "subreddit": "politics", "score": 3, "controversiality": 0}
