{"body": "Starting January 1st, I won't be able to use my HSA to purchase over-the-counter medicines.\n\nThanks Obama!", "gilded": 0, "created_utc": "1278018874", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Thanks Obama, you damned war monger! We didn't vote you in for this, you #%*&amp;@ thing!", "gilded": 0, "created_utc": "1278118186", "subreddit": "reddit.com", "score": 5, "controversiality": 0}
{"body": "Graduated a month ago and have around 200k in debt between the wife and I (this includes our mortgage, which is about 60% of that debt).  I got laid off about midway through my bachelors degree, so we had to use credit cards to survive for a while.  We essentially refinanced all our credit card debt via student loans and paid some off while still keeping our house (thanks Obama, that 4.5% refi rate helped a lot).  I just landed a job that will allow us to slowly start paying off stuff, I hope to be in your shoes in about 5 years.  ", "gilded": 0, "created_utc": "1278139661", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "I'm pretty pissed at Obama about the warmongering, but I'm happy to give him credit where credit is due. This is a step in the right direction. Thanks Obama, hopefully we'll see more of this from you. ", "gilded": 0, "created_utc": "1278342802", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama. I didn't expect ACTA when I voted for you.", "gilded": 0, "created_utc": "1278355168", "subreddit": "worldnews", "score": 0, "controversiality": 0}
{"body": "x_x\nHe *always* supported it. It was one of the major reasons I could never support him. You just didn't do your research.\n\nIn other words, it's not Thanks Obama. It's Thanks ignorant, propaganda-prone idiots like you. When ACTA passes look in the mirror.\n\nI'm sorry, I know you're probably a good person, and we'd probably be friends in real life, but MAN! I friggin copyfight for years and nothing ever seems to happen because masses of people just don't bother to inform themselves. I keep seeing the country get worse and worse with nothing changing around... It's infuriating.", "gilded": 0, "created_utc": "1278359727", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Thanks Obama. ", "gilded": 0, "created_utc": "1278390646", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "I'm glad the govt busted all those video sites. I didn't even know they existed before that. Thanks Obama!", "gilded": 0, "created_utc": "1278441125", "subreddit": "trees", "score": -1, "controversiality": 0}
{"body": "NO, No, and No! Thanks Obama... The Serial-Warmonger gets more money for his Murders!", "gilded": 0, "created_utc": "1278465180", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "And the new world order agenda proceeds with the puppet in place... thanks obama, you sure are making me look psychic", "gilded": 0, "created_utc": "1278490597", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks! (and thanks, Obama!)", "gilded": 0, "created_utc": "1278785214", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Hey! My cousin is on that! She always posts stuff like \"flying to California, thanks Obama!\" what does that mean?", "gilded": 0, "created_utc": "1278786583", "subreddit": "IAmA", "score": 6, "controversiality": 0}
{"body": "Now everyone who blamed Obama for not stopping the oil spill say in unison, \"Thanks Obama.\"", "gilded": 0, "created_utc": "1279032339", "subreddit": "news", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1279032679", "subreddit": "pics", "score": -29, "controversiality": 0}
{"body": "Now that's Obamanomics putting people to work...but not Americans. Thanks Obama. Thanks for tanking the United States of America with your failed fabian socialistic policies.", "gilded": 0, "created_utc": "1279072294", "subreddit": "Economics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama! I didn't want to enslave myself to religion anyways!", "gilded": 0, "created_utc": "1279074868", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Thanks Obama and the Democrats!", "gilded": 0, "created_utc": "1279112972", "subreddit": "Economics", "score": 0, "controversiality": 0}
{"body": "&gt;Unnamed sources at the White House are starting a campaign to discredit liberals, targeting liberals on blogs, such as Reddit, as undermining Obama setting up Nov. elections to go Republican. The enemy are citizens who wanted real reform in healthcare, banking, energy, and war. Thanks Obama, thanks\r\n\r\nSo \"the enemy\" is the group of idiots who had unrealistic expectations about what can be accomplished in government with a House and Senate makeup such as it was after the 2008 elections?\r\n\r\nWith pragmatism like that, progressive politics is dead.\r\n\r\nStart lining up at your local church for your American Exceptionalism Bible and vagi-cam (females only). Distribution starts Winter, 2013, but the first 20 million Americans also get copies of Dick Cheney's as-yet-untitled memoir and Todd Palin's latest best seller \"Cooking from the Oval Office: 200 Indoor Grilling Recipies.\"", "gilded": 0, "created_utc": "1279218800", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Not sure Jefferson actually said these words but regardless, they are ringing more true every day.  Now the fed has even more powers (thanks Obama) and will never be completely audited.  Trillions will be forever unaccounted for and both Democrats and Republicans have enabled it.  In the mean time, since the Fed took over in 1913, the dollar has lost 95% of it's value.  If their job was to regulate the currency to ensure it's stability, apparently they have failed.", "gilded": 0, "created_utc": "1279285998", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "The cost of these wars is incalculable.  Thanks Obama for keeping them going when you had a chance to stand up and do the right thing.  History will remember you for this.", "gilded": 0, "created_utc": "1279382615", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "lol, thanks Obama for letting me stay.", "gilded": 0, "created_utc": "1279431067", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt;Due to the enactment of new Federal legislation, Nat Sherman will no longer be able to honor and ship your mail orders for our all natural cigarette products. President Obama signed into law earlier this month the “Prevent All Cigarette Trafficking Act” (PACT Act). While the intent of this law is to end cigarette smuggling, which we support, **the unintended consequence on law-abiding business, like ours, will make it illegal to ship cigarettes thru the U.S. Postal Service. Other carriers, such as Federal Express and United Parcel Service have previously ceased the delivery of tobacco products to individual consumers.**\n\n\nWow! Not sure this is even going to be possible - [Thanks Obama](http://www.natsherman.com/customer-announcement-2010.cfm)", "gilded": 0, "created_utc": "1279555346", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Ridiculous. I particularly enjoyed the guy who recaps the video about how the military will dispose of the bodies and pregnant women, etc. and then ends his synopsis with \"Your tax dollars at work.\" haha, do people just throw out blanket statements no matter what they hear/read? \n\nZombie invasion looms on the horizon with outbreak of fast spreading virus, government admits it will be difficult to prepare and defend against such a scenario. \"Your tax dollars at work people. How are they going to pay for such defense, by continually increasing the national debt like every liberal president? Thanks Obama. Socialists. They took our jobs\"", "gilded": 0, "created_utc": "1279727755", "subreddit": "pics", "score": 73, "controversiality": 0}
{"body": "thanks obama", "gilded": 0, "created_utc": "1280335830", "subreddit": "news", "score": 1, "controversiality": 0}
{"body": "Thanks Obama and Progressives.  Change I can believe in.", "gilded": 0, "created_utc": "1280441207", "subreddit": "Economics", "score": 2, "controversiality": 0}
