{"body": "Wake me up when they make bacon flavored cigarettes.  Sadly, flavored cigarettes will be illegal by the end of the year.  Thanks Obama, asshole.", "gilded": 0, "created_utc": "1249097450", "subreddit": "pics", "score": -4, "controversiality": 0}
{"body": "I'm bullish on oil now.  Thanks Obama!\n\n", "gilded": 0, "created_utc": "1249183020", "subreddit": "business", "score": 1, "controversiality": 0}
{"body": "just another good reason to... bomb bomb bomb. bomb bomb iran. thanks obama, for keeping the dream alive so that this talented painter may be dead.", "gilded": 0, "created_utc": "1249416561", "subreddit": "WTF", "score": 0, "controversiality": 0}
{"body": "Thanks Obama! So glad a reformer and somebody who isn't a shill for the corruptors and ruiners of america! You betcha!", "gilded": 0, "created_utc": "1249828679", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Thanks, Obama. Another campaign promise shoved up our asses.  ", "gilded": 0, "created_utc": "1250029662", "subreddit": "technology", "score": -3, "controversiality": 0}
{"body": "this is a good thing: solar panel prices are in free fall:\n\nhttp://solarbuzz.com/Moduleprices.htm\n\nyou can buy turnkey systems for &lt; 3.50$/watt...half of what it cost 1-2 years ago:\n\nhttp://www.ecobusinesslinks.com/solar_power_kits.htm\n\nMany states ending their rebate programs (no money), but the feds are giving 30% discount off the top (aside: thanks obama).\n\nAt sub 3$/watt, it starts to become economical to install solar even considering financing costs.  Access to financing is actually what this is all about...you can get crazy deals right now.\n\n\n\n", "gilded": 0, "created_utc": "1250351543", "subreddit": "business", "score": 1, "controversiality": 0}
{"body": "Thanks Obama, keep up the good work.", "gilded": 0, "created_utc": "1250633426", "subreddit": "progressive", "score": -1, "controversiality": 0}
{"body": "It was headed to \"Cash for Clunkers\" anyway. Thanks Obama!!!", "gilded": 0, "created_utc": "1250835570", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Yup, me too. Really happy to see this. Bush used to do it as well, as far as I remember. But thanks Obama for bringing the nation and more importantly bringing the world together.", "gilded": 0, "created_utc": "1250911678", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "We have become a nation of kidnappers, torturers and murderers! Thanks, Bush. Thanks, Obama...?", "gilded": 0, "created_utc": "1251198703", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "A comment: \" Max1066 wrote:\n\"prompted by a fight earlier in the day at a high school, after a widow was shot out of a home Sunday night ...............The mayor wasn't sure what started the fracas. ?\nA riot like that would be cause to call out the National Guard . Thanks obama .\"\nI cannot figure out how to connect Obama to this, I just can't.  Anyone?", "gilded": 0, "created_utc": "1251226808", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "THANKS Obama fan boys!  Let's see how many votes this gets.  Reddit tools.", "gilded": 0, "created_utc": "1251479805", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "Once Obama passes the bill to allow executive orders to shut down websites and the Republicans retake the White House we will be able to finally shut down sites like this. Thanks Obama!", "gilded": 0, "created_utc": "1251518816", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "It would also really help if we knew what the fuck happened here now wouldn't it?\n\n*Thanks obamalies. These horrible accidents do happen all the time. \n\nI recall a show on HBO I think where they talked to paramedics in NYC about their experiences. One concerned a man who had fallen onto the subway tracks and when he tried to climb out a subway train came and twisted and trapped him between the train and the platform. Even though his lower body was crushed, he was still conscious. When the paramedics came they realized that if the train was moved away, he would die of massive bleeding. So they contacted his wife to come down to the station so when she reached there she could be able to say her goodbyes to her husband. The paramedic says that after incidents like these and others, they almost become immune to the horror and suffering they see. ", "gilded": 0, "created_utc": "1251554953", "subreddit": "worldnews", "score": 2, "controversiality": 0}
