{"body": "The TSA officers now have ribbed gloves for my pleasure. Thanks Obama.", "gilded": 0, "created_utc": "1238681842", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "when your president has total disregard for the constitution, this is what happens.  shit flows down.  thanks obama, your change and hope is great.", "gilded": 0, "created_utc": "1238762966", "subreddit": "politics", "score": -11, "controversiality": 0}
{"body": "&gt;[The temperature at the core of \"the pile,\" is near 2000 degrees Fahrenheit, according to fire officials, who add that the fires are too deep for firefighters to get to. As the rubble is removed, oxygen causes the fires still smoldering to strengthen, making the task more difficult.](http://abcnews.go.com/sections/us/DailyNews/WTC_recovery010918.html)\n\n\n&gt;[Jet fuel burns at 800° to 1500°F, not hot enough to melt steel (2750°F).](http://www.popularmechanics.com/technology/military_law/1227842.html?page=4)\n\n\n&gt;[A combination of an uncontrolled fire and the structural damage might have been able to bring the building down, some engineers said. But that would not explain steel members in the debris pile that appear to have been partly evaporated in extraordinarily high temperatures, Dr. Barnett said.](http://www.nytimes.com/2001/11/29/nyregion/nation-challenged-site-engineers-have-culprit-strange-collapse-7-world-trade.html?sec=&amp;spon=&amp;pagewanted=all)\n\n&gt;[Molten metal flowed underneath ground zero for months after the Twin Towers collapsed.](http://georgewashington.blogspot.com/2005/12/why-was-there-molten-metal-under.html)\n\nYes America, your government blew up your own buildings and blamed foreigners. Can you please end the genocide in Afghanistan, Pakistan (thanks Obama), and Iraq now?", "gilded": 0, "created_utc": "1238934547", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.  God forbid I make a fucking decision about what I put in my body.  2,000 fucking percent?  Its a good thing that tobacco smokers are such a villainized group in society already, or people might make a fuss over how controlling this is.  I can't believe I'm considering growing my own damned tobacco.  Well, tomorrow, tobacco seeds will be taxed one billion percent, probably.  God Bless America!", "gilded": 0, "created_utc": "1239084194", "subreddit": "WTF", "score": 13, "controversiality": 0}
{"body": "Good news people! We no longer have secret prisons! Granted, we just call them transfer points now, but we no longer have secret prisons!  THANKS OBAMA!!!", "gilded": 0, "created_utc": "1239367142", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "I'm so glad that Cuban Americans will receive special privileges that us other Americans obviously do not require.  Thanks Obama.", "gilded": 0, "created_utc": "1239653892", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Thanks Obama, no really.", "gilded": 0, "created_utc": "1239848861", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "That literally is change I can believe in; thanks, Obama.", "gilded": 0, "created_utc": "1240341744", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Thanks, Obama, for creating a more transparent government that doesn't deem it wise to tell a city about large airplanes flying similar to 9/11's airplanes. \n/s", "gilded": 0, "created_utc": "1240890063", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Yes! Thanks Obama.", "gilded": 0, "created_utc": "1240930392", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1241106012", "subreddit": "pics", "score": -1, "controversiality": 0}
