{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1304244699", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": ".....Try that shit in america, we would be slammed to the ground and be beaten jsut for asking to get dressed.\n\nPlus it would have been a swat team....  thanks obama", "gilded": 0, "created_utc": "1304263627", "subreddit": "WTF", "score": -1, "controversiality": 0}
{"body": "Yep. Aside from the fact that he was campaigning for his second term, it was all right. And thennnnnn..... \"God this God that\" - thanks Obama. \"No matter what God you pray to...\" - I felt kind of disenfranchised. Like Obama doesn't acknolwedge that there are people in this country who DON'T pray or believe in a God.", "gilded": 0, "created_utc": "1304313336", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "There are a few options\n\n* Osama wasn't that relevent anyways.  Obama just wasted the taxpayer's money for political gain.\n* Obama (R) administration announced death of Bin Laden.\n* Obama announces \"death\" of Bin Laden\n* Obama is taking credit for Bush-era Bin Laden policy.  After all it was Bush who said, \"Dead or Alive\"\n* Obama invades sovereign territory without congressional approval.  Some people are saying impeachment proceedings should begin.\n* Just when we had gotten over the pain of 9/11... Thanks Obama.", "gilded": 0, "created_utc": "1304315620", "subreddit": "reddit.com", "score": 4, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1304337753", "subreddit": "investing", "score": -1, "controversiality": 0}
{"body": "Perspective from someone who was at the White House last night:\n\n\nI live pretty close, so I went in to get some pictures of the event.  I'll try to just give an honest recount on what was going on in front of the White House, not paint it one way or the other.\n\n\nFirst of all, the crowd was *overwhelmingly* college students.  I saw *very* few older or middle-aged people there.  So the crowd was going to be pretty energetic just because of it's youth.  I suck at estimating, but if I had to guess... 10,000.  At least it seemed that way (again, I suck at guessing).\n\n\nNow, as far as the crowd's demeanor goes, it was mostly pro-America, with some anti-Osama thrown in.  What I mean is that most of the chants and singing were patriotic in nature.  The national anthem, USA! USA!, cheers for the troops, that kind of stuff.  Of course there was also some anti-Osama stuff.  People chanting \"fuck Osama!\".  People singing \"Hey Hey Goodbye\".  But, in my experience, that was really overshadowed by the more patriotic stuff.  There weren't many signs.  But *most* of them were things like \"thanks Obama\", \"America, Fuck Yeah!\", etc. \n\n\nAs for how the crowd conducted themselves, it was pretty civil.  There was a sense of camaraderie, even between the crown and the cops.  Once they started putting barriers out and pushing the crowd back, some people in the crowd actually started pulling the barriers back towards themselves to help the police.  An officer remarked to me that it was the first time he'd seen that.\n\n\nThe closest thing I saw to civil disobedience or police brutality was when a police truck tried to push it's way through the crowed, and ran over a guy's foot.  Or when it backed up and bonked a couple people on the head (they really shouldn't have tried to drive it there. The crowd was too tightly packed for people to reasonably get out of it's way.\n\n\nNow, as far as my opinion goes...  I do think there are some startling similarities between people in the US celebrating the man's death and those in the Middle-East who celebrate similarly.  There is a sense of morbidity to it that's hard to shake about celebrating a man's death, no matter how evil.  And I'd imagine that it doesn't make America look particularly good to the rest of the world.\n\n\nBut, I think there are important distinctions to make between the gathering that happened last night, and similar gatherings we've seen in the Middle-East.  First, I saw no anti-Islam sentiment, none.  I did not see one single sign denigrating Islam (or any Islamic country) or hear one single chant doing so.  All of the vitriol was saved for Osama alone.  Secondly, I saw no violence.  The crowd gave respect to the police trying to contain it.  Most everybody was amicable.  Nothing was lit on fire.  Nothing was burned in effigy.  Nobody got in a fight.  (at least from what I saw).\n\n\n\n", "gilded": 0, "created_utc": "1304352332", "subreddit": "AskReddit", "score": 17, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1304362296", "subreddit": "reddit.com", "score": 67, "controversiality": 0}
{"body": "THANKS, OBAMA", "gilded": 0, "created_utc": "1304364378", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "THANKS OBAMA.", "gilded": 0, "created_utc": "1304367215", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "thanks obama for killing osama", "gilded": 0, "created_utc": "1304377546", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Thanks Obama administration, you corporate whores. Christ, you all aren't any different from the republicans. Odd how you guys cant get along when you share an identical philosophy (special interests &gt; the public) is way beyond me.\n\nKeep voting blue or red and watch this country crash and burn.", "gilded": 0, "created_utc": "1304392624", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "The Lion King has been a constant in my life over the past few days. Thanks, Obamalion. Off to download it!", "gilded": 0, "created_utc": "1304392993", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Thanks Obama. You are the head of the enforcement arm of the judicial system. . .  now that you are done fighting terrorists, its time to go after drugs again. ", "gilded": 0, "created_utc": "1304441863", "subreddit": "news", "score": 6, "controversiality": 0}
{"body": "Sorry about your situation! Here is something that might at least make you feel a little better, though. As of 2011 (or maybe even some time last year), every penny over the minimum that you pay goes toward the highest interest charges on your card. It used to be that you could never get the high-interest charges off your card because they were last to be paid, but this is no longer the case. Thanks, Obama?", "gilded": 0, "created_utc": "1304658463", "subreddit": "Frugal", "score": 2, "controversiality": 0}
{"body": "if some bitch has a fuck me from behind sign on her ass and acting all horny and slutty, its rape.  thanks OBAMA.  the only difference between  obama and osama is just a little \"bs\"", "gilded": 0, "created_utc": "1304875500", "subreddit": "politics", "score": -5, "controversiality": 0}
{"body": "Dear Sikh:\n\nThe fact this this piece of internet twitter news/activism/propaganda BULLSHIT has made it to the front page makes me truly sad. People like you and the OP, that spread misinformation for no reason, make me sick.\n\nTHIS ENTIRE ISSUE IS BULLSHIT. But now that it's latched on to reddit, the enemy of fact-checking and home of reactionary knee-jerk mob mentality, i'll bet not 1 in 1000 that saw this post will ever know the truth about it.\n\n[HERE IS THE IMAGE YOU WANT REMOVED FROM CNN](http://msnbcmedia.msn.com/j/MSNBC/Components/Photo/_new/pb-110503-india-da.photoblog900.jpg). **It's a photo of a pro-USA, anti-terror anti-Pakistan demonstration in India, AND IS PRESENTED EXACTLY AS SUCH BY CNN AS PART OF THEIR \"AFTER OSAMA\" NEWS SPECIAL**. you dimwitted clueless fucks - you can even fucking SEE the \"Thanks Obama\" poster and the US flags behind your Turbaned Sikh even in your blurry twitter tv screen photo.\n\nAlso, sorry about Sikhs being sometimes \"wrongly profiled\" in USA along with radical muslims. totally unfair. oh hey by the way, could you tell why this [AIR INDIA FLIGHT 182](http://news.bbc.co.uk/olmedia/995000/images/_998500_remains300.jpg) looks funny like this?", "gilded": 0, "created_utc": "1305001264", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "THANKS, OBAMA.", "gilded": 0, "created_utc": "1305042964", "subreddit": "AskReddit", "score": 38, "controversiality": 0}
{"body": "I'm a reporter for the Daily Dot, and I'm finding this all very interesting. This thread indicted CNN pretty quickly, and assumed the worst. \n\nOnly reading way down in the comment threads do you find a comment which proves CNN to actually be innocent in this situation. The picture is from a pro-U.S. rally, and a higher-res version shows that the sign in the background says \"Thanks Obama\". \n\nI contacted CNN's PR people, who only replied that they regret the \"error\" and have re-edited the promo. But where is the error to regret? \n\nIf you're a redditor with strong feelings about this post and its outcome, please get in touch with me. I'd love to hear your thoughts. I can be reached at 'grant at dailydot . com'\n\n", "gilded": 0, "created_utc": "1305046955", "subreddit": "pics", "score": -1, "controversiality": 0}
{"body": "Hi all! I'm a reporter for the Daily Dot, and I'm finding this all very interesting. The original thread indicted CNN pretty quickly, and assumed the worst.\n\nOnly reading way down in the thread do you find a comment which proves CNN to actually be innocent in this situation. The picture is from a pro-U.S. rally, and a higher-res version shows that the sign in the background says \"Thanks Obama\".\n\nI contacted CNN's PR people, who only replied that they regret the \"error\" and have re-edited the promo. But where is the error to regret? Doesn't the bulk of the error lie with the OP? Is CNN equally to blame? Did CNN do the right thing by removing the promo and burying it or, did we all just miss a great chance to learn more and challenge our knee-jerk reactions to everything in the news?\n \nIf you're a redditor with strong feelings about this post and its outcome, please get in touch with me. I'd love to hear your thoughts. I can be reached at 'grant at dailydot . com'", "gilded": 0, "created_utc": "1305050447", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Brought to many parents by [Bill Cosby.](http://www.imdb.com/title/tt0083652/quotes?qt=qt0418827) \n\nThanks Obama!", "gilded": 0, "created_utc": "1305059041", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Words words words, thanks OBAMA!", "gilded": 0, "created_utc": "1305230327", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "&gt; It's clear in the high-res and unprocessed original -- where the pro-Obama poster, and the waving of the American flags can be seen in detail -- that CNN likely wasn't confusing Sikhs with Muslims at all.\n\nYet the CNN image was obviously (as this blog points out) \"processed\" to an extent that viewers \"could barely make out the sign on large tv after pausing it\".  Why would they do this to an image, except to hide or change the meaning of it?\n\n&gt; A photo of Sikh protesters in a pro-U.S. rally supporting the raid on and subsequent killing of Osama bin Laden is totally appropriate to a discussion of world reaction.  In fact, it furthers the depth of coverage.\n\nRight: that photo would be totally appropriate.  But without the sign or any other context, that's not what this is a photo of.  A manipulated photo of a part of a scene is not the same as a photo of the entire scene.  If I took a macro photo of a ladybug at that rally, it would be a photo taken *at* the rally, but it would not be a photo *of* the rally.\n\n&gt; Seeing the original image changes the dialogue entirely. \n\nRight: it does.  Too bad CNN wasn't showing the original.  I can't think of any case where showing someone without context adjacent to Osama bin Laden would show them in a positive light.  Why were CNN manipulating an image to \"change the dialogue entirely\"?  The \"THANKS OBAMA\" sign was the most important of the original image.\n", "gilded": 0, "created_utc": "1305303660", "subreddit": "worldnews", "score": 5, "controversiality": 0}
{"body": "Probably blames the change for being cursed. That's not the change he voted for. Thanks, Obama!", "gilded": 0, "created_utc": "1305305400", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "THANKS OBAMA!!!", "gilded": 0, "created_utc": "1305327003", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
{"body": "thanks obamacare", "gilded": 0, "created_utc": "1305392307", "subreddit": "politics", "score": -5, "controversiality": 0}
{"body": "Clearly this is the result of repealing DADT.\n\nThanks Obama.", "gilded": 0, "created_utc": "1305455124", "subreddit": "Military", "score": 1, "controversiality": 0}
{"body": "Thanks Obama I love the change - I wonder what's on the table next term? ", "gilded": 0, "created_utc": "1305599942", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1305620271", "subreddit": "boston", "score": 1, "controversiality": 0}
{"body": "Thanks, Obama!", "gilded": 0, "created_utc": "1305725502", "subreddit": "gadgets", "score": 11, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1305754568", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1305826310", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1305831640", "subreddit": "todayilearned", "score": 0, "controversiality": 0}
{"body": "Thanks Obama, you fascist piece of shit.", "gilded": 0, "created_utc": "1305900570", "subreddit": "politics", "score": 12, "controversiality": 0}
{"body": "I pretty much read this as: Starcraft Mod Starcraft Starcraft Mod Starcraft Starcraft Mod Starcraft Starcraft Mod Starcraft Starcraft Mod Starcraft Starcraft Mod Starcraft Starcraft Mod Starcraft \n\nTHANKS OBAMA!", "gilded": 0, "created_utc": "1306086626", "subreddit": "starcraft", "score": 0, "controversiality": 0}
{"body": "Let me join the down vote club here.  Obama care was written by insurance companies for insurance companies and big pharma.  The statistics cited in the article mean more $$$$ for insurance companies.....it does nothing for me, my family, my medical bills, or any other middle class middle age person struggling in this corpotocracy created by the very same type of narrow minded thinking that manifests itself as downvotes in this thread.  \n\nMy wife gave birth on 4/23.  She did not take an epidural.  It was a natural child birth.  The doctor did not even show up until after the baby was born.  They kept my wife in the hospital for 2 nights.  She kept the baby in the room the entire time only letting him leave when the nurses took him for shots, etc. \n\nToday the bills for that child birth are rolling in and total 14,000+ so far.  My insurance company is Cigna and has covered some of the bills.  \n\nThe point is.........$14,000+ for nurses to deliver my baby, and 2 nights in the hospital and *some* of the costs have been covered.  Thanks Obamacare.....what a difference your plan has made.  \n\nPerhaps you can pass a law written by coca-cola that makes water more accessible and [affordable.](http://img5.visualizeus.com/thumbs/05/ab/bird,finger,hate,jesus,middle,finger-05ab79dc6b058216e2e969d471e4d34c_h.jpg)", "gilded": 0, "created_utc": "1306201182", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "Thanks Obamanomics!", "gilded": 0, "created_utc": "1306246754", "subreddit": "Economics", "score": -13, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1306283402", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Congress made it impossible to close Gitmo. Thanks OBAMA. /s", "gilded": 0, "created_utc": "1306381366", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "why? did they all get eated? freakin econonomy, we can't even afford to feed shamu delicious trainers anymore, THANKS OBAMA! &gt;=[", "gilded": 0, "created_utc": "1306382189", "subreddit": "sandiego", "score": 3, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1306393555", "subreddit": "science", "score": 12, "controversiality": 0}
{"body": "I would imagine that cheap people are the reason for this very technology. I don't think hotels want to check every bottle in the minibar to make sure some miser didn't drink the vodka and replace it with tap.\n\nTLDR: Thanks Obama.", "gilded": 0, "created_utc": "1306440083", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Thanks Obama and Progressives!", "gilded": 0, "created_utc": "1306533884", "subreddit": "politics", "score": -7, "controversiality": 0}
{"body": "THANKS OBAMA!", "gilded": 0, "created_utc": "1306551783", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks, Obama!", "gilded": 0, "created_utc": "1306605487", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "WHITE PEOPLE CAN'T DO ANYTHING ANYMORE!! THANKS OBAMA!!\n\n*cries in the corner of an Arby's wrapped in a flag*", "gilded": 0, "created_utc": "1306784850", "subreddit": "videos", "score": 14, "controversiality": 0}
{"body": "My sun conure, [Hobbes](http://imgur.com/TC8E0) would appreciate a new friend. thanks Obama! ", "gilded": 0, "created_utc": "1306823365", "subreddit": "funny", "score": 35, "controversiality": 0}
{"body": "I got my free parrot by bicycle messenger yesterday. Thanks, Obama!", "gilded": 0, "created_utc": "1306826431", "subreddit": "funny", "score": 15, "controversiality": 0}
{"body": "I don't know, if you look at the official Onion posting on Facebook there is plenty of stupid to go around: \n\nhttp://www.facebook.com/theonion/posts/159513990780174\n\n\"i'm unemployed and groceries are expensive.... thanks obama!\"\n\n\"How bought jus giving us back our freedom that was so obviously misplaced\"\n\n\"My girlfriend hates birds so she wants to sell hers or let it go when we get them... \"\n\n\n\"BARACK! YES WE CAN! BARACK! OH NO WE DIDN'T!!\"\n\n\" I'm gonna training mine to say *screw you pres* whenever he speaks... lmao\" \n\n\"how much more did he have to borrow from china for that one?\"\n\n\"thx anyway Barry... I'll pass...\" \n\n\"if u want this country to really be america and get bck to business u better vote for trump, not a politician\"\n\n\"Well that's just great. He only cuts my FICA tax rate by 2% measley points and now he wants to give everyone a f*****g parrot! WTF??????\"\n", "gilded": 0, "created_utc": "1306853024", "subreddit": "funny", "score": 8, "controversiality": 0}
{"body": "&gt; i'm unemployed and groceries are expensive.... thanks obama!\n\nI'm going to chose to interpret that as saying this person eats parrots and is happy to have a free meal!", "gilded": 0, "created_utc": "1306858135", "subreddit": "funny", "score": 10, "controversiality": 0}
{"body": "[I got mine! Thanks Obama!](http://i.imgur.com/sVFgi.jpg)", "gilded": 0, "created_utc": "1306861504", "subreddit": "funny", "score": 1, "controversiality": 0}
