{"body": "She had to join the Army to make ends meet.  Thanks Obama.", "gilded": 0, "created_utc": "1251913211", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1252446045", "subreddit": "Libertarian", "score": 1, "controversiality": 0}
{"body": "I used Cash for Clunkers. Without it I wouldn't have been able to afford going back to school because my '91 Jeep guzzled gas/fluids like a \"Frat Bruh\" during rush week at an Ivy League university. \n\nAlthough, I could complain: in less than a year my state would have classified my Jeep as a historical vehicle. \n\nThanks America, &amp; Thanks Obama.", "gilded": 0, "created_utc": "1252446585", "subreddit": "economy", "score": 3, "controversiality": 0}
{"body": "Thanks Obama", "gilded": 0, "created_utc": "1252450011", "subreddit": "Libertarian", "score": 0, "controversiality": 0}
{"body": "No thanks Obama: I will shape my own future.", "gilded": 0, "created_utc": "1252556336", "subreddit": "reddit.com", "score": -2, "controversiality": 0}
{"body": "That last picture was great...\n\n\"Thanks, Obama, Imma let you finish, but Canada had the best healtcare of all time\"", "gilded": 0, "created_utc": "1253211478", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "good luck man, I was also discharged from the military for medical reasons (crohns disease)\n\nKeep your head up, uncle sam is going to try and bend you over, especially if you're in the army. I was in the Air Force, which is the most generous as to how it rates its veterans. Marines is the worst. You could lose all your limbs and get rated 10%. (not really, but you get the point)\n\nAfter you get out, contact the VA immediately. You will get a new rating from them (almost guaranteed it will be higher, and get more money that is also tax free). You may also want to contact the DAV. They are awesome, and will help you out very much for free. \n\nAlso be prepared to appeal your case, they will prob rate you low initially. I have had my case appealed once, and now 2 years after I separated I am still waiting. It will prob take about a year to get a disability rating (depends on your location, but is much faster now than it was just a year ago. Thanks Obama!!!\n\nIn my situation I was rated 30% and permanent retirement from the Air Force. I now am rated 70% through the VA.\n\nAlso, be sure to be seen for mental health issues, i was very depressed (and still can be) at what all happened. I used to crawl around planes and nukes all day and now the highlight of my day might be doing laundry, it sucks when you look back on what you were doing, but keep your head up, get some new hobbies, and a good support circle and you will bounce back in no time. Civilian life is much better anyways  ; )\n\nGood luck man, you will be just fine!!!\n\n\nO ya, you are now entitled to free care from the VA for anything and everything for the rest of your life in case you didnt know. ", "gilded": 0, "created_utc": "1253253258", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "What a clusterfuck, the bill basically takes our money gives it to the insurance companies, and if we dont pay we are fined and jailed.\n\nYea, Fucking thanks Obama, way to keep your word on single payer.", "gilded": 0, "created_utc": "1254266138", "subreddit": "Economics", "score": 1, "controversiality": 0}
