{"body": "Ah yes, more \"GRAMMER\" rules to be imposed by the state bureaucracy, exactly what we need, thanks OBAMA.  How 'bout this, you shut the hell up.  Guess I had better change my tune before the brown shirts come for me!", "gilded": 0, "created_utc": "1257041338", "subreddit": "science", "score": 5, "controversiality": 0}
{"body": "&gt;From the comments of the article page (I'm kind of for sending this letter en masse to the white house with the Newscred article attached):\r\n\r\nDear Obama,\r\n\r\nI voted for you because you PROMISED (I know, politicians, right?) to protect Net Neutrality and fight for the \"little guy.\" If this goes through, you will have broken one of the big promises that made me vote for you. If this goes through, I promise you this: you will not get my vote in 2012 and I will do everything I can to do the opposite of what I did in 08: get you in office. \r\n\r\nViolate my trust. Violate the trust of those who put you in office by using the net to get you in office. See what it does for you in 2012. \r\n\r\nCannot believe you are signing off on this. If this is the \"change\" you were really selling in 08, then congratulations: you just officially fooled me and screwed me over. However, you will not fool me twice. \r\n\r\nI am majorly pissed at this moment. Majorly. I feel like I've just been screwed over by a mentor I trusted. Thanks, Obama. I cried tears of joy on November 4th. And now you do this. Why do you violate our trust like this? Why?\r\n", "gilded": 0, "created_utc": "1257344942", "subreddit": "politics", "score": 7, "controversiality": 0}
{"body": "&gt;Hasan had hoped Obama would pull troops out of Afghanistan and Iraq and got into frequent arguments with others in the military who supported the wars.\n\nObama lied\nFort Hood soldiers died.\nObama promised to pull the troops out and this guy bought into it like so many millions more.  Obama lied and this guy snapped.  Thanks Obama.", "gilded": 0, "created_utc": "1257514603", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "You're not forced to buy auto insurance if you don't drive. A health insurance mandate is a tax on life.\n\nThanks, Obama, for breaking your promise to not raise taxes on the middle class...", "gilded": 0, "created_utc": "1257656576", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "Obama is responsible for turning a whole new generation of idealistic American voters into hopeless cynics.  Gee, thanks Obama!.", "gilded": 0, "created_utc": "1257736734", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1257796535", "subreddit": "business", "score": -5, "controversiality": 0}
{"body": "I just stubbed my toe - THANKS OBAMA!", "gilded": 0, "created_utc": "1258126789", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama for fixing the mess Bush left you.", "gilded": 0, "created_utc": "1258491121", "subreddit": "conspiracy", "score": 3, "controversiality": 0}
{"body": "Well, at least the bankers are OK.  Thanks Obama for getting your priorities right and giving us peace in our time.", "gilded": 0, "created_utc": "1258665072", "subreddit": "reddit.com", "score": -2, "controversiality": 0}
{"body": "I found some change in my sofa cushions yesterday. Thanks, Obama.", "gilded": 0, "created_utc": "1259346686", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "&gt; the Obama administration\n\nall this time I've been wrong when I said that Obama has done nothing.. I stand corrected..  He is working very hard to regulate our internets for us.  thanks Obama!... hope! change! regulated internets!", "gilded": 0, "created_utc": "1259419657", "subreddit": "politics", "score": -1, "controversiality": 0}
