{"body": "Atleast the 12 Democrat crony executives at Freddie and Fannie will get their $42M in bonuses from the tax payers.\n\nThanks Obama.  ", "gilded": 0, "created_utc": "1262349699", "subreddit": "Libertarian", "score": -2, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1262807432", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "&gt; \"An administration official who briefed reporters said the budget office estimates the 10-year figure will be enough to recoup all the losses in the Troubled Asset Relief Program.\"\n\nThanks Obama for cleaning up more Bush shit smeared on the walls of the U.S.A.", "gilded": 0, "created_utc": "1263502867", "subreddit": "obama", "score": 10, "controversiality": 0}
{"body": "First off, I didn't mention TARP in my first post. It was not the only place where Obama drew bailout money from. Keep in mind that Bush only spent half of the TARP funds, and that Obama spent the other half within a month of being sworn in. AND THEN Obama and Geithner decided to spend $500 billion more with the Public-Private Investment Program (P-PIP). This is the same program that privatized public funds. THANKS OBAMA!!!\n\n&gt;What would you have proposed as the alternative course of action?\n\nWhat would you propose we do for all the other companies that go out of business? I propose that we, as a nation, should have let bad business practices fail instead of rewarding irresponsibility. Circuit City went out of business; did they get a bailout? No. It's the way capitalism works. When one bank goes out of business, an opportunity is opened for successful banks. Even the unsuccessful banks were doing this in the midst of the bailouts. Wachovia was on it's last leg, so Well Fargo bought it out (with that bailout money we gave them). Now that company is making record profits. Bad business practices should not be rewarded.", "gilded": 0, "created_utc": "1263565735", "subreddit": "news", "score": 1, "controversiality": 0}
{"body": "Thanks Obama, thanks for continuing to shit on our Constitution like your predecessor.  \n\nDemocrats, you got conned, now get your head of your asses and start acting like you care.  ", "gilded": 0, "created_utc": "1264186514", "subreddit": "politics", "score": 16, "controversiality": 0}
{"body": "Thanks Obama, damn your 'Open Government' and Individual Freedoms!", "gilded": 0, "created_utc": "1264205244", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1264358110", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Thanks Obama, you're a real stand-up guy.  At least if McCain was president I'd feel my impotent rage was more justified.", "gilded": 0, "created_utc": "1264391807", "subreddit": "politics", "score": 8, "controversiality": 0}
{"body": "Funny you should mention this.  I just filed for refinance through BOA ( through a new special process ( thanks obama.. kind of ) because my loan is negative but will let me get a better rate ) and I swear the refiance lady is complete incompentant.  Is her name joyce?\r\n\r\nShe had her assistant call me twice and say all the paperwork is good only to call me at work at 2 pm a week later twice and say that im missing \"all paperwork\".  When i say i sent it to her she says \"oh\" and proceeds to tell me to send her random items that were never requested before.  Not to mention she calls at my work at 2pm and her office closes at 5pm eastern time ( I am in pacific so its closed )\r\n\r\nShe never calls me back.  Never ever e mails me ignoring my repeated requests to just e mail me the damn paperwork i need and ill e mail it back and she always says when im off the phone thats all she needs.\r\n\r\nNot to meantion i am refinancing from BOA to BOA so they shouldnt even need anything since they already have all my damn info,  just do it!\r\n\r\nI still havent \"completed\" my loan for 2 months and If the same thing that happens to you happens to me in the next few weeks ill be sooo pissed.\r\n\r\n/endrant\r\n\r\n", "gilded": 0, "created_utc": "1264565449", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Obama to Florida, Texas, and California (circa 2007-08): \"I promise to increase funding for NASA and space enterprise.\"\n\nReal life (circa 2011-12): 6 seats aboard outsourced Russian/Chinese spacecraft for the entirety of two years due to NASA closure.  Florida, California, and Texas lose tens of thousands of jobs.  Etc, etc...\n\nI work close with Johnson Space Center in the military and the direct shit Obama took on a promise for campaign votes, and the fact that he didn't even wipe afterward, well that really puts a damper on, you know, a ***fuckload*** of lives.\n\nThanks Obama, you can speak intelligibly but you are nothing special.", "gilded": 0, "created_utc": "1264652008", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "What is the greatest political event of *your* lifetime?\n\nFor me, probably the Berlin Wall coming down, but however I feel about Obama's politics, at least it shut up the self-satisfied cynics who would state, as if I were an ignorant child for even suggesting it was possible, that a black man could become president.\n\nNow I just cut these same people off mid-sentence whenever they say anything about politics with a dismissive \"shut the fuck up, whitey.\"  It's satisfying.\n\nThanks Obama! :D", "gilded": 0, "created_utc": "1264783618", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Cuatro de Mayo?  Thanks Obama.  The thing is Obama's fuck ups don't get publicized as much.  And the ones that do, is the most inane childish shit normally on fox.", "gilded": 0, "created_utc": "1264924328", "subreddit": "politics", "score": 1, "controversiality": 0}
