{"body": "I think, \"Thanks, Obama.\"", "gilded": 0, "created_utc": "1314849388", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "More like broke Obama, and broke America. Thanks Obama!!", "gilded": 0, "created_utc": "1314865940", "subreddit": "funny", "score": -4, "controversiality": 0}
{"body": "Of course you did, thanks Obama. ", "gilded": 0, "created_utc": "1314949069", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1314967540", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "I did Peace Corps with Private loans, they just take the money out of your $6000 (I hear it's now $7500, thanks Obama!) readjustment allowance. I was paying a couple hundred each month to Sallie Mae so I only had about half of the 6000 when I came back.", "gilded": 0, "created_utc": "1314999051", "subreddit": "peacecorps", "score": 2, "controversiality": 0}
{"body": "Yep I may have too. Dammit it's just such a bitch to get shit to work on my toshiba laptop. Finally got fed up with cubase, download ableton. Now the damn thing wont recognize a keyboard midi. Oh well I may just have to splurg on a macbook sounds about the best thing to do but I'm not gonna have enough for that. May just have to grit n bear it for a while n try to get ableton to function better. BAH all i wants to do is make weird ass muzak but the comps don't function right, THANKS OBAMA.", "gilded": 0, "created_utc": "1315021917", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Now I'm sad. Thanks, Obama.", "gilded": 0, "created_utc": "1315073944", "subreddit": "videos", "score": 31, "controversiality": 0}
{"body": "Thanks, Obama.\n\n\n...Wait, I don't think I did that right.", "gilded": 0, "created_utc": "1315094282", "subreddit": "AskReddit", "score": 7, "controversiality": 0}
{"body": "Thanks Obama for bailing them out!", "gilded": 0, "created_utc": "1315249085", "subreddit": "politics", "score": -18, "controversiality": 0}
{"body": "Thanks, Obama.", "gilded": 0, "created_utc": "1315254690", "subreddit": "todayilearned", "score": -1, "controversiality": 0}
{"body": "If you're not authorized to work in the US, but are working in the US... guess what you're doing?  And Obama's is giving you $4.2B.  Thanks Obama!\n\n[Breakin' Da Law](http://www.youtube.com/watch?v=XPhPbTbjYM0&amp;feature=player_detailpage#t=34s)", "gilded": 0, "created_utc": "1315321762", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "&gt; If you're not authorized to work in the US, but are working in the US... guess what you're doing? And Obama's is giving you $4.2B. Thanks Obama!\n\nI'm not sure if you're purposely obtuse or just obtuse.  People who are \"not authorized to work in the US\" are typically NOT \"working in the US.\"  They have investment income or other US earnings.\n\nAll you're doing at this point is proving the bell curve.", "gilded": 0, "created_utc": "1315324500", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Which will create 300,000 jobs that will disappear in 6 months. Glad to know my tax dollars are being spent wisely, thanks Obama you prick.", "gilded": 0, "created_utc": "1315404125", "subreddit": "economy", "score": 2, "controversiality": 0}
{"body": "Yay!  Mexicans.  Thanks Obama.", "gilded": 0, "created_utc": "1315405747", "subreddit": "news", "score": -31, "controversiality": 0}
{"body": "Thanks Obama ", "gilded": 0, "created_utc": "1315443841", "subreddit": "politics", "score": -4, "controversiality": 0}
{"body": "Ugh, thanks Obama. ", "gilded": 0, "created_utc": "1315450199", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Thanks Obama ! ", "gilded": 0, "created_utc": "1315456881", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "Jesus christ, this agency was the worst fucking idea. Giving these dimwitted douchebags this kind of power. Thanks Obama for letting the TSA fuck with people. This shit needs to end. ", "gilded": 0, "created_utc": "1315467198", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1315508258", "subreddit": "pics", "score": -2, "controversiality": 0}
{"body": "[A law was actually passed in the US that states that advertisements actually have to be below a certain average sound level.](http://en.wikipedia.org/wiki/Commercial_Advertisement_Loudness_Mitigation_Act) It should actually be enforced soon. Thanks Obama!\n\nThose loud advertisements you hear aren't actually louder in the traditional sense of \"loudness\", it's just that they use more sound in the top of the limit of whatever loudness your TV is set to. So while a TV show has highs and lows advertisements will try to use only the top of that spectrum - so it indeed sounds much louder than whatever you were watching.  ", "gilded": 0, "created_utc": "1315513064", "subreddit": "technology", "score": 7, "controversiality": 0}
{"body": "II was on reddit a month earlier than this poser. Now its all mainstream with these 5 month redditor assholes. They probably came from digg and youtube, and play call of duty. \n\nThanks, obama.", "gilded": 0, "created_utc": "1315586375", "subreddit": "AdviceAnimals", "score": 7, "controversiality": 0}
{"body": "Tried to connect to whitehouse.gov to watch the speech, and the site's actually down.\n\n*Thanks, Obama!*", "gilded": 0, "created_utc": "1315591767", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "Thanks Obama ", "gilded": 0, "created_utc": "1315598260", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "something something political comment. Thanks Obama!", "gilded": 0, "created_utc": "1315598632", "subreddit": "funny", "score": 87, "controversiality": 0}
{"body": "Wow we need to push this through now as each job will only cost us 247,368.421 that's less than a quarter million a piece!!! Thanks Obama this is a bargain ", "gilded": 0, "created_utc": "1315598864", "subreddit": "politics", "score": -6, "controversiality": 0}
{"body": "The world is falling Apart... Thanks OBAMA!!!\n", "gilded": 0, "created_utc": "1315603068", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "You mean.... [THANKS OBAMA](http://www.youtube.com/watch?v=6RjA1bEt7VQ&amp;feature=player_detailpage#t=83s)", "gilded": 0, "created_utc": "1315619172", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "thanks obama? lol ", "gilded": 0, "created_utc": "1315629299", "subreddit": "WikiLeaks", "score": -1, "controversiality": 0}
{"body": "Thanks Obama", "gilded": 0, "created_utc": "1315651825", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Thanks obama for keeping jobs by continuing the patriot act ", "gilded": 0, "created_utc": "1315662492", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "thanks, obama", "gilded": 0, "created_utc": "1315686744", "subreddit": "worldnews", "score": -6, "controversiality": 0}
{"body": "I think you're confusing Obama's bungling of his policy initiatives as proof that America is not ready for change. \n\nIf was America was as conservative as you said then why did they elect a Candidate that was portrayed as a reformer by the media and a radical by his opponents?      \n\nHe bungled Healthcare reform, plain and simple. \n\n1) First of all he chose a Republican healthcare plan (Romneycare) thinking he would get support. Not getting that Republicans want to destroy him. He may think like them but they will never accept him. \n\nSidepoint, did you know he gave up the public option in a backroom deal with the health insurance industry? Yeah, Obamacare was a huge gift to the health insurance industry. We are now mandated to buy ever increasing in price private health insurance that does nothing to decrease costs to the consumer. Thanks Obama.    \n\n2) Second, personality-wise he does not get his hands dirty. He let the narrative be co-opted by the Republicans. Now this is more of a criticism of his leadership style rather then his initiatives.\n\nAlot people said FDR's programs was socialist or fascist but FDR had the political skill to convince the public he was right and the Republicans were wrong.         \n\nI also disagree with your last statement. I feel that Obama moves the political landscape to Right by adopting their positions and gives cover and credibility to them. Obama now use the terms \"Entitlement Reform\" and \"Job Creators\". Rather then say Social Security is fine and what we really need to raise taxes on the rich, he says we need to \"reform\" (meaning cut) Social Security in order to balance the budget even though Social Security does not contribute to the deficit. And like only Nixon can go to China, only a Democrat can cut Social Security. And Obama has been talking about cutting Social Security for a long time now.   ", "gilded": 0, "created_utc": "1315711449", "subreddit": "PoliticalDiscussion", "score": 1, "controversiality": 0}
{"body": "If we do nothing things will just get worse too (albeit at a slower pace). In an ideal world new technologies would overwhelm these systems. \n\nWithout a profit incentive government services never get better over time, they just stay the same or get worse. We are seeing some positive moves on disruptive education technology with Khanacademy.org and Western Governors University but there is a lot more room to grow.\n\nBut I haven't seen any positive moves towards a market system in healthcare. If anything we're going backwards (thanks Obamacare).", "gilded": 0, "created_utc": "1315720981", "subreddit": "Libertarian", "score": 2, "controversiality": 0}
{"body": "&gt;40 million insured isn't big change? The attempt at Campaign Finance Reform?\n\n1)Yeah, Obamacare was a huge gift to the health insurance industry. We are now mandated to buy ever increasing in price private health insurance that does nothing to decrease costs to the consumer. Thanks Obama.\n\n2) What attempt at Campaign Finance Reform?\n\n&gt;1) There has been a shitty economy. That's going to make people unhappy regardless.\n2) No president such an ideologically intransigent and united Republican party, with a base (not to mention paid astroturfers) who now has the means to communicate their propaganda and lies more effectively than ever before.\n\n1) 3 letters. FDR. \n\nThe Great Depression. Talk about a shitty economy. But he knew the value of economic populism and FDR pushed through huge job programs that saw the Democrats gain even more seats during the Midterm Elections leading to a landslide re-election victory for FDR winning all but 2 states.\n\nDemocrats were begging him to stay on the economy. He didn't listen. He's now paying the price.\n\n2) 3 letters. FDR.\n\nIn his immortal words. \n\n\"Never before in all our history have these forces been so united against one candidate as they stand today. They are unanimous in their hate for me and **I welcome their hatred**.\"  ", "gilded": 0, "created_utc": "1315721702", "subreddit": "PoliticalDiscussion", "score": 0, "controversiality": 0}
{"body": "The thing is that while yes, the various countries of the Arab world have legitimate grievances towards the United States, how many who hate the west could name them?\n\nSo much of the hate for the USA seems to be a kind of \"Thanks, Obama\" scapegoating rather than legitimate complaints about American foreign policy.  That and a fundamental disagreeement on whether or not Israel has the right to exist (and only the craziest Western anti-zionists deny that the existing Jewish populace of Israel/Palestine has no right to have their country.", "gilded": 0, "created_utc": "1315753498", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Thanks obama!", "gilded": 0, "created_utc": "1315880648", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "No.  My house price has gone up (according to Zillow) since I bought it just a year ago.  Since that's where all my money is, that's really all I care about.  Plus I locked in a super-low interest rate since it's a recession.  So really, I couldn't be happier.  Thanks Bush for tanking the economy to lower the interest rates and house prices so I could finally afford to buy the house of my dreams!  Thanks Obama for stimulating the spending to get the housing market growing immediately after I bought my house!  And thanks to everybody who taught me to think for myself so I didn't just think \"the housing market will never tank; millions of Americans can't all be wrong\" 10 years ago when I first started looking for a house.", "gilded": 0, "created_utc": "1315881051", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1315897860", "subreddit": "videos", "score": 0, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1315929242", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "thanks obama.  looks like your stimulus is working wonders.", "gilded": 0, "created_utc": "1315962721", "subreddit": "Economics", "score": -1, "controversiality": 0}
{"body": "Thanks Obama and Progressives!", "gilded": 0, "created_utc": "1315966887", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Indeed. \n\nAdd to that the shadow of looming super-inflation (anyone notice gold prices lately), a hot and dry summer (food is going to be expensive next year), increased unrest in the ME (oil) coupled with our own lack of exploration (thanks Obama!) and we're in for some rough times.", "gilded": 0, "created_utc": "1316006183", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!!", "gilded": 0, "created_utc": "1316006408", "subreddit": "worldnews", "score": -11, "controversiality": 0}
{"body": "As soon as you leave the country you can be called a \"terrorist\" by the President and assassinated (thanks Obama!).", "gilded": 0, "created_utc": "1316050689", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1316100798", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "No surprise there.  Political bullshit at it's finest, Thanks Obama for wasting more money", "gilded": 0, "created_utc": "1316138863", "subreddit": "business", "score": 13, "controversiality": 0}
{"body": "No joke man.\n\nI had to eat at *Arby's* today... Fuckin Arby's man!\n\nI mean, what else was I gonna do, drive 4 block to Sonic? 5 to Subway? **6 TO WHATABURGER?!**\n\nThis country is goin to hell man. Thanks Obama!", "gilded": 0, "created_utc": "1316201120", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "Yeah, basically America is a fucking shithole and if you live there you should come to terms with the fact that corporations can and will fucking you anally at every turn.\n\nThanks, Obama.", "gilded": 0, "created_utc": "1316207139", "subreddit": "gaming", "score": -2, "controversiality": 0}
{"body": "Great, now my mouth is watering and my dick is hard. THANKS OBAMA.", "gilded": 0, "created_utc": "1316259271", "subreddit": "gonewild", "score": 1, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1316287401", "subreddit": "Portland", "score": 7, "controversiality": 0}
{"body": "Another win for Obama and the Progressives!\n\n\nThanks Obama, you're liberal policies are working!", "gilded": 0, "created_utc": "1316350997", "subreddit": "politics", "score": -13, "controversiality": 0}
{"body": "We're both talking in hypotheticals now.  But from what I've seen, the single-party corporate control is almost complete.  Reforming the parties from within is impossible, and (thanks, Obama!) I wouldn't trust anybody who said they were trying.\n\nI didn't say third parties had a huge chance.  But if you look where the political vulnerability is, it's there.  Go independent and call out the single-party BS.", "gilded": 0, "created_utc": "1316358703", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Because his rallying speeches many time before this, have worked sooooo well that Obama is once again giving a rallying promise that in action, never be fulfilled.  \n\nThanks, Obama.  You have given us hope, over and over again.  I think i speak for everyone when I say it is time for you to stop giving us hoping and start giving us results. ", "gilded": 0, "created_utc": "1316359204", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks, Obama. You have given us hope, over and over again. I think I speak for everyone when I say it is time for you to stop giving us hope and start giving us results.", "gilded": 0, "created_utc": "1316359380", "subreddit": "business", "score": 2, "controversiality": 0}
{"body": "I don't think that works anymore. THANKS OBAMA.", "gilded": 0, "created_utc": "1316364126", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "I didn't get it. So I skipped ahead to 3:20 expecting something interesting. I feel stupid.\n\n\n\n\n\nThanks Obama.", "gilded": 0, "created_utc": "1316407453", "subreddit": "videos", "score": 2, "controversiality": 0}
{"body": "Thanks Obama ", "gilded": 0, "created_utc": "1316438673", "subreddit": "fffffffuuuuuuuuuuuu", "score": 0, "controversiality": 0}
{"body": "Really? It's that easy to get rid of America's most persistent blowhard? \n\nWow, thanks Obama -- you do that for me, and I'll excuse the other shit you let me down on and I'll donate to your campaign again in 2012!!", "gilded": 0, "created_utc": "1316526204", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Lol no doubt.  4 years later and we have little digital boxes so grandma can still watch broadcast tv...\n\nThanks Obama.", "gilded": 0, "created_utc": "1316544931", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1316554792", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "Thanks Obama, for working so hard to repeal the Patriot Act.", "gilded": 0, "created_utc": "1316622008", "subreddit": "energy", "score": 3, "controversiality": 0}
{"body": "I don't understand why the whole gang hasn't been brought before the Hague. Oh right Obama has fought prosecution since he entered office. Thanks Obama you are a real progressive champion. You lying sack of shit.", "gilded": 0, "created_utc": "1316719191", "subreddit": "worldnews", "score": 48, "controversiality": 0}
{"body": "&gt;I don't understand why the whole gang hasn't been brought before the Hague. Oh right Obama has fought prosecution since he entered office. Thanks Obama you are a real progressive champion. You lying sack of shit.\n\nHow dare Obama not rip the country apart, where does he get off?! Because that's exactly what would happen. Partisan politics would be taken to a new and very dangerous level.", "gilded": 0, "created_utc": "1316737774", "subreddit": "worldnews", "score": 11, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1316747665", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "Or we could just spend billions bailing out bankrupt companies. Because theyre obviously worth saving if they went bankrupt, its not like we live in a capitalist country. Thanks Obama and your wonderfully effective liberal views.", "gilded": 0, "created_utc": "1316815361", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1316877139", "subreddit": "circlejerk", "score": 2, "controversiality": 0}
{"body": "No human-oreo hybrids? Thanks Obama.", "gilded": 0, "created_utc": "1316894415", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks obama\n", "gilded": 0, "created_utc": "1316933311", "subreddit": "pics", "score": -1, "controversiality": 0}
{"body": "Yea traffic truly sucked. THANKS OBAMA!", "gilded": 0, "created_utc": "1317161906", "subreddit": "Denver", "score": 1, "controversiality": 0}
{"body": "Thanks Obama", "gilded": 0, "created_utc": "1317169093", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "This will make business owners more hesitant to even interview people, let alone make new hires. Thanks Obama!", "gilded": 0, "created_utc": "1317220649", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama. ", "gilded": 0, "created_utc": "1317250021", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama ", "gilded": 0, "created_utc": "1317268657", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Yeah we need to be more like Iran or Pakistan this is bullshit / thanks Obama ", "gilded": 0, "created_utc": "1317269822", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1317317533", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I'm amazed that you, as a foreigner, know more about what's going on in this country than any of my coworkers. Well, save one, who listens to nothing but FOX news. I hear, \"THANKS OBAMA!\" quite often.", "gilded": 0, "created_utc": "1317327563", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1317341341", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Thanks Obama...", "gilded": 0, "created_utc": "1317359568", "subreddit": "AskReddit", "score": -1, "controversiality": 0}
