{"body": "Thanks Obama", "gilded": 0, "created_utc": "1254367107", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Seriously, it should have been given to one or more human rights activists in China. No one from China has ever received a Noble Peace Prize. The fact that it wasn't is another sign of how the West is kowtowing to the totalitarian government in China.\r\n\r\n[Chinese Human Rights advocates denied Noble Peace Prize - Thanks Obama!](http://futurenewstoday.blogspot.com/2009/10/chinese-human-rights-advocates-denied.html)", "gilded": 0, "created_utc": "1255099004", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "And threatening to bomb Iran. And collaborating with Israel to ethnically cleanse the Palestinians.\r\n\r\nI finally figured out that this is all a ruse to divert attention from the fact that the award should have gone to Chinese Human Rights activists Hu Jia and Gao Zhisheng.\r\n\r\n[Chinese Human Rights advocates denied Noble Peace Prize - Thanks Obama!](http://futurenewstoday.blogspot.com/2009/10/chinese-human-rights-advocates-denied.html)", "gilded": 0, "created_utc": "1255099559", "subreddit": "conspiracy", "score": 5, "controversiality": 0}
{"body": "Thanks, Obama administration. Change you can count on.\n\nWe just got done voting for a guy who claimed that this would be a democracy again if we voted for him. Words ≠ actions.", "gilded": 0, "created_utc": "1255225719", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "yet another SOCIALIST move, denying jobs to oil drillers. thanks OBAMACARE!!!!!!!!!!\nlol ;-)", "gilded": 0, "created_utc": "1255403515", "subreddit": "environment", "score": -2, "controversiality": 0}
{"body": "Whatever is left of Americans standard of living, its now going down the tube with the falling dollar.\r\n\r\nThanks Obama", "gilded": 0, "created_utc": "1255447932", "subreddit": "business", "score": 0, "controversiality": 0}
{"body": "Pat Tillman was a Hero, one of the Real ones! He was murdered and the fact covered up by the war criminal who is now in charge in Afghanistan. Thanks Obama!", "gilded": 0, "created_utc": "1255553015", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "WOW, Over 10,000...  You know exactly where we were from 2004-2008, Thanks Obama, you're really making a difference!", "gilded": 0, "created_utc": "1255563077", "subreddit": "politics", "score": -8, "controversiality": 0}
{"body": "As a longtime pot user, this didn't bother me one bit.  \n\nI do not need Obama to help my cause.  The movement to legalize pot is doing just fine without him.  We don't need him or his drug czar to make it legal and their opposition is just the continued stimulus that the Medical marijuana movement (see backdoor legalization) needs to keep growing and spreading.\n\nThanks Obama!!!", "gilded": 0, "created_utc": "1255628466", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Can you blame a Huge For-Profit entity for serving their primary mission? And that mission is to minimize all healthcare expenditures so they can apply your healthcare dollars to their bottom line.\n\nAnd consider the answer to all of our Healthcare needs is to get *All Americans* to buy one of their wonderful policies. *Thanks Obama!*", "gilded": 0, "created_utc": "1255738851", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "Yes YES! Fox does not tow the team Obama line! They are propagandists! The White House doess not want other news organizations to follow Fox news, I guess the White House knows the other news channels are government lapdogs. The underlying threat to news channels is clear: don't be anything like Fox News, are we will do the same to you.\n\nWho the hell is the government to \"decide\" what a \"legitimate\" news organization is, ahh no thanks Obama, I will figure that one out for myself.", "gilded": 0, "created_utc": "1256087745", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Americorps VISTA. Thanks, Obama!", "gilded": 0, "created_utc": "1256150310", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Score one for the Arabs! Thanks Obama.", "gilded": 0, "created_utc": "1256337158", "subreddit": "environment", "score": -9, "controversiality": 0}
{"body": "Thanks Obama! I feel so safe now. Let me know when you killed Doctor Evil too ok?", "gilded": 0, "created_utc": "1256394722", "subreddit": "worldnews", "score": 3, "controversiality": 0}
{"body": "Win! When I heard about Obama supposedly joining up with this cause a short while back, I was getting seriously worried. So, thanks Obama, for not being a douche.", "gilded": 0, "created_utc": "1256652220", "subreddit": "atheism", "score": 10, "controversiality": 0}
{"body": "I am in Group A, am employed, have health insurance.  I'm also in debt up to my ears.  $250 would pay off all my unpaid medical bills (did I mention I have health insurance?) and improve my credit score.\r\n\r\nThanks Obama!", "gilded": 0, "created_utc": "1256760692", "subreddit": "politics", "score": 1, "controversiality": 0}
