{"body": "I was allowed to stay on my mom's insurance another year before turning 26. During that time I moved across the country for school and was quite sick. Had that age limit not been extended I would have been in a hell of a lot of debt. Thanks Obama.", "gilded": 0, "created_utc": "1346462872", "subreddit": "politics", "score": 7, "controversiality": 0}
{"body": "Simple and specifically thanks Obama -&gt; #BetterOffThanksObama\n\n(it includes the predecessor tag too in case someone already started)", "gilded": 0, "created_utc": "1346464124", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Got cancer - thank's god.\nGot insurance - thanks Obama!", "gilded": 0, "created_utc": "1346471736", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "I was able to buy my first home thanks to the first time homebuyer's tax credit!  \n\nMy wife finished her degree using the opportunity credit!\n\nSince the end of the Bush years, my 401k has only expanded.\n\nThanks Obama &amp; congressional Dems!  Don't forget that these policies needed reps and senators to get signed!", "gilded": 0, "created_utc": "1346479846", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I grew up in a very poor family (read: Appalachian poor).  My brother, who has type 1 diabetes, was able to stay on my mom's insurance plan (she also has type 1) even though he is now 22yrs old.  I would like to point out that diabetes has long been considered a pre-existing illness by insurance companies (technically, it is).  Without Obamacare, we don't know what he would have done after his 18th birthday.  We were afraid that he might have to go on welfare or disability in order to get health coverage.  He would have basically started adult life in the nosebleed section.  As it stands, he has some time to learn a skill, trade, or profession that will allow him to earn an income.  Then, when he does have to get his own insurance policy, he should not be turned down for having a pre-existing condition.  Thanks, Obama.  You really do care!\n\nAlso, I was able to go back to school (thanks to the stimulus as OP mentioned) and get my degree at age 29.", "gilded": 0, "created_utc": "1346489035", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "President's AMA was on the level or Woody Harrelson's, Nick Offerman was much better than both of them\n\nthe POTUS AMA barely kept positive karma and lasted all of 20 minutes, breaking reddit for no point- thanks Obama for tanking my favorite site with your useless media campaign, just a reason not to vote for him now, back fired hard like \"We the People\" and the youtube Q&amp;As", "gilded": 0, "created_utc": "1346505007", "subreddit": "AdviceAnimals", "score": 2, "controversiality": 0}
{"body": "Thanks to Obamacare and my parents/their insurance, I'm sitting in a chiropractor's office right now, waiting to be adjusted to help ease my isthmic spondylolisthesis. I've also had an MRI and a (failed) steroid epidural. I wouldn't have been able to afford these things without insurance, and when I graduated the only job I could find was at my old CVS, part-time, where I couldn't get insurance. Thanks, Obama!", "gilded": 0, "created_utc": "1346508805", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I get the sentiment in the billboard which I will repeat here:\n\n&gt; THANKS, OBAMA. You've spent my lunch money, my allowance, my inheritance, 35 years of future paychecks, and my retirement. You Jerk.\n\nBut I don't understand why anyone would think it actually makes sense.\n\nWhere does the 35 years of future paychecks figure come from? What is it alluding to? Taxes? As [Nate Silver documented in 2009](http://www.fivethirtyeight.com/2009/08/obama-has-cut-taxes-for-986-percent-of.html), Obama cut taxes for more than 98% of citizens. Surely the little girl can't be feeling the heat too badly.\n\n**Can someone tell me what large spending increases occurred under Obama that would not have occurred under a McCain presidency?** Is 2009 the stimulus the only thing?\n\nConservatives may balk about the 2009 stimulus price tag, but it was one third tax cuts, which conservatives seem to love, leaving around ~$500bn in \"recovery and reinvestment\" spending. That's extra government spending no doubt, but a paltry amount compared to the Iraq war, and I can't imagine attacking Iran would be very cheap, but on Twin Earth where McCain is president we see no reason why he wouldn't want to, since he's [already nodded in agreement.](http://www.nationaljournal.com/nationalsecurity/mccain-trust-israel-s-judgment-on-attacking-iran-20120305)\n\nAdditionally, if this is something to be angry about in general, why didn't conservatives show similar ire with Bush in 2004? It is now completely clear that the fiscal expectations of the Iraq war were off by miles ([$80-100 billion](https://www.mtholyoke.edu/acad/intrel/bush/cheneymeetthepress.htm) whereas it cost $3.2-4 trillion), and the Bush tax cuts cost us about $1.6 trillion more in debt between 2001 and 2011 (says the [CBO](http://www.cbo.gov/sites/default/files/cbofiles/attachments/06-07-ChangesSince2001Baseline.pdf))\n\nThere's nothing wrong with reduced spending, but its a little too cute that it only happens after Bush has left office. It seems that conservatives that make ads like this one are unserious or insincere.\n\nBut maybe he had a \"THANKS, BUSH\" sign and I missed it. He'd have to bump the \"35 paychecks\" number way up, though.", "gilded": 0, "created_utc": "1346548757", "subreddit": "Conservative", "score": 5, "controversiality": 0}
{"body": "[Well, now you don't need a six figure income for birth control. Thanks Obama.](http://www.dailyfinance.com/2011/08/02/in-the-u-s-free-birth-control-is-born/)", "gilded": 0, "created_utc": "1346602428", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Is this Obama bashing? Don't make us do this for Bush. Unemployment in 2000 3.9% in 2009 7.8%.Year 2000 vs 2009 Median income  53k then 50k in 2009 (according to information I found inflation adjusted). Gas prices 1.51/gallon in 2000, rose to 4.11/gallon in 2008 under bush. dropped to 1.84 in 2009. Thanks Obama.  Nation debt 5.6T in 2000, 10T in 2009. Republicans made the big mess to start with and will make it far worse if they get into office again. ", "gilded": 0, "created_utc": "1346605626", "subreddit": "POLITIC", "score": 1, "controversiality": 0}
{"body": "thanks obama", "gilded": 0, "created_utc": "1346721319", "subreddit": "fitnesscirclejerk", "score": 3, "controversiality": 0}
{"body": "THANKS OBAMACARE!", "gilded": 0, "created_utc": "1346762683", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1346766048", "subreddit": "todayilearned", "score": -1, "controversiality": 0}
{"body": "Skin cancer rates plummet. Thanks, Obama. ", "gilded": 0, "created_utc": "1346768024", "subreddit": "politics", "score": 7, "controversiality": 0}
{"body": "Yeah I have the opposite problem.. used to play T2 pro but now I can't even afford to repair my main rig (thanks Obama) so I'm playing at 10-15 fps with a trackball on a laptop.. I still do ok against level 20s but since Im creeping into the high 30s myself I keep ending up in lobbies with 40-50s and I find myself playing less and less as it just ends up as a big ball of frustration.\n\nHitting blue plates when your screens a slideshow is hard enough without the trash talk you get from a lot of the 50s.\n\nMatchmaking based on levels is stupid and counterproductive anyways since bad players are going to end up out of their league quickly and will rage quit and good players will get bored slogging through the newbie lobbies and quit.\n\nWhat we need is a metric that evaluates actual skill like (top of my head example) adding up the total objective based points collected that round by your team and dividing your total by it then averaging that across your game history.\n\nThat should give a more accurate view of an individual players contributions and effectiveness and not just how long they have been playing.\n\n[edit]\nThinking about it further it could also serve to illustrate the massive difference in points (and therefore xp) given to two equally skilled players just because they are playing different roles.. and perhaps we could finally get that somewhat balanced.", "gilded": 0, "created_utc": "1346829532", "subreddit": "Tribes", "score": 1, "controversiality": 0}
{"body": "KARMA VENDORS ARE TOO EXPENSIVE, THANKS OBAMA!", "gilded": 0, "created_utc": "1346852937", "subreddit": "Guildwars2", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1346871765", "subreddit": "todayilearned", "score": -4, "controversiality": 0}
{"body": "Because the first term is just a throw away.  Glad we were here for the wasted four years.  Thanks, Obama.  Also, I'm sure he'll apologize to all the people put in prison during his tenure for marijuana charges.  \n\nSomehow, I'm not convinced.  I think the next four years will pretty much be exactly the same as these last four.  ", "gilded": 0, "created_utc": "1346881414", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "And, the pride i had is now gone.\n\nTHANKS OBAMA!", "gilded": 0, "created_utc": "1346887371", "subreddit": "atheism", "score": 3, "controversiality": 0}
{"body": "Ummmm... Thanks, Obama?", "gilded": 0, "created_utc": "1346902361", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks, Obamanomics.", "gilded": 0, "created_utc": "1346947903", "subreddit": "news", "score": -3, "controversiality": 0}
{"body": "yeah, thanks obama", "gilded": 0, "created_utc": "1346960601", "subreddit": "nfl", "score": 19, "controversiality": 0}
{"body": "Sheesh first people start defending themselves against burglars then next it's going to be the rapists and back alley muggers loosing work. What's this country coming to? \n\n*THANKS OBAMA*", "gilded": 0, "created_utc": "1346967681", "subreddit": "videos", "score": 2, "controversiality": 0}
{"body": "What do you mean thanks Obama... We all had to chip in so you don't have to be responsible.", "gilded": 0, "created_utc": "1346990300", "subreddit": "pics", "score": 73, "controversiality": 0}
{"body": "Because 99.16% are military-age males standing next to confirmed terrorists. Thanks, Obama.", "gilded": 0, "created_utc": "1346990486", "subreddit": "conspiracy", "score": -7, "controversiality": 0}
{"body": "Some things that stood out for me:\n\n###Climate change is not a hoax. - President Barack Obama\n\n###I AM the President. - President Barack Obama\n\n###You did it. - President Barack Obama\n\n###Osama bin Laden is dead. - President Barack Obama\n\nOh, and as a [veteran](https://s3.amazonaws.com/obama.3cdn.net/71720a03c270f9fa63_5lm6b3wnv.jpg), he has my vote. Thanks Obama for giving us a shout-out, especially those of us who didn't come back with everything we left with (AKA all of us). And yes, I'm on my way to become a teacher. I voted for him in 2008, and this time in 2012 it's another simple choice. Those of you who say both parties are the same, how can you pretend that this speech and Romney's speech were the same??? On one side, we have a President that uses facts and logic to provide solutions. On the other side, we have a guy who just spouts the same thing we've heard every single time, \"cut taxes\". Sorry, but the problems we face are more complex than that. Obama is right, Romney is wrong, plain and simple. I've seen it every single time. \"Oh, but democrats don't have a spine\". No, that's just the narrative the media plays. This Obama is the same Obama that's been in office this entire time. This democratic party is the same party that's been in office this entire time. They've had a spine all along, but for some reason, the media only points that camera at it once in a blue moon. Look at that crowd. That's Americans. That's YOU. Do you really think a McCain president would have [signed the repeal of DADT](http://go.wsupnow.com/wp-content/uploads/2012/04/Obama-Infographic-Gay-Rights-Timeline.png)??? Do you really think a McCain president would have declared that climate change is not a hoax? Do you think a Romney president would have done those things either?? Of course not. \n\nThere is a big difference between the two parties, get it right. I don't care where you live in the United States, whether it's San Francisco or Austin or Atlanta or New York City. Every single vote counts. Places that used to be Republican strongholds are now swing states. [Especially for those who live in Austin and Texas, which is going to be a swing state or even a democratic stronghold in the very near future, but **only** if you show up at the polls.](http://www.dailykos.com/story/2012/05/07/1089562/-Texas-marches-toward-swing-state-status-Only-question-is-when) Can you imagine that? If Texas becomes a blue state? In the current election, if Obama wins Texas, **none of the other swing states would even matter, that alone would guarantee his victory**. [Test it out here](http://www.cnn.com/ELECTION/2012/ecalculator#_) if you don't believe me. Can you imagine that, never having to worrying about a Republican as President ever again? Never have to deal with creationism, reproductive rights, faith-based initiatives, warmongering, etc. ever again from the White House? It's possible. It's very much possible. But only if you get out there and vote and show how many people **really** are opposed to those things. Let the Republicans know that they don't have your support, and they'll **have** to adapt and change their ways. Look at Great Britain, where *their* [Conservative Party has the following in their platform](http://www.conservatives.com/Policy/Where_we_stand/Women_and_Equality.aspx):\n\n*     We will use our relationships with other countries to push for unequivocal support for gay rights and for UK civil partnerships to be recognised internationally.\n*     We are tackling homophobia in sport and homophobic bullying in schools.\n*     We have introduced legislation that will allow the removal of criminal convictions for consensual gay sex from times when such acts were illegal.\n*     We are allowing those religious premises that wish to do so to register civil partnerships and we will consult next year on how to introduce same-sex civil marriage.\n\nCan you imagine that in the United States, where both parties were pushing for this sort of thing? I can. It's up to you, millennials. Please, [register to vote](http://www.rockthevote.org/). Vote in the election. Don't pretend it's pointless. Because it's not. Don't ruin this for me. I'm sick and tired of the United States being a laughing stock. I want there to be a time where the Swedish circlejerk about **us** and talk about how great **we** are.\n\nAnd finally, [*Curiosity*](http://upload.wikimedia.org/wikipedia/commons/a/a9/Mars_Science_Laboratory_Curiosity_rover.jpg) is counting on your vote too. Don't make that robot sad by voting for the party that doesn't care about science, because **Obama cares**. Get it right.\n\nVote, vote, vote, **vote**!\n\n[-Jason](http://www.reddit.com/r/JasonMacker)", "gilded": 0, "created_utc": "1346998761", "subreddit": "politics", "score": 425, "controversiality": 0}
{"body": "Thanks, Obama!", "gilded": 0, "created_utc": "1347002334", "subreddit": "louie", "score": 6, "controversiality": 0}
{"body": "Umm, 95% of federal spending is medicare and military. Thanks Obama for building the federal highways that i use once a week though! Thanks a million!", "gilded": 0, "created_utc": "1347007116", "subreddit": "POLITIC", "score": 1, "controversiality": 0}
{"body": "oh yeah this is horrible im so glad we only listen to facts here on reddit oh hey did you guys hear how romeny gave a woman cancer? thanks obama for letting us know this truth. ", "gilded": 0, "created_utc": "1347007761", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "Before July my fiance was paying about $40 a month for birth control, which she needed to both regulate her cycles and to *prevent pregnancy* which, by the way, is a 100% legitimate use of the pill. \n\nI don't know why people are so afraid to say they use birth control to prevent pregnancy, but whatever.\n\nIn August, her birth control bill was $0. Thanks Obamacare!", "gilded": 0, "created_utc": "1347025475", "subreddit": "pics", "score": -4, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1347035038", "subreddit": "Austin", "score": 1, "controversiality": 0}
{"body": "Fuck, I can't believe that guy from Bell Biv DeVoe joined a gang\n\nTHANKS OBAMA", "gilded": 0, "created_utc": "1347039143", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Another suggestion is Access Healthcare in Apex (off Hwy 55). Regular doctor, but he doesn't deal/file with insurance companies. $59 per visit. Used to be $50... THANKS OBAMA!!! /sarcasm\n\nhttp://www.acchealth.com/\n\npulled from info page:\n\nFees:\n\nWe believe that insurance companies, the government, and HMO's can get in the way of quality healthcare.  Our office does not file insurance of any type.  Our fees have been dramatically reduced to make our  services affordable even without using insurance.  We offer these reduced fees while providing excellent service and top quality medical care.  This fee schedule will be beneficial for those in our community who are unable to afford health insurance and will also be appealing to those who have insurance but do not want to wait long periods of time to be seen by a doctor on their insurance plan.  It will also be helpful for those with high deductibles.  Our goal is to make it easy for those in our community to access quality healthcare without the hassle and drawbacks to managed care.  We do not sign contracts with insurance companies or HMO's that cause us to have the insurance companies' interests ahead of our patients- At Access Healthcare you are our # 1 priority- not your insurance company or the government.  Unlike most offices that take insurance and send your personal health record to the insurance company or the government to get paid, we do not.  Your health information never leaves our office without your expressed request to do so(unless requested by legal authorities). Although existing patients have access to same day or walk-in appointments for visits, new patients are taken on a limited basis and it may take several weeks for a new patient to become established at the practice with their first visit.\n\nOffice visits $59 for existing patients(this fee is normally $93-$150 at other offices)\nWork Physicals $49 to schedule plus any labs if needed\nSports Physicals $29\n\nLab work: We offer a significant discount for our patients regardless of insurance- this can be as much as 85% off standard LAB prices.  One example is that we charge $9 for a cholesterol test.", "gilded": 0, "created_utc": "1347060658", "subreddit": "triangle", "score": 3, "controversiality": 0}
{"body": "&gt; The Obama administration told a federal court Tuesday that the public has no “reasonable expectation of privacy” in cellphone location data, and hence the authorities may obtain documents detailing a person’s movements from wireless carriers without a probable-cause warrant.\n\n&gt; The administration, citing a 1976 Supreme Court precedent, said such data, like banking records, are “third-party records,” meaning customers have no right to keep it private. \n\nThanks Obama.  This was exactly the sort of change everyone voted for...", "gilded": 0, "created_utc": "1347134090", "subreddit": "technology", "score": 191, "controversiality": 0}
{"body": "Thanks Obama. Your health care is completely flawless.\nOh wait.", "gilded": 0, "created_utc": "1347142455", "subreddit": "WTF", "score": -14, "controversiality": 0}
{"body": "Being white is hard. I had to wait longer at the drive thru today because there were non-white people that had cars. It was such an inconvienence having to wait around a minute longer.  Had that non-white person not owned a car I could have spent that minute at home surfing reddit while watching old episodes of Pokemon instead of surfing reddit on my iPhone while listening to the music in my car.\n\nTHANKS OBAMA!!!", "gilded": 0, "created_utc": "1347181616", "subreddit": "politics", "score": 87, "controversiality": 0}
{"body": "I was off work on workmans comp with my wrist just out of a cast. We had prepaid for a 7 day cruise but were broke the whole trip. When we got home our income tax return ($5000 THANKS OBAMA!) we immediately when to fry's bought a flat screen and a laptop. Then straight to the apple store and bought my wife a MacBook. When we got home I told my wife I was ready to impregnate her. A week later she was Pregasaurus and the doctor cleared me to go back to work. Too bad the company went under while I was on the mend. So broke, unemployed, pregnant, but at least we had Internet and a kickass TV. ", "gilded": 0, "created_utc": "1347228397", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "1. Boyfriend can probably defer at least one or two of his student loans due to \"economic hardship\". That cuts down on monthly payments temporarily so you can catch up on regular bills. \n2. Look on craigslist for odd jobs like lawn mowing, tutoring high school kids, whatever.\n3. If you're paying for private health insurance, cancel it and start being really careful when crossing the street (just for now). IF you are under 26, you're eligible to be on your parent's health insurance plan (Thanks Obama). If you're not 26, you're probably eligible for medicaid.\n4. It's not clear if you are applying for jobs online exclusively. Walk yourself to the nearest strip mall with a stack of bare-bones non-law degree resumes with your retail/service experience highlighted and ask to speak to the manager of each and every store. This will consistently bring better results than online applications. I graduated with an engineering degree three years ago and found a job at Petco this way, and it tided me over until my next legitimate career opportunity. Note: maybe its because you have to be someone competent to work at Petco since you're taking care of real, live animals?.\n5. Do you have an extra bedroom? Get a roommate and ask for a deposit contribution upfront. This will get you extra cash now.\n6. Go online and find your local temp. agencies. They get paid to find you a job (and you don't have to pay them upfront). Once they place you, they will skim off the top of your wages a bit, but often temping can lead to a full-time career opportunity.\n7. Good luck...I've been in this position before, but as long as you have SOME source of income, you will get through it. It doesn't seem like it now but you will be surprised what you can survive through...this gets easier. This time last year I had $5000 in credit card debt, $30,000 in student loans, and lived paycheck to paycheck even when I moved back in with my parents. Today I have my own place and $4000 in the bank. Your luck will turn around. Promise.", "gilded": 0, "created_utc": "1347248906", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "I got fired, lost my health care plan, couldn't pay for COBRA, and am now getting fined for it. Thanks Obamacare!", "gilded": 0, "created_utc": "1347257555", "subreddit": "politics", "score": -11, "controversiality": 0}
{"body": "I developed asthma later on in life, thought it was just a cough, went to go get the \"cough\" treated, and it costed me $500 out of pocket since I was 19 and off my parent's health insurance (which is a lot for a waitress who's paying off a car, living on her own, and going to school). Called my mom crying because I had just handed over my month's rent and had to borrow money from friends just to make it.\n\nA year later ACA was passed. My parents decided that, since I was asthmatic and being a server didn't offer any benefits, they would put me on their health plan. All of a sudden I could afford my inhaler. I could afford medicine to treat my allergies. I didn't have to freak out about not affording treatment every time I got sick. I was able to go see a specialist for colon issues that had developed. \n\nSo thanks Obama! and a totally not incompetent congress for actually getting something like the ACA passed. because of them (and my parents putting me back on their plan), I can now afford healthcare.", "gilded": 0, "created_utc": "1347261263", "subreddit": "politics", "score": 88, "controversiality": 0}
{"body": "Thanks to OBAMACARE, I get to pay extra high taxes on insurance that's not based on my risk at all as a healthy male in my twenties! Thanks Obama!", "gilded": 0, "created_utc": "1347266980", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "This thread...sounds so much like an Obama campaign message. \"Thanks Obama\" everywhere.", "gilded": 0, "created_utc": "1347267232", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "I have been under employed for a three years, but now I still have to cover both my 25 year old children who are too lazy to even be under employed.  Thanks Obamacare for costing my Big Bucks every month.", "gilded": 0, "created_utc": "1347273406", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "All those free abortions I got. Thanks Obama!", "gilded": 0, "created_utc": "1347274506", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Me and my girlfriend are both recent college grads who are dirt poor, she needed surgery this year but couldn't afford it so Obamacare took care of it. Now they decided that she makes too much money for it ($245 a week) and are making us pay back the entire sum Thanks Obamacare! you fuck", "gilded": 0, "created_utc": "1347276532", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "My birth control went from $20 a month to $5. $20 a month adds up when you don't make a ton of money. So thanks Obama! Making it easier to not ever need an abortion!", "gilded": 0, "created_utc": "1347281536", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Lets see how Obama has helped me.\n\n#1 The company my wife worked for 12 years got out of the health insurance field because they could see what Obamacare was going to do to mid-size insurers. She had to find a new job for less money.\n\n#2 The amount of my families portion of debt has went from $90K to $136K in 4 years\n\n#3 My wife and I were both insured by our employers and we still are today.\n\nActually, I can't think of one good thing that has happened to me thanks to what the government has done in the last 4 years.\n\n\nThanks Obama!", "gilded": 0, "created_utc": "1347282442", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "my younger brother was also temporarily covered under my mom's insurance for a 18 months or so until he got a real job. nothing happened to him in that time though, so THANKS OBAMA", "gilded": 0, "created_utc": "1347283294", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I'm 24. My family has a genetic condition that caused my mom to have stage 4 colon cancer at the age of 32. And I have lived without the knowledge of whether or not I carry that condition because if I am generically tested for it, I could later be denied insurance under the pre-existing condition clause. I've wanted to know for a long time, and because if so, I can have preventative care. And if not, I don't have to worry about telling a potential future spouse \"there is a 100% likeliness I will have severe cancers before I'm 40.\"\nIt's been a hanging cloud pretty much my whole life. And as soon as 2014 comes around, you better believe I will get tested and take care of myself. But right now, plausible deniability of knowledge is what keeps me safe.\nSo, thanks Obamacare! ", "gilded": 0, "created_utc": "1347284475", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I work for a small business that was considering my request to provide health insurance; when I did the ACA tax calculations and showed my boss that she will get a 35 percent tax deduction immediately, which goes up to 50 percent in 2014, she said it was doable. Now insured through work. Thanks Obamacare!", "gilded": 0, "created_utc": "1347284923", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "It will push commodtities up, create a small(possibly already seen) jump in the stock market, and run the risk of us slipping into stagflation.  Thanks Obama!", "gilded": 0, "created_utc": "1347310236", "subreddit": "PoliticalDiscussion", "score": -1, "controversiality": 0}
{"body": "Obama doesn't control the Fed.... Thanks Obama for NDAA and codifying the indefinite detention of American citizens without trial - Thanks Obama for assassinating multiple American citizens without due process.\n\nGet your political complaints right.", "gilded": 0, "created_utc": "1347313920", "subreddit": "PoliticalDiscussion", "score": 2, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1347321089", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Really, so everyone doesn't hate America. Sweet, thanks Obama. ", "gilded": 0, "created_utc": "1347334842", "subreddit": "electronicmusic", "score": 3, "controversiality": 0}
{"body": "The coyotes are taking our jobs. Thanks Obama.", "gilded": 0, "created_utc": "1347381676", "subreddit": "pics", "score": 12, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1347387377", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks, Obamanomics.", "gilded": 0, "created_utc": "1347393205", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "How is this not on the front page ? We help them over throw their oppressive government, and give them BILLIONS in aid, and this is their thanks. Thanks Obama good job. Should just nuke the whole damn bunch of them. ", "gilded": 0, "created_utc": "1347403782", "subreddit": "worldnews", "score": -3, "controversiality": 0}
{"body": "Thanks Obama", "gilded": 0, "created_utc": "1347404635", "subreddit": "Conservative", "score": 0, "controversiality": 0}
{"body": "Yeah way to show one of the last non Isalmic nutbag countries in the region that they don't matter at all.\n\nAbandoning Mubarak to Islamists was a total disgrace and will (and has already) come back to bite the rest of the world in the ass (not to mention Egypt's own citizens have and will pay a huge price in basic human rights). Thanks Obama.", "gilded": 0, "created_utc": "1347429361", "subreddit": "worldnews", "score": -2, "controversiality": 0}
{"body": "$220.00 a month is not terrible, does your wife work?  That's like, 3 days work at 10.00 an hour and if your employer is offering healthcare you are probably making more than that.  I would give my left nut for my health insurance to only cost $80.00 a month, but then I would have a preexisting condition and be ineligible for insurance, oh wait, thanks Obamacare!", "gilded": 0, "created_utc": "1347459119", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I don't want to be rude to you, I am currently in your position, searching for health insurance for my 26th birthday. (thanks Obamacare for the last 2 years) My wife's plan allows me to add on for a bulk sum payment of $3,200 for one year. ($266.66 a month)  I can understand how you can't afford to add your wife, but man, $80.00, just pay it, I know that doesn't cover your family, but it will save your financial life if you have to go to the ER for any reason.  ", "gilded": 0, "created_utc": "1347460524", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I was going to get my own insurance, but Obama made it easy for me to just stay at home and not grow up\n\nThanks Obama! For helping everyone like me stay put longer. You bastard. I don't wanna pay for other peoples health, nor do I want them paying for mine", "gilded": 0, "created_utc": "1347461826", "subreddit": "politics", "score": -2, "controversiality": 0}
{"body": "Cool so a bunch of people with an extremely low risk of health issues are forking over billions of dollars to the health insurance industry. Thanks Obama!", "gilded": 0, "created_utc": "1347466531", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Well duh.  What did you think torture was for?  Why do you think America spent all that money rounding up random Iraqis with no possible \"intelligence\" value and fucking their kids up the ass as torture, and raping their women and men and then releasing them?  Obviously it's state terrorism.  Thanks Obama!", "gilded": 0, "created_utc": "1347470721", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "My 23 year old son, and 25 year old daughter, can thank Obama for being on the family insurance plan.  Thanks Obama!", "gilded": 0, "created_utc": "1347480042", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "True democracy when 70% Americans oppose attacking Iran but are government is already doing so.\n\nThanks Obama for blow back...", "gilded": 0, "created_utc": "1347496301", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "--- \n\n[Thanks Obama – The Terrorists You Used To Topple Regimes In Egypt And Libya Are Now Attacking Our Embassies](http://www.reddit.com/r/worldnews/comments/ztlqb/thanks_obama_the_terrorists_you_used_to_topple/)\n\nsubmitted 14 minutes ago by: [Perfect_Fit](/user/Perfect_Fit) to [worldnews](/r/worldnews)\n\n---\n\n**[Confirm it's missing](/r/worldnews/search?q=\"Thanks%20Obama%20%E2%80%93%20The%20Terrorists%20You%20Used%20To%20Topple%20Regimes%20In%20Egypt%20And%20Libya%20Are%20Now%20Attacking%20Our%20Embassies\"&amp;sort=new&amp;restrict_sr=on)** |\n**[Message the moderators](http://www.reddit.com/message/compose?to=/r/worldnews&amp;subject=Spam%20filtered%20in%20/r/worldnews%20%3A%20Thanks%20Obama%20%E2%80%93%20The%20Terrorists%20You%20Used%20To%20Topple%20Regimes%20In%20Egypt%20And%20Libya%20Are%20Now%20Attacking%20Our%20Embassies&amp;message=http%3A//www.reddit.com/r/worldnews/comments/ztlqb/thanks_obama_the_terrorists_you_used_to_topple/)** |\n**[Post to PoliticalModeration](/r/PoliticalModeration/submit?title=/r/worldnews%20%5Bspam%20filtered%5D%20Thanks%20Obama%20%E2%80%93%20The%20Terrorists%20You%20Used%20To%20Topple%20Regimes%20In%20Egypt%20And%20Libya%20Are%20Now%20Attacking%20Our%20Embassies&amp;url=http%3A//www.reddit.com/r/worldnews/comments/ztlqb/thanks_obama_the_terrorists_you_used_to_topple/)**\n\n\n|           |     | |           |     |\n------------|-----|-|-----------|-----|\ncreated:    |  Sept. 13, 2012 2:04 p.m. | |score:     |  1 |\nfirst seen: |  Sept. 13, 2012 2:14 p.m. | |upvotes:   |  1 |\nlast seen:  |  [[SPAM FILTERED]](/message/compose?to=/r/worldnews&amp;subject=Spam%20filtered%20in%20/r/worldnews%20%3A%20Thanks%20Obama%20%E2%80%93%20The%20Terrorists%20You%20Used%20To%20Topple%20Regimes%20In%20Egypt%20And%20Libya%20Are%20Now%20Attacking%20Our%20Embassies&amp;message=http%3A//www.reddit.com/r/worldnews/comments/ztlqb/thanks_obama_the_terrorists_you_used_to_topple/)  | |downvotes: |  0 |\nmissing:    |  Sept. 13, 2012 2:19 p.m. | |comments:  |  0 |\n\n", "gilded": 0, "created_utc": "1347546174", "subreddit": "ModerationLog", "score": 1, "controversiality": 0}
{"body": "It is not a bad idea to join the entrenched mobsters rather than the  peasant class.  Teachers' unions, cop unions, public service unions, and health care (thanks Obamacare!) will all benefit over most every private sector.  Of course, still #1 is the private sector selling to, or influencing, the USG.  THAT sector is booming like nothing else.", "gilded": 0, "created_utc": "1347551850", "subreddit": "Anarcho_Capitalism", "score": 2, "controversiality": 0}
{"body": "There must be a lot of new users. The front page is almost full of re-posts. Thanks Obama.", "gilded": 0, "created_utc": "1347553465", "subreddit": "funny", "score": 8, "controversiality": 0}
{"body": "THANKS, OBAMA- NOW WHAT AM I GOING TO DO WITH ALL THESE 'HONK IF YOU AREN\"T A FAG' BUMPER STICKERS!?! \n\nI THOUGHT THIS WAS AMERICA??", "gilded": 0, "created_utc": "1347556719", "subreddit": "funny", "score": 9, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1347561790", "subreddit": "Health", "score": 0, "controversiality": 0}
{"body": "Thanks Bush/Cheney for running the US economy off a cliff\n\nThanks Obama for trying to fix it, without any help from the party of NO", "gilded": 0, "created_utc": "1347566931", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "aw fuck where do i start \n\n* tax cuts for wealth citizens (that obama extended indefinately)\n* Iraq and afghanistan wars ( That obama let continue for 3 years until he needed election points , also we are in afghanistan until 2029 , thanks obama) \n* TSA (again something obama has done nothing to alter or combat) \n* Teh deficit and debt (obama has done more financial damage in 3 years than bush has managed to do in 8 , you can fact check your little heart out. In case you dont bush entered office with a debt of 5 trillion , left office with a debt of 10 trillion. Obama came into office with a debt of 10 trillion , he is ending his first term at 16 trillion dollars of debt. Good game democrats) \n* Failure to deregulate the banks (obama hasnt done a single thing about this) \n* Obamacare , nuff said. \n* dickcheney , blackwater , somehow this is bush's fault guys. ", "gilded": 0, "created_utc": "1347579270", "subreddit": "PoliticalDiscussion", "score": 2, "controversiality": 0}
{"body": "THANKS, OBAMA", "gilded": 0, "created_utc": "1347631195", "subreddit": "hockey", "score": 6, "controversiality": 0}
{"body": "I am 23 and the only reason I'm able to have health insurance right now is the provision of Obamacare that allows individuals to stay on their parents plans until they are 26. \n\nThanks Obamacare!", "gilded": 0, "created_utc": "1347652967", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1347660558", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Thanks obama.", "gilded": 0, "created_utc": "1347663371", "subreddit": "news", "score": -10, "controversiality": 0}
{"body": "I can think of a couple hardships cis people routinely face:\n\n* Being unwilling to tell the difference between mockery and oppression\n\n* Can't figure out how to word this one... \"Gaben is a cismale, he gets made fun of!\" \"Not for being cismale though!\"\n\n\nAh shit.  I think I got \"hardships\" and \"privileges\" mixed up there.  THANKS OBAMA.", "gilded": 0, "created_utc": "1347665256", "subreddit": "ShitRedditSays", "score": 9, "controversiality": 0}
{"body": "What? Not a liberal circle jerk? I don't know what this means? On a real note I'd like to thank the bush admin on providing us with the right supplies while during a war, I was an infantry line medic with the 82nd Airborne in both Iraq and afghan. Having the right supplies makes a world of difference, and as every solider knows... Voting democrats is like voting for a pay cut. I should note that I used my Montgomery GI Bill and would like to thank the tax payers, but unfortunately I HAVE let you down as I have been trying to secure a job for the last year and have not been able to. Even the shitty jobs that no one wants I get told I have to much education. And that Iwould just find something better later. Well it's later and thanks Obama for helping with that. Obviously I can't fault him for my misgivings but a professional resume plus 10 years of military exp apparently gets you, sorry not enough experience. I wish my employers new half the struggles I over came but saddly that does not translate to my profession. ", "gilded": 0, "created_utc": "1347692672", "subreddit": "todayilearned", "score": 0, "controversiality": 0}
{"body": "I like this a lot, any thoughts on the nice town next to them?\nI also think alcohol plays a huge roll in how the government workers act. It seems like whenever they go out to a bar they don't just drink a little, they get demolished. Another example was in the episode where Knopp had an interview with the Indianapolis television show, interview falls through, she gets a little buzzed, interview on, she makes mistake, they drive to get him to stop it from airing and when it's found out that it has been stopped they celebrate by drinking at like 8 in the morning. I'd like to think they are just constantly wasted throughout the show.\nI guess the stress of working in the government can do that to you, thanks Obama. ", "gilded": 0, "created_utc": "1347759407", "subreddit": "FanTheories", "score": 5, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1347818202", "subreddit": "ImGoingToHellForThis", "score": -6, "controversiality": 0}
{"body": "Oh man, you mean I just have to make payments for 20 years?  LOOK AT ALL THIS FREE MONEY THANKS OBAMA", "gilded": 0, "created_utc": "1347849473", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "the financial growth in this case was an old woman dying and leaving her children money. thanks obama. \n\nalso i dont know why you keep saying whiling instead of willing but it makes whatever you say invalid. ", "gilded": 0, "created_utc": "1347891511", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Hey man, I married my high school boyfriend. We were all like \"Gay marriage? Heck yes I want me some of that. Thanks Obama.\" *POTUS Bro Fist*", "gilded": 0, "created_utc": "1348028417", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "For the first time in my life my wife's health insurance premium actually went down.  Thanks ObamaCare (ACA)!!!", "gilded": 0, "created_utc": "1348029101", "subreddit": "Republican", "score": 8, "controversiality": 0}
{"body": "Turns out that being denied for a preexisting condition is something from the past. Thanks, Obama. ", "gilded": 0, "created_utc": "1348058759", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "--- \n\n[Well...there goes my creativity. Thanks Obama!](http://www.reddit.com/r/politics/comments/104zyh/wellthere_goes_my_creativity_thanks_obama/)\n\nsubmitted an hour ago by: [springflipflops](/user/springflipflops) to [politics](/r/politics)\n\n---\n\n**[Confirm it's missing](/r/politics/search?q=\"Well...there%20goes%20my%20creativity.%20Thanks%20Obama%21\"&amp;sort=new&amp;restrict_sr=on)** |\n**[Message the moderators](http://www.reddit.com/message/compose?to=/r/politics&amp;subject=Why%20was%20this%20removed%20from%20/r/politics%3F%3A%20Well...there%20goes%20my%20creativity.%20Thanks%20Obama%21%20&amp;message=http%3A//www.reddit.com/r/politics/comments/104zyh/wellthere_goes_my_creativity_thanks_obama/)** |\n**[Post to PoliticalModeration](/r/PoliticalModeration/submit?title=/r/politics%20%5Bspam%20filtered%5D%20Well...there%20goes%20my%20creativity.%20Thanks%20Obama%21&amp;url=http%3A//www.reddit.com/r/politics/comments/104zyh/wellthere_goes_my_creativity_thanks_obama/)**\n\n\n|           |     | |           |     |\n------------|-----|-|-----------|-----|\ncreated:    |  Sept. 19, 2012 3:09 p.m. | |score:     |  0 |\nfirst seen: |  Sept. 19, 2012 3:06 p.m. | |upvotes:   |  1 |\nlast seen:  |  Sept. 19, 2012 3:06 p.m. | |downvotes: |  1 |\nmissing:    |  Sept. 19, 2012 4:16 p.m. | |comments:  |  0 |\n\n", "gilded": 0, "created_utc": "1348071631", "subreddit": "ModerationLog", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1348080988", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "Not for long... Thanks ObamaCare!", "gilded": 0, "created_utc": "1348086393", "subreddit": "AdviceAnimals", "score": 0, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1348093341", "subreddit": "politics", "score": -12, "controversiality": 0}
{"body": "[Jeez, thanks Obama.](http://25.media.tumblr.com/tumblr_m7y4mgNNGB1qhn1hko1_500.png)", "gilded": 0, "created_utc": "1348093733", "subreddit": "politics", "score": 7, "controversiality": 0}
{"body": "My car keys are nowhere to be found!  THANKS, Obama.", "gilded": 0, "created_utc": "1348095898", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Because they're marginal upvotes. I only get 1/2 of an upvote after the first 10. *Thanks, Obama!* lol", "gilded": 0, "created_utc": "1348103944", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "\"I was born with a small penis 61 years ago. Thanks, Obama!\"", "gilded": 0, "created_utc": "1348233016", "subreddit": "nottheonion", "score": 36, "controversiality": 0}
{"body": "  Have you heard of the NEW   $40   BILLION  bailout for the BANKS..40 Billion $$$ per month, every month until the banks say no more. Tax $$$$ Thanks Obama and the Fucking FED.  New this month of September. Dem. &amp; Rep. parties Allow more 10% drugs to be grown in Afgan, under Bush, while fighting the same damn drugs through out the world. Tax Payers Foot Both Bills , Lose, Lose, Lose ", "gilded": 0, "created_utc": "1348250693", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks Obama! Coming after Reddit's jokes... What's next are you gonna ban cats, BARK Hussein?\n\n^^^/bizzaremetacirclejerk", "gilded": 0, "created_utc": "1348356385", "subreddit": "todayilearned", "score": 5, "controversiality": 0}
{"body": "Thanks Obama for cancelling the shuttle program", "gilded": 0, "created_utc": "1348409547", "subreddit": "pics", "score": -1, "controversiality": 0}
{"body": "&gt;This idea will apply to Americans soon enough.\n\nThanks Obama!", "gilded": 0, "created_utc": "1348429284", "subreddit": "worldnews", "score": -5, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1348434585", "subreddit": "IAmA", "score": -1, "controversiality": 0}
{"body": "Thanks, Obama.", "gilded": 0, "created_utc": "1348450510", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1348454438", "subreddit": "worldnews", "score": -1, "controversiality": 0}
{"body": "I nearly got fired last time I tried to take a white-water kayaking break at work.  Thanks Obama.", "gilded": 0, "created_utc": "1348467752", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "I *have* insurance (thanks Obama, I got back on Dad's insurance until I'm 26!) and an ER visit costs me a $75 copay.  \n\nIf you don't have insurance, you're literally not allowed to get sick. I lost my insurance for several months before Obama's plan kicked in, and I had to pay $947.50 per month for Seroquel, medication that I will die without. My job doesn't offer health insurance, and I work 30+ hours a week while going to school. Sorry Mittens, but I'm not \"the 47% in a welfare mindset\". I'm an ill person who needs healthcare to survive, just like millions of others. \n\nSOCIALIZE IT. ", "gilded": 0, "created_utc": "1348467911", "subreddit": "politics", "score": 26, "controversiality": 0}
{"body": "What you are seeing in the NFL now is a conspiracy theory exposed.  Regular refs are capable of controlling the outcome in subtle ways.  These replacement refs are doing the same things regular refs would do, only extremely obviously.  Thanks Obama.", "gilded": 0, "created_utc": "1348542556", "subreddit": "nfl", "score": 4, "controversiality": 0}
{"body": "Thanks, Obama!", "gilded": 0, "created_utc": "1348542948", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Thanks Obama for defending my right to call you a murderer\n\nhttp://www.esquire.com/features/obama-lethal-presidency-0812", "gilded": 0, "created_utc": "1348590914", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "  GOV. GARY JOHNSON WOULD NOT BE CURRENTLY GIVING THE BANKS  40  BILLION DOLLARS EVERY MONTH WITH NO END DATE. THANKS OBAMA  AND THE FED.   BY THE WAY, WHY DO WE HAVE TO PAY INTEREST ON THE NAT. DEBT WHEN WE LOANED THE DAMN BANKS THE MONEY INTEREST FREE. THANKS DEM. AND REP. PARTIES.", "gilded": 0, "created_utc": "1348595013", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks Obama, for defending my rights. By the way, you're an Asshole!", "gilded": 0, "created_utc": "1348611019", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "Thanks OBAMA!", "gilded": 0, "created_utc": "1348637730", "subreddit": "funny", "score": 19, "controversiality": 0}
{"body": "You and I are not safer from this, in fact you are put into more danger from this move. \n\nThanks Obama and your hollow promises! ", "gilded": 0, "created_utc": "1348674978", "subreddit": "Marijuana", "score": 38, "controversiality": 0}
{"body": "Worst President - **EVER** but that's ok. I'll get so much more in the way of handouts and \"freebies\" from this man and his cabinet staff because of your ridiculous \"Change\" votes...and the beautiful thing is I won't have to lift a finger. So by proxy...I say \"Thanks Obama voters\" you just paid for my 80\" LED. The next 4 years are going to be splendid perk grab if he wins. I bet I can even get a better gardening service under Obama? We'll see? So make sure to vote and remember...**\"CHANGE\"** cause daddy needs that 90\" instead. [Fools.](http://youtu.be/MSXOIf1YHmo) ", "gilded": 0, "created_utc": "1348696515", "subreddit": "pics", "score": -3, "controversiality": 0}
{"body": "That's a great way to put it. Walking into my pharmacy and getting my BC for free last month for the first time was such a great feeling. Thanks Obama!!", "gilded": 0, "created_utc": "1348697229", "subreddit": "TwoXChromosomes", "score": 2, "controversiality": 0}
{"body": "\"The Zionists and their fiat money are keeping me down!  Thanks Obama!\"", "gilded": 0, "created_utc": "1348705284", "subreddit": "AdviceAnimals", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.  Little victories and things that are good should not go unnoticed.", "gilded": 0, "created_utc": "1348707271", "subreddit": "politics", "score": 12, "controversiality": 0}
{"body": "This is the most backwards shit ever. Thanks Obama you liar. ", "gilded": 0, "created_utc": "1348736046", "subreddit": "Marijuana", "score": 1, "controversiality": 0}
{"body": "I think in order to ask questions like \"How is any of this due to Obama\" that would d rely on the OP actually saying something like \"thanks Obama\" or \"due to Obama\" or something in the title, or even the words \"Obama\" appearing even once in the text of the article.  Which it does not.", "gilded": 0, "created_utc": "1348770349", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "My FB rules; no family members, no professional contacts.\n\nNot once has this come back to haunt me. When my family asks, \"why won't you add me?\" I tell them that my facebook is between my friends and I. I don't want to know what you're doing, and I don't want you to know what my friends and I do.\n\nSimple, honest, and I can feel free to post my own opinions without fear of recourse from those people. Too often I'll argue with someone and their fucking mom/dad/brother/sister/cousin/grandparents (yes mima, please tell me your opinion of the negative effects video games have in our society, and go on to say how much better the world was without them...) have to get all defensive, and now I have one more person who thinks I'm a piece of shit. I look at my friend's walls who's parents constantly post and feel sorry for them. I should note that I don't only go on facebook to make myself look like an asshole, but it does come out sometimes when I see posts like, \"3 guards at the embassy with no ammo!? Thanks Obama\". I cannot keep myself from calling out those people on a public forum.\n\nI'm 24, I get into a lot of shit, and I don't want family/professional contacts thinking I'm a bad egg; nor do I care to hear their opinions most of the time.", "gilded": 0, "created_utc": "1348805052", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Don't like the laws - just hire judges that will do what you want.  \n\nThanks Obama for your open and non-politically based appointment!!", "gilded": 0, "created_utc": "1348809044", "subreddit": "Portland", "score": 1, "controversiality": 0}
{"body": "Thanks, Obamacare!", "gilded": 0, "created_utc": "1348823737", "subreddit": "toosoon", "score": 2, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1348838251", "subreddit": "worldnews", "score": -1, "controversiality": 0}
{"body": "&gt; (as amended by the American Recovery and Reinvestment Act.)  \n\n[is an economic stimulus package enacted by the 111th United States Congress in February 2009 and signed into law on February 17, 2009, by President Barack Obama.](http://en.wikipedia.org/wiki/American_Recovery_and_Reinvestment_Act_of_2009)  \n\n[The MSM even has ha somethign to say about it.](http://abcnews.go.com/Blotter/solyndra-report-obama-admin-restructured-loan-pr-concerns/story?id=16912518)  \n\nIt's not just that taxpayer dollars were lost ona  weak business model, it's that the loan package was restructured to allow private investors to get money back out of it before the government.  Those investors have several personal ties to the Obama Administration.  So we have bad loans and corruption.  Thanks Obama!", "gilded": 0, "created_utc": "1348838820", "subreddit": "Libertarian", "score": 1, "controversiality": 0}
{"body": "Then what the hell did your original comment even mean? OP thanks Obamacare for allowing him to afford the procedure and you say what? \"It's because of Obamacare.\" No shit Sherlock. That's why he said \"Obamacare literally saved my life.\"\n\nAs for the fend for themselves element:\n\nNot really. Prior to this they were forced to go without insurance and risk crippling debt or the destruction of their parent's accumulation of wealth should they have gotten sick. See, most people that fall into the teat sucking category you describe work entry level jobs that offer no health insurance nor a salary capable of affording insurance. Fuck them, right?\n\nPop quiz hot shot. Prior to the recession what was the No. 1 cause of bankruptcy? Buzz. Major illness. \n\nBesides, who the hell are you to tell people how they spend their money or when their children should not be on their parents health insurance? I though you and your ilk were against that kind of thing.\n\nIt's OK though. I know you'll never be convinced until it happens to you and fortunately based on how things are going it never will because of people like me and OP. And before you give me some mighty condemnation, I've held a steady full-time job for 20 years paying taxes since I was in high school. Put myself through college working two jobs and taking a full class load with the help of the federal student loan program. I've been a contributor to our society and you're damn right I'm willing to pay more. I've sucked 0 teats.", "gilded": 0, "created_utc": "1348873637", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1348875113", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Thanks Obama. You put reddit in the headlines, and now we're flooded with shit like this. ", "gilded": 0, "created_utc": "1348955321", "subreddit": "aww", "score": -1, "controversiality": 0}
{"body": "If your under 26, and your parents have good a good healthcare plan. Stay on their plan. I'm under my parents plan and save about 500 a year on medical/dental/vision insurance. Obligatory thanks Obama.", "gilded": 0, "created_utc": "1348962828", "subreddit": "Frugal", "score": 10, "controversiality": 0}
{"body": "\"It's our right to life and it will be far more threatened under Romney than yours will ever be under Obama.\"\n\n[citation needed]\n\nsince we already know that thousands have died due to drone strikes, we also know that those people's lives will be far more threatened under obama that yours will be under any president. so just like you don't care about men's lives, i don't need to care about yours. see how shitty things would be if we were all self-centered?\n\nnot enough people were willing to desegregate until people agitated for it. but you're not agitating for anything, you're giving up. it's sad. \n\nthe only choice of the 3 that will save lives is post-capitalism. because under capitalism i for sure, and likely you as well, will be doomed to austerity and financial sodomy in the present and near future.\n\ni don't understand why you don't radicalize yourself. you're reasonably articulate, you could be moving the population towards good, instead of a lesser evil. but why should i help you not die from a back alley abortion if you won't help me with my dead-end job, crippling debt, and no retirement to which obama is just as willing to doom me to as romney is? my death warrant is signed- a life of hard labor, maybe cancer due to pollution, and always knowing that my tax contributions are killing my brothers and sisters overseas while paying for bankers' bonuses. thanks obama.", "gilded": 0, "created_utc": "1348986232", "subreddit": "politics", "score": 1, "controversiality": 0}
