{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1349066973", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "California and LA are seperate places now? Thanks Obama *shakes fist*\n", "gilded": 0, "created_utc": "1349070947", "subreddit": "movies", "score": 18, "controversiality": 0}
{"body": "Won't even get read.\n\n\"But I'd have to pay for my own birth control\" would seem to be the metric here. Based on the number of \"OMG my birth control is finally free thanks Obama\" posts I've seen here.\n", "gilded": 0, "created_utc": "1349104200", "subreddit": "TwoXChromosomes", "score": 0, "controversiality": 0}
{"body": "THANKS, OBAMA!", "gilded": 0, "created_utc": "1349135046", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Thanks, Obama.  The children of Iran hope to join the 1 million (dead) children of Iraq who benefited from Bill Clinton's sanctions.", "gilded": 0, "created_utc": "1349185895", "subreddit": "worldnews", "score": -19, "controversiality": 0}
{"body": "I think you're remembering it wrong. That never happened. Of course, that's not to say it *won't* happen. Thanks Obama.", "gilded": 0, "created_utc": "1349199119", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "&gt;Net worth does not include net worth...\n\nThanks, Obama!", "gilded": 0, "created_utc": "1349202511", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks, OBAMA!", "gilded": 0, "created_utc": "1349235650", "subreddit": "washingtondc", "score": 0, "controversiality": 0}
{"body": "Thanks, Obama...", "gilded": 0, "created_utc": "1349284453", "subreddit": "economy", "score": 1, "controversiality": 0}
{"body": "Locked myself out of the car! THANKS OBAMA!", "gilded": 0, "created_utc": "1349289134", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "Atlas shrugged. Thanks Obama. Or do we call you Mr. Thompson whichever you prefer", "gilded": 0, "created_utc": "1349301997", "subreddit": "pics", "score": -14, "controversiality": 0}
{"body": "Thanks Obama for shutting Iran out of swift. That was all your doing.", "gilded": 0, "created_utc": "1349308209", "subreddit": "worldnews", "score": -2, "controversiality": 0}
{"body": "*Now* it is.\n\n(Thanks, Obama.. ಠ_ಠ)", "gilded": 0, "created_utc": "1349310493", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "&gt; 55 Percent Of American Doctors Approve of Obamacare. Romney will shut it down.\n\nI have no idea what this is based on as the majority of major changes that the ACA will have do not take affect until 2014 and we will not see if it is actually lowing costs for several years after that.\n\n&gt; 49 percent of all Americans live in a home where at least one member is receiving government benefits. Thanks Obama!\n\nTo some people this is a major problem. (Myself included)", "gilded": 0, "created_utc": "1349310643", "subreddit": "PoliticalDiscussion", "score": 1, "controversiality": 0}
{"body": "/R/IAmA is now a promoting tool. Thanks Obama. ", "gilded": 0, "created_utc": "1349319806", "subreddit": "IAmA", "score": 0, "controversiality": 0}
{"body": "No kidding. Thanks to Obama and his \"give it all away\" policy, I can no longer afford to have insurance at all. Through my husband's job, he is able to cover himself and all of our children for a reasonable fee. But adding a spouse -- ie, me -- DOUBLES the amount. So, thanks, Obama. Because of your generosity, I have to pay for all of my own healthcare out of pocket. (Though I'm glad my husband is the one who works and has insurance; he has more health concerns than I do.)", "gilded": 0, "created_utc": "1349366498", "subreddit": "MensRights", "score": 9, "controversiality": 0}
{"body": "[This is false as of 2010.](http://thanksobamacare.org/index.php?id=9). Thanks, Obamacare!", "gilded": 0, "created_utc": "1349423101", "subreddit": "WTF", "score": 2, "controversiality": 0}
{"body": "thanks obama(care)! :D", "gilded": 0, "created_utc": "1349440570", "subreddit": "science", "score": 7, "controversiality": 0}
{"body": "I feel like you're being sarcastic so I'll be earnest. Thanks Obama for Obamacare. It's obviously working.", "gilded": 0, "created_utc": "1349442659", "subreddit": "science", "score": 3, "controversiality": 0}
{"body": "Thanks, Obama!", "gilded": 0, "created_utc": "1349455853", "subreddit": "business", "score": -9, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1349638942", "subreddit": "worldnews", "score": 0, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1349737837", "subreddit": "CFB", "score": 9, "controversiality": 0}
{"body": "Yeah, thanks Obama!", "gilded": 0, "created_utc": "1349741752", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Thanks, Obama. If Romney wasn't such a bastard I'd consider not voting for your brand of corporate servitude. Two party systems totally suck dick.", "gilded": 0, "created_utc": "1349805093", "subreddit": "technology", "score": 6, "controversiality": 0}
{"body": "Thanks obama", "gilded": 0, "created_utc": "1349807255", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "Expect PBS is not politically affiliated.  Great way to enforce the notion they are liberally biased.  Thanks Obama Campaign.", "gilded": 0, "created_utc": "1349809723", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "Thanks Obama", "gilded": 0, "created_utc": "1349813992", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1349847071", "subreddit": "technology", "score": 1, "controversiality": 0}
{"body": "My car keys! You found them! Thanks, Obama!", "gilded": 0, "created_utc": "1349891677", "subreddit": "UFOs", "score": 3, "controversiality": 0}
{"body": "Thanks Obama and your administration! We all appreciate you and what you have done to hundreds of lawful Medical Marijuana Patients in the State of California! Those cartels you give guns to also love what you are doing! You are giving them back their market! Yay!...", "gilded": 0, "created_utc": "1349989476", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "NDAA lets them fuck anybody for any reason. No evidence required. Thanks Obama! \n\nBut seriously, untraceable currencies are not something governments like. If they do ever decide to crack down on bitcoins, not much will save you.", "gilded": 0, "created_utc": "1349991456", "subreddit": "RPI", "score": 1, "controversiality": 0}
{"body": "instead we got Alpha Protocol\n\nthanks obama", "gilded": 0, "created_utc": "1350003376", "subreddit": "gaming", "score": 7, "controversiality": 0}
{"body": "But they, unfortunately, don't seem to care about facts. As proven by the fact that Grandmaster Liar Romney actually has a decent chance of winning, the fact that he won the debate (thanks Obama for not calling him out on his bullshit, take some lessons from Biden), the fact Fox News has existed for so long, and also the fact we elected Bush. Twice.\n\nObviously, there are a good amount of people who do vote and have beliefs based on cold hard facts and truths, but it's already been proven in this country time and time again that it doesn't appear to be the case with everybody.", "gilded": 0, "created_utc": "1350058368", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "So you're one of those people that takes shit on Internet super personal and then takes money from the american taxpayer!?\n\nTHANKS OBAMA", "gilded": 0, "created_utc": "1350097468", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Except those gas prices. Thanks Obama!", "gilded": 0, "created_utc": "1350147832", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Well thanks Obama.", "gilded": 0, "created_utc": "1350159068", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Thanks, Obama!", "gilded": 0, "created_utc": "1350196997", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1350200091", "subreddit": "cringe", "score": 16, "controversiality": 0}
{"body": "This will affect the entire military vote not just in Ohio.  Thanks Obama.", "gilded": 0, "created_utc": "1350215640", "subreddit": "Conservative", "score": -2, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1350321889", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Well, now Skeleton #242 lost his job. Thanks Obama!", "gilded": 0, "created_utc": "1350327995", "subreddit": "IAmA", "score": 68, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1350356923", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "Yeah, thanks for that! My husband works with two die hard GOPers who go on and on all day long. One even blurts out a sarcastic, \"THANKS, Obama!\" while he reads the news online. I pass stuff like this on to my husband, and some of it he forwards to them. On occasion, it has shut them up for a whole day, while they frantically reseach the information an see that, sadly, YES - their candidates are lying douchbags.", "gilded": 0, "created_utc": "1350389580", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "\"I've just made a deal that will keep the Empire out of here forever.\"\n\nThanks Obama... I mean Lando.", "gilded": 0, "created_utc": "1350400669", "subreddit": "milwaukee", "score": 1, "controversiality": 0}
{"body": "I love this. Thanks, Obama. You truly are a gangster.", "gilded": 0, "created_utc": "1350412226", "subreddit": "Psychonaut", "score": 3, "controversiality": 0}
{"body": "If you commit an act of terror, are you a terrorist? Yes. Then saying \"No acts of terror will ever shake the resolve of this great nation...\" while talking about an attack that attacked this nation, you ARE talking about terrorism. I suppose it was the President's fault that he assumed you could put two and two together and figure out that he was talking about the attack as an act of terror. Thanks Obama!", "gilded": 0, "created_utc": "1350456946", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "Or America for that matter. Thanks, Obama! I'm moving to Mars.", "gilded": 0, "created_utc": "1350477968", "subreddit": "news", "score": 2, "controversiality": 0}
{"body": "Great, so colleges can increase tuition even more. Thanks Obama.", "gilded": 0, "created_utc": "1350483017", "subreddit": "politics", "score": -7, "controversiality": 0}
{"body": "In the process of doing this let's also raise interest rates for graduate students to the completely unreasonable levels of 7% for \"subsidized\" loans and 8% for \"unsubsidized\" loans and prohibit graduates from shopping around for a bank to give them a better deal when they try to consolidate after school.\n\nNothing like having $100k of graduate school loan debt at these FIXED interest rates as I try desperately to start a career. Looks like that having a family thing is going to have to wait. Thanks Obama, nailed that one.", "gilded": 0, "created_utc": "1350485103", "subreddit": "politics", "score": 6, "controversiality": 0}
{"body": "THANKS OBAMA.", "gilded": 0, "created_utc": "1350489539", "subreddit": "worldnews", "score": 29, "controversiality": 0}
{"body": "This explains the extra 1g supplemental grant that I received. Thanks Obama Administration.", "gilded": 0, "created_utc": "1350493542", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Thanks Obama....wait", "gilded": 0, "created_utc": "1350498058", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "True, I literally just received (last week) a grant \"from Obama\" because I am a female engineer.... pretty awesome I might add! Thanks Obama!", "gilded": 0, "created_utc": "1350498277", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Here's a partial history of Obama's dealings - listed (roughly) chronologically, most recent first:\n\n    U.S. Begins Talks to Extend Troop Presence in Afghanistan Beyond 2014.\n    Obama implements additional Iran sanctions.\n    Electronic monitoring by Justice Department on the rise under Obama, ACLU says.\n    At UN, Obama Falsely Claims America Sides With Democratic Change in Mid East.\n    New Stanford/NYU Study Documents the Civilian Terror from Obama's Drones. ‘Counterproductive’ drone war \"terrorizes\" civilians in Pakistan. The drone war has given rise to \"anxiety and psychological trauma among civilian communities\".\n    Obama wins right to indefinitely detain Americans under NDAA.\n    Obama administration to spend an estimated $350 billion on nuclear weapon upgrades. (But the US doesn't acknowledge its hypocrisy in sanctioning &amp; threatening Iran for pursuing nuclear energy).\n    AIPAC thanks Obama for 'steadfast support'.\n    Obama Admin Appeals Overruling of Indefinite Detention Under NDAA.\n    Rahm Emanuel: President Obama supports me against striking teachers in Chicago.\n    Obama has kept his promise to not prosecute CIA torturers, leaving them unaccountable.\n    Suspected U.S. drone strike kills civilians in Yemen, officials say.\n    Obama Gives Shell Green Light to Start Risky Arctic Drilling.\n    Obama sends 200 Marines to Guatemala to fight drug trafficking.\n    Obama authorized covert support for Syrian rebels, sources say.\n    Obama signs law increasing aid to Israel day before Romney trip to Holy Land.\n    Obama in Yemen: Killing Civilians, Bolstering Dictatorship, and Bombing in Secret.\n    Obama signs executive order giving himself control of all communication systems in America.\n    U.S. beefs up Persian Gulf forces.\n\nAnd tons more and SOURCES here: http://stpeteforpeace.org/obama.html", "gilded": 0, "created_utc": "1350507048", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Oh boo hoo.  You get the whole \"pre-existing conditions thing and insurance companies are scammers and rip off artists\" but have no sympathy for victims of the insurance companies.\n\nI work hard and my company doesn't provide adequate coverage, so I'm on my dad's, which is great (thanks, Obamacare.)  But that will end soon, so I will die, I guess.", "gilded": 0, "created_utc": "1350508568", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1350516437", "subreddit": "MensRights", "score": 1, "controversiality": 0}
{"body": "Obama screwed our economy over by doubling our debt. Plus, we have millions of more people who are relying on welfare. \"IM GOING TO FIX THE ECONOMY\". THANKS OBAMA, YOU'RE THE GREATEST.", "gilded": 0, "created_utc": "1350522325", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "yeah, thanks Obama.  And don't forget our Ambassador in Libya and the 3 Americans that tried to protect him.  Also the incessant drone killing by our stone cold killer President.  Oh, and all of the Mexicans killed by his administration's policy of giving guns to the drug cartels, hey and an American Border Patrolman was killed with these guns.  Yes, you can be quite proud of our President.  Good points all.", "gilded": 0, "created_utc": "1350525519", "subreddit": "Conservative", "score": 0, "controversiality": 0}
{"body": "Thanks, Obama :/", "gilded": 0, "created_utc": "1350583697", "subreddit": "politics", "score": 8, "controversiality": 0}
{"body": "They are afraid of policies that might force them to spend the cash or pay high taxes.  More of these companies are moving to other states or countries because of this.  They need cash to prepare for huge down times because when they lose money, they REALLY lose money.  People see a company earn a billion and think that they now should have cash to spend, but when they lose a billion everyone is like 'meh, they have money'.\n\nIf they thought our regulations were stable and our economy was bouncing back, they would loosen up their spending habits.  They have to keep this close to the chest until they figure out what the hell obama is going to do.  He keeps saying all this shit about large businesses and rich people - do you think this is the time for them to spend when obama is threatening them?  Nope.  They think he will do something to hurt them because that is what he keeps saying he will do.  He doesn't stop talking about how the rich are the real pain in this country.  Now they will sit on their cash to make sure they survive.  If their taxes dropped you would see money being spent like crazy cakes.  We got a guy running our country saying he will do this and that to large corporations - well guess what. now they don't trust their future and won't spend their money.  Thanks obama.  \n\n", "gilded": 0, "created_utc": "1350590009", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "The amount of money I contribute to my HSA tax-free is being halved. The current plan I was using will be illegal when Obamacare comes into effect and similar plans cost about 50% more. Thanks Obama, I appreciate it.", "gilded": 0, "created_utc": "1350635000", "subreddit": "Libertarian", "score": 2, "controversiality": 0}
{"body": "Only by drinking tequila can I overcome the pain of having a fucking jack-o'-lantern for a head. Thanks, Obama.", "gilded": 0, "created_utc": "1350652456", "subreddit": "funny", "score": 85, "controversiality": 0}
{"body": "I''m in college and thanks to Obamacare, I'm forced to pay $800 per semester (a $400 increase per semester) for healthcare if I'm not on my parents plan. Obamacare forced them to cover certain things, which I didn't want, and am now paying for as a broke college student. Thanks Obamacare!", "gilded": 0, "created_utc": "1350653783", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "I wish I could upvote you twice: once for \"Thanks, Obama\", and the other for your username.", "gilded": 0, "created_utc": "1350673387", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Was your appendix inflamed 4 years ago? Because if not it would have been cheaper to remove it then. Thanks obama.", "gilded": 0, "created_utc": "1350676150", "subreddit": "feminisms", "score": 6, "controversiality": 0}
{"body": "Could have left out everything before \"Thanks, Obama.\" I might have upvoted even harder.", "gilded": 0, "created_utc": "1350677640", "subreddit": "funny", "score": 0, "controversiality": 0}
{"body": "Thanks Obama for taking care of Bin Ladden. The guy who first tried failed miserably.", "gilded": 0, "created_utc": "1350680145", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "prevents a depression - nope\nends a war - nope\ndoubles the dow - gee, thanks for increasing profits for wall street\n\nso we're left with a \"saved\" auto industry because the Federal Government is sitting on billions of losses in stock purchases from the dying American auto industry, and a dead OBL.  the significance of the latter has been diminished by the Obama administration's overt and covert support for radical Salafist Islam elsewhere in the Near East.\n\nso, thanks, Obama.\n", "gilded": 0, "created_utc": "1350750548", "subreddit": "politics", "score": -7, "controversiality": 0}
{"body": "THANKS OBAMA", "gilded": 0, "created_utc": "1350756749", "subreddit": "philadelphia", "score": -9, "controversiality": 0}
{"body": "1. I've missed/been late with maybe four pills during the six years I've been taking the pill. It's really not a difficult addition to my life (as someone with a moderately routine schedule).\n\n2. Now the pill is free for me (thanks, Obama, I guess).\n\n3. I had to try several different hormone combinations before I was able to find one that didn't turn me into a monster. I'm wary of getting something inserted without knowing what effect it will have on me.\n\n4. Nervous about the small percentage of women who have a lot of trouble with it (extreme cramps, cysts, etc.).", "gilded": 0, "created_utc": "1350876866", "subreddit": "sex", "score": 3, "controversiality": 0}
{"body": "These cutbacks aren't only limited to mentioned country. Say what you want, there has been a huge cut to US military (not sure if that is public yet) and my unit is feeling it. Thanks Obama (Bring on the down votes, I couldn't care less)  I really do have sympathy for this soldier, it's a lonely feeling. Doing something and then of all existing things, it's your government that abandons you. No one should have this done to them. ", "gilded": 0, "created_utc": "1350884502", "subreddit": "worldnews", "score": 0, "controversiality": 0}
{"body": "yeah and we're 4 years closer to sharks growing wings, and attacking our fighter jets over New York City, thanks Obama for not stopping time!!", "gilded": 0, "created_utc": "1350970622", "subreddit": "PoliticalDiscussion", "score": 3, "controversiality": 0}
{"body": "We're four years closer to _Star Trek_ teleporters!  Thanks, Obama!", "gilded": 0, "created_utc": "1350975614", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!\n\n/s", "gilded": 0, "created_utc": "1351032593", "subreddit": "technology", "score": 0, "controversiality": 0}
{"body": "Your wind energy surged amazingly, too, thanks Obama and PTC, or am I thinking of the other Dakota?", "gilded": 0, "created_utc": "1351048105", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!!! :)", "gilded": 0, "created_utc": "1351057217", "subreddit": "technology", "score": -2, "controversiality": 0}
{"body": "Damnnnnnnn. Shit just got real. Thanks Obamaroid!", "gilded": 0, "created_utc": "1351098628", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1351154061", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "We used to use SVN to store our internal documentation.  (Need to know how to build report X?  Check its SVN folder.  Need to deploy a new server to production? Follow instructions in Deployment SVN folder.)  Yeah, it's not perfect, and not *technically* designed for it, but it kept revision history.  It worked well though - you always had a local copy, and working with it was as simple as choosing your favorite editor.  *As it should be*.\n\nNow we're moving more and more to Sharepoint.  You can view documents just fine.  Technically there's revision history.  But you need the right version of IE.  And the right office plugins.  And the right version of office.  And you need an active internet connection.  Sure, organization is almost a tiny bit in the vicinity of \"slightly easier to understand\" but that's by luck and holy shit not worth the pain.  \n\nTHANKS OBAMA", "gilded": 0, "created_utc": "1351189062", "subreddit": "sysadmin", "score": 20, "controversiality": 0}
{"body": "Just proof the two parties are the same.  Keeping the public confused, taking each others positions back and forth while they pretend they are different.\n\nObamacare was the huge sellout to the oligarchy.  As an insurance company, I cant imagine a bigger xmas present than requiring all citizens to purchase my private service, and the ones who cant?  Oh goody, they will get government subsidies so we get the tax payers money.  Those who wont buy it? OH extra goody, they get a tax penalty and we get the money any way!\n\nWoooo hoooo Obama, mr big corporation gave us EVERYTHING we wanted in Obamacare.\n\nBut what about price controls you say?!?!?  Oh yeah, it only gets better... there are NONE, so we get even MORE money.\n\n\" Thanks Obama!!!! \"  - the oligarchy\n", "gilded": 0, "created_utc": "1351189692", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "And thanks to Obama we get to pay for their healthcare.  Thanks Obama!", "gilded": 0, "created_utc": "1351258198", "subreddit": "science", "score": -5, "controversiality": 0}
{"body": "well, lemme think - they don't get healthcare - they get even more ill - they lose their job (if they had any - but there's, forgive the pun, slim chance) - then they get even more ill and require 24/7 nurse or other caretaker - which is most likely their family - which is then also unemployed since they have to take care of a dying fatty - etc., etc. So yeah, thanks Obama, for giving them a chance to actually pay some taxes at least once in their life.", "gilded": 0, "created_utc": "1351259411", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "Wow... Thats much worse than here... As far as I've seen at least. The company I work for has increased employment here by about 600% in the last 3 years. And our CEO told us a couple weeks ago they are going to double or triple the size of our site in the next year or so. Even going to bring jobs back from overseas to another site in America. Thanks Obama.", "gilded": 0, "created_utc": "1351264549", "subreddit": "worldnews", "score": -1, "controversiality": 0}
{"body": "Thanks Obama, we appreciate your apathy in defending our embassies. Our sodomized American ambassader was merely an inconvenience.", "gilded": 0, "created_utc": "1351266567", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "Thanks obama. ", "gilded": 0, "created_utc": "1351291582", "subreddit": "science", "score": -1, "controversiality": 0}
{"body": "yah, THANKS OBAMA!", "gilded": 0, "created_utc": "1351307095", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "All my classes on Monday are cancelled from this, including my biochem exam, thanks Obama! More time to study!", "gilded": 0, "created_utc": "1351353079", "subreddit": "ucf", "score": 3, "controversiality": 0}
{"body": "Not really. Even if they fail to steal this election, Paul Ryan will win easily in 2016, since he looks so good with his shirt off. And then executive powers of extrajudicial killing and indefinite detention will be in the hands of Ayn Rand's #1 fan. Thanks Obama.", "gilded": 0, "created_utc": "1351365270", "subreddit": "politics", "score": -1, "controversiality": 0}
{"body": "They bought their gum with the food stamps Obama gave them because they list their jobs! Thanks Obama. Buh bye!!! ", "gilded": 0, "created_utc": "1351376810", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "In my mind the surgeries were well worth it. You can't really put a price on your 5 senses, so if you can afford it, go for it. \n\nOn that note, I do not know how much it all cost. I'm still on my parents' health insurance (thanks Obamacare), so they have been able to take care of it. ", "gilded": 0, "created_utc": "1351385435", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Thanks Obama.", "gilded": 0, "created_utc": "1351389260", "subreddit": "funny", "score": -5, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1351444305", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Thanks to free collage education, my scrapbooks are the talk of the town! Thanks Obama!\n\nCollages and scrapbooking are related right? What's a collage again?", "gilded": 0, "created_utc": "1351444953", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "thanks Obama spokesperson for all the incorrect campaign talking points, its a shame you shamelessly push your party and cannot even acknowledge issues in civil liberties and human rights", "gilded": 0, "created_utc": "1351467575", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "That's pre NDAA Section 1021. Thanks Obama!", "gilded": 0, "created_utc": "1351497717", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!", "gilded": 0, "created_utc": "1351567243", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Watching the whole interview, there really wasn't anything political about it. He talks about the damage and about the response, and mentions and thanks Obama/FEMA for the help. I find it kind of funny because *we're* the ones politicizing it, not him. ", "gilded": 0, "created_utc": "1351607447", "subreddit": "politics", "score": 107, "controversiality": 0}
{"body": "In 2012 America we can't tell jokes. Thanks, Obama.\n", "gilded": 0, "created_utc": "1351660532", "subreddit": "politics", "score": -3, "controversiality": 0}
{"body": "In 2012 we have no senses of humor. Thanks, Obama.", "gilded": 0, "created_utc": "1351692344", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "thanks obama", "gilded": 0, "created_utc": "1351692908", "subreddit": "SRSRedditDrama", "score": 19, "controversiality": 0}
{"body": "When I was 43 I developed acute labrynthitis (vertigo - instant sea sickness - non stop spins).  (I'm 48 now). The underlying cause was never determined - some people are just susceptible to that I guess - could have been caused by a virus/ear infection.  While doing blood tests to check for other neurological conditions my elevated iron level was discovered.  My Dr then ordered genetic testing to confirm I am homozygous on C282Y.  My initial Fe was 980 at diagnosis.  A whole battery of tests to determine extent of organ damage was also done - seems I escaped that.  I was the first person in my family to be diagnosed.  Turns out my younger sister has it too.\n\nAt the time I was working for a big company in Seattle with good insurance so I was referred to a hematologist at a hospital who ordered weekly phlebotomies that continued for over six months.  The hematology department shared offices with oncology and hanging with all these people who were REALLY sick every week was kind of unnerving but the nurses were great about trying to make the phlebotomies as easy as possible by experimenting with smaller gauge IV catheters to minimize the scarring.  Also, when losing so much blood - the thing that is really hard to replace is folate (folic acid).  Need to take supplements during acute treatment phase.\n\nA few months after I completed primary therapy I left the big company job to start a consulting business and I was surprised to find that I was unable to purchase individual health insurance because of the diagnosis. Thus, for a couple years all medical expenses became out of pocket.  \n\nAfter discussion of this issue with my Doctor (whose office charged $200 for a phlebotomy), he told me that I could just donate blood at the blood drives because I wasn't manifesting iron overload.  It was also true that the local blood center would accept donation with a note from my doctor but further investigation showed this policy wasn't that well known among the blood center workers and once you've been identified as a HHC donor you could find yourself banned for life.  Better to never disclose it seems.\n\nI have been primarily using blood drives to manage my condition ever since.\n\nI have since moved from Seattle to SoCal and managed to acquire health insurance (thanks Obama) but I find that not a lot of doctors really \"get\" HHC.  I have to manage it on my own.  My insurance limits me to two Ferritin tests a year.  Anytime I'm not really sure of my level I just donate.  I am on the most valued donor roles in three different blood banks.\n\nIt kind of sucks having to \"go underground\" but until the US medical system wises up and implements donor programs for hemochromatosis patients, this is the best solution.  They really are behind the curve on this and you need to educate yourself and be really aggressive about managing your own health. \n\nI have since met several other folks with my condition and it is the same story.  We donate blood when we can and we keep our mouths shut.", "gilded": 0, "created_utc": "1351703134", "subreddit": "Hemochromatosis", "score": 1, "controversiality": 0}
{"body": "Let's keep this meme going!\n\nDisney's making a new Star Wars movie. Thanks, Obama.\n\nCommunity won't be back until February. Thanks, Obama.\n\n", "gilded": 0, "created_utc": "1351703997", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Louis C.K.'s SNL got postponed.  Thanks, Obama.\n\n", "gilded": 0, "created_utc": "1351704559", "subreddit": "politics", "score": 1, "controversiality": 0}
