{"body": "Thanks Obama, Bush, etc.\r\n\r\n", "gilded": 0, "created_utc": "1233780886", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Exactly.  It is the Fed's monopoly on money and their reckless (treasonous?) actions that allowed this to happen.  The more people mention subprime, derivatives, fannie/freddie, a lack of \"regulation\", etc.  the more they divert attention from the cause of the disease and focus instead on symptoms.  There are already plenty (too many) laws on the books to prevent these kinds of bubbles from popping up; what happened here is called FRAUD, there does not need to be any new regulatory agency or set of rules to prosecute those responsible.  \n\nSo thanks Obama, but try again.\n\nThat and we should abolish the fed ASAP. peace", "gilded": 0, "created_utc": "1233826297", "subreddit": "Economics", "score": 3, "controversiality": 0}
{"body": "Thanks, Obama. Your simplistic foreign-policy ways are being used to slap you and us around in front of the entire world. \"American has failed.\" \"American must apologize for its crimes.\" \"Do not repeat Bush's words of warning.\" We have emboldened a regime that funds terrorism through your guilt-complex, victim-mentality foreign policy. Oh, joy.\n", "gilded": 0, "created_utc": "1233879263", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "1 more trillion for the banks...\n\nYeah, thanks Obama. Change. Woo hoo.\n\n*waves flag*.", "gilded": 0, "created_utc": "1234147818", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "It's interesting to note how The New York Times is treating this story.  Remember that their publisher, the racist Jew Arthur Sulzburger, Jr., [tried to rip off writers](http://slash.autonomedia.org/node/272) over royalty/copyright claims.\n\nBy juxtaposing the AP photo with the artist's rendering, they are clearly siding with the dicks (note spelling) at AP, which shouldn't surprise anyone.\n\nThe paper only survives thanks to massive infusions of drug money I think.\n\n[you are trying to submit too fast. try again in 3 minutes.]\n\nThanks Obama subreddit!  Change I can believe in for sure!  LOL", "gilded": 0, "created_utc": "1234294311", "subreddit": "obama", "score": -5, "controversiality": 0}
{"body": "awesome. now old people get to complain about not using the internet to get coupons for another 4 months. and my tv shows get this wonderful scrolling message at the bottom of my screen about how the change to digital is moving.\n\nthanks obama.\noh and thanks for pre-empting Chuck on monday.\njk.", "gilded": 0, "created_utc": "1234423065", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Thanks Obama!!\n\nGreat job on the \"Stumu-ass Package\"!!\n\nLooking forward to Bharf II!!\n\nWoo Hoo.\n\nYeah Obama economic team!!!!!", "gilded": 0, "created_utc": "1235432371", "subreddit": "Economics", "score": -6, "controversiality": 0}
{"body": "Majority of troops out by Sep 2010. Thanks Obama for attempting to find a responsible end to a terrible idea. ", "gilded": 0, "created_utc": "1235567799", "subreddit": "Economics", "score": -4, "controversiality": 0}
{"body": "This legislation didn't work the first time and won't work now either. Thanks Obama for making gun store owners able to wipe their asses with hundred dollar bills the last three months.", "gilded": 0, "created_utc": "1235672679", "subreddit": "politics", "score": 12, "controversiality": 0}
