{"body": "I really havent had much trouble healing with it. Given some decently intelligent group members that know their roles (no pun intended), I have no issues. Power management isnt too bad but I do have to be mindful of it without a tank. Unless I'm up against a cr88/89 healer, I can usually keep up on heals. I've found electric healing a pretty nice class to heal with. I like the safety nets and burst healing. I've found that if you use a little planning and strategy, it's pretty easy to heal with. I've tried nature and sorcery and just can't get in to them. *shrug*", "gilded": 0, "created_utc": "1364989748", "subreddit": "dcuonline", "score": 1, "controversiality": 0}
{"body": "Personally, I would go with a few Judge Dredds. No superpowers, but... man, let's just say you'd want 'em on your side. Beyond that, I'd want the Expendables and the Inglorious Basterds. They know how to fight as a team, they can cooperate, and they're accustomed to killing. Tell the Basterds that the Vietnamese are Japanese, and they'd go to town.\n\nBeyond that, I wouldn't mind having a few [Kasrkins](http://i245.photobucket.com/albums/gg53/flameman6000/Kasrkin.jpg), [Ogryn](http://3.bp.blogspot.com/-qgUFCd28er8/TgIIZBETT4I/AAAAAAAAAHk/ojlyQVJ130s/s1600/Ogryn.jpg), and [Catachans](http://3.bp.blogspot.com/_wRZ1N9p2Fyg/TMcJj3fKtII/AAAAAAAAAP4/t88z4FHLL_4/s1600/pmoss-40k-catachan-ork-self-promo(2).jpg) at my back. They're all basically \"super guardsmen\", which means that they're accustomed to marching into certain death. A few [Death Korpsmen](http://images3.wikia.nocookie.net/__cb20130208191048/warhammer40k/images/8/88/Death_Korps_of_Krieg_Medic.jpg) would be handy too, because they have no fear of death and could use poison gas to clear floors.\n\nFinally, Rambo. And \"Dutch\" from Predator. Why? Because. Also, the entire squad of Colonial Marines from Aliens. That would round out my force quite nicely.", "gilded": 0, "created_utc": "1367302283", "subreddit": "whowouldwin", "score": 1, "controversiality": 0}
