{"body": "[Me Ole Bamboo](http://www.youtube.com/watch?v=bQgXccbxHbM)", "gilded": 0, "created_utc": "1299274593", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "[cool too](http://www.youtube.com/watch?v=8CL2hetqpfg)", "gilded": 0, "created_utc": "1299376239", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "The clone (with a bit of the patch) tool [worked pretty ok too](http://imgur.com/d8Cf3).  EDIT: [No line connecting noses](http://imgur.com/iqlMy) :D", "gilded": 0, "created_utc": "1299497012", "subreddit": "photoshop", "score": 2, "controversiality": 0}
{"body": "Get her a [whole zoo](http://i.imgur.com/bnbjT.png).", "gilded": 0, "created_utc": "1299643992", "subreddit": "linux", "score": 1, "controversiality": 0}
{"body": "Don't discount the walking tours because you are afraid of the weather.  Play it by ear and see how it is once you arrive.  The CAF office is right in the loop (check the website), you can decide that day if it's nice enough to go.\n\nThe zoo you are thinking of is Lincoln Park Zoo and it is open everyday and it is free:  [Lincoln Park Zoo](http://www.lpzoo.org/).  Easy bus ride up Michigan Ave from the loop.\n\nAlso check out the [Wicker Park/Bucktown neighborhood](http://www.chicagotraveler.com/neighborhoods/wicker-park-bucktown-feature.htm) for funky shops, bars and restaurants.  To get there you hop on the [Blue Line](http://www.transitchicago.com/riding_cta/systemguide/blueline.aspxin) in the loop and take it to the Damen stop.\n\nYou already mentioned the Skydeck at the Willis Tower.  Also check out the John Hancock - the views of the city are particularly spectacular at night. PROTIP: At night, you can head up to the [Signature Lounge bar]( http://www.signatureroom.com/) on the 96th floor and not pay the entrance fee to the observation deck.  Tell your g/f that the best views of the city at night are from the ladies room. Not kidding.\n", "gilded": 0, "created_utc": "1299870136", "subreddit": "travel", "score": 2, "controversiality": 0}
{"body": "[me and my sister ahtna, she's a redditor too](http://i.imgur.com/amvQ6.jpg) see ya at zeno's!", "gilded": 0, "created_utc": "1299888288", "subreddit": "Columbus", "score": 5, "controversiality": 0}
{"body": "[They see me rollin too](http://www.youtube.com/watch?v=bfCDuPMfp_Y)", "gilded": 0, "created_utc": "1300125472", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Hey Fred, this guy beat you to the punch by less then a minute!!!\n\n[Trolololololoo](http://www.reddit.com/r/politics/comments/g3vle/amid_furor_over_cutting_state_pensions_congress/)", "gilded": 0, "created_utc": "1300132339", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "&gt; because she did it under the pretense of being absolutely serious, and people believed her as seen by the response she got. That's trolling. Satire is like Colbert, where no one in their right mind would think he's really articulating his personal views.\n\nPeople believe [Colbert is serious, too](http://news.cnet.com/8301-17852_3-10232295-71.html). They believe Edward Current is serious. The Huffington Post was fooled by [ChristWire](http://www.theatlanticwire.com/entertainment/2010/08/satirical-christian-site-hoodwinks-the-huffington-post/23306/). So on and so forth.\n\nIf the difference is whether or not people are fooled, then your \"very large difference\" is in fact nothing more than the degree of subtlety employed.\n\nI personally liked her posts *because* they were subtle. It made it creepier, and I prefer cynical satire over goofy satire.", "gilded": 0, "created_utc": "1300183187", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "I first parsed your sentence as \"she has [boobs with a keyhole tattoo] [over her eye]\".  Now that's how I'll be imagining the graphic novel.", "gilded": 0, "created_utc": "1300224776", "subreddit": "books", "score": 3, "controversiality": 0}
{"body": "About an hour ago I dreamt of posting on a web site. Strange dreaming myself as human. Much more interesting to be a [Hooloovoo](http://en.wikipedia.org/wiki/List_of_races_and_species_in_The_Hitchhiker's_Guide_to_the_Galaxy#Hooloovoo).  Still, very exciting. One heart though, very dangerous.", "gilded": 0, "created_utc": "1300294264", "subreddit": "doctorwho", "score": 3, "controversiality": 0}
{"body": "Yay, I made a [colcannon recipe too](http://www.reddit.com/r/recipes/comments/g5ten/st_paddys_day_sausages_and_colcannon/)!", "gilded": 0, "created_utc": "1300370281", "subreddit": "recipes", "score": 1, "controversiality": 0}
{"body": "Originally they were vessels to hold both warm water and your shaving soap before running hot water was common. They typically had a soap holder above a lower container for the hot water, which had a wide mouth to allow dipping the brush into the water. Here's an example of [an old style one](http://www.memoriesebay.com/pictures/Olga/MUGS_WITH_CHIPS-OCT.2010_081.jpg).\n\nModern scuttles are mostly about keeping the lather warm and less about carrying warm water back to your room to use while shaving. I use a [Dirty Bird scuttle](http://www.dirtybirdpottery.com/shavinggear.html) (the 1.5 model down on the right side of the page) but there are [other folks making them, too](http://wiki.badgerandblade.com/index.php/Scuttle).", "gilded": 0, "created_utc": "1300485357", "subreddit": "wicked_edge", "score": 2, "controversiality": 0}
{"body": "[Fez's are cool too](http://images2.memegenerator.net/ImageMacro/5065299/UMAD-Fezs-Are-cool.jpg?imageSize=Medium&amp;generatorName=I-wear-an-X-now-X-are-cool)", "gilded": 0, "created_utc": "1300591122", "subreddit": "doctorwho", "score": 2, "controversiality": 0}
{"body": "Shall we start running hash algorithms on rendered text/HTML with a certain level of \"fuzziness\" to \"verify\" content like we do files? On top of that, why not throw in sub-link parsers, so if a known blogging platform links to a \"Grade 1\" link (e.g. news outlets, 4chan, etc) it tags it as such -- assuming the Higher Grade link has already been uploaded to Reddit.\n\nReally, if they hashed and tried to make unique entries for the content, it would make it a lot easier than getting the same video posted 35 times on 10 different subreddits (if not more). You can just virtually attach a different discussion board for every \"re-post\", but the original link has its own GUID (e.g. reddit.com/link/TK429). This way, once it a post is made *once* it is assigned a GUID. if somebody were to try to post it to /r/pony but it was already in /r/cute, then /r/pony would get a virtual link added to the subreddit -- reddic.tom/TK429/r/pony/discussion which. Aside from adding \"DRM\" to the content and attempting to preserve some level of freshness, it would help people find new subreddits. Perhaps, somebody who browses /r/pony quite often doesn't know about /r/cute, but they notice this link they really nice is \"Also in these subreddits:\". I'm sure, if anything, the porn-reedits would propagate. \n\nSure, mechanisms exist to attempt authenticate via the search engine, but most people have proven themselves either too inept (or more likely uncaring) to utilize it. This methodology allows people to re-post all they want in as many sub-reddits as they want. If a link with that GUID already has a discussion board attached to that particular sub-reddit, then it goes [NOOOO](http://www.youtube.com/results?search_type=&amp;search_query=vader%20no).", "gilded": 0, "created_utc": "1300652723", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "[A site somebody I know made, which I find pretty useful. I believe he's a redditor too](http://rooster.am)\n\n[A compilation of stand up comedy clips that I put together. Yes, it is a shameless plug, but check it out before downvoting. It'll get updated periodically, so keep checking.](http://www.shortform.com/serfis)\n\n[I like her art, though she only uploads her older and simpler stuff on here](http://animechi.deviantart.com)", "gilded": 0, "created_utc": "1300769358", "subreddit": "AskReddit", "score": -6, "controversiality": 0}
{"body": "Mark \"Inker\" Marshall at [Old Harbour City Tattoo](http://www.oldharbourcitytattoo.com) is very, very good. ", "gilded": 0, "created_utc": "1300809801", "subreddit": "halifax", "score": 3, "controversiality": 0}
{"body": "Just a helpful tip, try adding some fish to your diet.\n\nYou can get low sodium varieties of sardines for really cheap, and they're safe to eat daily because of the really low levels of mercury.\n\nThey're loaded with helpful stuff both for general health and weight loss. Also, I think they're delicious but I guess I'm not everyone heh. Good luck!\n\n[Here's a link to a big pack of sardines for decently cheap](http://www.amazon.com/Roland-Plain-Sardines-Sodium-4-375-Ounce/dp/B001IZEJB2)\n\n[Here's one showing how low in mercury they are](http://www.fda.gov/food/foodsafety/product-specificinformation/seafood/foodbornepathogenscontaminants/methylmercury/ucm115644.htm)\n\n[Here's a nutritional profile on a regular sodium variety, notice how high they are in protein, omega 3 fatty acids, vitamin b12, they're a decent source of vitamin d, and other goodies like choline too](http://www.whfoods.com/genpage.php?tname=nutrientprofile&amp;dbid=174)\n\n[Here's a study showing fish is good for you](http://www.sciencedirect.com/science?_ob=ArticleURL&amp;_udi=B6WPT-49V3GJ1-1&amp;_user=10&amp;_coverDate=12%2F31%2F2003&amp;_rdoc=1&amp;_fmt=high&amp;_orig=gateway&amp;_origin=gateway&amp;_sort=d&amp;_docanchor=&amp;view=c&amp;_acct=C000050221&amp;_version=1&amp;_urlVersion=0&amp;_userid=10&amp;md5=a3000f3689a6f39af632e9564448bf07&amp;searchtype=a)", "gilded": 0, "created_utc": "1301026033", "subreddit": "Fitness", "score": 2, "controversiality": 0}
{"body": "[Check out Lennon's new solo project too](http://www.youtube.com/watch?v=bUq3oc0lYbw)", "gilded": 0, "created_utc": "1301027149", "subreddit": "Music", "score": 3, "controversiality": 0}
{"body": "My family has an annual tradition of taking a trip up to Wisconsin State Fair, and I have to say, you can totally tell the difference between honeys that come from different flowers. They're markedly [different in color and in flavor too](http://en.wikipedia.org/wiki/File:Texas_State_Fair_honey.jpg); some are really floral while others are fruity or taste like citrus.", "gilded": 0, "created_utc": "1301186859", "subreddit": "til", "score": 1, "controversiality": 0}
{"body": "Hi there [cliffor](http://www.reddit.com/user/Cliffor), or whatever you choose to call yourself.\n\nNice to see you trolling here [too](http://www.reddit.com/r/MensRights/comments/gbu1j/looks_like_pretending_to_be_a_crazy_misogynist/).", "gilded": 0, "created_utc": "1301270443", "subreddit": "MensRights", "score": 0, "controversiality": 0}
{"body": "How set are you on navy? [Union](http://www.unionmadegoods.com/Universal_Works_Fell_Jacket_in_Red_1331.html) [made](http://www.unionmadegoods.com/Garbstore_SF_Parka_in_Tan_1438.html) [has](http://www.unionmadegoods.com/Levi_s_Vintage_Clothing_Parka_Pullover_in_Indigo_1365.html) [a few](http://www.unionmadegoods.com/Woolrich_John_Rich_&amp;_Bros._Uphill_Jacket_in_Sky_Grey_814.html) in [red](http://www.unionmadegoods.com/NIGEL_CABOURN_Nigel_Cabourn_Surface_Jacket_in_Orange_815.html) among others and a [lighter blue](http://www.unionmadegoods.com/NIGEL_CABOURN_Nigel_Cabourn_Aircraft_Jacket_in_Blue_816.html). Context has [a black apolis](http://www.contextclothing.com/item.php?id=1807), [an olive BoO](http://www.contextclothing.com/item.php?id=2048), and [a slate blue](http://www.contextclothing.com/item.php?id=2041). Closest I could find to the one you posted (second one is BoO, right?) is [this one by garbstore](http://www.couvertureandthegarbstore.com/Product/?p=3390&amp;i=3421) if you don't mind the strings.", "gilded": 0, "created_utc": "1301446533", "subreddit": "malefashionadvice", "score": 1, "controversiality": 0}
{"body": "Your attachment to your fantasies about the conflict are what perpetuate it.  You blatantly ignore the reality I present to you and hold on to your melodramatic vision of what you've gleaned from newspapers.\n\n&gt;Sure, every human rights violation is \"unusual\" or an exception\n\nNo.  When even the article explicitly states \"unusual\" or \"strange\", that's a sign that it is indeed unusual or strange.  How is this basic logic lost on you?\n\n&gt; A law passed in 2003 prevents Palestinians who marry Israelis from obtaining residency, a right granted to all other nationalities\n\nThis was as a response to the thousands of Israeli Arabs (who are full and equal citizens, duh!) who marry Palestinians in order to gain citizenship.  Surely even you can see the problem with the en masse immigration of a political entity that has self-declared as an enemy of the state.\n\n&gt; Gaza is a giant prison and the West Bank is walled in. How could you call that apartheid?\n\n[Luxury hotels don't exist in \"prisons'](http://www.grandpalace.ps/).  [Luxury malls either](http://www.alresalahtalk.net/vb/showthread.php?t=3636)\n\n&gt; Armed soldiers guard Jewish-only roads connecting illegal settlements.\n\nThey used to be for all, but the restrictions on Palestinians came as a response to terrorism.  Reversing cause and effect is a favourite tactic with your crowd.\n\n&gt;There is no occupation of \"Judea and Samaria\". \n\nThey're building homes, we must slaughter them!\n\n&gt;Palestinian homes in East Jerusalem are constantly being demolished.\n\n\"constantly\"?  now you're just making things up.  By the way, [they demolish Jewish homes too](http://www.ynetnews.com/articles/0,7340,L-3615679,00.html).  The question is not who owns the house - it is whether it meets building codes and has the proper permits.  A pretty standard process in any democratic first-world country.  Come on.  Are you really this obtuse?\n\n&gt;But this is not ethnic cleansing.\n\n[No, *this* is ethnic cleansing](http://en.wikipedia.org/wiki/Israel's_unilateral_disengagement_plan)\n\n&gt;Cluster bombs and white phosphorus are dropped on Arab civilians. Israel does not commit war crimes.\n\nThe UN has yet to bring any Israeli to trial for war crimes.  Full stop.\n\n&gt;All of this is ok. Palestinians are sub-human, and Arab blood is cheap. As one of the foremost Israeli rabbis, Ovadia Yosef, said \"Goyim were born only to serve us. Without that, they have no place in the world.\n\n[True ignorance](http://en.wikipedia.org/wiki/Ovadia_Yosef#Position_on_the_Israeli-Palestinian_conflict)\n\n&gt;But the rest of us won't to turn a blind eye forever. The world will not sit here and wait while you try to enact some perverted apocalyptic fantasy. Your attitude will turn Israel into a pariah state, and in the end, justice for the Palestinians will be achieved\n\nTruly sad that your Manichean fantasy of evil Israelis and poor innocent helpless Palestinians is what informs your positions.  Here's an idea: let the two parties work out their differences.  Israel has traded the Sinai for peace successfully before.  It's record on signed peace agreements is impeccable (see Jordan; Egypt).  What have the Palestinian leaders done besides get evicted from Tunisia, Lebanon, Jordan, and Egypt?", "gilded": 0, "created_utc": "1301487067", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "[solid shampoo](http://www.lushusa.com/shop/products/haircare/solid-shampoos/)", "gilded": 0, "created_utc": "1301611292", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
