{"body": "[I lol'd too](http://i.imgur.com/tGlJU.jpg)", "gilded": 0, "created_utc": "1296661222", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Except that quantum mechanics, for example, is basically the opposite of common sense.\n\nScientists will go wherever the evidence leads them, no matter how absurd it seems. [This happened with evolution, too](http://en.wikipedia.org/wiki/Fallacy_of_quoting_out_of_context#.22Absurd_in_the_highest_degree.22).", "gilded": 0, "created_utc": "1296666964", "subreddit": "pics", "score": 9, "controversiality": 0}
{"body": "The Egyptian situation looks to me to be very similar to the (1987) June Democracy movement in South Korea. \n\nThe democratically elected [Park Chunghee](http://en.wikipedia.org/wiki/Park_Chung-hee) (President 1963-1979), became a \"president for life\", ostensibly by using the threat posed by North Korea to invoke emergency powers, preventing the direct election of a president. Eventually he was assassinated by his head of intelligence. There was a brief interim before one of his generals, [Chun Doo-Hwan](http://en.wikipedia.org/wiki/Chun_Doo-hwan) launched a coup and took the reins from 1980-1988. When Chun tried to hand off his presidency to his high-school friend and military colleague [Noh Tae-Woo](http://en.wikipedia.org/wiki/Roh_Tae-woo), massive protests developed, some upwards of 1.5 million people. This was particularly impressive because Chun Doo-Hwan had been known for brutally putting down a popular democratic uprising, AKA the Gwanju Massacre in 1980, during his rise to power.\n\nHowever, due to the size and scale of the June Democracy movement in 1987, reforms were implemented that allowed for the direct election of the next president that October.\n\nHowever, since the two major left wing candidates would not unit they split the vote, allowing Noh Tae-Woo to win the presidency. However with the reforms implemented the there have been direct fair elections ever since, and the two left wing candidates, [Kim Young-sam](http://en.wikipedia.org/wiki/Kim_Young-sam) and [Kim Dae-Jung](http://en.wikipedia.org/wiki/Kim_Dae-jung) each served as president subsequently.\n\nYou can read about the June Democracy movement [here](http://en.wikipedia.org/wiki/June_Democracy_Movement), but its a rough read, it's a bit slanted (pardon the pun) parts of it are not translated, and the rest appears auto-translated from the Korean article. I'd edit it myself but I'm not a good enough writer.\n\n**EDIT:** Oh! I forgot to draw parallels between SK and Egypt. Both Dictatorships were supported by the US. Thn one in South Korea under the specter of holding back Communism (the 1980 Gwanju Massacre was justified as putting down a communist uprising), and Egypt under the specter of holding back radical Islam. It is important to note that *South Korea did not turn communist upon the election of the liberal Kim Young-sam*, despite the fact that there was a very strong and organized left wing movement in the country at the time. It should be easy to see the parallels in rhetoric between equating leftist political parties at home with communists on your border and a moderate Muslim \"brotherhood\" at home with Jihadism throughout the region.\n\nAfter the transition in South Korea, they remained an ally to the United States, the relationship was rocky at times, especially because of the sunshine policy they instituted against North Korea, but the alliance prevailed.", "gilded": 0, "created_utc": "1296733251", "subreddit": "history", "score": 1, "controversiality": 0}
{"body": "The [old zoo](http://www.yelp.com/biz/the-old-zoo-griffith-park-los-angeles-2) is worth checking out while you're there.", "gilded": 0, "created_utc": "1296866574", "subreddit": "LosAngeles", "score": 1, "controversiality": 0}
{"body": "[And it's what some parts of reddit look like today too](http://www.reddit.com/r/nfl/)\n\nStop feeling superior to the rest of the internet for lurking a website that elected r/fffffffuuuuuuuuuuuu as the best big community of 2010", "gilded": 0, "created_utc": "1297025847", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "You do understand that anyone who posts \"ZOMG TEH SUBMISSIONS ON REDDIT ARE SO BAD!!!!11\" is naturally going to have their own submission history combed through in search of hypocrisy?\n\nIn your case, [it](http://www.reddit.com/r/pics/comments/fayho/not_sure_if_im_doing_this_right/) [was](http://www.reddit.com/r/pics/comments/ek30s/how_does_this_make_you_feel_reddit/) [too](http://www.reddit.com/r/pics/comments/d4aa0/yo_dawg_i_heard_you_like_taking_out_the_trash/) [easy](http://www.reddit.com/r/pics/comments/dviwj/my_roommates_pets_dick_is_the_sun/).\n\n**TL;DR**: 100% of your submissions are stupid pictures.", "gilded": 0, "created_utc": "1297204078", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "[Ferrari 1950-2009](http://i.imgur.com/l3khS.jpg)\n\n[And this is pretty cool too](http://i.imgur.com/aqIfP.jpg)\n\nBoth are from a Spanish newspaper. Cant remember which one.", "gilded": 0, "created_utc": "1297276963", "subreddit": "formula1", "score": 7, "controversiality": 0}
{"body": "He strongly supported the [crappifications of schools too](http://elomdus.blogspot.com/2008/06/einstein-vs-edison-victory-for-iyun.html), learn 150 useless facts because that will help you in life!", "gilded": 0, "created_utc": "1297293396", "subreddit": "wikipedia", "score": 8, "controversiality": 0}
{"body": "On [Reddit West Coast TOO](/r/westoo) we have a plugin that allows you to bind whatever key you want to be Team-Only Voicechat. Alltalk is the default voice key because we like to have fun and talk to each other, but believe me when I say that our server is *very* team-oriented and competitive. \n\nGive us a try, if you live anywhere near the West coast (and even if you don't, it'll still be playable -- we have regulars playing from Chicago and even the East coast of Canada) and check the link in the sidebar entitled \"How to set up Team Talk\" if you want to do that.\n\nI hope to see you around, sir! I'm Cygnus ingame, just say hey if you see me.", "gilded": 0, "created_utc": "1297452123", "subreddit": "tf2", "score": 2, "controversiality": 0}
{"body": "On [Reddit West Coast TOO](/r/westoo) we have a plugin that allows you to bind whatever key you want to be Team-Only Voicechat. Alltalk is the default voice key because we like to have fun and talk to each other, but believe me when I say that our server is *very* team-oriented and competitive. \n\nGive us a try, if you live anywhere near the West coast (and even if you don't, it'll still be playable -- we have regulars playing from Chicago and even the East coast of Canada) and check the link in the sidebar entitled \"How to set up Team Talk\" if you want to do that.\n\nI hope to see you around, sir! I'm Cygnus ingame, just say hey if you see me.", "gilded": 0, "created_utc": "1297480562", "subreddit": "tf2", "score": 1, "controversiality": 0}
{"body": "Pol @ [Pol Tattoo](http://pol-tattoo.com/) or Safwan @ [Imago Tattoo](http://www.imagotattoo.com/)\n\nAmazing artists with a respect for tattoo tradition and east-asian art.", "gilded": 0, "created_utc": "1297484580", "subreddit": "montreal", "score": 3, "controversiality": 0}
{"body": "Of relativity, FTL, and causality you can only pick two. [This page explains it.](http://www.theculture.org/rich/sharpblue/archives/000089.html\"not that I understand much of it\") \n\nIt seems for the sci-fi style FTL travel we see on TV to exist, relativity would have to have serious flaws. An astronomer named Tom Van Flandern claimed that the guys running the GPS system  *\"have basically blown off Einstein\"* in making their calculations. That seems to be a glimmer of hope, at least to me.\n\nHere's the [original article](http://ldolphin.org/vanFlandern/\"scroll down for the American Spectator article\") reporting his claim and [here's an article with a more critical tone](http://www.salon.com/people/feature/2000/07/06/einstein/print.html) towards him.\n\nI think there's a few more things worth noting though. \n\nThe first is that, even though FTL travel has problems with causality violations (under relativity) [apparently black holes do too](http://www.reddit.com/r/science/comments/f78wo/would_a_black_hole_be_able_to_suck_in_another/c1dtbzh?context=1). So there's a problem somewhere. Either causality doesn't work the way we think it does or there's an error in modern physics somewhere. If there is an error then maybe discounting FTL is an error too. If causality violations are possible then FTL ought to be no problem ([though I'm not sure I want to live in a Universe with messy causality violations](http://www.comedycentral.com/videos/index.jhtml?title=grandma-paradox&amp;videoId=166476)).\n\nThe second is things is that **even if** FTL and antigravity are impossible the Extraterrestrial Hypothesis may still be a valid explanation for UFOs. If flying saucers are [Von Neumann probes](http://en.wikipedia.org/wiki/Self-replicating_spacecraft) then they could spread across the galaxy by [landing on moons](http://www.youtube.com/watch?v=GPKg2c_bRCs) and replicating; a lot like [the way a virus spreads](http://www.youtube.com/watch?v=QkK0JFs5r3g#t=3m31s) across an animal's body. If you're wondering how UFOs could do all their fantastic maneuvers without using any new physics principals [this guy](http://www.youtube.com/watch?v=DlU4hxAMFE4\"How to Produce an Apparently Reactionless Drive without Violating Newton's Third Law-- 1 of 3\") has a possibility.\n\nLastly UFOs may be \"weird life\", like creatures made of [self organized plasmas](http://www.unexplained-mysteries.com/column.php?id=111062). We assume that if aliens showed up they'd (1) be in space ships, (2) have flesh and blood bodies, and (3) be from distant places. Perhaps all those assumptions are wrong. They may be so exotic they don't need ships, aren't made of liquids and solids, and live near by.", "gilded": 0, "created_utc": "1297511554", "subreddit": "UFOs", "score": 3, "controversiality": 0}
{"body": "I like to think he's being blown backward, but [trolling physics works too](http://i.imgur.com/4Obmo.gif).", "gilded": 0, "created_utc": "1297720446", "subreddit": "fffffffuuuuuuuuuuuu", "score": 50, "controversiality": 0}
{"body": "sorry that I don't have a more reputable source; I thought I read it on antiwar.com. [was on reddit, too](http://www.reddit.com/r/politics/comments/8laeu/the_reverse_nuremberg_defense_bush_administration/)", "gilded": 0, "created_utc": "1297877023", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "[Reddit West](/r/tf2west) and [Reddit West TOO](/r/westtoo) are two very different servers. \n\nTry out West TOO sometime, man. You will not at all be disappointed by the extreme amount of teamwork, competition, fun times, and charity.\n\nI'm Cygnus, and I think I remember playing with you on the original West server. I mainly play on TOO now, say hey if you see me.", "gilded": 0, "created_utc": "1297884099", "subreddit": "tf2", "score": 4, "controversiality": 0}
{"body": "Sure, I can and would love to be more specific.  I'll first post photos of my current tattoos to give you an idea of who I am and what I've done.  \n\nfirst of all, [this is me](http://i.imgur.com/gvHIS.jpg).  I built that monster cabinet thingy.\n\n[this is my arm tattoo](http://i.imgur.com/gcaLl.jpg), the most recent.  I got it when I was sick, and had to make a choice to get better or give up.  I chose to dedicate myself to being a good man and doing good not just for other people, but to my body so that I could survive to achieve the things I want and change to world in ways I'd like.  The top one says, essentially, \"above all else, do no harm\", in latin, and the other seven are \"wisdom, respect, love, bravery, honesty, humility, truth\" in my tribes language, ojibwe.  It faces me to remind me each day. [here's an alternate shot with the spellings to the side](http://imgur.com/RTTg6).  I got this tattoo when I was in my mid to late 20s.\n\n[this tattoo](http://pegothejerk.imgur.com/all/) is a nod to my native roots, a war horse handprint.  I was taught that ones print should go on a horse facing down, to represent the creator giving you a gift that would see you through war.  I turned mine facing up to represent my willingness and desire to give myself to the creator, to help the world around me in the best ways I knew how for the betterment of creation.  The circles represent the complexity of my beliefs and of reality - molecules, stones, quarks, gluons, multiverse bubbles, separate lives, etc.  I got this tattoo in my early to mid twenties when I decided to stop being selfish and learn to do for others and help to make the world beautiful.\n\nand finally, I got [my first tattoo, a tribal band](http://imgur.com/J91Io) that I designed, when I was 18 as a kind of identity marker, to express who I was both artistically and as a real human.  It says Pego in binary code, with separators that are a design that can be traced back to my tribe, and containers that are a north american native rock carving representing water containers - essentially two buckets and a stick.  This indicates roughly the season I was born in, being this season now, actually.\n\nI want this new tattoo either on the other forearm, opposite the list tattoo, or large covering my shoulder opposite the hand tattoo.  It depends on the design, I have been assuming.\n\nI am half native, half scots-irish.  I like both the native style of tattoo, as is obvious by my current designs, but I also like the tradition sailor style, and the new more free artistic style that seems to be emerging, so I'm open to anything.  I am an artist, afterall, just not a tattoo artist.  heh.  I love the idea of the drill looking sortof like an old sci fi ray gun in coloring and style, so that might be what I've been picturing most in my head - bright, almost pop-art, but stylized and cartoonish.    I picture a few other objects, maybe just one other, but something that indicates the woodworking.  a saw?  a saw and a screw driver?   a screw?  I like the idea of it being tight, almost like a seal or coat of arms, but not realistic like those are.  I can show you styles I like, but that may or may not apply.  [this tree is very dark but cartoonish, I like that](http://choicetattoo.gnux.us/wp-content/uploads/2010/12/Sexy-stomuchTattoo.jpg), I love quarter/half sleeve types [like this one](http://zhippo.com/colorboxtattoohosted/images/news/Tattoo%27s/pigs.jpg) and must at one point incorporate one of my Boo Science monsters, perhaps now - I love tattoos that use bright color and technique to look \"clean\" and vibrant, [like this back tattoo](http://www.tattooclimax.com/images/feminine-tattoo-amazing-color-waves-18072009.jpg) - I do love that japanese style derived from woodblock cuts just as much as I love the sci fi and sailor pop look.I'd definitely wrap a bit [like this](http://3.bp.blogspot.com/_bQ0SqifjNcg/TC5CnP2aQeI/AAAAAAAAXRQ/HVSkCfCSf54/s400/shoulder-tattoo-4.jpg) if it was a big piece.  I like this [old school bike tattoo](http://i32.photobucket.com/albums/d19/katekeen/l_fd45eb1b9a1451a7b2e00d04aef9253a.jpg) because of it's design, shape, feel, and I like [ray gun tattoo](http://farm4.static.flickr.com/3200/2760051766_ea08a4c102_z.jpg) because they are hilarious, cool, and have some deeper meaning (if you like sci fi books, collectables, whatever).  \n\nIf you'd like to see my monster work, my imgur album is [over here](http://pegothejerk.imgur.com/reddit_wood_creations#7l5vU).  My favorite is the red guy pictured with me in the very first picture I posted.\n\nI've got to get to some painting, but if you have more questions, I'll gladly answer them when I get back inside.\n\nAnd thank you for even considering this.  I am grateful for your even glancing at this request, but even more thankful now that I know it's being looked upon differently thanks to grandpa orval and the meaning.", "gilded": 0, "created_utc": "1297885996", "subreddit": "Favors", "score": 2, "controversiality": 0}
{"body": "[I heart @fakedriscoll too](http://twitter.com/#!/fakedriscoll)\n\nOther people you should be following:\n\n@xianity\n@fakespurgeon\n\nand any of the 15 or so fake Derek Webb accounts.", "gilded": 0, "created_utc": "1297913730", "subreddit": "Christianity", "score": 2, "controversiality": 0}
{"body": "In honor of Roo itself, I have good ol' [Ripper Roo](http://i.imgur.com/wiBux.jpg)", "gilded": 0, "created_utc": "1298000774", "subreddit": "LGBTrees", "score": 1, "controversiality": 0}
{"body": "[Sounds more like wololoooo](http://www.youtube.com/watch?v=3tBqdKGiqnI) to me.", "gilded": 0, "created_utc": "1298258609", "subreddit": "fffffffuuuuuuuuuuuu", "score": 1, "controversiality": 0}
{"body": "[you could just search drugs on reddit too](http://www.reddit.com/r/Drugs/)", "gilded": 0, "created_utc": "1298335118", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "Oliver is too cute! I have a god-dog-hter (yes, I'm the godmother to a dog, and it's awesome. U jelly? lol). Her name is [Boo](http://imgur.com/ALhZp). AKA Boofus and Boo-berry. Enjoy the snuffles and kraken noises!\n\nP.S. Hope it's not too creepy, but I am envious of your awesome camera skillz. And your fancy dress friends seem keen. Tell the henchmen I said 'what's up?' Looks like you have bitchin' parties. Anyway, Bully love!", "gilded": 0, "created_utc": "1298353840", "subreddit": "aww", "score": 1, "controversiality": 0}
{"body": "watching this really makes me miss [Ryan Stiles](http://www.youtube.com/watch?v=9DcZ8R_H5pM). [Colin too](http://www.youtube.com/watch?v=OkwrVqTuY6A)", "gilded": 0, "created_utc": "1298671970", "subreddit": "videos", "score": 4, "controversiality": 0}
{"body": "Wait, so [RED] is the reddit guild?\n\nAlso, could you elaborate on the politics of [MOO] and [TL]? I have been given the impression that [MOO] seems to lean towards player killing.", "gilded": 0, "created_utc": "1298808379", "subreddit": "IPY", "score": 1, "controversiality": 0}
{"body": "[Security forces have used this to control crowds, too](http://www.newscientist.com/article/dn9158-hooligan-chants-silenced-by-delayed-echoes.html).", "gilded": 0, "created_utc": "1298835487", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "OP probably meant to post the [Holden Maloo](http://en.wikipedia.org/wiki/HSV_Maloo), I think the engine is the same one they put in a corvette...", "gilded": 0, "created_utc": "1298860464", "subreddit": "Autos", "score": 1, "controversiality": 0}
{"body": "Yeh I live in the Suburb [Wooloomooloo](http://maps.google.com.au/maps?q=woolloomooloo&amp;ie=UTF8&amp;hq=&amp;hnear=Woolloomooloo+New+South+Wales&amp;gl=au&amp;z=14)...\n\nwhich is pretty central I guess you mean suburbs like way out of town right?", "gilded": 0, "created_utc": "1298869777", "subreddit": "vancouver", "score": 1, "controversiality": 0}
