{"body": "Okay, most of the suggestions given here are the typical tourist trap stuff. It's all fine to do if that's what you're into. I hate the tourist crap for the most part, personally (except [Shedd Aquarium](http://www.sheddaquarium.org/)... that is amazing)... so let me give you some more \"local\" suggestions.\n\nSome off-the-beaten-path cool stuff:\n\n* You said you're a film/TV dude... [Brew &amp; View at the Vic](http://www.brewview.com/) might be up your alley.\n\n* You said you're a geek... Do you like video games? If you'll already be near Wrigley, *do not miss* People Play Games at 3268 N Clark. They have every video game / system you've ever heard of ever. It's ridiculously nostalgic.\n\n* [Lincoln Park Zoo](http://www.lpzoo.org/) is a pretty safe bet for cheap entertainment. It's a free zoo that is actually pretty high quality.\n\n* [7/10 Lounge](http://www.sparetimechicago.com/index.php?section=4) is a pretty cool bowling alley / bar.\n\n* Random shopping place: Belmont Army (855 W. Belmont... walkable from Wrigley). Five floors, each with their own unique flavor (basement = skate shop, ground floor = trendy clothes, 2nd floor = shoes, 3rd floor = army surplus, 4th floor = retro). I bought a gas mask there a couple weeks ago on a whim for like $30.\n\nRestaurants / Bars / Breweries / Beer Gardens:\n\n* [Bar Deville](http://bardeville.com/) - Personal favorite bar near my neighborhood. Not much to see, really... just a nice chill bar with good drinks (the bartenders come up with some really creative stuff) and good people.\n\n* [The Hideout](http://www.hideoutchicago.com/) - Best-hole-in-the-wall you'll ever go to.\n\n* [Revolution Brewery](http://revbrew.com/) - Pretty new brewery in Logan Square. Great food, great beer. Don't miss the bacon fat popcorn.\n\n* Happy Village (1059 N. Wolcott Ave) - Best beer garden in the city bar none.\n\n* For breakfast... so hard to choose a favorite... but you can't go wrong with [Kitsch'n](http://www.kitschn.com/) (especially if it's a nice day and you can get a table in the garden), Flying Saucer (1123 N. California), or [Ann Sather](http://www.annsather.com/) (the only chain in Chicago I can recommend in good conscience... get the cinnamon rolls).\n\n* [DMK Burger Bar](http://www.dmkburgerbar.com/) - incredible burgers.\n\n* [Old Oak Tap](http://www.theoldoaktap.com/) - My somewhat regular local haunt. Pretty great food.\n\n* [The Hopleaf](http://hopleaf.com/) - Great bar in Andersonville (pretty far north). Lots of really good and rare beer available.\n\n* Again, if you are near Wrigley, one of the most fun times I've had at a bar in that area was at [Sluggers](http://www.sluggersbar.com/) (right by the stadium). It's entirely dependent on the upstairs (with dueling pianos and old school video game / batting cages / skee-ball) not being taken by a private party, though. If you can't get up there, it's not worth going.\n\n* Pretty much anywhere in Wicker Park. It's a great neighborhood for food, booze, shopping, whatever.\n\n* Someone else mentioned Hot Doug's. They're right, it's awesome for gourmet sausages / hot dogs. If you're in a bit of a masochistic mood, though, head to the Wiener's Circle (2622 N Clark St) late night. You'll never receive so much abuse trying to order a hot dog for the rest of your life.\n\n* If you're looking for a couple more slightly-more-upscale food choices... check out [Blackbird](http://blackbirdrestaurant.com/) or [Redlight](http://www.redlight-chicago.com/).\n\nA general heads up... A lot of the local (non-touristy) bars in Chicago are cash only. Most will have an ATM if you need it, but make sure you have access to cash.\n\nI'll edit this as I can think of more stuff. Let me know if you had anything specific in mind and I'll see if I can come up with something for you.", "gilded": 0, "created_utc": "1275496452", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "This is a violent step up from Evony but get them to download Steam and play Half-Life or any Gold Source games (old school shit). Hours of killing and maybe, stress retaining within the family! Huzzah!\n\nPlus, Steam has over 1100 games [about 500 less than 10 or 5 dollars I think, too]", "gilded": 0, "created_utc": "1275647175", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I [may](http://amzn.com/B00005OU2X) be [able](http://www.overstock.com/Home-Garden/Franklin-Brown-Tufted-Leather-Club-Chair/5036238/product.html) to [help](http://amzn.com/B002CZQ51Y) you [with](http://www.radiolovers.com/) that, [too](http://www.moonflower-starfire.com/site/1321714/product/882-9156074).", "gilded": 0, "created_utc": "1275948978", "subreddit": "gaming", "score": 3, "controversiality": 0}
{"body": "Indeed. Creepy little fuck has [a little 'SS' symbol on his collar too](http://i.imgur.com/VYznx.jpg)", "gilded": 0, "created_utc": "1276299812", "subreddit": "WTF", "score": 4, "controversiality": 0}
{"body": "Once my kitten got locked in a house that was being renovated, less than 10 meters away from our house.  He talked the owner of the renovating house into dealing him tuna.  After three days locked up, [Zed, the kitten](http://imgur.com/EYCjg.jpg), came back home. The lock up did not teach him the right lesson and after listening to our lecture for 2 hours he excused himself to pee outside.\n\nThis time he was gone for three weeks.  He had an addiction now and we could not help him with. We did not approve of his new habits, and he ran.  He lived on the streets and I don't even want to imagine what he had to go through to get his next fix.\n\nWe had posters all over town, we called rescue services, we searched through and through. All the tips we received on the phone did not lead anywhere. He was finally brought back home by a relative of ours whom he trusted. The relative just happened to see him downtown.\n\nWe didn't talk much about Zed's days on the street.  We didn't talk about much at all after he was back. He was [different.](http://imgur.com/X79BK.jpg)  We could see that his addictions were serious and now he was into street foods.\n\nHis next episode came went Zed went as low as begging for milk from neighbours. He simply walked into an old man's house and asked for it.  The old man sent his niece to complain. \n\nOver the years we heard all kinds of lies from Zed : \n\nThe next time he went missing he was \"adopted\" by a neighbour girl, three houses down. She build him a card box fort, gave him milk and tuna, renamed him Smoky Rocks. Four days he lived under fake identity, hiding from his real family. The posters worked this time, and the girl's sister sold him out for a mere $ 20.\n\nOnce he \"forgot his identification at home, so someone apprehended him and called animal services\". We had to get him back and pay a \"fee.\" I am pretty sure he had some kind of a deal going on with those individuals and was probably splitting the fee with them, so he could feed his habit. \n\nHe had the coolest [Lighting bolt tattoo](http://imgur.com/1LVme.jpg), going all the way down his right leg. That's how our relative found him downtown, she recognized the tattoo.  There was no other way to know- when she brought him back to us, I didn't think he was ours, but when I saw the mark, I was in shock- he was [three times his size!](http://imgur.com/hTWDN.jpg)  He was also almost a month older, but I didn't not think he would be so big! Lean and tall, he was often compared to a tiger.\n\nThe next time around though, he never came back. During one of his short stays with us something went wrong.  We heard a loud noise in the bathroom and rushed, found him on the floor, paralysed.  He died 20 hours later. Weak heart. \n\ntl;dr: RIP ZED. Don't feed cats that wander into your yard, because they will keep coming back.", "gilded": 0, "created_utc": "1276435305", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "[South Carolina, too](http://www.youtube.com/watch?v=lj3iNxZ8Dww)", "gilded": 0, "created_utc": "1276542913", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "[my dropbox is pretty cool too](http://bit.ly/aG7crv)\n\nThat or Airsharing/Discovery.", "gilded": 0, "created_utc": "1276573857", "subreddit": "promos", "score": 1, "controversiality": 0}
{"body": "Im not a fan of drinking out on fri/sat nights - mostly because it gets really crowded/loud - not top mention, expensive. I enjoy drinking a beer to relax - not to get drunk. I often go to a bar at off-peak/happy hours; more often alone than with friends and its perfectly alright. Dont go expecting anything..some times it will be great, other time you will have quality alone time :) \n\n[you will run into a few alcoholics too]\n\nAlso, going to movies/dinner alone is enjoyable", "gilded": 0, "created_utc": "1277056681", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I love Old Crow and Yonder.  I wouldn't classify them as classic bluegrass in any sense but I love the elements they draw from it. I went to a bluegrass festival in VA 3 weeks ago and all the late-night improv and jam sessions played by the other festival-goers was just incredible. Having an upright bass, fiddle, and multiple guitars and banjos play around a campfire at 2 am is just awesome. I'm leaning towards picking up a resonator guitar in the near future because I went.\n\nHere's a classic that I had never heard of before it was sung by about 20 people around a campfire:\n\n[Steam Powered Aeroplane- John Hartford](http://www.youtube.com/watch?v=qdgLtzWJhbU)\n\nSaw these guys at the festival:\n[Cherryholmes at Bonnaroo](http://www.youtube.com/watch?v=siyfsmFdNuU)\n\nOne of my favorite Yonder songs:\n[Left Me in a Hole - Yonder @ Allgood 2009](http://www.youtube.com/watch?v=8YH6nEuTZ-o)\n\n\n\n\nI wish I remembered the names of all the songs I heard but my memory is pretty shoddy.", "gilded": 0, "created_utc": "1277129514", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "[Yeah](http://www3.telus.net/public/nwatt23/mypage_files/mirror%20tpol%202.jpg), [me](http://www.memoryalpha.de/news/media/episodes/ent094_inthemirrordarkly_tpol.jpg) [too](http://4.bp.blogspot.com/_E2bodr__ZvI/Rs3F67BVPPI/AAAAAAAAAFw/wrMzETwv4DM/s1600-h/MUTPolcaptioned.jpg).", "gilded": 0, "created_utc": "1277144853", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Definitely quality reporting. It presents a lot of arguments from both sides of the debate with minimal (if any editorializing). The first time I watched it, I hadn't developed a stance on GMO's and was flip flopping with each argument presented; the report's an exceptional thought provoking piece. There's an accompanying [website with useful educational tools, too](http://www.pbs.org/wgbh/harvest/). ", "gilded": 0, "created_utc": "1277186393", "subreddit": "science", "score": 2, "controversiality": 0}
