{"body": "[Vote this up in the politics reddit, too](http://www.reddit.com/r/politics/comments/8p1qm/bigtime_multiple_pulizer_winning_nytimes_writer/)\n\nEDIT:  And remember to proofread it three or five times, you're talking to a Pulizer prize winning journalist, try not to sound like an idiot!", "gilded": 0, "created_utc": "1243913519", "subreddit": "Marijuana", "score": 12, "controversiality": 0}
{"body": "Believe it or not, [there's a subreddit for that, too](http://www.reddit.com/r/pregnant/).  \n\n\nNSFW", "gilded": 0, "created_utc": "1244215803", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Why am I being downmodded and this retard below me gets upvotes?  I flew 8 hours across the atlantic on a Lufthansa flight, and it was horrible.  The food was bad, the plane was shitty, and the service was non-existant.\n\nI flew back on an Air France flight and they had better food than some of the restaurants I had eaten at.  Who serves quinoa on a flight? Air France does.  Who gives you extra rolls [good bread, too] without you needing to ask?  Air France.\n\nAll of you France haters need to sit down alone for a few minutes and think about why you hate France, or anything that has France in it.\n\nRemember 'freedom fries'? You are allowing stupid shit like that to continue in your head.  All it does is emphasize the fact that your opinions are largely formed from what the television spews at you.\n\nWant some good reasons to like France?  I'll make it easy for you\n\n[Daft Punk](http://en.wikipedia.org/wiki/Daft_punk)\n\n[ITER](http://en.wikipedia.org/wiki/ITER)\n\nThe rest of you, fuck off.  Wait, I remember the age thread a few days ago.  The rest of you need to learn some shit and finish school.", "gilded": 0, "created_utc": "1245165436", "subreddit": "business", "score": 2, "controversiality": 0}
{"body": "and obviously you, and at least one other person still don't understand.\n\nLet me spell it out for you real slow. **I challenge the statement that there is intelligent life on Earth.**\n\n*How do you define intelligent?, evrae?*\n\nFinding planets orbiting stars in other galaxies?  Ever watch Lexx? The ship was able to travel between the stars, but was not terribly intelligent *by human standards*\n\nYou are measuring intelligence by **human** standards.  How *intelligent* are we by the standards of a [Hooloovoo](http://en.wikipedia.org/wiki/Races_and_species_in_The_Hitchhiker's_Guide_to_the_Galaxy#Hooloovoo)? \n\nand just in case you still don't get it:\n\n[Theodor Kaluza](http://www-history.mcs.st-andrews.ac.uk/Biographies/Kaluza.html) unified Einstein's theory of gravity and Maxwell's theory of light into 5 dimensions and his idea that fundamental forces can be explained by additional dimensions did not re-emerge until string theory was developed. We know there are at least 5 dimensions, because Kaluza produced a unified theory in 1919.  *(and by the way, kk theory produces a unknown force that is similar to electricity and magnetism. I wonder if anyone will ever get around to seeing if dark energy is a match)*\n\nWhat does that have to do with intelligence? Although we have yet to prove the existance of life in higher (or lower) dimensions *(edit: and by existence, I mean that while the universe can be considered a 5d construct, the human seat of consciousness functions in a 3+1 manner. Our mythical Hooloovoo may have a limited 3d existence while their seat of consciousness functions in a 4+1 manner.)*, what if these Hooloovoo existed on the 4th dimensional plane and one of their requirements for intelligence was the ability to think in 5 dimensions and move in 4 dimensions?\n\nThe fact that you limit your definition of intelligence to that of what humans can conceive and then *include humans* shows your prejudice and narrow-minded thinking.\n\nThere's a lot more room in the 4th dimension. If we are hoping for, nay, *demanding* human-like intelligence in this universe based on our 3+1 perception, imagine how much roomier the universe must be for a being with 4+1 perception! Intelligent life *must* exist on such a scale and our 3+1 lives would seem as limited as protozoa in a petri dish.\n\nAnd now, you have exhausted me, attempting to explain this concept in simple terms. I hope I have helped to enlighten you, and I sincerely hope it was worth the effort. Read KK theory, flatland, for more insight.\n\n", "gilded": 0, "created_utc": "1245500772", "subreddit": "space", "score": 4, "controversiality": 0}
{"body": "In my experience the only people who do not like the ribbon are those people who are long time intermediate/advanced '03 users.\n\nWhen  you learn one system you are less likely to want to put in the effort to learn a new one. This happens with anything.\n\n\"This fucking thing sucks. I can not find XYZ feature in it at all [never mind that it took me a long time to learn where it was in the old system too]\"", "gilded": 0, "created_utc": "1245612519", "subreddit": "programming", "score": 5, "controversiality": 0}
{"body": "[Reddit Tattoo](http://www.reddit.com/r/AskReddit/comments/8uwj4/askreddit_have_any_of_you_got_a_tattoo_you_sorely/c0aihwf)", "gilded": 0, "created_utc": "1245790966", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "That might be the same dolphin from [this tattoo](http://www.myconfinedspace.com/wp-content/uploads/tdomf/32706/best%20tattoo%20ever.jpg), I just can't be sure.", "gilded": 0, "created_utc": "1246241710", "subreddit": "humor", "score": 5, "controversiality": 0}
