{"body": "Please tell me what you think about the New Digg and whether it can survive this mass defection. I started an [AskReddit thread too](http://www.reddit.com/r/AskReddit/comments/d95yn/sure_theres_all_this_new_digg_stuff_but_has/).", "gilded": 0, "created_utc": "1283530596", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I have a [goldfish too](http://www.flickr.com/photos/40994371@N07/4922741051/in/photostream/).  They're awesome.", "gilded": 0, "created_utc": "1283655382", "subreddit": "comics", "score": 2, "controversiality": 0}
{"body": "Hey, did you go to Hollywood Upstairs Medical College, [too](http://www.mentalfloss.com/wp-content/uploads/2009/04/doctorb.jpg)?", "gilded": 0, "created_utc": "1283737500", "subreddit": "funny", "score": 7, "controversiality": 0}
{"body": "Probably the same troll tattoo shop that did [this classic troll tattoo](http://bullmurph.com/wp-content/uploads/2010/08/jh2.bmp)! ", "gilded": 0, "created_utc": "1283798248", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I have a [Columbia Bugaboo](http://www.modells.com/product/index.jsp?productId=3442031&amp;CAWELAID=407325387) similar to the one in the link, and it works well. It is pretty affordable too, as you can see. A good hat is a must. Scarves work well but can be a hassle, so I don't usually wear one. Boots make a huge amount of difference! Mine are big clunky ones from Cabella's, but most boots should work well. If I wear my pants legs over them, they look almost like slightly less casual Timberlands or something like that.", "gilded": 0, "created_utc": "1283823150", "subreddit": "chicago", "score": 1, "controversiality": 0}
{"body": "[You might want to reply to the AskReddit thread about it, too](http://www.reddit.com/r/AskReddit/comments/dav6j/hey_kn0thing_did_you_get_to_ask_colbert_a_question/)!", "gilded": 0, "created_utc": "1283912842", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "&gt;However, this really shouldn't imply that we stop talking honestly about the vileness of rape, police brutality, etc.\n\nYou're talking about the actions and I'm talking about the actors. It's at least very possible that neurobiology may explain why these behaviors are engaged in. And I also wouldn't be surprised if authoritative drives result from abuse of some sort. In short, I'm only interested in treating the symptoms when they *need* to be addressed. I'd rather focus on the disease.\n\n&gt; But that doesn't really help when dealing with seriously non-rational people.\n\nWhich is why I said there are limits on how far rhetoric will go.\n\n&gt; it is very clear that the people who oppose \"illegal\" immigration are not merely after the neutral enforcement of a neutral law. They are also in favor of police and private citizens harassing brown people on the street, requiring them to carry \"papers\" which white people are not expected to carry, etc.\n\nConsidering the correlation between \"brown skin\" and \"illegal alien\" is very high and that most people don't give a shit about civil liberties, thinking if you haven't done anything wrong, there's nothing to fear, I don't really consider that good evidence.\n\n&gt;They do have a grudge against legal Mexican immigrants ... and against anyone else who doesn't look like they \"belong\". And that belonging is defined in both racial and cultural terms.\n\nDo the legal Mexicans who support that law hold a grudge [too](http://www.youtube.com/watch?v=jzTgqksQT0Y)?\n\n&gt; This is xenophobia, yes, but it is also racism; the two are not separable, just as they are not separable in the case of classic European antisemitism, or the anti-Asian attitudes that prevailed in the American West in the late 19th and early 20th centuries; and so on, and so on.\n\nI'll respond to this the way I responded to Brainpolice on facebook:\n\n&gt;Is it not true that a minorities represent a higher level of the prison population, especially where immigration is viewed as a \"problem?\"\n\n&gt;http://www.scribd.com/doc/938138/Minority-Proportion-of-Incarcerated-Pop-by-State\n\n&gt;Is it not true that mexican immigrants speak spanish and have different cultural values?\n\n&gt;Is it not true that some illegal immigrants are on welfare roles?\n\n&gt;And above all, is it not true that it's easy to stir up anger about the \"invasion\" **any outsider?** I mean considering that \"Okies,\" irish, italian, and everyone else involved in a mass migration usually ends up a target, the default appeal to racism seems particularly weak.\n\n&gt;Essentially your analysis begs the question. **What is the motivation behind it all?** *You and I have information* that explains that the poor and incarcerated are often products of a corrupt system. You think the average flag waving American is operating under that assumption? No. You show them a couple worthless statistics combined with their experience of having to parse through the broken english of an immigrant and an anecdote about how their friend lost their job to ILLEGAL (OMG!) labor plus combine that with nationalism and it seems to me that racism or even xenophobia shouldn't be anywhere near the front of the line as far as explanations go. It's guaranteed that there's some racism/xenophobia everywhere, but this seems much more like **tribalism mixed with false information**.\n\nI think racism is a problem, but describing everything that may vaguely look like racism is a problem too. You have to try to look at it from the perspective of \"the racist.\"", "gilded": 0, "created_utc": "1284086682", "subreddit": "Anarchism", "score": 1, "controversiality": 0}
{"body": "Paul Rietzl was playing a \"White Weenie\" deck [in quotes because 4/5s, 8/8s and 4/4 double-strikers aren't weenies by any stretch :p. Plus, postboard, it plays a decent control deck too]\n\n[Decklists are here](http://www.wizards.com/Magic/Magazine/Article.aspx?x=mtg/daily/eventcoverage/ptams10/top8decks)", "gilded": 0, "created_utc": "1284132394", "subreddit": "magicTCG", "score": 1, "controversiality": 0}
{"body": "[I'd like to sound the troll alert here, too](http://www.reddit.com/r/TwoXChromosomes/comments/dc0vs/false_rape_allegations_are_rare/c0z398w)", "gilded": 0, "created_utc": "1284253035", "subreddit": "TwoXChromosomes", "score": 3, "controversiality": 0}
{"body": "[Lincoln Park Zoo](http://en.wikipedia.org/wiki/Lincoln_Park_Zoo) is free. Stick your arm into various cages if you're feeling the need for danger.", "gilded": 0, "created_utc": "1284485567", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "I'm pretty sure [Hitler hated getting RickRolled too](http://www.youtube.com/watch?v=LLd2uAam0hI).", "gilded": 0, "created_utc": "1284914590", "subreddit": "politics", "score": 4, "controversiality": 0}
{"body": "I found it!\n\n[The Indelible Stamp of our Lowly Origin](http://www.youtube.com/watch?v=Vg4AjD1fUaw)\n\nEDIT: [This one is cool too](http://www.youtube.com/user/UppruniTegundanna#p/u/12/Hf07e5h8474)", "gilded": 0, "created_utc": "1285456477", "subreddit": "IAmWeird", "score": 2, "controversiality": 0}
{"body": "Congratulations! I know the feeling in some ways. I hurt my ankle really badly last December, and was unable to walk for 5 months. I was so happy when I could walk that I [shared it with reddit too](http://www.reddit.com/r/happy/comments/c2p67/i_can_walk_again/). :)", "gilded": 0, "created_utc": "1285460532", "subreddit": "happy", "score": 3, "controversiality": 0}
{"body": "get out of my head! i came here to post the exact same thing- [karma solid shampoo](http://www.lushusa.com/shop/products/hair/solid-shampoos/karma-komba) + [veganese conditioner](http://www.lushusa.com/shop/products/hair/conditioners/veganese). i also like the reincarnate henna shampoo for special occasions.", "gilded": 0, "created_utc": "1285543573", "subreddit": "veg", "score": 3, "controversiality": 0}
{"body": "I see your Pinheads and Patriots by Bill O'Reilly and raise you [a Japanese Lucky Golden Poo](http://www.thinkgeek.com/gadgets/cellphone/9069/)", "gilded": 0, "created_utc": "1285548888", "subreddit": "reddit.com", "score": 4, "controversiality": 0}
{"body": "Here is one alternative for the really committed. :)\n\n[colbert_tattoo](http://community.colbertnation.com/Photo/Stephen-Colbert-Tattoo/0C7E3FFFF01DB44B5000700E72A66)", "gilded": 0, "created_utc": "1285887194", "subreddit": "promos", "score": 2, "controversiality": 0}
