{"body": "Hey I think it's cool you are trying to restart a stagnate subreddit. If you want, I tried to draw you up a **[header logo](http://i.imgur.com/ivRHd.png)**, feel free to use it! (It's suppose to be a reddit alien [snoo] in a scout uniform with scout logo thing.) If you dont want to use the header, no problem, just thought I'd offer it. Have a nice day!", "gilded": 0, "created_utc": "1317486566", "subreddit": "BoyScouts", "score": 3, "controversiality": 0}
{"body": "Since we're using the comments to post links of other looping artists: [Check out Keller Williams](http://www.youtube.com/watch?v=PAI3QgssxKA&amp;feature=player_detailpage#t=292s)\n\n[This clip's cool too](http://www.youtube.com/watch?v=dMONzLf8VvA)", "gilded": 0, "created_utc": "1317557206", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "[Relevant Boltaloo](http://maximillianveers.deviantart.com/art/Boltaloo-245066327)", "gilded": 0, "created_utc": "1317600692", "subreddit": "mylittlepony", "score": 3, "controversiality": 0}
{"body": "Cool.  I have one [too](http://imgur.com/RQkZm)! [Made](http://imgur.com/SVlWF) it awhile back as you can see from the timestamp and horrible picture resolution.\n\nAfter awhile the foam starts getting weird though.", "gilded": 0, "created_utc": "1317658910", "subreddit": "Guitar", "score": 2, "controversiality": 0}
{"body": "Running start is the name of the program in Washington and Hawaii.\nSome other colleges specifically have it, but not state-wide programs I think.\n\n[I'm 15 in college woo]", "gilded": 0, "created_utc": "1317875817", "subreddit": "fffffffuuuuuuuuuuuu", "score": 2, "controversiality": 0}
{"body": "We've [observed amino acids and other organic compounds organizing themselves out of random waste](http://en.wikipedia.org/wiki/Miller-Urey_experiment), and those amino acids have been observed forming lipids.\n\nAfter that, you need a few of those simple chemical compounds to form into nucleotides, which has also been observed.  That's when shit gets real, because nucleotides are *very* good at polymerization:  they create more nucleotides and throw off what we consider the building blocks of life as a byproduct.  Get these in the right order (and remember, these things throw off organic materials as a byproduct, so they *create more chances for it to work*) and you have prions.\n\nCombine these - a lipid forms a layer around some RNA.  [Now you have a virus](http://en.wikipedia.org/wiki/RNA_world_hypothesis).  Any time the lipid layer closes around the end - now you have a cell!\n\nNow, most random sequences of RNA are complete derps, and produce random shit.  But if even some manage to produce desirable behaviors, like gaining energy from light (incredibly easy), you will eventually get at least one lipid layer around a RNA polymer that's creating molecules that photosynthsize.  The chemical reaction continues.  Nature just discovered the big trick to keeping meat fresh.\n\nThese cells don't resemble ours, because we've had the benefit of three and a half billion years of competition creating a crazy number of alternate designs.  Calling these self-replicating, sheathed polymers \"prokaryotes\" is almost overstating it.  But they're defined membranes defending a self-sustaining chemical reaction; that's life.  Add in some random chance in order to create polymer variations that are better at collecting resources, and you have varied suitability for their environments - i.e., evolution.  The rest is just iterating.\n\nTL;DR Natural processes did not need to roll the world's greatest natural 20 to get life started; life organized itself out of the natural processes already present.\n\nSource:  [The Major Transitions in Evolution](http://en.wikipedia.org/wiki/The_Major_Transitions_in_Evolution), and [far too](http://en.wikipedia.org/wiki/Evolutionary_history_of_life) [much Wikipedia](http://en.wikipedia.org/wiki/Origin_of_life) for this early in the morning.", "gilded": 0, "created_utc": "1317916271", "subreddit": "fffffffuuuuuuuuuuuu", "score": 6, "controversiality": 0}
{"body": "[She's probably a redditor too](http://www.heyitsapril.com/post/9390468312/reddit-you-so-funny-i-luh-you#notes).", "gilded": 0, "created_utc": "1318075326", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "Get a used Gretsch. Best guitars on the planet and \n[they look cool too](http://i.imgur.com/kRS1t.jpg)\n", "gilded": 0, "created_utc": "1318134188", "subreddit": "Guitar", "score": 3, "controversiality": 0}
{"body": "Apparently evolution is [pretty damn obvious to biologists too](http://www.talkorigins.org/indexcc/CA/CA111.html).", "gilded": 0, "created_utc": "1318262553", "subreddit": "atheism", "score": 2, "controversiality": 0}
{"body": "Black Moth Super Rainbow!\n\nThey make music that truly does not sound like anything else, lots of analog synth and vocoder.\n\n\n\n[When The Sun Grows On Your Tongue](http://www.youtube.com/watch?v=oLdF0-n3zkA)\n\n[I Think It's Beautiful That You Are In 256 Colors Too](http://www.youtube.com/watch?v=BrCWpNpVh0U)\n\n", "gilded": 0, "created_utc": "1318265187", "subreddit": "Music", "score": 1, "controversiality": 0}
{"body": "X-posted (stolen) from [/r/weeaboo](http://www.reddit.com/r/weeaboo/comments/l614j/mahjong_show_saki_to_get_a_spinoff_achigahen/)", "gilded": 0, "created_utc": "1318282706", "subreddit": "anime", "score": 3, "controversiality": 0}
{"body": "Ahh....the old reddit [switch-a-roo](http://www.reddit.com/r/pics/comments/k0r71/my_friend_isnt_always_related_to_famous_people/c2gqgg1?context=3)", "gilded": 0, "created_utc": "1318297837", "subreddit": "reddit.com", "score": 552, "controversiality": 0}
{"body": "Don't forget, they [won the Golden Poo](http://consumerist.com/2010/04/congratulations-comcast-youre-the-worst-company-in-america.html) two years in a row!  Crappy customer service!\n\nOh well, at least they didn't [set your house on fire](http://consumerist.com/2007/08/verizon-there-was-no-fire-fire-department-yes-there-was-a-fire.html) then pretend they didn't.", "gilded": 0, "created_utc": "1318395608", "subreddit": "AdviceAnimals", "score": 3, "controversiality": 0}
{"body": "Damn troll nose, I wondered why when I snore at it night it sounds like [troll-lo-lo-lo-la-loo](http://www.youtube.com/watch?v=2Z4m4lnjxkY)", "gilded": 0, "created_utc": "1318429414", "subreddit": "amiugly", "score": 1, "controversiality": 0}
{"body": "[Wil Wheaton is a redditor too](http://www.reddit.com/user/wil)", "gilded": 0, "created_utc": "1318445280", "subreddit": "starcraft", "score": 10, "controversiality": 0}
{"body": "Noah Wyle already played him. I think [Arnold Vosloo](http://www.imdb.com/name/nm0903677/) is a batter choice.", "gilded": 0, "created_utc": "1318538468", "subreddit": "movies", "score": 1, "controversiality": 0}
{"body": "*Homeland* is a semi-political drama, but not in the administrative duties or aspirations aspect -- it explores themes of patriotism, intelligence and terrorism. Surprisingly well done and [there's a subreddit for it too](http://www.reddit.com/r/homeland/).", "gilded": 0, "created_utc": "1318873777", "subreddit": "television", "score": 3, "controversiality": 0}
{"body": "The [Indianapolis Zoo](http://www.indyzoo.com/SitePages/home.aspx) is a short walk from downtown.  The downtown museums are pretty good too. I'd recommend The South Bend Chocolate Company's hot chocolate (right on Monument Circle) if you get a bit cold walking around. There are breweries downtown as well if you're interested in that ([Sun King](http://sunkingbrewing.com/) comes to mind). If you want something that's an Indianapolis institution, for a late lunch or whatever, check out [The Slippery Noodle](http://www.slipperynoodle.com/index2.cfm) (Warning: site plays blues music) the nachos are great probably big enough for two. It's located at South and Meridian, about .5 miles south of the Circle. \n\nIf you have time just to walk around, take a stroll up Mass Avenue. There are lots of local shops and plenty of places to eat (you really couldn't go to far wrong picking a place at random). \n\nHave fun!", "gilded": 0, "created_utc": "1318887541", "subreddit": "indianapolis", "score": 5, "controversiality": 0}
{"body": "[I colored it too](http://imgur.com/yLOuw)", "gilded": 0, "created_utc": "1319059444", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "[oh man so cool this is my reason too](http://www.youtube.com/watch?v=BXAOz7PDul0)", "gilded": 0, "created_utc": "1319160264", "subreddit": "creepy", "score": 1, "controversiality": 0}
{"body": "*Homeland* just started but it's been really good and [there's a subreddit for it too](http://reddit.com/r/homeland). ", "gilded": 0, "created_utc": "1319220701", "subreddit": "ifyoulikeblank", "score": 1, "controversiality": 0}
{"body": "And once again, Raynor is relegated to being a complete pussy, while Kerrigan is seems completely one-dimensional. Can we get a starring cast we give a damn about please? I mean, Tychus felt like the only decent character from WoL [Tosh was neat too], and they killed them both off!", "gilded": 0, "created_utc": "1319243500", "subreddit": "starcraft", "score": 2, "controversiality": 0}
{"body": "Are you sure that's accurate?  Perlmutter, the Marvel owner, is now likely Disney's single largest shareholder (since the death of Steve Jobs).  [The Beat has been reporting Perlmutter may want operational control over Disney, too](http://www.comicsbeat.com/2011/10/21/marvel-layoffs-the-cheapskate-is-coming-from-inside-the-house-of-ideas/)", "gilded": 0, "created_utc": "1319478116", "subreddit": "comicbooks", "score": 5, "controversiality": 0}
{"body": "Not particularly, though there are stories of human sacrifices.  It's a common trope in many religions.  That said, *every society up through WWII* practiced cannibalism, some of it ritualistic, some of it of enemies, some of it of friends.\n\n* [Dead Men Are a Ghoul’s Best Friend](http://www.skeptic.com/podcasts/monstertalk/11/09/07)\n\n&gt; IN THIS EPISODE of MonsterTalk we discuss Ghouls and their real world counterpart: cannibals. The hosts are joined by **Carole A. Travis-Henikoff**, author of [Dinner With A Cannibal: The Complete History of Mankind’s Oldest Taboo](http://dinnerwithacannibal.com/index.htm). This episode also features guest MonsterTalker Adam Levenstein, a long-time friend of the show whose background combines anthropology and skepticism.", "gilded": 0, "created_utc": "1319488840", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "Met my drummer through a local beloved guitar tech when my then-guitarist told him we needed one and he suggested his son. He was 14 and we were 19-20. [That band](http://www.myspace.com/borninmemory) died a slow death but my drummer and I still wanted to work together. He wanted to play death metal (we had been doing some sort of prog) and I knew a guitarist in a regionally big thrash band (their first album made a couple top-10 of '09 blog lists) whose main love was tech death. So we started a tech death band. Our drummer is 16 now, can blast at 220, and is working on his gravity blasts. I'm floored every time we play together. This was a little over a year ago, and we've got 2 songs finished, one almost there, one halfway done and four in the nascent stages. So I have a much better perspective on Necrophagist now. The sad thing is that most of the writing has occurred since our main guitarist has been unable to play thanks to tendonitis. He quit the thrash band to make this one work full-time and karma took a shit on him for it.\n\nThe same drummer brought me into an instrumental prog metal project with an amazing guitarist who just finished high school. They recorded [this](http://www.reddit.com/r/progmetal/comments/j60w3/singularity_the_new_world/) while I was in jail in May. We added this guitarist to the tech death project, and just brought in another guitarist who I've played in a couple other bands (see below) with in on the instrumental one.\n\nFinally, I've played bass with a kid since the end of my freshman year in high school, eight months into playing bass. My first band actually, and that lasted until halfway through our senior year. I went from knowing no one at the school to being pretty good friends with all of the members of the band by the end of the year, and they'd heard me play a couple times and invited me into the fold. We opened for some cool cats, like [Rishloo](http://www.rishloo.com/) and [Fair to Midland](http://www.ftmband.com/) when they came through town. We recorded [this](http://danielandthedragon.bandcamp.com/album/basilica-in-caelo) and our frontman abruptly got fed up with the band and quit. He asked me to join a [new project](http://danielandthedragon.bandcamp.com/album/there-is-nothing-left-for-us-to-conquer) a few months later, a fusion of the band we had and another he had fronted. This culminated a few months later in both my favorite live performance and the last time I've played live (this was ~3 years ago). I was coated with sweat and am pretty sure I haven't cleaned the dried sweat off my bass fully yet. He left for college in LA and we had mixed success keeping in touch and playing in bands together, attempting to put [this](http://danielandthedragon.bandcamp.com/album/inversions), which he wrote and recorded himself, into practice with the same lineup as the second project the next summer. That failed miserably. This last summer we had a great experience recording [this](http://danielandthedragon.bandcamp.com/album/disconnecter-first-edition), in which he's finally letting the fantastic musicians he brings together be themselves more often. I mean, I've always insisted on being my own bassist but there was a lot more group creativity at work here and a lot less frustration. We're hoping to put together a live performance or two when he gets back for winter break.\n\nAlso I've played bass for a couple of rappers which I met partying and in rehab, respectively. Neither of those two projects went anywhere.\n\n**tl;dr** Sixteen-year-old drumming prodigy, two projects, both full of awesome. Oh, and supporting my heterosexual life partner in playing bass for what amount to solo projects, though of late he appears to be letting go of his ego.\n\ntl;dr for the **tl;dr** I have way too much on my plate. And the above accounts for about a third of the musical projects in which I've been involved in the seven years I've played bass.\n\nTo the OP: keep your mind open and don't hesitate to jam with anyone. You won't know if your musical vibes agree until you play, whatever your particular genres of choice. Also, craigslist led to our tech-death project finding a damn awesome growler, and we're in a very low-population area. So that'd be a place to start if you don't know people that play.", "gilded": 0, "created_utc": "1319525927", "subreddit": "bandmembers", "score": 3, "controversiality": 0}
{"body": "I seriously listened to this album on repeat for 3 months my senior year of high school. [I'm a Cuckoo](http://www.youtube.com/watch?v=GuKuw71YBbI&amp;ob=av3n) may be even more catchy from the album, though. \n\nTo be fair, Belle and Sebastian have hit it *pretty* big. But the radio is just a different kind of \"popular\", I guess.", "gilded": 0, "created_utc": "1319605358", "subreddit": "Music", "score": 1, "controversiality": 0}
{"body": "Each state in the USA has at least one [World Association of Zoos and Aquariums-certified zoo.](http://www.waza.org/)\n\nThe [Cincinnati Zoo](http://cincinnatizoo.org/), [Indianapolis Zoo](http://www.indyzoo.com/SitePages/home.aspx), [Minnesota Zoo](http://www.mnzoo.com/), [National Zoo of the Smithsonian Institute](http://nationalzoo.si.edu/), [Bronx Zoo](http://www.bronxzoo.com/) (now known as the International Wildlife Conservation Park of the New York Zoological Society), and [San Diego Zoo](http://www.sandiegozoo.org/) are world-renown institutions that participate in genetic exchange programs, advisory boards relating to animal welfare in captivity and rehabilitation, and international conservation efforts. All of them are in America.\n\nI think it's a bit of a stretch to say American zoos are horrible as a big, monolithic group. There are horrible zoos in the USA; thanks to third-party watchdog groups and licensing requirements this isn't the norm.\n\nNot all hospitals are as good as [the topper of this list](http://hospitals.webometrics.info/top2000.asp), but that doesn't mean all others are dirty alleys.\n\nWith all of that said, could you qualify your statement so that I can understand you with more clarity?", "gilded": 0, "created_utc": "1319610791", "subreddit": "pics", "score": 10, "controversiality": 0}
{"body": "[We're probably cooler than they are too](http://imgur.com/GZsIG)", "gilded": 0, "created_utc": "1319651452", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "While looking up their names, it looks like it's actually [two computer science grads](http://engineering.tamu.edu/news/2007/06/07/aggie-astronaut-computer-science-grad-in-space/) and [two meteorology](http://www.spacefacts.de/bios/astronauts/english/weaver_carol.htm) [grads too](http://www.spacefacts.de/bios/astronauts/english/aufderhaar_grant.htm)", "gilded": 0, "created_utc": "1319674759", "subreddit": "aggies", "score": 3, "controversiality": 0}
{"body": "I'm not for prohibition though.  So feel free to share your views but don't presume that you're debating me.  I think prohibition [re: throwing drug users in prison] is a failed social study.\n\nThat being said, I do want to raise the notion that maybe people shouldn't be advocating drug use.  Just because it might become legal someday doesn't mean we should talk positively about drug use [and abuse].  Kids should be encouraged to do things with their lives outside of school/work and they need role models for this. \n\nThe whole reason we have things like classical music, art, literature, competitive sports, etc, is because someone decided to do something with their time.  \n\nIf you can fit drugs into an active lifestyle by all means kudos.  From my personal experience seeing people around me, drugs [and yes I mean alcohol too] tends to bring people down.  ", "gilded": 0, "created_utc": "1319729998", "subreddit": "canada", "score": 0, "controversiality": 0}
{"body": "&gt;I do want to raise the notion that maybe people shouldn't be advocating drug use. Just because it might become legal someday doesn't mean we should talk positively about drug use [and abuse].\n\nNobody is advocating drug use here, much like nobody is advocating the use of alcohol either. \n\nWe are advocating for an end to prohibition - I'm sure you understand the reasons for this.\n\n&gt;Kids should be encouraged to do things with their lives outside of school/work and they need role models for this.\n\nKids are already encouraged to do things with their lives outside of school. What does this have to do with a discussion about ending marijuana prohibition?\n\nIf it is legalized and regulated like alcohol, it would likely only be on sale to people over 19.\n\n&gt;The whole reason we have things like classical music, art, literature, competitive sports, etc, is because someone decided to do something with their time.\n\nWhat people do instead of participating in activities such as classical music, art, literature, competitive sports, etc. is **none of your business.**\n\nOn another ironic note, I tend to enjoy classical music, art, literature and sports after a nice trees session.\n\n&gt;If you can fit drugs into an active lifestyle by all means kudos.\n\nThank you.\n\n&gt;From my personal experience seeing people around me, drugs [and yes I mean alcohol too] tends to bring people down.\n\nFrom my personal experience, seeing people around me, a nice bowl of trees tends to make people feel happier about their day! \n\nI would suggest that you read and understand the myriad of scientific studies on marijuana before jumping on conclusions based on anecdotal evidence.", "gilded": 0, "created_utc": "1319731474", "subreddit": "canada", "score": 2, "controversiality": 0}
{"body": "It's not the masturbation, per se. It's the pornography that kids of such an age watch out of curiosity. This is very desensitizing to them, and as my own guardians told me [way too] many times during my life, 'pornography is degrading to a child of your age.'  \nThis always scared me so I didn't watch it.  \n\nEdit: Ehehe, look when it was [posted](http://4stor.com/e7c2e7490104b96f7499829c2da0970a).  `#immature`", "gilded": 0, "created_utc": "1319859483", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Nice list. I enjoy folk. My girlfriend made an [excellent list for folk too](http://open.spotify.com/user/its_december/playlist/0DgxRsz4ndZ2UNOldfZqEP), if you're interested: \n\n", "gilded": 0, "created_utc": "1320060720", "subreddit": "spotify", "score": 1, "controversiality": 0}
{"body": "[In the same subreddit, too](http://www.reddit.com/r/politics/comments/loqe4/google_received_multiple_requests_from_law/)", "gilded": 0, "created_utc": "1320075798", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "Crabs molt [too](http://www.youtube.com/watch?feature=player_detailpage&amp;v=4QIgW639Oog#t=55s). ", "gilded": 0, "created_utc": "1320085357", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "[](/rdshadowbolt)[OooooOOOoOOOooo](http://www.reddit.com/r/mylittlepony/comments/lv38m/spooktacular_halloweenmotes_ooooooooooooooo/)", "gilded": 0, "created_utc": "1320102305", "subreddit": "mylittlepony", "score": 4, "controversiality": 0}
