{"body": "Can you link to one of the comments in question?\n\nI've found that often what's written just doesn't come across the way it was intended.  [though there are plain ol' jerks too]\n\nEDIT:  I found your comment about the psychologist...  I wonder if that was voted because it looked commercial to someone?  [ie, people aren't disagreeing with you, they're saying they don't want to see advertisements in the comments]", "gilded": 0, "created_utc": "1257055027", "subreddit": "Christianity", "score": 4, "controversiality": 0}
{"body": "[Bernie was also dead the whole time.](http://en.wikipedia.org/wiki/Weekend_at_bernies)\n\n[Nicole Kidman was dead the whole time too](http://en.wikipedia.org/wiki/The_Others_%282001_film%29)", "gilded": 0, "created_utc": "1257296467", "subreddit": "fffffffuuuuuuuuuuuu", "score": 2, "controversiality": 0}
{"body": "[Michigan Ave.](http://www.themagnificentmile.com/) with holiday lights is quite nice and walking it is free.\n\nThe [Lincoln Park Zoo](http://www.lpzoo.org/) is also free, might be a bit cold for you, but they will have lights and animals (i imagine the big cat house and ape exhibit will be heated for a break from the weather).\n\nI'd recommend getting a drink at the [Signature Lounge](http://www.signatureroom.com/) (much cheaper than than dinner at the attached Signature Room and cheaper than the tour), but the age thing again...\n\nI'll think of more and get back to you.", "gilded": 0, "created_utc": "1257811221", "subreddit": "chicago", "score": 6, "controversiality": 0}
{"body": "Well some robbers are [pretty cool too](http://www.reddit.com/r/WTF/comments/a48tb/robbers_tie_up_adults_steal_their_stuff_but_only/), but you wouldn't leave your baby alone at home at their mercy, would you?", "gilded": 0, "created_utc": "1258257131", "subreddit": "WTF", "score": 8, "controversiality": 0}
{"body": "From my own experience, there's no single standard, but what criteria a women does exercise is usually very targeted (which explains the data).  IMO, positive past experiences with male role-models, familial and romantic, seems to be a large part of it.\n\nJust about anything can be a 'trigger' for attractiveness: haircut, beard/no beard, nose shape, jawline, eye shape, overall build, percentage body fat, smell, sound of your voice, type of cologne worn, etc.  Beyond the physical there are social aspects like wordsmithing, body language, personal interests, and choice in friends.  In other words: it's anything but fair for competition, and not something you can work towards all that much, unlike what women can do to become \"more attractive\" in the general sense.  So all a man can do in this environment is be one's self and cast a huge net.\n\nThen there's the [research](http://www3.interscience.wiley.com/journal/118598235/abstract?CRETRY=1&amp;SRETRY=0) that suggests that women look for one of two different types of men, based on facial indications of overall masculinity/femininity, depending on whether they're looking to settle down or not.\n\nEdit: Apparently, the phase of the [menstrual cycle plays a role too](http://www.sciencedirect.com/science?_ob=ArticleURL&amp;_udi=B6WGC-4NB99J2-1&amp;_user=10&amp;_rdoc=1&amp;_fmt=&amp;_orig=search&amp;_sort=d&amp;_docanchor=&amp;view=c&amp;_searchStrId=1100822919&amp;_rerunOrigin=google&amp;_acct=C000050221&amp;_version=1&amp;_urlVersion=0&amp;_userid=10&amp;md5=d65174157c31ce55e1d671d19d86d3c1).\n\nAnyway, all this adds up to a very discrete, and inconsistent, selection criteria.  As others have mentioned, this explains the data in the article.", "gilded": 0, "created_utc": "1258644672", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Sorry for the thread dig. I was looking at this again, and noticed your comment. Donnelly does speak pretty openly about being a voluntaryist on the blog, and has some good insights there as well.  He [is a redditor too](http://www.reddit.com/user/georgedonnelly). I know no one else will probably ever see this, but thought I'd pass along that heads up.", "gilded": 0, "created_utc": "1258990299", "subreddit": "voluntarism", "score": 3, "controversiality": 0}
{"body": "It's okay, [Arnold did it too](http://www.youtube.com/watch?v=_wk-jT9rn-8) once.", "gilded": 0, "created_utc": "1259417764", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
