{"body": "&gt;Kepler science team leader William Borucki announced that **Kepler has already logged more than 100 transiting-planet candidates**, *but he said most of these will probably prove to be false alarms once followups are done by other methods*. The team did release detailed information on five fully confirmed Kepler exoplanets that were discovered in **just the first 43 days of data-taking last May and June, following the mission's launch last March**. In these cases, radial-velocity measurements made by ground-based observatories showed the transiting objects to have planet-like masses, based on their stars' slight wobbles due to the planets' gravitational influence.\n\nand the Kepler spacecraft w/ its 95-megapixel photometer fed by a 36-inch scope [looks pretty damn cool too](http://media.skyandtelescope.com/images/Kepler+art.jpg). but then again, i think anything in space finding exoplanets looks pretty dang cool.", "gilded": 0, "created_utc": "1262656716", "subreddit": "science", "score": 2, "controversiality": 0}
{"body": "You can [roll your own e-book too](http://www.mobipocket.com/en/DownloadSoft/DownloadCreator.asp) using the free Mobi converter.", "gilded": 0, "created_utc": "1262750808", "subreddit": "technology", "score": 2, "controversiality": 0}
{"body": "[Check out the 250m pixel resolution version too](http://rapidfire.sci.gsfc.nasa.gov/gallery/?2010007-0107/GreatBritain.A2010007.1150.250m.jpg)\n\nwow.\n", "gilded": 0, "created_utc": "1262900586", "subreddit": "unitedkingdom", "score": 10, "controversiality": 0}
{"body": "[Check out the 250m pixel resolution version too](http://rapidfire.sci.gsfc.nasa.gov/gallery/?2010007-0107/GreatBritain.A2010007.1150.250m.jpg)\n\nwow.", "gilded": 0, "created_utc": "1262947824", "subreddit": "environment", "score": 10, "controversiality": 0}
{"body": "[NOLSie here too]", "gilded": 0, "created_utc": "1262965529", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "I'm worried my account will be flagged as a spammer if I suck this particular cock any harder on reddit, but [World of Goo](http://store.steampowered.com/app/22000/) is also great on a tablet. (I'm sure most point-and-click games are).", "gilded": 0, "created_utc": "1263258299", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "If you're looking for hosting on the cheap side, check out http://prmgr.com. Their $/ram is pretty much the lowest you'll find for vps's. They don't have the CPU punch that linode does, but that's pretty irrelevant if all you're doing is hosting up webpages. He's a [redditor too](http://www.reddit.com/user/lsc)\n\nOnly problem is that there's a waiting list for new VPS's due to high demand. Very much worth it though.", "gilded": 0, "created_utc": "1263277551", "subreddit": "web_design", "score": 1, "controversiality": 0}
{"body": "[Turns out we've been drawing the map upside down this whole time too](http://www.wall-maps.com/World/upsideDownMap.jpg)", "gilded": 0, "created_utc": "1263349878", "subreddit": "history", "score": 0, "controversiality": 0}
{"body": "[I had to create a irrlicht reddit too](http://www.reddit.com/r/irrlicht/)", "gilded": 0, "created_utc": "1263365556", "subreddit": "IndieGaming", "score": 1, "controversiality": 0}
{"body": "What are you talking about??? You seem to be the one who believes in the \"I-Was-Only-Following-Orders\" rationale; not I. I believe in holding people accountable. I believe that Bush and Dick Cheney should be tried for war crimes, that the men who physically carried out the orders should be tried, and that the apologists [like Mr. Yoo] who aided and abetted patently illegal acts should be tried. I'm the one arguing for accountability. If you're for exonerating Yoo, then it is YOU who believe in the \"only-following-orders\" rationale. \"He didn't physically do any of the torturing\" seems to be your excuse. Well, Mr. Hitler didn't *physically* kill any Jews, either. The men who call the shots and give the orders actually have *more* culpability, not less. You seem to want to scapegoat the smallfry and protect the mob-bosses. \"Well, they didn't *physically* do any of the torturing\". If Mr. Yoo were tried under the Nuremberg standard, he'd have been hanged by now. He's a soulless monster and a piece of human garbage.", "gilded": 0, "created_utc": "1263673137", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "As a cruel inside joke with myself, I did the same. The joke wasn't the fact that he got a tattoo that was my phone number in AAANNNXXXX format, but what is actually was. lo and behold, [the tattoo](http://markmallett.com/blog/wp-images/Holocaust_tattoo.jpg) (it's of the type of tattoo he got, all numbers, but I did it for the day I'd have to euthanize him if he didn't die in his sleep or comfortably etc)", "gilded": 0, "created_utc": "1264095956", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "[holy shit i did it too](http://imgur.com/8tKGQ.jpg)", "gilded": 0, "created_utc": "1264470256", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "I'm 46 [don't laugh, you're getting old too] and I very very clearly remember the Carter administration.  I recall being surrounded by Southern conservatives like my grandfather, uncles and aunts, neighbors, etc., and rarely did I hear anyone say really negative things about him the way people do now about Clinton and Obama.  I remember my grandfather in particular, a well liked multi-term Republican county commissioner in NC, saying \"I don't think he's a bad man, I think he has a good heart, but I just don't think he's a good president.\"\n\nMy parents, on the other hand, actually agreed with the 55 mph speed limit, the turning down of the thermostats and dressing warmer, and some of the other things that weren't too popular.  They didn't like the super high interest rate on their mortgage that they got on our house in SC in 1979, but I don't recall them blaming the president for all things financial (and by the way, even though they were both teachers for most of their careers, at this time they were both working for AG Edwards &amp; Sons as brokers).\n\nAfter carter lost the 1980 election, I was particularly impressed with my life-long Southern conservative Republican grandfather's appreciation for Carter's humanitarian efforts and international peace missions. I wonder what he'd think of Obama today?", "gilded": 0, "created_utc": "1264544354", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "[Hannity apologized to Stewart, too](http://www.youtube.com/watch?v=y8HeJuBcI3Y).\n\nStewart: Don't apologize to *ME*...", "gilded": 0, "created_utc": "1264551732", "subreddit": "entertainment", "score": 42, "controversiality": 0}
{"body": "reddit should really dedicate a whole calendar to [sezypoo](http://reddit.com/user/sezypoo).  \nwouldn't you order that one?", "gilded": 0, "created_utc": "1264886869", "subreddit": "gonewild", "score": 2, "controversiality": 0}
