{"body": "Wrong.  This was debunked last year.  It's the result of sloppy research, that's all. \r\n\r\nhttp://www.factcheck.org/askfactcheck/does_rahm_emanuel_pay_property_taxes.html \r\n\r\n\"Not only does White House Chief of Staff Rahm Emanuel pay his property taxes, but he pays them in advance. Property taxes for the first half of 2008 were due on Tuesday, March 3, 2009. Emanuel paid his on February 23. Last year, he paid $13,022.60 in taxes on his home.\" \r\n\r\nGet a fookin life. \r\n", "gilded": 0, "created_utc": "1241473046", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "So now the idjit has an  update, claimning that it's not true because Media Matters is funded by Annenberg so THEY'RE LYING!!!1!ELEVENTY11! \r\n\r\nI 'spect he added that after I TRIED to post a comment pointing out the debunking.  Of course, he deleted my comment so I'm posting my own followup here as well.  \r\n===========================================\r\n\r\nHAHAHAHHAA \r\nDebunked not only by the uberliberal Annenbergs O NOES! THE ANNENBERGS!!! but also by \r\nthe Cook County Tax Assessor:\r\n+++++++ \r\n1) The tax bill IS listed where the Emanuel home is located. They are on two lots.\r\n\r\n2) By “for tax purposes,” I mean that this is the location associated with the PIN. But it’s the same property.\r\n\r\n3) Yes, it was inaccurate to say that. Because it is the same house. It was listed in our records — and the Treasurer’s records — under a different address. Had you contacted either office to check this out, we could have told you that.\r\n\r\n4) It would be highly misleading and irresponsible for you to say that, because we don’t assess property by address – we do it by PIN. And we do it because addresses change and get combined all the time, when owners divide and combine lots. Apparently, with this property, a previous owner had taken three lots and turned them into two.\r\n\r\nLet me make one further point: Before posting this “story,” neither you nor anybody from the Illinois Review made an effort to contact the Assessor’s office to verify it. As a former newspaper reporter, I find this shocking.\r\n\r\nEven after learning, when I emailed you at 10:46 this morning, that there were factual problems with the story, you kept it on your web site. Moreover, you deleted my effort to correct the story from the “comments” section. I’d be keenly interested in hearing your justification for this conduct.\r\n++++++\r\n\r\nI'll add his actual tax record but I admit it's not the vault copy. \r\nhttp://www.sangamonwatercolor.org/cap/rahmbillpaidfull.jpg\r\n\r\nOh, it's too fookin easy.  Do you pwn yourself every day? BWAHAHABWAHA \r\n\r\nPS - Now that thius is linked on reddit, you can read my same comments over there. Deleting them here doesn't help, idjit. ", "gilded": 0, "created_utc": "1241475290", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "What good have you been to me? I deem you wothless.", "gilded": 0, "created_utc": "1241518165", "subreddit": "worldnews", "score": 8, "controversiality": 0}
{"body": "If ye doont wanna end oop a ryte fatteh like meh, stoop ittin the fookin behkin, mate!", "gilded": 0, "created_utc": "1242243419", "subreddit": "Bacon", "score": 10, "controversiality": 0}
{"body": "\"Excuse me, I need to ASS you a few questions.\"\n\nGreatest movie. Ever. Well not really, but fookin' hilarious.", "gilded": 0, "created_utc": "1242374912", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "stupid trendy shite, Python, Pearl, Ruby,Haskell,Ruby with fucking bells and little hat. Just fookin write in C/C++ and stop messin about.", "gilded": 0, "created_utc": "1242427267", "subreddit": "programming", "score": -17, "controversiality": 0}
{"body": "yeah... fookin' ads", "gilded": 0, "created_utc": "1242783170", "subreddit": "youtube", "score": 1, "controversiality": 0}
{"body": "Looks fooking fantastic.  ", "gilded": 0, "created_utc": "1243060394", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "What?! Yea, \"World at War\" sucked, but Modern Warfare is dope and MW2 looks fookin awesome", "gilded": 0, "created_utc": "1243473894", "subreddit": "videos", "score": 1, "controversiality": 0}
