{"body": "lissen u fokker my vids r fookin sic", "gilded": 0, "created_utc": "1230127741", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "Oh... this blog makes me happy.  Spurious quotation marks drive me fookin' insane!  Arrrrrgh!", "gilded": 0, "created_utc": "1230208754", "subreddit": "geek", "score": 3, "controversiality": 0}
{"body": "Brilliant! Taken with the spirit intended. Let this be the zero vote four thousand comment drunken late night comment thread. \n\nP.S. Is it only Redditors who are so compulsive about spelling correctly that we'll backspace fifty fooking times and take twelve minutes to type one paragraph because we'd rather just not have one bloody typo in the whole fookin post?", "gilded": 0, "created_utc": "1230278277", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "that is a fooking nice rack to say the least.", "gilded": 0, "created_utc": "1228747095", "subreddit": "nsfw", "score": 1, "controversiality": 0}
{"body": "I believe that the missing component in this is a FOOKIN JOB!\n\nI buy and sell things.  I have never before had any trouble making enough money to meet my needs and to put some aside.  Now I am drawing on my \"put aside\" money.  It sux.  There are plenty who have no \"put aside\" money.  They also have no jobs.  The suck is only going to get worse.  ", "gilded": 0, "created_utc": "1228885944", "subreddit": "economy", "score": 3, "controversiality": 0}
{"body": "Trailer premiere dates, now trailer fookin' breakdowns. I'm a huge comic book/X-Men fan and eagerly awaiting this movie, but what the fuck man it's just a movie, goddamn.", "gilded": 0, "created_utc": "1229488166", "subreddit": "movies", "score": 1, "controversiality": 0}
{"body": "Cheeky cunts.\n\nI don't remember Iceland bothering about International Law when they went from 6km of sea for fishing rights to 250km which put whole British communities into the scrap-heap.\n\nThere is a lot of sympathy in the UK for Iceland but try this shit while the UK is struggling too, and that will change. ", "gilded": 0, "created_utc": "1229519495", "subreddit": "worldnews", "score": 0, "controversiality": 0}
