{"body": "I thought it was shit like wrestling instead of SGU, but hey, it guess it's not actually SciFi anymore right?\n\nfookin idiots. \n", "gilded": 0, "created_utc": "1296553604", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Initially I thought \"ouch\"... soar?\n\n/pedant\n\nps - Yes, it's fookin' awesomes!", "gilded": 0, "created_utc": "1296556470", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "Well I live in England, may have to start some Lizard smuggling...this time next year I'll be a millionaire!.....but seriously, that's pretty fooking cool.", "gilded": 0, "created_utc": "1296581757", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Fookin' Ellis Island.", "gilded": 0, "created_utc": "1296666068", "subreddit": "funny", "score": 12, "controversiality": 0}
{"body": "**R E D U N D A N C Y**\n\nedit: fookin' phones", "gilded": 0, "created_utc": "1296671988", "subreddit": "AskReddit", "score": 19, "controversiality": 0}
{"body": "Fookin Prawns!", "gilded": 0, "created_utc": "1296737098", "subreddit": "IAmA", "score": 200, "controversiality": 0}
{"body": "Fookin' prawns, eh?", "gilded": 0, "created_utc": "1296739932", "subreddit": "IAmA", "score": 9, "controversiality": 0}
{"body": "Fookin' pr0ns...\r\n\r\nAlso, use that Glock to get rid of that Mac.", "gilded": 0, "created_utc": "1296742552", "subreddit": "guns", "score": 2, "controversiality": 0}
{"body": "Fookin' prawn.", "gilded": 0, "created_utc": "1296762215", "subreddit": "shittyadvice", "score": 24, "controversiality": 0}
{"body": "**FOOKIN' PRAWNS!!**", "gilded": 0, "created_utc": "1296766555", "subreddit": "shittyadvice", "score": 2, "controversiality": 0}
{"body": "You're probably thinking poopdonor.net, maybe crapfactory.org, an Organization domain name, might work better for your needs.\n\nLet's not all forget what happened with www.penisland.com, either. I got really stoked when I heard there was an honest to god website named \"Penisland Dot Com\" at first, thinking, HA! HA! ( but not in a gay way, if you know what I mean )\n\nBut then, I open up Firefox, go to www.penisland.com and, Lo &amp; Behold, what do I get? \n\nFookin' \"Pen Island\". Me! LASER_PEN! I go *looking* for dicks, just this **one time** kinda thing, on the internet, JUST THIS ONCE, and I get freakin' fookin' PEN ISLAND instead.\n\nServes me right I suppose.", "gilded": 0, "created_utc": "1296817060", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "You should make a slew of tweets violently opposing some made up issue, like mutants or prawns.\n\nfookin' prawns.", "gilded": 0, "created_utc": "1296833061", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Well, what **I** do, in the morning, especially if I'm pressed for time as I sometimes am, is this. Coffee::Creamer -&gt; pragma-&gt;creamer-&gt;sugarbomber-&gt;FULL_THROTTLE=enabled or whatever.\n\nThen when I stop by good old Bob's Java Hut in Uptown it doesn't matter to me as much if Han Solo was killed that morning attempting to save Leia from being gang-Sithed by Jabba and his V-alien-series monitor-lizards-disguised-as-humans minions. \n\nAlso, then, it's easier to accept the negotiated truce that myself, my family, Toby Lucient, and Jack Merlot have made with the Shrike agents currently causing random Nightmare Fuel Domesday Celebrations here and there worldwide, because, obviously, I shouldn't be **afraid** of the Shrike.\n\nNope. At least, that's what Jack says. He says the Shrike are \"...valuable trading partners in the worldwide race to acquire the most sophisticated forms of advanced, surgically accurate, precision munitions, as well as the other associated advanced technologies that the Shrike use in order to *stop* interplanetary warfare from breaking out across the galaxy...\"\n\nAnd, well, if that's what Jack Merlot says, I'm pretty much DONE ARGUING WITH THAT GUY AND RECOMMEND THAT YOU ALSO DESIST AS WELL UNLESS YOU WANT A VISIT FROM THE TOOTH FAIRY OR WHATEVER.\n\n*fookin' prawns.*\n", "gilded": 0, "created_utc": "1296843121", "subreddit": "gaming", "score": 2, "controversiality": 0}
{"body": "Reminds me of the blackout of 2003. The first place I go was to the LCBO (ontario governed liquor store) and sure enough there's a fookin lineup!", "gilded": 0, "created_utc": "1296857628", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "dats fookin stoopid. That doesnt even make sense I dont even", "gilded": 0, "created_utc": "1296943863", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "FOOKIN PRAWNS", "gilded": 0, "created_utc": "1296959422", "subreddit": "funny", "score": 3, "controversiality": 0}
{"body": "I fookin' love that film :D", "gilded": 0, "created_utc": "1296995267", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Dats Fookin Stoopid", "gilded": 0, "created_utc": "1297009609", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Fooking prawns", "gilded": 0, "created_utc": "1297087504", "subreddit": "videos", "score": 8, "controversiality": 0}
{"body": "I really enjoyed watching District 9 but I would've liked the movie a lot more if it had been more like this short-film. That is, they should have focused a little bit more on where the real issue is how some folks see people different from them as if they belong to another species (the *Fookin' prawns* from District 9 can be compared to the *Tutsi cockroaches* from Hotel Rwanda).\r\n\r\nWhile this was done effectively in the first half of the film, the second half turned into an average brainless action-flick with a villainous-looking villain being overcome by an unlikely yet likable hero with the help of a resourceful friend and his kid. This demoted District 9 from becoming one of the best movies I've watched to the level of a very well made alien movie.", "gilded": 0, "created_utc": "1297090535", "subreddit": "videos", "score": 8, "controversiality": 0}
{"body": "Fookin bad ass. ", "gilded": 0, "created_utc": "1297099157", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Holy Crap, the Whip In!! Still goin' strong? Fookin sweet...", "gilded": 0, "created_utc": "1297107151", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I pay my private tracker for bandwidth, as I can't share enough with my connection to DL everything I want.\n\nThen I use said bandwidth to DL more fookin prawn.", "gilded": 0, "created_utc": "1297113238", "subreddit": "nsfw", "score": 2, "controversiality": 0}
{"body": " you fooking prawn!!!", "gilded": 0, "created_utc": "1297119436", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Hopefully those who went to anger were wearing their fookin seat belts", "gilded": 0, "created_utc": "1297145292", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "fooking **hawt**\n\nknowing Joss Whedon I know he'll fuck this up with some kind of feminist message or something, but at least it will be (hopefully) fapable", "gilded": 0, "created_utc": "1297166380", "subreddit": "movies", "score": 0, "controversiality": 0}
{"body": "&gt;Seriously? But you think \"My theory is that you atheists are in this particular subreddit talking about how sure you are in your lack of faith because, deep down, you know Christianity is truth\" is a completely valid argument? One given without any basis whatsoever? What am I supposed to respond to? And how? What answer would suffice?\n\nExactly what I mean. You are criticized and so you try to deflect the criticism to someone and/or something else. How daft are the people you usually associate with?\n\nIt's a red herring because it's completely fooking different to what you were responding to. That's what a red herring is defined as. It doesn't matter if you want to redefine it. And really? You're going to try the \"oh, um I was joking so you cant disagree with me,\" bullshit?", "gilded": 0, "created_utc": "1297175854", "subreddit": "Christianity", "score": -1, "controversiality": 0}
{"body": "&gt;Exactly what I mean. You are criticized and so you try to deflect the criticism to someone and/or something else.\n\nI wasn't \"criticized\", I was judged based on a misunderstanding of what I actually wrote. He made a mistake, and proceeded to base his entire argument on something I never actually said. Me trying to correct _him_ isn't a \"red herring\".\n\n&gt;How daft are the people you usually associate with?\n\nAh, the kind words of a True Christian :)\n\n&gt;It's a red herring because it's completely fooking different to what you were responding to.\n\nThe word is \"fucking\". This is the internet, not prime-time TV. And no, it's not different. It's completely fucking relevant. It's even the _same argument_. I'm just showing him the faults in his logical process by replacing _his_ belief in God with anyone else's belief in any other deity. If you can't grasp that, you are in no position to call anyone else \"daft\".\n\n&gt;And really? You're going to try the \"oh, um I was joking so you cant disagree with me,\" bullshit?\n\nNo, because I have absolutely no problem with anyone disagreeing with what I've said. I just like it if, when they do, they do so based on what I _actually_ said, not what they mistakenly _think_ I said. There's a distinct difference between the two, don't you think?", "gilded": 0, "created_utc": "1297177324", "subreddit": "Christianity", "score": 3, "controversiality": 0}
{"body": "When you say you do know, to quote a comedian who's name I can't remember, \"Get in the fookin' sack\".", "gilded": 0, "created_utc": "1297192486", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "&gt;I wasn't \"criticized\", I was judged based on a misunderstanding of what I actually wrote. He made a mistake, and proceeded to base his entire argument on something I never actually said. Me trying to correct him isn't a \"red herring\".\n\nYeah that's often referred to as \"being criticized\" moron.\n\n&gt;Ah, the kind words of a True Christian :)\n\nYet another wonderful example of shitty logic. The ol' \"I disagree with you, therefore Christian,\" statement made by many idiots on here.\n\n&gt;The word is \"fucking\". This is the internet, not prime-time TV. And no, it's not different. It's completely fucking relevant. It's even the same argument. I'm just showing him the faults in his logical process by replacing his belief in God with anyone else's belief in any other deity. If you can't grasp that, you are in no position to call anyone else \"daft\".\n\n[The word was spelled as I intended moron](http://en.wiktionary.org/wiki/fooking). It isn't a logical response it's a deflection. That's a red herring. Nice and similar to the straw men you also like to attack but critically different in that at least with a straw man you make it look like you answered. If someone asks you what your favorite color is and you answer with \"Oh I think we should talk about the spectrum of colors and why you don't like those,\" that's a fucking red herring and it's stupid and it's just what you did. But of course you won't admit it. Don't you know 90% of people in gaol are innocent?\n\n&gt;No, because I have absolutely no problem with anyone disagreeing with what I've said. I just like it if, when they do, they do so based on what I actually said, not what they mistakenly think I said. There's a distinct difference between the two, don't you think?\n\nObviously you do since you cry so much about it. Here's a hint if you want people to focus on what you said don't post-facto try to say it was a joke. Also don't answer a question with a question. If you feel the need to post then actually respond directly to what you quoted. Not too bright are you?", "gilded": 0, "created_utc": "1297195936", "subreddit": "Christianity", "score": -1, "controversiality": 0}
{"body": "Hey I never said we didn't... I fookin love watermelon and (real) rap music too, how u luv dat?", "gilded": 0, "created_utc": "1297279312", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "It is made of 550 cord, so you can unwind it and have some \"Fookin' rope\" handy. Although 90% of people wearing that are just trying to look cool and are being stupid, as the store bought 550 wrist bands would take some time to unwind, and most soldiers are smart enough to carry a bag of 550 cord in their packs instead.", "gilded": 0, "created_utc": "1297315117", "subreddit": "gaming", "score": 4, "controversiality": 0}
{"body": "Life without parole.  Piracy is serious fookin business, so I hope you're not considering it.  ", "gilded": 0, "created_utc": "1297356447", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "Public, verifiable proof of some kind.\n\nI don't have to see it for myself, but if the news reports a giant spaceship hovering over Johannesburg, and every South African on twitter was going nuts about it, then maybe I'd entertain the thought that there's some fookin' prawns over there.\n\nBasically, news conferences, scientist verifications, etc.", "gilded": 0, "created_utc": "1297367484", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "I would argue that the Irish plight is very comparable to the Indians ordeal.  There was no famine in Ireland, just a lack of potatoes, but the English were essentially stealing everything and starved millions of Irish to death, which was a systematic ethnic cleansing, in a sense.  In addition to starvation and cold blooded murder the English also raped their culture making elements of Irish identity illegal.  \n\nAlso, as wallychamp pointed out, it's not the Irish, it's the Fighting Irish.  It doesn't bother me because I know it wasn't meant to be cruel, but I think it is arguable that calling them the \"Fighting Irish\" takes away a lot of the good things about Irish culture and portrays a very \"Yah I'm fookin' good and pissed, give me mah shillelagh and I'll bash out yous fookin' brains.\"", "gilded": 0, "created_utc": "1297374025", "subreddit": "sports", "score": 3, "controversiality": 0}
{"body": "fookin prawns", "gilded": 0, "created_utc": "1297389414", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "It's more like \"Fookin'\", but yeah.", "gilded": 0, "created_utc": "1297416229", "subreddit": "canada", "score": 1, "controversiality": 0}
{"body": "I've never heard a Canadian say 'fookin' when they meant 'fucking'. Another stereotype I really never understood. But I am from Ontario and not out east. Fookin just sounds stupid to me.", "gilded": 0, "created_utc": "1297438643", "subreddit": "canada", "score": 2, "controversiality": 0}
{"body": "In Ottawa we use a fookin arrow to say \"hey how aboot you make your left turn there before we go straight true the intersection there?\"\n\nNo confusings aboot it.", "gilded": 0, "created_utc": "1297449398", "subreddit": "canada", "score": 6, "controversiality": 0}
{"body": "Fookin' prawns!", "gilded": 0, "created_utc": "1297453470", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "FOOKIN PRAWNS", "gilded": 0, "created_utc": "1297460802", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Let me guess... You sunk my fookin battleship?", "gilded": 0, "created_utc": "1297468166", "subreddit": "gaming", "score": 3, "controversiality": 0}
{"body": "Holy WTF. I don't like them fookin flamingos anymore!", "gilded": 0, "created_utc": "1297477370", "subreddit": "WTF", "score": -3, "controversiality": 0}
{"body": "I want that fooking BOW!", "gilded": 0, "created_utc": "1297560075", "subreddit": "nostalgia", "score": 2, "controversiality": 0}
{"body": "I fookin 'ate piekeys.", "gilded": 0, "created_utc": "1297578648", "subreddit": "reddit.com", "score": 12, "controversiality": 0}
{"body": "But, Die Antwoord is fookin' addictive.", "gilded": 0, "created_utc": "1297588657", "subreddit": "metametacirclejerk", "score": 2, "controversiality": 0}
{"body": "FOOKIN' PRONS!", "gilded": 0, "created_utc": "1297628146", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "\"Why the fook'd I wanna caravan's got na wheels?\"\n\n\"Ah you sneaky fookin' prowns!\"", "gilded": 0, "created_utc": "1297645899", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "And in *District 9* the fookin prawns went to South Africa.\n\nEDIT: Had written 13 by mistake, changed it to 9. It's hard to keep track of so many districts.", "gilded": 0, "created_utc": "1297664579", "subreddit": "scifi", "score": 10, "controversiality": 0}
{"body": "I fookin' luv it. \n\nDidn't watch it until about a year after it first aired. Very glad I did.\n\nGood old 4od.", "gilded": 0, "created_utc": "1297713447", "subreddit": "BritishTV", "score": 2, "controversiality": 0}
{"body": "Shniken is a FOOKIN QUEEEAH!!", "gilded": 0, "created_utc": "1297729987", "subreddit": "OneY", "score": -17, "controversiality": 0}
{"body": "I was being ironic. In the UK our typical northern thugs will scream \"fookin quueah\" and \"more than three shakes is a wank\" etc.\n\nBefore you judge, try to understand.", "gilded": 0, "created_utc": "1297794203", "subreddit": "OneY", "score": 0, "controversiality": 0}
{"body": "FOOKIN PRAWNS,MATE", "gilded": 0, "created_utc": "1297809801", "subreddit": "funny", "score": 10, "controversiality": 0}
{"body": "That's a FOOKING HUGE BABY!", "gilded": 0, "created_utc": "1297816746", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "fucking savages, what else did you expect? nothing says 'we are just a retarded mob and not freedom fighters fighting for democracy' as gang rape.\n\n&gt; \"**83** percent of women experienced harassment - and that 98 percent of foreign women visitors did. And 62 percent of men admitted to perpetrating it.\"\n\nhooray for Egypt, there's a country that fights for freedom indeed!!\n\nand that Lara Logan is fooking **hawt**, wow.\n\nand about the comments about how female journalists should go to dangerous places like that =&gt; THEY ARE FUCKING RIGHT. it's sad, but it's correct. I'm not saying the rapists or agressors are right, but this shit **does happen**. is it worth to get a cute girl saying the news instead of a dude and risking her ass? No, it isn't.", "gilded": 0, "created_utc": "1297855234", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Depends. Are they fookin' prawns? ", "gilded": 0, "created_utc": "1297879840", "subreddit": "AskReddit", "score": 20, "controversiality": 0}
{"body": "Sookin' and fookin' prawns.", "gilded": 0, "created_utc": "1297893408", "subreddit": "AskReddit", "score": 16, "controversiality": 0}
{"body": "What's the feckin matter wid ya, ye fookin gobshite?", "gilded": 0, "created_utc": "1297895457", "subreddit": "funny", "score": 25, "controversiality": 0}
{"body": "\"Fookin prawns\" you mean. Maybe even prawnz, but not prawins. Sorry mate.", "gilded": 0, "created_utc": "1297898476", "subreddit": "pics", "score": 6, "controversiality": 0}
{"body": "Sneaky fookin' prawns, eh?", "gilded": 0, "created_utc": "1297901188", "subreddit": "pics", "score": 19, "controversiality": 0}
{"body": "\"What did you say?\"\n\n\"Prawins. I said fookin' prawins.\"\n\n\"Why are you putting so much emphasis on the 'I'?\"\n\n\"What? I'm just saying fookin prawins. I wish they'd deport these fookin prawins.\"\n\n\"What small crustacean do you commonly find in fried rice?\"\n\n\"Prawns, of course.\"\n\n\"Now say 'Prawn'\".\n\n\"Prawin.\"\n", "gilded": 0, "created_utc": "1297903200", "subreddit": "pics", "score": 15, "controversiality": 0}
{"body": "FOOKIN PRAWNS", "gilded": 0, "created_utc": "1297905760", "subreddit": "pics", "score": 68, "controversiality": 0}
{"body": "Fookin' awesome!", "gilded": 0, "created_utc": "1297911464", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "fookin prawns", "gilded": 0, "created_utc": "1297914142", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "no, i'm looking for your brother FOOKIN\nsorry for the mix up.\n", "gilded": 0, "created_utc": "1297978228", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "This was my experience too.  Healed from Vanilla thru wotlk Naxx and then in Ulduar decided to try out Clique.  It took about a week to get used to and then it was a world of difference.\r\n\r\nReally, *instincts* make a good healer.  Addons help add efficiency so that a good healer becomes a great healer.", "gilded": 0, "created_utc": "1297979683", "subreddit": "wow", "score": 3, "controversiality": 0}
{"body": "fookin' perv. is into bestiality as well I'd guess. *vomits", "gilded": 0, "created_utc": "1297998198", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "If you need to know the level of popularity of some music to decide that you like it or not... You're not a hipster, you'ze just a fooking tool of the worst kind, the holier than thou tool...", "gilded": 0, "created_utc": "1298033634", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "It's a fookin' PRAWN!", "gilded": 0, "created_utc": "1298034243", "subreddit": "reddit.com", "score": 6, "controversiality": 0}
{"body": "&gt;Throw a fookin prawn on the barbie\n\nFTFY", "gilded": 0, "created_utc": "1298036361", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "I would never have intercourse with a fookin' creature...", "gilded": 0, "created_utc": "1298122285", "subreddit": "scifi", "score": 2, "controversiality": 0}
{"body": "FOOKIN PRAWNS!", "gilded": 0, "created_utc": "1298176319", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "jesus mary and joseph ireland has been thru fooking enoof already...", "gilded": 0, "created_utc": "1298206715", "subreddit": "politics", "score": 2, "controversiality": 0}
{"body": "Fookin' prawns!", "gilded": 0, "created_utc": "1298227466", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Fookin' penguins.", "gilded": 0, "created_utc": "1298276767", "subreddit": "pics", "score": 4, "controversiality": 0}
{"body": "Foo-Kin (All you can Foo Kin eat) http://www.fookinexpress.co.uk/\n\nAlso there's a restaurant named 'Thunderdome' near me - rather disappointingly it's not a Mad Max themed diner\n", "gilded": 0, "created_utc": "1298293897", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "E KIWD MEH NAYFUN.\n\nAM FOOKIN DED", "gilded": 0, "created_utc": "1298315362", "subreddit": "BritishTV", "score": 4, "controversiality": 0}
{"body": "Fookin gorgeous. Love the nipples.", "gilded": 0, "created_utc": "1298320305", "subreddit": "gonewild", "score": 4, "controversiality": 0}
{"body": "GIVE ME BACK MY JEWS\n\nedit: from the wikipedia entry:\n\n&gt; Neeson felt \"[Schindler] enjoyed fookin' [sic] with the Nazis.\n\n&gt; Spielberg said of Fiennes' audition that \"I saw sexual evil.\"\n", "gilded": 0, "created_utc": "1298346762", "subreddit": "todayilearned", "score": 2, "controversiality": 0}
{"body": "fookin?", "gilded": 0, "created_utc": "1298353750", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "Country A uses leverage B to achieve result C. \n\nALERT TEH MOTHAFOOKIN PRESSES NAO!", "gilded": 0, "created_utc": "1298391067", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Fookin' Prawns", "gilded": 0, "created_utc": "1298403190", "subreddit": "pics", "score": 123, "controversiality": 0}
{"body": "I did NOT have sex with one of those FOOKING creatures Eh?", "gilded": 0, "created_utc": "1298413760", "subreddit": "pics", "score": 0, "controversiality": 0}
{"body": "Tha caravan ain' got na fookin wheels.  The fook am I sposta do with a caravan tha ain' got na fookin wheels?", "gilded": 0, "created_utc": "1298428551", "subreddit": "todayilearned", "score": 1, "controversiality": 0}
{"body": "Fookin' prawns.", "gilded": 0, "created_utc": "1298454091", "subreddit": "askscience", "score": -3, "controversiality": 0}
{"body": "&gt;[A5.3](http://www.ofcom.org.uk/static/archive/oftel/publications/numbering/pers1001.pdf\"PDF\") In particular, the only services allowed to be used for the 070 range shall be Personal Numbering Services, which enable end users to be called using a single telephone number and to receive those calls **at virtually any telephone number**, including mobile numbers. The range of 070 numbers is suitable for end users who habitually move location.\n\n---\n\n&gt;A5.4 For the avoidance of any doubt, the 070 range shall not be used for Premium Rate Services.\n\nDo you live in the UK? I grabbed my phone ready to dial it until the **0** sprung out at me. If I had a PAYG SIM card I'd ring him now, but no fooking way am I giving my contract number to a spammer.\n\nAnd even with the ban on 070 numbers been used for PRS numbers, you still can be forwarded to *virtually any telephone number*. I wonder if you end up getting forwarded to some 419er in Nigeria. I'm tempted to go get a throw away card for a laugh.", "gilded": 0, "created_utc": "1298471063", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "fookin prawns", "gilded": 0, "created_utc": "1298476065", "subreddit": "WTF", "score": 86, "controversiality": 0}
{"body": "Ah, thanks for the clarification. Fookin movies.", "gilded": 0, "created_utc": "1298495129", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Was there something wrong with the 'King of Dicks'?\n\nThat is a fookin awesome GT.", "gilded": 0, "created_utc": "1298509895", "subreddit": "Team_Awesome", "score": 1, "controversiality": 0}
{"body": "Fookin' pawns.", "gilded": 0, "created_utc": "1298515693", "subreddit": "pics", "score": 8, "controversiality": 0}
{"body": "FOOKIN' PAWNS", "gilded": 0, "created_utc": "1298520845", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "fookin pawns", "gilded": 0, "created_utc": "1298529232", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "&gt;Fookin Prawns\n\nFTFY", "gilded": 0, "created_utc": "1298558918", "subreddit": "canada", "score": 0, "controversiality": 0}
{"body": "Yeah, like the *Olive Garden*...are you fookin' kidding me?  In Manhattan?  ", "gilded": 0, "created_utc": "1298563154", "subreddit": "nyc", "score": 7, "controversiality": 0}
{"body": "Working muh fookin ass off and leveraging what I'm best at.", "gilded": 0, "created_utc": "1298593329", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "You can marry your fookin boyfriend for all the Swedes care! And by marry, I mean move in with and get the same rights as married, and by boyfriend, I mean gay! Sweden is the best! Actually respect people! They let you bring in your spouse -and by spouse I mean sambo- and by sambo I mean Swedish word for cohabiting partner.\nThis means that if you live with someone, gay or straight, you have the same rights as marrieds except inheritance without a will.", "gilded": 0, "created_utc": "1298646328", "subreddit": "IAmA", "score": 4, "controversiality": 0}
{"body": "Love the tongue in cheek naming.\n\nShattered Temple --&gt; Lost Temple (didn't remove all terran goodness on this map, do YOU want to try killing the gold/blue bases in the corner with a PF at the gold and tanks on the ridge? 'cause I sure as hell don't!)\nDistrict 10 --&gt; District 9 (awesome movie reference? fooking prawns!)\nRed Stone Gulch --&gt; Blood Gulch (Halo 1 reference?)\nKhaydarin Depths --&gt; Cause amulet was nerfed? Whatever, I totally see a bunny, and that's all that matters.", "gilded": 0, "created_utc": "1298686519", "subreddit": "starcraft", "score": 2, "controversiality": 0}
{"body": "PRAWNS.\n\n(In my defense, you said fooking)", "gilded": 0, "created_utc": "1298690029", "subreddit": "RedditThroughHistory", "score": 4, "controversiality": 0}
{"body": "FOOKIN' MONKEYS\n\nFTFY", "gilded": 0, "created_utc": "1298705360", "subreddit": "videos", "score": 3, "controversiality": 0}
{"body": "Fookin' Prawn! :€", "gilded": 0, "created_utc": "1298771368", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "And the way life works that's 2% too many. Still, great you're doing what you are. As annoying as bats can be scratching in the walls we need them. Fookin' skeeters...", "gilded": 0, "created_utc": "1298773951", "subreddit": "pics", "score": 10, "controversiality": 0}
{"body": "I'm going to cross my fingers, not let cynicism get the best of me, and believe this won't get downvoted because it has the term 'Israeli' in the fookin title.", "gilded": 0, "created_utc": "1298801541", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Long post, and a bit old. I originally wrote this about half a year ago, and for a friend, so it might not make sense in places but it should summarise it enough.\n\nTL;DR: We move in to our house, neighbour parks in front of our garage door, my dad politely asks him to move, he replies by swearing, war ensues over the next few years and police eventually get involved but don't really do much at all and he still acts like a douche.\n\n--\n\nThis all started about 6 months (if I remember correctly) after we moved into our house. Around the back of our house, we have a shared car park area which is there for use by six different houses. Ourselves, our neighbours, and a coach house. Ourselves and one of our immediate neighbours, as well as the coach house, all have access to a single garage each, for one car. The other three houses don't have access to a garage, but they do have individual parking bays - two each. Because we (and our neighbour) have a garage each, we only get access to one parking bay in the car park. They're marked by the house number, and on the far side of the car park there are also four visitor bays, for visitors. Obviously.\n\nNow, our garage is in the far corner of the car park, and as such, it does need a bit of room to get in and out of it. If someone parks in what would be the 5th visitor bay (it's not, it's currently marked with yellow stripes), you can't get out of the garage at all. Which, for obvious reasons, is annoying.\n\nSo, basically, as I was saying, this \"war\" with our one neigbour (who's name is Oliver) started about 6 months after we moved in. One night, he decided to have a party at his house. As such, he invited a few friends around, and one of them decided to park in front of our garage, which meant that if we did want to go out, we couldn't get the car out. So, my dad went around to his house and knocked on his door (he lives two doors down from us).\n\nHe opened the door and proceeded to say, and I quote, \"What the fuck do you want?\". This was the first time we'd ever spoken to him, and this was the greeting he gave. This quite clearly showed that he had a very low IQ and in general, was a chav (UK slang for a c*** basically). My dad explained that we wouldn't be able to get out of our garage with his friend's car parked as it was, and he promptly slammed the door shut (more than likely, due to his low IQ, he didn't understand proper English - perhaps it would have made more sense if my dad had said something along the lines of \"fookin' move your fookin' car, you fookin' dickhead\"). Obviously, he didn't get his friend to move the car at all. In addition to this, at the time, his friend was living in the same house, and they both had a car (parked in their two marked bays) and a van each for work (which were both always parked in two of the visitors bays, permanently, making the place look like a business car park.). If I had a van myself, I wouldn't park it in a residental car park that was looked onto by tons of houses - same reason why I wouldn't park a semi-trailer there either.\n\nTo cut a long story short, this has gone on for most of the time we've lived here, and several times the police have had to come out to deal with it, but nothing ever really happened as there was no actual evidence, aside from his word against my dad's word. Over time, he's made threats and comments to myself and both my parents, and he and his friends have constantly taken up all the visitors bays for days at a time sometimes, and he and his friends often park in the middle of the car park too. It's not exactly a large area either, so it's hard enough to get out without more cars being in the way. While he was originally living with some other guy (who was as much of a twat as he is), the other guy eventually moved out and Oliver's girlfriend moved in. This meant that one of the vans was gone, but he still had his own van.\n\nAnyway, back in July this year (2010), he (Oliver) was home (his silver BMW was there and his van was as well, but his girlfriend had gone out), and in addition to that, one of his friends was there, and his mother/sister (I think) was there as well. Because all the visitors bays were taken (by other legitimate people using them), his friend and his mother decided to just park all over the car park instead. Because of this, I decided to take a photo from the upstairs window at the back of our house. I only took the photo because I know it annoys him, but he's never really seen me do it, however on this occasion, he did see me take it, and all hell broke loose. I switched to the video mode on my phone, and managed to film a video of him going on for about 5 minutes, just swearing his head off, threatening us, and generally being an arse. His mother and sister also decided to contribute a little toward the video, but eventually, he shut up and went back inside his house.\n\nShortly after this happened, the police arrived (we called them), discussed it with us for a bit, and I gave them the video on a DVD, which they took as evidence. The first evidence of what a delightful person Oliver is. A week or two later, and they presented him with a restriction (I'm not sure if it's an [ASBO](http://en.wikipedia.org/wiki/Anti-Social_Behaviour_Order) or something else). He's now not allowed to talk to us at all, aside from saying \"hello\". If he talks to us, the police will arrest him. Which is awesome, since he doesn't talk to us at all now, so it's a lot more peaceful. Him and his friends still park like assholes though, so that's not really solved, but the upside is that he doesn't really do it that often now, which is better.\n\nI'm not going to post the video as it gives away almost exactly where I live, but you can probably see a similar thing by typing \"retard chav\" into YouTube. =P", "gilded": 0, "created_utc": "1298925229", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "no fooking way!", "gilded": 0, "created_utc": "1298925731", "subreddit": "trees", "score": -1, "controversiality": 0}
