{"body": "Definitely not. Less is so often much sexier. I prefer it, personally. Well, up to a point, obviously.\n\nAnyway, when an ideology about nudity takes precedence over not looking fookin' ridiculous, I'll pass.", "gilded": 0, "created_utc": "1213387349", "subreddit": "nsfw", "score": 3, "controversiality": 0}
{"body": "Intersting mix, suprisingly eclectic...\n\nBut Pot Head Pixies by Gong! I used to get bent and listen to that thirty five fooking years ago.\n\nAnd Taxi! Forget bloody Cats and bloody maudlin cradles, that is The Harry Chapin song.\n\nPS, I think you might enjoy everything Warren Zevon ever wrote.", "gilded": 0, "created_utc": "1213539394", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "\"Git\": from the expression \"whore's git\", i.e begotten of a prostitute. Used to refer to an annoying idiot. Less perjorative than \"asshole\". \n\nExample usage: '-and curse Sir Walter Raleigh, he was such a stupid git' from the Beatles song \"I'm so tired\". Referring to Raleigh's introduction of tobacco to England and Lennon's consequent smoking habit (**Git**annes, apparently).\n\nRarely uttered without the adjective 'fookin' inserted between 'stupid' and 'git' i.e 'stupid fookin git'.", "gilded": 0, "created_utc": "1213649129", "subreddit": "programming", "score": 1, "controversiality": 0}
{"body": "Actually - *dickhead* - I was not complaining.  I was saying it was kind of shitty though, that these people were just sucking off of other people's work to make a quick buck, they do not provide any original content, and generally post popular articles from aggregator/social bookmarking sites - so they aren't helping anyone by reposting things that were already popular on big sites like digg, reddit, etc.  \n\nIs it ok if a musician uses *part of a song* say... like small sample of music and uses it in his own song?  Without paying royalties?  Even if he says he used part of a song?\n\nAhh, no.\n\nSo, conclusion kids is... Ahnteis is a fooking moron.\n\nbtw, if you notice, I wasn't really complaining, just saying that that it was kind of shitty that these people just sucked off of other people's original content and made money AND clogged up google searches with blogspam.  \n\nI had one guy once, that quoted my entire article, I asked him to just quote part of it, and he did.  I don't really mind, but I DO mind when morons make stupid assumptions.\n\nI also think all copyright and patent laws should be repealed.  Fuck em all, copyright and patent laws only serve to reduce competition, which hurts the consumer.\n\nI would go on, but I don't think you would understand.  Go back to digg.", "gilded": 0, "created_utc": "1213671081", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "&gt;While it was a pain when I first started, I’m certainly glad I kept with it. I feel like I’m in much better shape, **I’ve dropped eight pounds** and I’ve been able to add a couple of days to each tank of gas.\n\nSeriously?  Riding eight miles per day at a casual pace for two weeks yields an eight-pound weight loss?  The fooking guy must be obese.", "gilded": 0, "created_utc": "1213972711", "subreddit": "environment", "score": -2, "controversiality": 0}
{"body": "It was an insurance job.  The \"hosers\" on the far side of the building are controlling the heat reaching the neighboring buildings.  The near fireman is cleaning up the truck and overseeing the reefing of the hoses. (See foreground.) It appears that heroic measures were useless over the preceding hour or so.  \"Macht fookin Nix\" ", "gilded": 0, "created_utc": "1214438354", "subreddit": "pics", "score": 2, "controversiality": 0}
