{"body": "Theme song from \"Man of La Mancha\"\n\nTo dream the impossible dream\nTo fight the unbeatable foe\nTo bear with unbearable sorrow\nTo run where the brave dare not go\n\nTo right the unrightable wrong\nTo love pure and chaste from afar\nTo try when your arms are too weary\nTo reach the unreachable star\n\nThis is my quest\nTo follow that star\nNo matter how hopeless\nNo matter how far\n\nTo fight for the right\nWithout question or pause\nTo be willing to march into Hell\nFor a heavenly cause\n\nAnd I know if I'll only be true\nTo this glorious quest\nThat my heart will lie peaceful and calm\nWhen I'm laid to my rest\n\nAnd the world will be better for this\nThat one man, scorned and covered with scars\nStill strove with his last ounce of courage\nTo reach the unreachable star\n\n\nAh, screw it. lvngdead has already quit and given up hope. Fookin' zombies.\n\n", "gilded": 0, "created_utc": "1195748306", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "At a world brewing convention in the States, the CEOs of various Brewing organizations retired to the bar at the end of each day's conference.\n\nBruce, CEO of Fosters, shouted to the Barman: \"In 'Strylya, we make the best bladdy beer in the world, so pour me a Bladdy Fosters, mate.\"\n\nBob, CEO of Budweiser, calls out next: \"In the States, we brew the finest beers in the world, and I make the King of them all; gimme a Bud.\"\n\nHans steps up next: \"In Germany ve invented das beer, verdamt. Give me ein Becks, ya ist Der real King of beers, danke.\"\n\nPaddy, CEO of Guinness, steps forward \"Barman, would ya give me a doyet coke wid ice and lemon. Tanks.\"\n\nThe others stare at him in stunned silence, amazement written all over their faces. Eventually Bruce asks, \"Are you not going to have a Guinness, Pat?\"\n\nPaddy replies: \"Well, if you fookin' pansies aren't drinkin', then neither am I\".", "gilded": 0, "created_utc": "1195831987", "subreddit": "reddit.com", "score": 311, "controversiality": 0}
{"body": "This is going to go over like a fookin' led zeppelin.", "gilded": 0, "created_utc": "1195928078", "subreddit": "politics", "score": 2, "controversiality": 0}
