{"body": "Fookin' A!!!", "gilded": 0, "created_utc": "1199358884", "subreddit": "politics", "score": -4, "controversiality": 0}
{"body": "Fookin' A-hole!!! It was funny. End of story. ", "gilded": 0, "created_utc": "1199358975", "subreddit": "politics", "score": 0, "controversiality": 0}
{"body": "Fookin' brilliant. You are a hard act to follow. Mr. Oneofakind, hisself. ", "gilded": 0, "created_utc": "1199946772", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "You're thinking of Alec Guinness. OR Ewen Mac-fookin-Gregor.", "gilded": 0, "created_utc": "1200451706", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "The fookin *Economist* is naive. Piss off.", "gilded": 0, "created_utc": "1200586805", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "It's probably a bit cheeky on my part, but I'm going to take this mildly drunken opportunity to reiterate your cuntlike motherfuckingness and stress that you/we change nothing.", "gilded": 0, "created_utc": "1201408940", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "You fookin rock.\n\n[Bill Hicks - JFK](http://www.youtube.com/watch?v=11Fl9ZVJ7B8)\n\n*EDIT*\n\nDamnnn. I didn't watch it all before I posted. I just got to the part about anti-Castro pigeons saying \"coup, coup\".", "gilded": 0, "created_utc": "1201595405", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "At a world brewing convention in the States, the CEOs of various Brewing organizations retired to the bar at the end of each day's conference.\n\nBruce, CEO of Fosters, shouted to the Barman: \"In 'Strylya, we make the best bladdy beer in the world, so pour me a Bladdy Fosters, mate.\"\n\nBob, CEO of Budweiser, calls out next: \"In the States, we brew the finest beers in the world, and I make the King of them all; gimme a Bud.\"\n\nHans steps up next: \"In Germany ve invented das beer, verdamt. Give me ein Becks, ya ist Der real King of beers, danke.\"\n\nPaddy, CEO of Guinness, steps forward \"Barman, would ya give me a doyet coke wid ice and lemon. Tanks.\"\n\nThe others stare at him in stunned silence, amazement written all over their faces. Eventually Bruce asks, \"Are you not going to have a Guinness, Pat?\"\n\nPaddy replies: \"Well, if you fookin' pansies aren't drinkin', then neither am I\".", "gilded": 0, "created_utc": "1201763727", "subreddit": "reddit.com", "score": 162, "controversiality": 0}
