{"body": "I did read the whooole fooking thing.  But I was thinking of [potassium benzoate](http://www.imdb.com/title/tt0758368/quotes).\n\n&gt;Would you stop eating cake or ice-cream because theres a chance that the unhealthiness would kill you?\n\nI stopped eating cake and ice cream because I don't have time to burn enough calories in a day to keep up with their caloric count.  I stopped drinking coffee and pop because I was addicted to caffeine.  I stopped eating tomatoes for the hell of it, just to piss myself off.\n\nIt is easy to deny myself a pleasure; I do not live for myself.  I live first for enhanced survivability of my descendants.  All the rest is petty to me.  I also practice [defensive driving](http://en.wikipedia.org/wiki/Defensive_driving).", "gilded": 0, "created_utc": "1210572024", "subreddit": "science", "score": 5, "controversiality": 0}
{"body": "I fookin hate pikeys", "gilded": 0, "created_utc": "1211073488", "subreddit": "worldnews", "score": 2, "controversiality": 0}
{"body": "I was about to bring up the very point of self-incrimination. It's about fookin' time, that's all I can say.", "gilded": 0, "created_utc": "1211130124", "subreddit": "business", "score": 10, "controversiality": 0}
{"body": "The link states &gt; We know for a fact that this bill will cost America $845 billion above and beyond what America already spends on global aid in the next thirteen years.\n\nWe *know*. Yeah *right*.\n\nThis bill, put forward by Obama, does nothing of the kind. It is little more than a requirement that the government declare that it has the *objective* of reducing worldwide poverty among people making $1 a day or less. Start studies, make a plan, etc. No requirement to spend *anything*. Big fookin' deal. By the time anything gets done, the dollar will have sunk to such a low that *everybody* will be making at least $1 a day.\n\nAnyway the right just makes shit up and eats it.", "gilded": 0, "created_utc": "1211477151", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "What a fookin' asshat. It's not that bob is dead. You are. He is alive and evolving and exploring his being through music, his music. Some twat wants him to stagnate. Fuck you. I saw him four years ago in Germany with Larry Campbell on guitar and he was too goddamn good. So fuck you very much. Thanks. ", "gilded": 0, "created_utc": "1211652934", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "\"Fookin asshat?\" I have to agree. All power to Uncle Bob for not even bothering with this breed of shitic. May this numbnuts get to heaven after they close the door. ", "gilded": 0, "created_utc": "1211678715", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
