{"body": "Yep.  Somebody was fookin around.  ", "gilded": 0, "created_utc": "1223086564", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Damn I thought so too. Fookin' Oirish all look alike", "gilded": 0, "created_utc": "1223283662", "subreddit": "pics", "score": 7, "controversiality": 0}
{"body": "One thing I've come to realize is there's a difference between Soviet citizens and their government, just as there's a stark difference between US citizens today, and their government.  \n\nGovernments make war today, not citizens.  Governments play spy games, not citizens.\nGovernments trump up the threat of the other side, to keep the citizens pliable.\n\nStill, planting bad information for them to take home in such a widespread, successful way, is pretty fookin cool.", "gilded": 0, "created_utc": "1223434473", "subreddit": "programming", "score": 4, "controversiality": 0}
{"body": "Sure  ..its shooped, but funny as previously mentioned, and the first thing I thought of was [Chef on his trek for mangoes...](http://i114.photobucket.com/albums/n256/Hollyfeld/FOOKIN-TIGER.gif)", "gilded": 0, "created_utc": "1223568627", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I meant Fookin'", "gilded": 0, "created_utc": "1223878422", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "No kidding! That's the biggest fooking Barbie doll I've ever seen!", "gilded": 0, "created_utc": "1224096776", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "[suprise, suprise.](http://www.reddit.com/r/videos/comments/6za0q/the_max_payne_trailer_looks_fookin_pwnage_until/c05a1v9)\nIts like i went to the future or something.", "gilded": 0, "created_utc": "1224395764", "subreddit": "entertainment", "score": 1, "controversiality": 0}
{"body": "I said sheep.  Sheep will all run in one direction.  There is no thought as to why they are running in that direction, and no consideration as to whether they ought to keep running or not.\n\nI am sorry that it pisses you off no end.  I am going to tell you what pisses me off no end, and that is people and their near daily postings about Reddit-man.  And it doesn't piss me off about him, it pisses me off at them.  \n\nThen you get a nob-gobbler like **All23** that posts about him near daily.\n\nI have always felt that calling people out in headlines is a no class thing to do, but who knows.  Maybe he was raised in a no class manner.  Hell, maybe he was raised in New Zealand in the middle of a freaking sheep herd and is just following what he had been taught and that is following.\n\nBut then you get people like him that are sucking off of the hate teat, and using it to karma whore.  I find that disgusting beyond words, and if he posts one more mother fooking time about it, I am going to start posting daily about him.\n\nNext?", "gilded": 0, "created_utc": "1224644238", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "Nixon.  What a fookin' trooper.  I will give him one thing, he has alway been able to step in to a bad spot with a smile on his puss.  A new suit, a shave and a quick bite and he will be ready to go.  ", "gilded": 0, "created_utc": "1224897268", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Fookin' amazin'!!! Hi-res version?", "gilded": 0, "created_utc": "1225056492", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "What a fookin' ageist, ya know whutamsayin'? This guy is a fookin' ageist?", "gilded": 0, "created_utc": "1225269132", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
