{"body": "Real or not that was fookin' funny.", "gilded": 0, "created_utc": "1237084794", "subreddit": "reddit.com", "score": -6, "controversiality": 0}
{"body": "Sorry, I didn't mean to pick on you, your comment was right in front of me when i was typing and was fairly concise and easy to quote, it was also memorable for the good use of \"fookin\".", "gilded": 0, "created_utc": "1237332448", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "No, pls check my comment again - we're a fooking mess right now, IMHO we don't need other countries pointing it out to us. That's all -", "gilded": 0, "created_utc": "1237435807", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Residents of the UK who haven't been fortunate enough to live under a rock will have heard that the figurehead of everything foul, shallow, ugly and unmerited was thankfully taken from us today in the revolting conclusion of a drawn-out media feeding frenzy. \n\nMany celebrities and people of almost as little worth as Jade herself have publicly spewed forth a sickening torrent of sympathy towards the plight of this fat, racist waste of DNA. The media, who before were pleasingly content to heap much-deserved scorn upon her and all she represented, are falling over themselves to fawn over the gentle, the good Jade Goody. \n\nPeople who should know better, who should stand up for the best Britain and humanity can offer rather than an embodiment of the worst, are slaveringly trailing the bandwagon. The Prime Minister himself has sunk so low as to desperately capitalise on it. \n\nWell, I say enough. I, and many others, despised her while she was alive. I maintain that it is only right that her memory remain true to her life, and we continue to revile her, lest the lessons we learn about bullshit celebrity be forgotten. \n\nTo this aim, I suggest that Ozzy Osbourne (or failing that, Lemmy from Motorhead) kick down the doors to Radio 1, administer spirited backhands to the fawning, loudmouthed oafs in front of the microphones, and mumble out across the nation's radio waves a message along the lines of \n\n\"Fookin' Jade, fook 'er.\"", "gilded": 0, "created_utc": "1237751810", "subreddit": "reddit.com", "score": -1, "controversiality": 0}
{"body": "That's not the same logic at all. As I said, I'm all in favor of proper stewardship of the environment. I believe in the environmental cause. I am 100% against alarmism which does more to hurt the cause of responsible environmentalism than 100 causes in favor of it.  The problem with AIC is that it's so full of half truths and outright exaggerations that it's been completely debunked and discredited, and by extension, the whole environmental movement is dismissed. \n\nKiliminjaro is not an example of the effects of AGW. This is fact. Malaria increases were not attributed to AGW by the Pasteur Institute. This is fact. The amount of arctic ice melt attributed to Gore-ish AGW was extremely exaggerated by AIT. This is fact. \n\nThis is not the spokesman that environmentalism needs, and AGW is not the cause that environmentalism needs. There are so many important causes to get behind when it comes to polluting our environment, our food, our air, our water, that the fact that this suit has completely co-opted the movement with his easily  disproven half truths and scary slide shows is insulting. His \"mission to save the earth\" has stolen millions in research and philanthropic funds from far more important causes, diverting them to shell games such as Carbon Credits which serve no real environmental purpose except to enrich Gore and his friends who play in a Green version of Wall Street. \n\nAGW is the NYSE version of the Bailout Bill for supposedly enlightened intellectuals who feel like they should be plugged in to environmental causes, but never bothered to actually read a peer reviewed paper unless it was vetted by the UN first. Follow the fooking money for fook's sake. Look twice at the source of the information. Vet the data. Think like a scientist for half a second.", "gilded": 0, "created_utc": "1237952697", "subreddit": "science", "score": 1, "controversiality": 0}
{"body": "If it's destroyed your sensitivity, then you are an extremely rare case, and you should see a Doctor about that. For the other 200 Million of us, there is no loss of sensitivity. I have mind blowing orgasms from myriad sexual activities on a regular basis, and I can't imagine my glans being any MORE sensitive...I don't think I could take it. When my gf licks the underside, and then blows softly, it's fooking intense. I don't know what you uncirc'ed blokes feel, but for me, that's plenty right there. \r\n\r\nSorry about your bad luck, Tilon. I had mine done by a professional in a hospital at birth. I don't know what your story is, but I've never met or heard of another person like you. Everyone I know who is circumcised, and every girl I've ever known who has slept with circumcised men (all of them) has never reported the decreased sensitivity issue you described, and after hearing about all this on Reddit, I've asked around extensively. You won the shit out of luck lotto. ", "gilded": 0, "created_utc": "1238089285", "subreddit": "science", "score": 0, "controversiality": 0}
{"body": "fookin disgoostin!", "gilded": 0, "created_utc": "1238191955", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "She's right fookin sorry - with a mug to stop a lorry.\n", "gilded": 0, "created_utc": "1238332106", "subreddit": "worldnews", "score": -5, "controversiality": 0}
{"body": "Let him 'stop Iran.' Let this for once be entirely Israel's fooking problem, which they created with their own fooking paranoia. I'm tired of this state jerking us around.", "gilded": 0, "created_utc": "1238537475", "subreddit": "worldnews", "score": 7, "controversiality": 0}
{"body": "what the fuck is fooking?", "gilded": 0, "created_utc": "1238543153", "subreddit": "worldnews", "score": 10, "controversiality": 0}
