{"body": "In fookin' Bruges?!\n\nI loved this movie.  Colin stretched his abilities.", "gilded": 0, "created_utc": "1298942886", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "fookin prawns.", "gilded": 0, "created_utc": "1298980477", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "Fookin Proons!", "gilded": 0, "created_utc": "1298995734", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "Naming a medication is not naming a family member, unless it's \"John Doe's Drug\". Pretty lame to do an IamA and not be able to answer topical question. Unless the prescriber is not a legal practitioner (in which case you couldn't get medication) or the diagnosis is incorrect (which, according to another post might be possible because you're symptoms are worse *on* the drug), there is no legal reason not to name the drug you are taking. \n\nYES FATHER I'LL ASK HIM! Stop stalling and answer the fooking question!\n\nYou still a troll (whether sincere or not). ", "gilded": 0, "created_utc": "1299016855", "subreddit": "IAmA", "score": 1, "controversiality": 0}
{"body": "Fookin' prawns!", "gilded": 0, "created_utc": "1299039309", "subreddit": "videos", "score": 4, "controversiality": 0}
{"body": "Fookin' Prawns! ", "gilded": 0, "created_utc": "1299053057", "subreddit": "politics", "score": 3, "controversiality": 0}
{"body": "Fooking aye!", "gilded": 0, "created_utc": "1299058468", "subreddit": "worldnews", "score": 3, "controversiality": 0}
{"body": "Fookin' prawns!", "gilded": 0, "created_utc": "1299158646", "subreddit": "Minecraft", "score": 3, "controversiality": 0}
{"body": "Get those fookin' prawns off of my planet.", "gilded": 0, "created_utc": "1299170673", "subreddit": "environment", "score": 1, "controversiality": 0}
{"body": "FOOKIN PRAWNS!", "gilded": 0, "created_utc": "1299215037", "subreddit": "Physics", "score": 2, "controversiality": 0}
{"body": "Fookin' prawns!", "gilded": 0, "created_utc": "1299243925", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "At a U2 concert in Ireland, Bono asks the audience for some quiet.\r\nThen he starts to slowly clap his hands. Holding the audience in total silence, he says into the microphone:\r\n\" I want you to think about something. Every time I clap my hands, a child in Africa dies.\"..\r\nA voice from the front of the audience yells out:\r\n\"Then fookin stop clapping, ya *****!\"....\r\n", "gilded": 0, "created_utc": "1299267999", "subreddit": "DoesAnybodyElse", "score": 1, "controversiality": 0}
{"body": "wanna get tin foiley . . . it's the fookin banks.  they make money off of every side of every conflict. ", "gilded": 0, "created_utc": "1299276116", "subreddit": "worldnews", "score": 6, "controversiality": 0}
{"body": "upvoted because I feel your pain. Every so often on a night out:\n\"You think you're 'ard, mate?\" \n\"*sigh* No, I just happen to be bigger than you and your Neanderthal brain is telling you to \"beat up big man;be leader of tribe!Get women!\"\"\n\"You wot?\" \n\"Nothing, nothing, just fuck off before you annoy me\" \nBravo on your rage towards your would-be home invaders", "gilded": 0, "created_utc": "1299397833", "subreddit": "AskReddit", "score": 4, "controversiality": 0}
{"body": "Documentary. \"Our Brand Is Crisis\". \n\nFookin' amazing. It's about how the same people who brand and sell our politicians go down to Bolivia and brand and sell the new president down there....just with less rules. Good stuff, and if it don't make you angry, then you werent paying attention.", "gilded": 0, "created_utc": "1299422836", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "You're a fookin eejit.", "gilded": 0, "created_utc": "1299466356", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "well as an oregonian im all for it. my credit union is kinda holdin it down for right now though but i honestly dont see anything wrong with having a state bank. its worth a fookin shot.", "gilded": 0, "created_utc": "1299505920", "subreddit": "politics", "score": 5, "controversiality": 0}
{"body": "Technically no, but if you don't talk to people about it in your comments, what's the point of submitting it other than to drive traffic to it? Have a conversation with your audience or people will mark you a spammer.\n\nAnd if you *are* just using Reddit to drive traffic to your site, without using a paid advert, that makes you a *cheeky cunt*.", "gilded": 0, "created_utc": "1299508330", "subreddit": "programming", "score": 5, "controversiality": 0}
{"body": "Fookin zef side.\n\nI would totally do the creepy chick. But I would double bag it.", "gilded": 0, "created_utc": "1299517022", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "Totally true, those D.A.R.E programmes are fookin' awful! We have Talk to Frank in the UK which spreads the same kind of misinformation. Of course, I know weed doesn't cause cancer and is likely the least harmful recreational drug you could choose to take, but still; too much of anything is bad and weed *can* reduce motivation for many people, or cause pretty unpleasant paranoia.\n\nPeople just need to be rational about weed; the whole \"its natural and therefore harmless\" thing is just as stupid as saying weed makes black men rape white women. Arsenic is fucking natural, so is opium, but they can still kill you. Cannabis definitely can't kill you, but it can still make you boring, lazy or paranoid so just use it responsibly, and most importantly stop lying about it.\n\nTo me, a cop telling a group of kids that cannabis will \"turn them into Meth addicts\" is exactly the same as some \"Earth Child\" telling those same kids that it's \"totally harmless\". They're both unnecessary lies told to further personal agendas.", "gilded": 0, "created_utc": "1299524486", "subreddit": "trees", "score": 21, "controversiality": 0}
{"body": "fookin prawns", "gilded": 0, "created_utc": "1299537240", "subreddit": "pics", "score": 3, "controversiality": 0}
{"body": "FOOKIN PRAWNS", "gilded": 0, "created_utc": "1299539836", "subreddit": "pics", "score": 22, "controversiality": 0}
{"body": "Can't wait, I'm gonna have loads of fun with that. Fookin prawns!", "gilded": 0, "created_utc": "1299576831", "subreddit": "apple", "score": 1, "controversiality": 0}
{"body": "You know what they say about shagging a fookin prawn... \"Never again!\"", "gilded": 0, "created_utc": "1299695092", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Fookin kill ya sef", "gilded": 0, "created_utc": "1299697268", "subreddit": "movies", "score": 1, "controversiality": 0}
{"body": "fookin' kangaroos. ", "gilded": 0, "created_utc": "1299701414", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "fookin prawns on the bar b ..", "gilded": 0, "created_utc": "1299702640", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "Fookin' prawns!", "gilded": 0, "created_utc": "1299721780", "subreddit": "videos", "score": 7, "controversiality": 0}
{"body": "All I could think of was FOOKIN PRAWNS, MEN!", "gilded": 0, "created_utc": "1299758951", "subreddit": "Music", "score": 3, "controversiality": 0}
{"body": "this means he can send in scabs. he knew what he was doing by making sure this provision is in the bill. they need a massive general strike immediately, no holds barred, everyone. call his fooking bluff.", "gilded": 0, "created_utc": "1299770934", "subreddit": "politics", "score": 9, "controversiality": 0}
{"body": "I'LL SHOOT DE PIG, DON'T MAKE ME SHOOT DE FOOKING PRAWN!", "gilded": 0, "created_utc": "1299806090", "subreddit": "WTF", "score": 4, "controversiality": 0}
{"body": "wow, classic fookin album. Nice. ", "gilded": 0, "created_utc": "1299813930", "subreddit": "MusicAlbums", "score": 2, "controversiality": 0}
{"body": "Fookin' fuck!", "gilded": 0, "created_utc": "1299862985", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Die Antwoord is fooking amazing.", "gilded": 0, "created_utc": "1299904045", "subreddit": "WTF", "score": 9, "controversiality": 0}
{"body": "FOOKIN' PROWNS", "gilded": 0, "created_utc": "1299917718", "subreddit": "AskReddit", "score": 10, "controversiality": 0}
{"body": "Fookin chavs", "gilded": 0, "created_utc": "1299961273", "subreddit": "WTF", "score": 3, "controversiality": 0}
{"body": "Pretty much.\n\nI get so pissed off when nuclear power is played with by the media. Fucking ignorance is astounding. The night before the earthquake I was reading a medical physics text book (for fun) and a little radiation table caught my eye. I can't find references at the moment, but seeing as this is qualification level text I think it's safe to quote. But I will correct it if anyone finds anything different:\n\nLevels measured in micro Sieverts per year. (1Sv = 1 Gray x quality factor)\n\nNatural \n\n* Radon, terrestrial x-rays, cosmic rays, internal radionuclides - 1870 \n\nArtificial\n\n* medical exposure - 250\n* nuclear fallout - 10\n* occupational exposure - 9\n* miscellaneous (flight, coal ash, TV etc) - 11\n* **nuclear power industry waste - 2**\n\nSubtotal - 282\n\nTotal - 2152 micSv/year\n\n2 out of 2152 micro Sv... 0.1%\n\nNotice the coal ash contribution. Of course, the level wrt nuclear here is 'waste' but that is most likely how the general public is going to come anywhere near anything to do with nuclear power. For reference: Occupational exposure in the UK is limited to 20milli Sv per year while for general public it's 1mSv per year. As the table above shows, the UK average background radiation is 2.2milli Sv per year.\n\nThe levels from nuclear technology are tiny, particularly when considering the natural fookin' background.\n\nWhen something has gone wrong in the past, it has occasionally gone wrong badly. But people don't seem to realise the huge advances in safety and technology.\n\nBut when the word \"nuclear\" is involved, the general public shits themselves. I've heard tell that MRI should actually be NMRI, but at the time it was developed the general fear of all things nuclear rendered that particular extra letter in the acronym being left out. It's quite depressing, considering the massive health risks from conventional fuels around us all the time.\n\nedit -format", "gilded": 0, "created_utc": "1299962889", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "Guy on the fooking hill!", "gilded": 0, "created_utc": "1299964669", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Fooking reposts.", "gilded": 0, "created_utc": "1299992163", "subreddit": "fffffffuuuuuuuuuuuu", "score": 3, "controversiality": 0}
{"body": "Fooking prawns.", "gilded": 0, "created_utc": "1300017377", "subreddit": "fffffffuuuuuuuuuuuu", "score": 3, "controversiality": 0}
{"body": "The BBC were interviewing a woman with family over in Japan. Now this is a pet hate of mine that reporters always seem to roll out when tragedy strikes, they always someone whose life has just been ripped apart - 'How do you feel?'. Fooking eejits.", "gilded": 0, "created_utc": "1300027920", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Fookin' Snoipah's!!\n\n(feel free to make fun of my southern accent, JD.)", "gilded": 0, "created_utc": "1300062412", "subreddit": "Team_Awesome", "score": 4, "controversiality": 0}
{"body": "Not a doubt in my ~~fucking~~ fooking mind. ", "gilded": 0, "created_utc": "1300120606", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Fookin' Prawns!", "gilded": 0, "created_utc": "1300148152", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Fookin Micks.", "gilded": 0, "created_utc": "1300151550", "subreddit": "videos", "score": 0, "controversiality": 0}
{"body": "We each formed groups of us kids who would come up with as many slang words for the penis, vagina and sex as we can think of.\n\nAll the guys in the room tried their best poker face for penis words such as: Peener, Magic Stick, Johnson, Hot Rod, Skin Flute, Wang, Googoo, the Bishop, etc.\n\nThe guys then started laughing at slang words for vagina: Peach, Vagoo, Slit, Foxhole, Pussy, Clittybangbang, etc.\n\nThe most memorable moment came when we made up words for sex.  We wrote down roughly 8 variations of the word \"Fuck\". We all just started laughing hysterically when the teacher said, \"Hmm, okay so Fuck, Fucking, Make Fuck, Farking, ...Fooking?, Freaking...\" Then she shouted, \"Okay boys, start acting mature\".\n\nWe couldn't stop though, after laughing for 5 minutes she then took it a step further. \"Okay, 'fuck' is not a proper word for sex, we all say 'fuck' all the time but when we say 'fuck' we are not always talking about sex. If I say 'I fucking hate you' does that mean I hate having sex with you, or 'This is fucking good' mean it's good to have sex with?\" We were in utter tears.\n\nIn her final attempt to calm us all down she said, \"Okay how about we all just say it, to get it out of our systems! We're all going to say 'Fuck', on the count of three? Ready? 1...2...3...FUCK\"\n\nThe entire class in unison shouted, **\"FUCK!\"** together. After 5 seconds of silence afterwards, the teacher then said, \"Okay! Let's move on!\" And 5 minutes later the bell rang.  It was indeed the most memorable day of Sex Ed.", "gilded": 0, "created_utc": "1300162765", "subreddit": "AskReddit", "score": 46, "controversiality": 0}
{"body": "You wot?", "gilded": 0, "created_utc": "1300196421", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "While we are generalizing, in my travels, I have found the British to be far louder than Americans. I will never forget being in the Hohensalzburg and hearing a guy at a table 30 feet away yell \"Sauerkraut? That's that fookin wilted cabbage, innit?\"\n\nJust the worst example of many.", "gilded": 0, "created_utc": "1300197473", "subreddit": "WTF", "score": 9, "controversiality": 0}
{"body": "Like tallnasty daft punk mainly, and movie themes: specefically:\r\n\r\n* daft punk alive 2007 (Entire cd)\r\n* returns a king (300)\r\n* last of the mohicans theme\r\n* shipping up to boston - dropkick FOOKIN murphys\r\n* We are Sex bob-omb - Scott Pilgrim / Sex bob-omb\r\n* Time - Hans Zimmler (sp?) - Inception\r\n* ecstasy of gold/ nike remix  - eccio morrine (sp?) - good bad and ugly\r\n* moar ghosts in stuff - deadmau5\r\n* Lil Wayne's No Ceilings mixtape ", "gilded": 0, "created_utc": "1300208704", "subreddit": "Fitness", "score": 4, "controversiality": 0}
{"body": "get ours sent up (to BAC) from flynn's every year with the presents from the cork rellies. \n\nfookin' delish. ", "gilded": 0, "created_utc": "1300211323", "subreddit": "ireland", "score": 2, "controversiality": 0}
{"body": "&gt;shipping up to boston - dropkick FOOKIN murphys    \n\nNAILED IT! (Bad/Great things happen when I hear this song!)", "gilded": 0, "created_utc": "1300218315", "subreddit": "Fitness", "score": 2, "controversiality": 0}
{"body": "Not literally sloppy, but I was 3rd in line... I was fooking around with an older gal for a few months.  I was 28 at the time, she was 52.  One night she called me all excited about a MFM 3some she had with two coworkers from out of town earlier that evening.  I got hard hearing about it and she got so hot retelling the story that she invited me over.  They had used condoms of course so there wasn't any creampie, but it was wild being her 3rd cock in less than a few hours.  And she was loving how slutty it made her feel.", "gilded": 0, "created_utc": "1300251867", "subreddit": "sex", "score": 13, "controversiality": 0}
{"body": "I use cunt and dick interchangeably, in regards to magnitude of insult. Both are people of unfavorable character.\n\nBut I prefer cunt because I always think of it in a British accent. \"Why are you lying about smoking weed before, *you fooking coont*!\"\n\nHas nothing to do with the gender of the person. It's just \"a cussword\" to me.", "gilded": 0, "created_utc": "1300267143", "subreddit": "trees", "score": 1, "controversiality": 0}
{"body": "FOOKIN PIKEYS", "gilded": 0, "created_utc": "1300283263", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "So when are you going to come back to Portland Oregon?! We really fookin miss you, bretherin!!!!!", "gilded": 0, "created_utc": "1300289893", "subreddit": "AMA", "score": 1, "controversiality": 0}
{"body": "indeed! when I visited Tara I was delighted, then I trekked over to the hill where Patrick the BRIT set up his new fooking church and I spit on his statue. I told him I was  reclaiming Ireland for the pagans. I detest this day, and in the US it is merely an excuse to get drunk and eat fucking corned beef and cabbage that  NO ONE EATS IN IRELAND. fuck st patrick", "gilded": 0, "created_utc": "1300399636", "subreddit": "videos", "score": 1, "controversiality": 0}
{"body": "Fookin' prawns!", "gilded": 0, "created_utc": "1300402359", "subreddit": "AskReddit", "score": 203, "controversiality": 0}
{"body": "Fookin butter.", "gilded": 0, "created_utc": "1300402930", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I did NOT have sex with a FOOKIN' PRAWN!", "gilded": 0, "created_utc": "1300423656", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Or you could just wear orange instead, and simply glass those who pinches you, and scream **\"Oi, Paddy, why don'tcha tell yer hoore ma ta stich this, ya fookin papist spudsucker!\"** at them. \n\nCultural events only suffer if they're not inclusive. ", "gilded": 0, "created_utc": "1300446999", "subreddit": "comics", "score": 6, "controversiality": 0}
{"body": "Fookin prawn!", "gilded": 0, "created_utc": "1300464179", "subreddit": "pics", "score": 107, "controversiality": 0}
{"body": "No need to be a jerk. The article actually does mention how spells will behave, perhaps you didn't read the whole thing?\n\nAlso, you actually expect trees to catch fire as you use spells? Do you have any idea what kind of horsepower it would require to dynamically light trees on fire, burn them down, and not look fooking stupid? It would be way beyond what any PC today could realistically handle.", "gilded": 0, "created_utc": "1300466845", "subreddit": "gaming", "score": 4, "controversiality": 0}
{"body": "I fookin 'ate Poikes.", "gilded": 0, "created_utc": "1300468753", "subreddit": "pics", "score": 17, "controversiality": 0}
{"body": "delete your fookin spoiler", "gilded": 0, "created_utc": "1300471048", "subreddit": "AskReddit", "score": 0, "controversiality": 0}
{"body": "Fooking prawn", "gilded": 0, "created_utc": "1300472631", "subreddit": "pics", "score": 7, "controversiality": 0}
{"body": "How many Australians does it take to screw in a light bulb?\n\nThe lightbulb is not changed, they just stand around complaining about \"dem fooking lebbos\" breaking it. \n\nLater on, an Indian immigrant studying Hospitality Management does it for less than minimum wage.\n\n(I just made this up based on observation)", "gilded": 0, "created_utc": "1300496376", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "There's more than that. Way more. Here's a choice selection\n\n* [A wasp that disables the flight reflex of a roach via surgical stings](http://en.wikipedia.org/wiki/Jewel_wasp), then lays an egg on it.. with no flight reflex the roach is slowly consumed by the larva, which then develops in to an adult wasp and breaks free.  \n* [A protozoa that makes mice flee toward cats instead of from them](http://en.wikipedia.org/wiki/Toxoplasma_gondii), after which the mouse (obviously) gets consumed. You may also be interested to know that there's a not insignificant chance you're a carrier of this right now. Human behavioral reaction to it isn't consistent.  \n* [A fungus that makes ants climb to a high branch](http://en.wikipedia.org/wiki/Ophiocordyceps), grab hold with its pincers, and then die. Shortly after that the fungus sprouts from the head of the ant. You saw a take on this in an X-Files episode.  \n* [Creutzfeldt–Jakob disease](http://en.wikipedia.org/wiki/Creutzfeldt%E2%80%93Jakob_disease), basically mad cow disease for humans. Spongiform encephalopathy for the medical-types out there. It changes behavior of victims for obvious reasons - the brain cells are being destroyed, making the brain resemble a sponge. *edit: Almost forgot something obvious with this one: Fookin' prions!*\n\nSleep well, folks.", "gilded": 0, "created_utc": "1300509375", "subreddit": "atheism", "score": 16, "controversiality": 0}
{"body": "Die fookin Answah", "gilded": 0, "created_utc": "1300543859", "subreddit": "trees", "score": 2, "controversiality": 0}
{"body": "Fookin prawns.", "gilded": 0, "created_utc": "1300575327", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "A *standin' fookin' ovation* and a gourmet blueberry pie to you, sir/madame!", "gilded": 0, "created_utc": "1300601358", "subreddit": "circlejerk", "score": 1, "controversiality": 0}
{"body": "FOOKIN PRAWNS", "gilded": 0, "created_utc": "1300605194", "subreddit": "funny", "score": 4, "controversiality": 0}
{"body": "Because you're a fookin cunt yea?", "gilded": 0, "created_utc": "1300669069", "subreddit": "AskReddit", "score": 61, "controversiality": 0}
{"body": "Fookin' prawns!", "gilded": 0, "created_utc": "1300680627", "subreddit": "AskReddit", "score": 5, "controversiality": 0}
{"body": "Fookin' eh!", "gilded": 0, "created_utc": "1300691482", "subreddit": "politics", "score": 1, "controversiality": 0}
{"body": "I've had baby shrimp on pizza many times.  Doesn't seem like a strange idea to me.  Those fookin' prawns look like a pain to eat, though.", "gilded": 0, "created_utc": "1300714933", "subreddit": "reddit.com", "score": 3, "controversiality": 0}
{"body": "fookin prawns.", "gilded": 0, "created_utc": "1300724118", "subreddit": "WTF", "score": 22, "controversiality": 0}
{"body": "that's fookin GREAT!!! (cute biscuits too, dude)", "gilded": 0, "created_utc": "1300756276", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "fookin' prawns!", "gilded": 0, "created_utc": "1300821475", "subreddit": "AskReddit", "score": 80, "controversiality": 0}
{"body": "That's\n\nFookin'\n\n**SWEET**", "gilded": 0, "created_utc": "1300829742", "subreddit": "Warhammer", "score": 4, "controversiality": 0}
{"body": "One would hope so but what happens is tummy kisses are only good for so long. The rich see us lowbies getting similar tummy kisses so they now need forehead raspberries and their heads pet before going to sleep. Then to further punish us, they tax tummy kisses to hell so we can only afford written down, \"XOXO\"s... fookin bastards.", "gilded": 0, "created_utc": "1300911664", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "The last half of the album is fooking awesome... I saw them at a small club in Tempe with the Drums, and a majority of the crowd left after the Drums! ", "gilded": 0, "created_utc": "1300988741", "subreddit": "listentothis", "score": 3, "controversiality": 0}
{"body": "Fookin Prawns.", "gilded": 0, "created_utc": "1301027357", "subreddit": "snackexchange", "score": 3, "controversiality": 0}
{"body": "Looks fookin delicious.", "gilded": 0, "created_utc": "1301051459", "subreddit": "FoodPorn", "score": 1, "controversiality": 0}
{"body": "Its a fooking great big place http://www.youtube.com/watch?v=fhn8j7S4uKU", "gilded": 0, "created_utc": "1301060040", "subreddit": "atheism", "score": 1, "controversiality": 0}
{"body": "it's casing out your jugular!\nyou are so fookin screwed!!\nnow is a very good time to bring out your ka-bar for some down and dirty hand to paw combat", "gilded": 0, "created_utc": "1301074340", "subreddit": "pics", "score": 1, "controversiality": 0}
{"body": "I appreciate it.  I'm not looking for upvotes, or to change this guy.  I'm just pointing something out in the hopes his balls grow 3 sizes today.  The downvotes actually tell me I'm doing something right in this context.\r\n\r\nThese entitled kids are in for a major fucking headache if they think inaction will get them what they want in life.  Yes it needs fixed, but in the meantime, it's 5 fookin' minutes of faceroll effort. -_-", "gilded": 0, "created_utc": "1301082292", "subreddit": "gaming", "score": 1, "controversiality": 0}
{"body": "Signum (ron or pascal) would be fooking  awesome. our local scene owes a hell of alot to those dudes.", "gilded": 0, "created_utc": "1301169054", "subreddit": "trance", "score": 2, "controversiality": 0}
{"body": "I hate it when he does that! Fookin' Gumby!", "gilded": 0, "created_utc": "1301171513", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "I don't have a car, job, or apartment, and I STILL have healthcare. Fooking Socialists. How do they work.", "gilded": 0, "created_utc": "1301172529", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "me at my retail job \"can I help you find anything\"  Customer \"a million dollars\"  fookin Morons.  why the fook would I be here at this store to give it to you.", "gilded": 0, "created_utc": "1301211729", "subreddit": "AskReddit", "score": 3, "controversiality": 0}
{"body": "Fookin.", "gilded": 0, "created_utc": "1301224271", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "It's a reference to District 9, a movie which was set in South Africa and there were aliens called prawns and lots of people didn't like them and so they were referred to as 'fucking prawns' which came out more like 'fooking prawns'.\n\nIt's kind of a meme I guess?", "gilded": 0, "created_utc": "1301226811", "subreddit": "AskReddit", "score": 2, "controversiality": 0}
{"body": "Er... I think that by the time it was happening, if they weren't *already* in position, that someone who is wasted enough to aspirate *will* aspirate before you can lug them over to one side, especially if you're doing the PITA spine-friendly logroll...  But whatever.  Mostly I'm just happy when people try; they tend to help more than hinder.\n\nAs for whether it's wrong - I think that it depends on training and resources available.  The layman can do less \"wrong\" because they have significantly less of both available - for example if both ability to intubate and knowledge of spinal precautions to logroll are lacking, airway technically comes before spine, at least if there is no obvious or known spinal MoI.\n\nEven in worst-case scenario for the most-trained doctor or paramedic, you'd paralyze them to save their life, though hopefully that'd never happen.  Fookin' lawsuits...", "gilded": 0, "created_utc": "1301267446", "subreddit": "WTF", "score": 1, "controversiality": 0}
{"body": "No, but a funny story no one will care about. Was at a college football game and filled up a syrup bottle full of wiskey. My buddy was on lookout ... But low and behold I got a tap tap on the shoulder. Fookin cops! Cop id'd me... I was 21. He walked me downstairs and made me pour it out. He rolled his eyes and said \" no alcohol in the stands.\" One week later I am in a random dive bar and get a beer bought for me... \" Cop looking at me... \"Syrup bottle? Really? That was a first\" ", "gilded": 0, "created_utc": "1301279565", "subreddit": "AskReddit", "score": 6, "controversiality": 0}
{"body": "Fookin prawns!", "gilded": 0, "created_utc": "1301281421", "subreddit": "AskReddit", "score": 1, "controversiality": 0}
{"body": "Fooking Prawns...", "gilded": 0, "created_utc": "1301306217", "subreddit": "IAmA", "score": 3, "controversiality": 0}
{"body": "Bad news for fookin' prawns. ", "gilded": 0, "created_utc": "1301319633", "subreddit": "personalfinance", "score": 2, "controversiality": 0}
{"body": "Int science fookin' brillyant LOL!", "gilded": 0, "created_utc": "1301322756", "subreddit": "Documentaries", "score": 1, "controversiality": 0}
{"body": "Is it because of the fookin' prawns?", "gilded": 0, "created_utc": "1301323494", "subreddit": "IAmA", "score": 100, "controversiality": 0}
{"body": "Fooking awesome. I'll be daring enough to use this in production code.", "gilded": 0, "created_utc": "1301362658", "subreddit": "Python", "score": 4, "controversiality": 0}
{"body": "FOOKING PRAWNS!", "gilded": 0, "created_utc": "1301510066", "subreddit": "pics", "score": 2, "controversiality": 0}
{"body": "You are a fucking douche of the greatest magnitude. You were never told you had cancer, its all fucking bullshit so you can get a big hug off all the naive saps that have ruined this site and turned it in to a big fucking sissy convention of grown men crying over their dogs and pretending to be destitute in order to get a few cheeky donations from even more naive saps via PayPal.  People like you, who use cancer as a means to an end as pathetic as getting fucking karma on a website deserve being fucking killed, I really mean it. I actually do wish serious harm befalls you very soon you fucking cunt.", "gilded": 0, "created_utc": "1301511150", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "This has been on here multiple times. On that note...\n\nSouth African here.\n\nI will say with 99% certainty that this is fake.\n\nNo cop would ever risk his life by trying to jump into another vehicle, they shoot first and ask questions later, and by shoot first, I mean shoot the guy dead.\n\nfookin prawns.", "gilded": 0, "created_utc": "1301531539", "subreddit": "funny", "score": 11, "controversiality": 0}
{"body": "&gt;fookin prawns.\n\nWell, it's a good thing you added that, or I wouldn't have believed you were a real South African.", "gilded": 0, "created_utc": "1301532526", "subreddit": "funny", "score": 7, "controversiality": 0}
{"body": "To answer your question about youth development, that is one area where we've been very strong in recent years. We've had a good number of players come through to the first team - or others - and their national teams, however, that is starting to be pinched a little with only the real cream making much of an impact as you might expect now our sights are set a little further. What we are starting to see is a bit of Wenger-esque style of nicking kids from other academies at a relatively late age which is a bit worrying but probably a short term move to keep the conveyor belt moving towards the first team. The club has stated that the crazy acquisiton of players is a short term solution and the future focus will be on homegrown talent development.\n\nAs for investment in facilties, etc. The new owners have begun to invest probably more than any other PL club to date... There's a £1bn \ndevelopment project just kicked off which will see the area surrounding the ground extensively developed with training facilities for the squad and, i believe academy, who currently train separately at some distance from the ground. They're also investing in other sports and entertainment facilities in the same locale. Oh and they've also made enquiries about increasing the stadium's capacity should success - and the glory hunters - come. Although i suspect this was done mainly for due diligence before the spending the £1bn in developing the area only to outgrow the stadium.\n\nHappily, they are also continuing to invest in the community as well which has always been a pretty key thing for the club given it's history in the deprived environs of Moss Side.\n\nSo, full marks so far for the owners. 'Bout fookin' time with some of the clowns we've had.", "gilded": 0, "created_utc": "1301556692", "subreddit": "soccer", "score": 2, "controversiality": 0}
{"body": "Fookin' prawns?", "gilded": 0, "created_utc": "1301578130", "subreddit": "worldnews", "score": 0, "controversiality": 0}
{"body": "you are right! fuck freedom! socialism all the way!\nWhy don't we all live in cages, it will be safer for everyone. No car accidents since you'll never be let off your cage. And if you behave well and show respect for caging system and understanding of a goodness of it (as you clearly would) you might be selected to be a guard. no longer in small cage(of course the guard guarding the cage will be in even bigger cage, can't trust these guards either.\n\n\nbut on serious note: the driver was/is irresponsible and your deceased friend should know better not to get into the car with him, right? If I notice someone is a irresponsible moron I am not getting into the car he is driving. fooking simple. If you saw a lion in your garden, would you go and cuddle him?!\n\ntl;dr - instead of calling for more government control, do not get into the car with a moron, think for yourself.", "gilded": 0, "created_utc": "1301585091", "subreddit": "pics", "score": 1, "controversiality": 0}
