{"body": "I once went hiking on the [Mountains of Mourne](http://en.wikipedia.org/wiki/Mountains_of_Mourne) and some bloke told me about this statue they have in the area, which is for [the Irish general who *\"burnt down the \\*fookin\\* White House in \\*fookin\\* Washington.*\"](http://en.wikipedia.org/wiki/Robert_Ross_%28general%29)", "gilded": 0, "created_utc": "1208093516", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Fooking USA, leading all the way. ", "gilded": 0, "created_utc": "1208195210", "subreddit": "worldnews", "score": 1, "controversiality": 0}
{"body": "You sweat that shite oot aye your system Tom, else al fookin kick it oot.", "gilded": 0, "created_utc": "1208562881", "subreddit": "funny", "score": 1, "controversiality": 0}
{"body": "You mean lots of glitz and glamour, shining graphics, whoosing sounds, news personalities who are your friends, soft and fuzzy round the edges concealing a hardcore cheesily over-dramatic tone, and complete lack of substance?\n\nIt takes quite some skill to have that subject matter and still come across as trite. In a rare twist, the Reddit title is far better than their \"Sex offer caught on tape\" (so props to you, trifecta). There's sex involved, you say? Well shucks, anything else is just a minor detail.\n\nI found that painful to watch, I'm sorry but U.S. news is embarassing and just plain fookin' awful and you are not going to get serious investigative reporting out of them as long as they consider their audience to be imbeciles.\n\nWhat exactly is the investigative part of that piece? The video is in entirety just a series of clips from the tape with a couple of notes at the beginning describing what is happening and the article is a transcript of the video.", "gilded": 0, "created_utc": "1208603065", "subreddit": "reddit.com", "score": 4, "controversiality": 0}
{"body": "How often do you think of abandoned Underground tunnels?  \n  \nBut seriously, fookin' choon man!", "gilded": 0, "created_utc": "1208992695", "subreddit": "pics", "score": 2, "controversiality": 0}
