{"body": "hang on mate- they aren't romany gypsys lucky heather et al, they're just fucking pikeys;  a coagulation of the dregs of several different ethnicities,\n\nAnd Ah fookin 'ate pikeys.", "gilded": 0, "created_utc": "1215009136", "subreddit": "worldnews", "score": 8, "controversiality": 0}
{"body": "furry muff, I just wanted to make it clear that I fookin 'ate pikeys.", "gilded": 0, "created_utc": "1215010452", "subreddit": "worldnews", "score": -1, "controversiality": 0}
{"body": "You'll be nought but a radioactive cloud of dust at that point, you long-haired dope-smoking paki-loving twat.  You're about as Aryan as Hitler, i.e., in your fooking dreams.", "gilded": 0, "created_utc": "1215468840", "subreddit": "reddit.com", "score": 0, "controversiality": 0}
{"body": "Oh my fookin' eyes! How can I unsee that?  ", "gilded": 0, "created_utc": "1215728119", "subreddit": "reddit.com", "score": 2, "controversiality": 0}
{"body": "The world Nigger will always be offensive. However the political correct African Americans should also be considered offensive to our intelligence. I’m assuming that less then 1% of blacks in America were actually born in Africa, its fooking ridiculous.\r\n\r\n", "gilded": 0, "created_utc": "1216386406", "subreddit": "offbeat", "score": 4, "controversiality": 0}
{"body": "Oh! To (fookin) fickin.  Yumz!", "gilded": 0, "created_utc": "1216767675", "subreddit": "reddit.com", "score": 1, "controversiality": 0}
{"body": "Aw shit, yet another slackjawed slackbrained American gets to be in the motherfookin' news. Isn't there a toilet at some obscure rest stop that needs a cleaner? ", "gilded": 0, "created_utc": "1217268024", "subreddit": "obama", "score": 2, "controversiality": 0}
{"body": "Jesus, fookin' 'ell.\n\nNo, Bush did not make the list. What did make the list were websites like this which delude people into thinking that Bush is the be-all-and-end-all of everything, ever.\n\nI'm sure you were joking, but it's like Bush has this monolithic group of ironic online cheerleaders to whom he is the center of the universe. Please. Let me read a discussion connected to politics, America, oil, the Middle East, economics, modern history, alcohol, Winnie the Pooh, Origami, *anything* without a Bush reference being forcibly dragged into the ring and forced to perform at gunpoint.", "gilded": 0, "created_utc": "1217367066", "subreddit": "funny", "score": 7, "controversiality": 0}
