{"body": "&gt; Scots isna juist English written wi orra wirds an spellins. It haes its ain grammar an aw. If aw ye fookin dae is tak an English text an chynge the spellins an swap a puckle wirds it'll juist be Scotched English an no Scots ya twat.\n\n", "gilded": 0, "created_utc": "1233501304", "subreddit": "wikipedia", "score": 35, "controversiality": 0}
{"body": "I fooking HATE mosquitoes.  I would have walked out.", "gilded": 0, "created_utc": "1233865281", "subreddit": "WTF", "score": -1, "controversiality": 0}
{"body": "Whisper to your friend. Now this might just be a personal complaint but I have chap friends and I have lady friends. I have one particular lady friend who insists on whispering to the person next to her when we've gone somewhere together, the pub normally.\n\nMaybe I'm just a paranoid android but when you start whispering to somebody, and make no attempt to hide it, then most people would want to know what the hell was so secretive.\n\nThis particular person has on occasion motioned me over to whisper something but I ask her quite plainly to tell me what she wants to say at a normal volume or not to bother. It is so obvious you are talking about somebody at the table (because most of the time your eyes are looking right at them while you're playing chinese whispers) and it's just fooking rude. If it's something so personal that you don't want to share it with us then keep it for later. If it's about one of us then get the fook out.\n\nJust a little vent there.\n\nOnly problem now is when she's in the mood she does it on purpose because I've told her what I think.", "gilded": 0, "created_utc": "1234310135", "subreddit": "funny", "score": 2, "controversiality": 0}
{"body": "Honey be careful on the way home tonight, some crazy bastard is driving down the freeway on the wrong side of the road. \n\nThar's not joost one! Thar's fooking hondreds of 'em! ", "gilded": 0, "created_utc": "1235077612", "subreddit": "funny", "score": 13, "controversiality": 0}
